{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/745507-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 745507, u'veryPopular': True, u'lowFodmap': False, u'title': u'Italian Burgers with Roasted Tomatoes and Caramelized Onions', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 291.52, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Baby arugula, for topping', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11959, u'unit': u'servings'}, {u'originalString': u'1 tablespoon roughly chopped fresh parsley and/or basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, roughly chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 pound ground beef chuck', u'aisle': u'Meat', u'name': u'ground beef chuck', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'4 brioche or hamburger buns, split', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/2 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'3 large onions, thinly sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'4 plum tomatoes, halved', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'4 slices provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'1 mild Italian sausage link, casing removed', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1017063, u'unit': u''}, {u'originalString': u'Pinch of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons chopped drained sun-dried tomatoes packed in oil', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun-dried tomatoes', u'metaInformation': [u'packed in oil', u'drained', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11955, u'unit': u'tablespoons'}, {u'originalString': u'4 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'Vegetable oil, for the grill', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for the grill'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 20.0, u'imageType': u'jpeg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/italian-burgers-with-roasted-tomatoes-and-caramelized-onions.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Make the aioli: Blend the mayonnaise, sun-dried tomatoes, garlic, fresh herbs and 1/4 teaspoon each salt and pepper in a mini food processor or blender until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and refrigerate until ready to use.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Make the roasted tomatoes: Preheat the oven to 425 degrees F and line a baking sheet with parchment paper. Pat the tomatoes dry with paper towels and arrange on the prepared baking sheet; drizzle with the olive oil and sprinkle with the dried basil, oregano and 1/2 teaspoon each salt and pepper. Roast until the tomatoes start caramelizing, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2003, u'name': u'dried basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, make the caramelized onions: Melt the butter in a large skillet over medium heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10211282, u'name': u'caramelized onions'}]}, {u'equipment': [], u'step': u'Add the onions and sugar and toss to coat. Cover and cook, stirring occasionally, until golden, about 20 minutes. Increase the heat to medium high and cook, stirring, until browned and caramelized, 15 to 20 more minutes; season with salt and pepper.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from the heat and set aside.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Make the burgers: Preheat a grill to medium high and brush the grates with vegetable oil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the beef and sausage in a large bowl and combine with your hands. Form four 3/4-inch-thick patties; season with salt and pepper. Grill the burgers until the edges begin browning, 3 to 5 minutes, then flip and top each patty with a slice of cheese. Cover and cook until the cheese is melted and the burgers are done, 3 to 4 more minutes for medium.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Lightly toast the buns on the grill.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the aioli on the top and bottom buns. Sandwich with the burgers, roasted tomatoes, caramelized onions and arugula.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10211282, u'name': u'caramelized onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}, {u'equipment': [], u'step': u'Photograph by Ryan Dausch', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Salentein Killka Malbec. It has 4.2 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'The color is  ruby red with tints of violet. The  aroma rich in fruit, reminiscent of plum, black fruits, blackberries and violets. The palate shows great structure and well-balanced acidity. The tannins feel soft and pleasant, with marked roundness and a strong fruity finish. View More', u'title': u'Salentein Killka Malbec', u'price': u'$12.99', u'id': 436136, u'link': u'https://www.wine.com/product/salentein-killka-malbec-2009/108793', u'imageUrl': u'https://spoonacular.com/productImages/436136-312x231.jpg'}]}, u'aggregateLikes': 429, u'instructions': u'Make the aioli: Blend the mayonnaise, sun-dried tomatoes, garlic, fresh herbs and 1/4 teaspoon each salt and pepper in a mini food processor or blender until smooth. Transfer to a bowl and refrigerate until ready to use.                          Make the roasted tomatoes: Preheat the oven to 425 degrees F and line a baking sheet with parchment paper. Pat the tomatoes dry with paper towels and arrange on the prepared baking sheet; drizzle with the olive oil and sprinkle with the dried basil, oregano and 1/2 teaspoon each salt and pepper. Roast until the tomatoes start caramelizing, about 30 minutes.                          Meanwhile, make the caramelized onions: Melt the butter in a large skillet over medium heat. Add the onions and sugar and toss to coat. Cover and cook, stirring occasionally, until golden, about 20 minutes. Increase the heat to medium high and cook, stirring, until browned and caramelized, 15 to 20 more minutes; season with salt and pepper. Remove from the heat and set aside.                          Make the burgers: Preheat a grill to medium high and brush the grates with vegetable oil. Put the beef and sausage in a large bowl and combine with your hands. Form four 3/4-inch-thick patties; season with salt and pepper. Grill the burgers until the edges begin browning, 3 to 5 minutes, then flip and top each patty with a slice of cheese. Cover and cook until the cheese is melted and the burgers are done, 3 to 4 more minutes for medium.                          Lightly toast the buns on the grill. Spread the aioli on the top and bottom buns. Sandwich with the burgers, roasted tomatoes, caramelized onions and arugula.                          Photograph by Ryan Dausch', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-burgers-with-roasted-tomatoes-and-caramelized-onions-745507', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}