{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/590317-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590317, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Chicken Alfredo with Red Pepper, Broccoli and Mushrooms', u'diets': [], u'pricePerServing': 133.15, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'2 cups chopped broccoli, fresh or frozen and thawed', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'fresh', u'thawed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11090, u'unit': u'cups'}, {u'originalString': u'6 tablespoons butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'8 button mushrooms, sliced', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'1 package (8 ounces) Neufchatel or cream cheese, cubed', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/4 cup plus 4 Tbsp. Parmigiano Reggiano', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbd lb. uncooked penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11120420, u'unit': u'lb'}, {u'originalString': u'1/2 cup chopped red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 boneless skinless chicken breasts, cooked and cubed', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cubed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2011/10/creamy-chicken-alfredo-with-red-pepper-broccoli-and-mushrooms.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium pot of boiling water, add penne pasta and cook according to package instructions (usually 11 minutes for al dente).', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain well and set aside.In a large skillet over low heat, melt cream cheese and butter; stir until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the milk, garlic powder, crushed red pepper flakes, salt and pepper. Cook and stir for 3 minutes, or until thickened.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the cooked chicken, broccoli, mushrooms and red pepper. Cook over medium heat for 5 minutes. Reduce heat; cover and cook 5 minutes longer or until vegetables are tender. Stir in Parmigiano Reggiano.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmigiano reggiano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Serve immediately with penne and extra Parmigiano Reggiano.Enjoy!', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmigiano reggiano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Alfredo works really well with Unoaked Chardonnay and Pinot Grigio. Creamy, cheesy, buttery alfredo dishes can pair beautifully with an unoaked chardonnay or a pinot grigio. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'unoaked chardonnay', u'pinot grigio'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 129, u'instructions': u'In a medium pot of boiling water, add penne pasta and cook according to package instructions (usually 11 minutes for al dente). Drain well and set aside.In a large skillet over low heat, melt cream cheese and butter; stir until smooth. Add the milk, garlic powder, crushed red pepper flakes, salt and pepper. Cook and stir for 3 minutes, or until thickened.Add the cooked chicken, broccoli, mushrooms and red pepper. Cook over medium heat for 5 minutes. Reduce heat; cover and cook 5 minutes longer or until vegetables are tender. Stir in Parmigiano Reggiano. Serve immediately with penne and extra Parmigiano Reggiano.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-alfredo-with-red-pepper-broccoli-and-mushrooms-590317', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}