{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/213444-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 213444, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy vegetable egg fried rice', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 110.88, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g basmati rice or 400g 14oz leftover cooked rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10020444, u'unit': u'g'}, {u'originalString': u'200g Chinese cabbage, finely sliced', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'chinese', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11109, u'unit': u'g'}, {u'originalString': u'2 large carrots, diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1-2 red chillies, deseeded and grated or very finely chopped', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'red', u'grated', u'deseeded', u'very finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'200g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'1 tbsp soy sauce, plus extra for serving, if you like', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'for serving, if you like'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'3 spring onions, sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1088653/spicy-vegetable-egg-fried-rice', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'If making the rice from scratch, cook itfollowing pack instructions, then drain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Mix the chillies and garlic (in a pestle andmortar, if you have one) with a pinch ofsalt, to make a paste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat oil in a wok or large frying pan ona medium-high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the carrots andstir-fry for 5 mins until tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Add thecabbage and chilli paste and cook for 1 minmore. Tip in the cooked basmati or leftoverrice and stir-fry for 1 min until piping hot.Push the rice mixture to one side of thepan.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add the eggs to the cleared spaceand scramble until set.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix in the onions,peas and soy and stir-fry everythingtogether until the peas are hot.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian on the menu? Try pairing with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 127, u'instructions': u'If making the rice from scratch, cook itfollowing pack instructions, then drain.Mix the chillies and garlic (in a pestle andmortar, if you have one) with a pinch ofsalt, to make a paste.Heat oil in a wok or large frying pan ona medium-high heat. Add the carrots andstir-fry for 5 mins until tender. Add thecabbage and chilli paste and cook for 1 minmore. Tip in the cooked basmati or leftoverrice and stir-fry for 1 min until piping hot.Push the rice mixture to one side of thepan. Add the eggs to the cleared spaceand scramble until set. Mix in the onions,peas and soy and stir-fry everythingtogether until the peas are hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-vegetable-egg-fried-rice-213444', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}