{u'recipes': [{u'sourceName': u'Chocolate Chocolate and More', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626525-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 626525, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chocolate Swirled Meringues', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'pricePerServing': 7.13, u'creditText': u'Chocolate Chocolate and More', u'extendedIngredients': [{u'originalString': u'1 ounce sweetened baking chocolate (I used semi-sweet chocolate)', u'aisle': u'Baking', u'name': u'baking chocolate', u'metaInformation': [u'sweetened', u'(I used semi-sweet chocolate)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounce'}, {u'originalString': u'1/4 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'2 egg white (room temperature)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'room temperature', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://chocolatechocolateandmore.com/2015/01/chocolate-swirled-meringues/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place chocolate in a microwave safe dish and melt on 50% power for 60 seconds. Continue to heat at 50% power in 15 second intervals until chocolate is about half melted.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove from microwave and stir until smooth and completely melted. If needed heat for additional time.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Let chocolate cool. In a mixing bowl, with the whisk attachment, start beating the egg whites and cream of tartar on medium to medium high speed. Once soft peaks begin to form, slowly add in sugar and vanilla extract, while continuing to beat. Continue to beat until stiff peaks form and your egg whites are glossy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Drizzle about half of your cooled melted chocolate over egg whites and then fold in one time.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle remaining chocolate over egg whites and fold 2 more times. Do not over fold, you want the chocolate streaks to run through the white.  Using a medium or large cookie scoop, place cookies 2 inches apart on a parchment lined baking sheet.  place in a preheated 200 degree oven and bake for 90 minutes, turn tray one time during baking. Turn oven off and let cookies sit in oven for 6-8 hours or overnight.  Store cookies in an airtight container.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 102, u'instructions': u'Place chocolate in a microwave safe dish and melt on 50% power for 60 seconds. Continue to heat at 50% power in 15 second intervals until chocolate is about half melted. Remove from microwave and stir until smooth and completely melted. If needed heat for additional time. Let chocolate cool. In a mixing bowl, with the whisk attachment, start beating the egg whites and cream of tartar on medium to medium high speed. Once soft peaks begin to form, slowly add in sugar and vanilla extract, while continuing to beat. Continue to beat until stiff peaks form and your egg whites are glossy.  Drizzle about half of your cooled melted chocolate over egg whites and then fold in one time. Drizzle remaining chocolate over egg whites and fold 2 more times. Do not over fold, you want the chocolate streaks to run through the white.  Using a medium or large cookie scoop, place cookies 2 inches apart on a parchment lined baking sheet.  place in a preheated 200 degree oven and bake for 90 minutes, turn tray one time during baking. Turn oven off and let cookies sit in oven for 6-8 hours or overnight.  Store cookies in an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-swirled-meringues-626525', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}