{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/196851-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196851, u'veryPopular': False, u'lowFodmap': False, u'title': u'Duck Egg Sandwich with Spinach and Chipotle Cream', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 118.76, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 tablespoon adobo sauce (from a can of chipotles; add more or less depending on how spicy you like things)', u'aisle': u'Ethnic Foods', u'name': u'adobo sauce', u'metaInformation': [u'canned', u'(from a can of chipotles; add more or less depending on how spicy you like things)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6979, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup baby spinach or arugula', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11457, u'unit': u'cup'}, {u'originalString': u'1 brioche bun, toasted', u'aisle': u'Baking', u'name': u'brioche bun', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10093730, u'unit': u''}, {u'originalString': u'1 duck egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'duck egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quail-eggs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1138, u'unit': u''}, {u'originalString': u'1 to 2 rings red onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 to 2 strips smoked red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'smoked', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'strip', u'unitShort': u'strips', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u'strips'}, {u'originalString': u'1 tablespoon sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tablespoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Duck-Egg-Sandwich-with-Spinach-and-Chipotle-Cream-51200440', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'\xbb', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the adobo sauce with the sour cream.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6979, u'name': u'adobo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [], u'step': u'Spread the mixture on both sides of the bun. Fry the egg sunny-side up. Top the bottom of the bun with the spinach, red pepper, onion, and egg.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the top bun and serve immediately.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Reprinted with permission from Put an Egg on It: 70 Delicious Dishes That Deserve a Sunny Topping by Lara Ferroni. Copyright \xa9 2013 by Lara Ferroni. Published by Sasquatch Books.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 11, u'instructions': u'Preparation                                                        \xbb Mix the adobo sauce with the sour cream. Spread the mixture on both sides of the bun. Fry the egg sunny-side up. Top the bottom of the bun with the spinach, red pepper, onion, and egg. Add the top bun and serve immediately.                                                                            Reprinted with permission from Put an Egg on It: 70 Delicious Dishes That Deserve a Sunny Topping by Lara Ferroni. Copyright \xa9 2013 by Lara Ferroni. Published by Sasquatch Books.', u'spoonacularSourceUrl': u'https://spoonacular.com/duck-egg-sandwich-with-spinach-and-chipotle-cream-196851', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}