{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/245783-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 245783, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spinach Gratin with Hard Boiled Eggs', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 279.73, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon freshly ground black pepper or more to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'6 hard boiled eggs*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'hard', u'boiled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 Tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup grated Gruyere cheese (about 1 ounce)', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1023, u'unit': u'ounce'}, {u'originalString': u'2 cups of milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u"1/2 teaspoon freshly grated nutmeg, or 3/4 teaspoon of ground nutmeg if you aren't starting with a whole nutmeg", u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'whole', u'with a  nutmeg', u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'3 to 4 Tbsp seasoned bread crumbs**', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18376, u'unit': u'Tbsp'}, {u'originalString': u'3 pounds of fresh spinach, cleaned (or 24 ounces of frozen spinach, thawed and drained)', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'frozen', u'thawed', u'cleaned', u'drained', u'(or 24 ounces of spinach, and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'pounds'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/spinach_gratin_with_hard_boiled_eggs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}], u'step': u'1 If working with fresh spinach, blanche the spinach in boiling water for 1 minute, drain and run cool water over it to cool it down. Press as much water as you can out of the spinach. (A good way to do this is to put the drained spinach in the center of a large, clean tea towel, wrap it with the towel, and wring the moisture out by wringing the towel.) Chop the spinach.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a large bowl. Season to taste with salt and set aside while you make the b\xe9chamel.2', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat milk in a medium saucepan until steamy, set aside. In a separate saucepan, melt 2 tablespoons of butter on medium heat. Sprinkle in the flour, whisking the mixture until smooth, about a minute or two.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat. Slowly pour in the hot milk, whisking the whole time so that the mixture is not lumpy. Continue to whisk until there are no lumps. Return the pan to heat and let heat to a simmer, continuing to whisk to keep the mixture from sticking to the bottom of the pan. The b\xe9chamel sauce will thicken as it cooks. Sprinkle in the ground nutmeg and black pepper.3 Stir the thickened b\xe9chamel sauce into the bowl of spinach.4 Grease the inside of a 2-quart gratin pan or casserole all around with a little butter.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutmeg.jpg', u'id': 2025, u'name': u'ground nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the spinach b\xe9chamel mixture into a gratin pan, and even out the surface. Sprinkle the surface with the grated Gruyere cheese. Slice the hard boiled eggs in half, and arrange, cut side up, on the surface of the spinach mixture. Press into the spinach mixture so that the cut side of the eggs are level with the spinach. Sprinkle with 3 to 4 tablespoons of seasoned bread crumbs.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18376, u'name': u'seasoned breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'id': 1023, u'name': u'gruyere'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Drizzle the top with a tablespoon or so of olive oil. At this point you can make the gratin a day ahead and chill until ready to cook to serve.5', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake, uncovered, in a 375\xb0F oven for 25-30 minutes, until nicely browned.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 926, u'instructions': u'1 If working with fresh spinach, blanche the spinach in boiling water for 1 minute, drain and run cool water over it to cool it down. Press as much water as you can out of the spinach. (A good way to do this is to put the drained spinach in the center of a large, clean tea towel, wrap it with the towel, and wring the moisture out by wringing the towel.) Chop the spinach. Place in a large bowl. Season to taste with salt and set aside while you make the b\xe9chamel.2 Heat milk in a medium saucepan until steamy, set aside. In a separate saucepan, melt 2 tablespoons of butter on medium heat. Sprinkle in the flour, whisking the mixture until smooth, about a minute or two. Remove from heat. Slowly pour in the hot milk, whisking the whole time so that the mixture is not lumpy. Continue to whisk until there are no lumps. Return the pan to heat and let heat to a simmer, continuing to whisk to keep the mixture from sticking to the bottom of the pan. The b\xe9chamel sauce will thicken as it cooks. Sprinkle in the ground nutmeg and black pepper.3 Stir the thickened b\xe9chamel sauce into the bowl of spinach.4 Grease the inside of a 2-quart gratin pan or casserole all around with a little butter. Pour the spinach b\xe9chamel mixture into a gratin pan, and even out the surface. Sprinkle the surface with the grated Gruyere cheese. Slice the hard boiled eggs in half, and arrange, cut side up, on the surface of the spinach mixture. Press into the spinach mixture so that the cut side of the eggs are level with the spinach. Sprinkle with 3 to 4 tablespoons of seasoned bread crumbs. Drizzle the top with a tablespoon or so of olive oil. At this point you can make the gratin a day ahead and chill until ready to cook to serve.5 Bake, uncovered, in a 375\xb0F oven for 25-30 minutes, until nicely browned.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-gratin-with-hard-boiled-eggs-245783', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}