{u'recipes': [{u'sourceName': u'SippitySup', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/254073-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 254073, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot Toddy', u'diets': [u'caveman', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 89.27, u'creditText': u'SippitySup', u'extendedIngredients': [{u'originalString': u'2 bags black tea', u'aisle': u'Tea and Coffee', u'name': u'black tea', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'bags', u'unitShort': u'bags', u'amount': 2.0, u'consistency': u'solid', u'id': 14355, u'unit': u'bags'}, {u'originalString': u'2 shots bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u''}, {u'originalString': u'2 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'2 lemon wedges (optional)', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.sippitysup.com/recipe/hot-toddy/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Bring the water to a boil in a kettle.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drizzle half the honey onto the  bottom of each of 2 very large mugs. Then add half the bourbon and lemon  juice to each mug. Once the water reaches near boiling, but not quite,  place one teabag in each mug and fill them nearly full with the hot  water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Garnish with any combination of whole cloves, cinnamon stick,  and/or lemon wedge.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 50, u'instructions': u'Bring the water to a boil in a kettle. Drizzle half the honey onto the  bottom of each of 2 very large mugs. Then add half the bourbon and lemon  juice to each mug. Once the water reaches near boiling, but not quite,  place one teabag in each mug and fill them nearly full with the hot  water. Garnish with any combination of whole cloves, cinnamon stick,  and/or lemon wedge.Share this:ShareGoogleTwitterPinterestFacebookLike this:Like Loading...', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-toddy-254073', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}