{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/697889-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 697889, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp-Filled Spring Rolls', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 35, u'pricePerServing': 171.4, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 tablespoon fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons chopped fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'18 8-inch rice papers', u'aisle': u'Ethnic Foods', u'name': u'rice papers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 10118368, u'unit': u''}, {u'originalString': u'4 scallions, chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'3/4 pound medium shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 1/2 cups bean sprouts, or sunflower sprouts', u'aisle': u'Produce', u'name': u'sunflower sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-pea-sprouts-or-pea-shoots.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 98986, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/shrimp_filled_spring_rolls.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook shrimp in boiling water just until curled and opaque in the center, 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Drain and refresh under cold running water.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer to a cutting board to cool, then chop.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the shrimp with sprouts, scallions, mint, fish sauce and lime juice in a bowl. Soak 6 of the rice papers in a large bowl of very warm water until they are softened, about 30 seconds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'id': 10118368, u'name': u'spring roll wrappers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Place them in a single layer on a clean dishtowel. Put a heaping tablespoonful of shrimp filling in the center of each rice paper and fold over all four edges to form a square, slightly flat packet. Repeat with the remaining rice papers and filling.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'id': 10118368, u'name': u'spring roll wrappers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve with a small bowl of Rice-Wine Vinegar Sauce for dipping.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Spring Rolls. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Cook shrimp in boiling water just until curled and opaque in the center, 1 to 2 minutes. Drain and refresh under cold running water. Transfer to a cutting board to cool, then chop.Combine the shrimp with sprouts, scallions, mint, fish sauce and lime juice in a bowl. Soak 6 of the rice papers in a large bowl of very warm water until they are softened, about 30 seconds. Place them in a single layer on a clean dishtowel. Put a heaping tablespoonful of shrimp filling in the center of each rice paper and fold over all four edges to form a square, slightly flat packet. Repeat with the remaining rice papers and filling. Serve with a small bowl of Rice-Wine Vinegar Sauce for dipping.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-filled-spring-rolls-697889', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}