{u'recipes': [{u'sourceName': u'Little Leopard Book', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/560847-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 560847, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Balsamic Bruschetta', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 143.99, u'creditText': u'Little Leopard Book', u'extendedIngredients': [{u'originalString': u'1 baguette (sliced)', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'sliced', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'1 tbsp balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp fresh basil (chopped)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tbsp'}, {u'originalString': u'2 oz goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1 tbsp Enzo Meyer Lemon Olive Oil', u'aisle': u'Gourmet;Baking', u'name': u'lemon oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10911111, u'unit': u'tbsp'}, {u'originalString': u'2 cups strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://littleleopardbook.com/2013/10/28/strawberry-balsamic-bruschetta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl combine the strawberries, vinegar, olive oil and fresh basil.Lightly toast the baguette, then spread the goat cheese on each slice. Top with the strawberry balsamic bruschetta and serve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bruschetta works really well with Chianti, Sparkling ros\xe9, and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Castello di Volpaia Chianti Classico Riserva. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'chianti', u'sparkling rose', u'sparkling wine', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Color: Ruby red with a trace of garnet Nose: Elegant and intense with hints of spices connected with fruity scents Taste: Good structure with evident tannins and long persistence', u'title': u'Castello di Volpaia Chianti Classico Riserva', u'price': u'$23.99', u'id': 439055, u'link': u'https://www.wine.com/product/castello-di-volpaia-chianti-classico-riserva-2003/92756', u'imageUrl': u'https://spoonacular.com/productImages/439055-312x231.jpg'}]}, u'aggregateLikes': 227, u'instructions': u'In a small bowl combine the strawberries, vinegar, olive oil and fresh basil.Lightly toast the baguette, then spread the goat cheese on each slice. Top with the strawberry balsamic bruschetta and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-balsamic-bruschetta-560847', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}