{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601631-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 601631, u'veryPopular': False, u'lowFodmap': False, u'title': u'30 Minute Healthy Broccoli Cheese Rice', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 163.68, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'6 tablespoons almond meal', u'aisle': u'Gluten Free;Health Foods', u'name': u'almond meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 93740, u'unit': u'tablespoons'}, {u'originalString': u'crushed almonds for topping', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'crushed', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 12061, u'unit': u'servings'}, {u'originalString': u'1 head broccoli, cut into florets', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'cut into florets'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11090, u'unit': u'head'}, {u'originalString': u'\xbd cup broth as needed', u'aisle': u'Canned and Jarred', u'name': u'broth', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cup'}, {u'originalString': u'1 cup uncooked brown rice (I used a brown rice blend from Costco - love it)', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'uncooked', u'(I used a brown rice blend from Costco - love it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cup'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 14-ounce can white beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned white beans', u'metaInformation': [u'white', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16051, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'sliced green onions for topping', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://pinchofyum.com/30-minute-healthy-broccoli-cheese-rice', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Cook the rice according to package directions. Bring a small pot of water to boil (enough to cover the broccoli).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Add the broccoli, cook for 1 minute or until the broccoli turns bright green, and remove from heat immediately.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain and transfer to a bowl of very cold water. This keeps the broccoli bright green and pretty.In a deep pot, melt the butter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the garlic and saute until fragrant, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the almond meal and salt and cook for 2-3 minutes (it will be thick and clumpy).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 93740, u'name': u'almond meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the milk a little bit at a time, whisking after each addition to smooth out the sauce and letting the mixture simmer until thickened slightly.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add half of the cheese and stir until melted.Chop the cooked broccoli into fine bits, leaving a few larger florets (just for a more interesting texture). Stir the broccoli, cooked rice, white beans, and any additional broth or milk as needed until the mixture is well combined. Sprinkle with remaining cheese and cover the pan until the cheese is melted. Top with almonds and green onions and season with more salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'aggregateLikes': 72, u'instructions': u'Cook the rice according to package directions. Bring a small pot of water to boil (enough to cover the broccoli). Add the broccoli, cook for 1 minute or until the broccoli turns bright green, and remove from heat immediately. Drain and transfer to a bowl of very cold water. This keeps the broccoli bright green and pretty.In a deep pot, melt the butter. Add the garlic and saute until fragrant, about 1 minute. Add the almond meal and salt and cook for 2-3 minutes (it will be thick and clumpy). Add the milk a little bit at a time, whisking after each addition to smooth out the sauce and letting the mixture simmer until thickened slightly. Add half of the cheese and stir until melted.Chop the cooked broccoli into fine bits, leaving a few larger florets (just for a more interesting texture). Stir the broccoli, cooked rice, white beans, and any additional broth or milk as needed until the mixture is well combined. Sprinkle with remaining cheese and cover the pan until the cheese is melted. Top with almonds and green onions and season with more salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/30-minute-healthy-broccoli-cheese-rice-601631', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}