{u'recipes': [{u'sourceName': u'Serena Bakes Simple from Scratch', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/628647-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 628647, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smokey BBQ Pulled Chicken Sandwiches With Creamy Coleslaw #SundaySupper #McSkilletSauce', u'diets': [u'gluten free'], u'pricePerServing': 188.72, u'creditText': u'Serena Bakes Simple from Scratch', u'extendedIngredients': [{u'originalString': u'2 whole Large Carrots, Grated', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'whole', u'grated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 packet McCormick Smokey Applewood BBQ Chicken With Bacon Skillet Sauce', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'with bacon skillet sauce'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'packet', u'unitShort': u'packet', u'amount': 1.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'packet'}, {u'originalString': u'1 tablespoon Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'1 whole Small Head Green Cabbage, Finely Shredded', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'shredded', u'whole', u'green', u'small', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'Head', u'unitShort': u'Head', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u'Head'}, {u'originalString': u'1/4 teaspoon Fresh Ground Pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup Mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 whole Medium Sized Onion, Sliced Thin', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'whole', u'medium sized', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/3 cup Plain Greek Yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/2 whole Small Red Onion, Diced Fine', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'whole', u'red', u'small', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/4 teaspoon Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds Chicken Breast, Boneless Skinless', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}, {u'originalString': u'3 tablespoons Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons White Balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white balsamic vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012069, u'unit': u'tablespoons'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.serenabakessimplyfromscratch.com/2015/02/smokey-bbq-pulled-chicken-sandwiches.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet with a lid add olive oil and sliced onion.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute until onion starts to caramelize.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken breast and McCormick Smokey Applewood BBQ Chicken With Bacon Skillet Sauce. Bring to a simmer, cover and reduce heat to low.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Cook chicken for 20 minutes or until cooked through and easily shreds with 2 forks.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'While chicken cooks assemble the coleslaw. In a large bowl combine cabbage, carrtos and red onion.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Mix until well combined.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl mix mayonnaise, greek yogurt, sugar, white balsamic vinegar, sea salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1012069, u'name': u'white balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour sauce over the top of cabbage mixture and stir until evenly coated. Refridgerate coleslaw until ready to use.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}]}, {u'equipment': [], u'step': u'Use 2 forks to shred chicken in sauce.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Serve pulled chicken over hamburger buns with coleslaw on top or on the side.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'pineapple , guava , apricot', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 130, u'instructions': u'In a large skillet with a lid add olive oil and sliced onion. Saute until onion starts to caramelize. Add chicken breast and McCormick Smokey Applewood BBQ Chicken With Bacon Skillet Sauce. Bring to a simmer, cover and reduce heat to low.                    Cook chicken for 20 minutes or until cooked through and easily shreds with 2 forks.                    While chicken cooks assemble the coleslaw. In a large bowl combine cabbage, carrtos and red onion. Mix until well combined.                    In a small bowl mix mayonnaise, greek yogurt, sugar, white balsamic vinegar, sea salt and pepper. Pour sauce over the top of cabbage mixture and stir until evenly coated. Refridgerate coleslaw until ready to use.                    Use 2 forks to shred chicken in sauce.                    Serve pulled chicken over hamburger buns with coleslaw on top or on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/smokey-bbq-pulled-chicken-sandwiches-with-creamy-coleslaw-sundaysupper-mcskilletsauce-628647', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}