{u'recipes': [{u'sourceName': u'Normal Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599047-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 599047, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pesto Chicken Penne Casserole', u'diets': [], u'pricePerServing': 181.35, u'creditText': u'Normal Cooking', u'extendedIngredients': [{u'originalString': u'1/2 jar Alfredo sauce (I accidentally used the whole jar and it was great! So you could do whichever)', u'aisle': u'Pasta and Rice', u'name': u'alfredo sauce', u'metaInformation': [u'whole', u'(I accidentally used the jar and it was great! So you could do whichever)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'unitLong': u'jars', u'unitShort': u'jar', u'amount': 0.5, u'consistency': u'solid', u'id': 93606, u'unit': u'jar'}, {u'originalString': u'1 1/2 cups fresh baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'1/2 can crushed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cans', u'unitShort': u'can', u'amount': 0.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'can'}, {u'originalString': u'3 cups cubed cooked chicken (you could use rotisserie)', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cubed', u'cooked', u'(you could use rotisserie)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'2 cups shredded Italian cheese blend', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'shredded', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93651, u'unit': u'cups'}, {u'originalString': u'3/4 cups 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/2 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 ounces penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'ounces'}, {u'originalString': u'4 ounces prepared pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 93698, u'unit': u'ounces'}, {u'originalString': u'1/4 cup seasoned bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://normalcooking.com/2014/01/30/pesto-chicken-penne-casserole/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.Cook pasta according to package directions. Meanwhile, in a large bowl, combine the chicken, cheese blend, spinach, tomatoes, Alfredo sauce, milk and pesto.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'id': 93606, u'name': u'alfredo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Drain pasta and add to chicken mixture; toss to coat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a greased 8-in. square baking dish.In a small bowl, combine the bread crumbs, Parmesan cheese and oil; sprinkle over casserole.Cover and bake for 40-45 minutes or until bubbly.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Chehalem INOX Chardonnay. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 297, u'instructions': u'Preheat oven to 350 degrees F.Cook pasta according to package directions. Meanwhile, in a large bowl, combine the chicken, cheese blend, spinach, tomatoes, Alfredo sauce, milk and pesto.Drain pasta and add to chicken mixture; toss to coat. Transfer to a greased 8-in. square baking dish.In a small bowl, combine the bread crumbs, Parmesan cheese and oil; sprinkle over casserole.Cover and bake for 40-45 minutes or until bubbly.', u'spoonacularSourceUrl': u'https://spoonacular.com/pesto-chicken-penne-casserole-599047', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}