{u'recipes': [{u'sourceName': u'Lady Behind the Curtain', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/572115-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 572115, u'veryPopular': False, u'lowFodmap': False, u'title': u'Light Berry Frozen Yogurt', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 67.52, u'creditText': u'Lady Behind the Curtain', u'extendedIngredients': [{u'originalString': u'18 ounces frozen mixed berries, thawed, pureed and stained to remove seeds', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'mixed', u'pureed', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'ounces'}, {u'originalString': u'1/3 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 cups low fat vanilla yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat vanilla yogurt', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1001119, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.ladybehindthecurtain.com/light-berry-frozen-yogurt/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Us a hand mixer to combine the milk and sugar until the sugar is dissolved, about 1 to 2 minutes.Stir in yogurt, berry puree and vanilla until combined.Turn the ice cream machine on; pour the yogurt mixture into the freezer bowl, and let mix until thickened, about 20 to 25 minutes or as your machine instructs.If you prefer the yogurt to be firm transfer the frozen yogurt to an airtight container and freeze for an additional 2 hours.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'id': 1009054, u'name': u'berries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are my top picks for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 248, u'instructions': u'Us a hand mixer to combine the milk and sugar until the sugar is dissolved, about 1 to 2 minutes.Stir in yogurt, berry puree and vanilla until combined.Turn the ice cream machine on; pour the yogurt mixture into the freezer bowl, and let mix until thickened, about 20 to 25 minutes or as your machine instructs.If you prefer the yogurt to be firm transfer the frozen yogurt to an airtight container and freeze for an additional 2 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/light-berry-frozen-yogurt-572115', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}