{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/319282-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 319282, u'veryPopular': False, u'lowFodmap': False, u'title': u'Szechuan Noodles with Chicken and Broccoli', u'diets': [u'dairy free'], u'pricePerServing': 187.62, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 bunch broccoli, cut into florets and stems discarded', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'cut into florets and stems discarded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11090, u'unit': u'bunch'}, {u'originalString': u'3 whole (6 split) chicken breasts, bone-in, skin-on', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'whole', u'split', u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1/2 teaspoon Asian hot chili oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'chili oil', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1014053, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons dark toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'dark sesame oil', u'metaInformation': [u'dark', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1004058, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup dry sherry', u'aisle': u'Alcoholic Beverages', u'name': u'dry sherry', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10114106, u'unit': u'cup'}, {u'originalString': u'1/4 cup fresh ginger, peeled and chopped', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11216, u'unit': u'cup'}, {u'originalString': u'6 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/8 teaspoon ground cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Good olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 red bell pepper, julienned', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'4 scallions, sliced diagonally (white and green parts)', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'white', u'green', u'sliced', u'( and parts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/4 cup sherry vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1012068, u'unit': u'cup'}, {u'originalString': u'1/2 cup smooth peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16150, u'unit': u'cup'}, {u'originalString': u'1/2 cup good soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1 pound spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'pound'}, {u'originalString': u'1/2 cup tahini (sesame paste)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [u'(sesame paste)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12698, u'unit': u'cup'}, {u'originalString': u'1/2 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 yellow bell pepper, julienned', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 29.0, u'imageType': u'jpeg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ina-garten/szechuan-noodles-with-chicken-and-broccoli-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the chicken breasts on a sheet pan, skin side up. Rub the tops with olive oil and sprinkle liberally with salt and pepper. Roast for 35 minutes, until cooked through. Set aside until cool enough to handle.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Remove the meat from the bones and discard the skin and bones. Shred the chicken in large bite-sized pieces and set aside.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Meanwhile, bring a large pot of salted water to a boil and blanch the broccoli florets for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 10011090, u'name': u'broccoli florets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain and immediately immerse in a bowl of ice water to stop the cooking and set the color.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and set aside.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the garlic, ginger, vegetable oil, tahini, peanut butter, soy sauce, sherry, sherry vinegar, honey, chili oil, sesame oil, 1/2 teaspoon black pepper and the cayenne pepper in a food processor fitted with a steel blade and puree until smooth. Set aside.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 1012068, u'name': u'sherry vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'id': 1014053, u'name': u'chili oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'id': 12698, u'name': u'tahini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add a splash of olive oil to a large pot of boiling salted water and cook the spaghetti according to the directions on the package.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the pasta in a colander, place it in a large bowl, and while still warm, toss with the sauce.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the scallions, peppers, chicken and broccoli and toss well.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Serve warm or at room temperature.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 13, u'instructions': u'Watch how to make this recipe.                    Preheat the oven to 350 degrees F. Place the chicken breasts on a sheet pan, skin side up. Rub the tops with olive oil and sprinkle liberally with salt and pepper. Roast for 35 minutes, until cooked through. Set aside until cool enough to handle. Remove the meat from the bones and discard the skin and bones. Shred the chicken in large bite-sized pieces and set aside.                          Meanwhile, bring a large pot of salted water to a boil and blanch the broccoli florets for 2 minutes. Drain and immediately immerse in a bowl of ice water to stop the cooking and set the color. Drain and set aside.                          Place the garlic, ginger, vegetable oil, tahini, peanut butter, soy sauce, sherry, sherry vinegar, honey, chili oil, sesame oil, 1/2 teaspoon black pepper and the cayenne pepper in a food processor fitted with a steel blade and puree until smooth. Set aside.                          Add a splash of olive oil to a large pot of boiling salted water and cook the spaghetti according to the directions on the package. Drain the pasta in a colander, place it in a large bowl, and while still warm, toss with the sauce. Add the scallions, peppers, chicken and broccoli and toss well. Serve warm or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/szechuan-noodles-with-chicken-and-broccoli-319282', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}