{u'recipes': [{u'sourceName': u'Give Recipe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582271-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 582271, u'veryPopular': False, u'lowFodmap': False, u'title': u'Celeriac With Quince', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 95.04, u'creditText': u'Give Recipe', u'extendedIngredients': [{u'originalString': u'1 carrot, chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery roots, peeled and chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'half bunch of fresh dill, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'bunch'}, {u'originalString': u'\xbd lemon, sequeezed', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbd orange, squeezed', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'\xbd quince, seeds discarded and chopped', u'aisle': u'Produce', u'name': u'quince', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quince.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9296, u'unit': u''}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'\xbe cup hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.giverecipe.com/celeriac-with-quince.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Put carrot, celeriac, and quince into the pot in this order.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quince.jpg', u'id': 9296, u'name': u'quince'}]}, {u'equipment': [], u'step': u'Pour orange juice and lemon juice onto them.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add olive oil and salt. Cover the pot and cook over medium heat for about 10 minutes.Then stir it and pour hot water into it. Cook for 15-20 minutes until tender. Do not overcook it or the veggies get mushy. Take it from heat, add chopped fresh dill and stir.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'fresh dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve it warm either as a main dish or side dish with meat or chicken.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 21, u'instructions': u'Put carrot, celeriac, and quince into the pot in this order. Pour orange juice and lemon juice onto them. Add olive oil and salt. Cover the pot and cook over medium heat for about 10 minutes.Then stir it and pour hot water into it. Cook for 15-20 minutes until tender. Do not overcook it or the veggies get mushy. Take it from heat, add chopped fresh dill and stir.Serve it warm either as a main dish or side dish with meat or chicken.', u'spoonacularSourceUrl': u'https://spoonacular.com/celeriac-with-quince-582271', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}