{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/616530-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 616530, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Red Pepper Tortilla Soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 45, u'pricePerServing': 132.65, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'1 avocado, pitted and diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u"\xbc teaspoon cayenne pepper (optional, skip if you're sensitive to spice)", u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u"(optional, skip if you're sensitive to spice)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'Handful cilantro leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Handful'}, {u'originalString': u'3 corn tortillas, sliced into thin, 2-inch long strips', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'sliced into thin, long strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'2-inchs', u'unitShort': u'2-inch', u'amount': 3.0, u'consistency': u'solid', u'id': 18363, u'unit': u'2-inch'}, {u'originalString': u'1 tablespoon arrowroot starch or cornstarch (optional but recommended for super creamy soup)', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [u'for super creamy soup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'2\xbd teaspoons cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'6 cloves garlic, in peel', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'7 medium to large red bell peppers (around 3\xbd pounds), halved, seeded, membranes removed', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'medium to large', u'halved', u'seeded', u'(around 3\xbd pounds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'4 cups (32 ounces) vegetable stock with peppers', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'with peppers'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ounces'}, {u'originalString': u'1 large yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://cookieandkate.com/2014/roasted-red-pepper-tortilla-soup/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Roast the peppers: Preheat oven to 450 degrees Fahrenheit with racks in the upper third and lower third of the oven. Arrange your halved peppers, cut side down, in a single layer on a large, rimmed baking sheet (use two sheets if necessary).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place the whole cloves of garlic in between the peppers. Roast on the upper rack (and lower rack, if you're using two baking sheets) until peppers are blackened across the top, around 20 minutes.Steam and peel the peppers: Once the peppers are deeply blackened, remove them from the oven and use kitchen tongs to transfer the peppers to a medium-sized bowl and cover (or transfer them to a plastic bag and seal).", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Let the peppers steam for at least 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Add the tomato paste, cumin, paprika, salt and optional cayenne pepper and cook for one minute, while stirring constantly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the peeled red peppers and vegetable stock and stir. Bring the soup to a gentle boil, then reduce heat to maintain a simmer and cook for 15 minutes, stirring occasionally.Meanwhile, make your crispy tortilla strips: Warm 1 tablespoon olive oil in a large saut pan over medium heat. Once warmed, add the tortilla strips and a dash of salt. Stir to coat the strips, then arrange them in roughly an even layer in the pan and let them cook, stirring occasionally, until both sides are golden and crispy, about 3 to 5 minutes.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6615, u'name': u'vegetable stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u'Remove the cover and let them cool until they are manageable. Use your fingers to peel off the charred top layer of skin and discard (you may want to wear kitchen gloves for this). Peel the skin off the garlic, too.In a 3 quart or larger Dutch oven or heavy-bottomed pot, warm 2 tablespoons of olive oil, then add the chopped onion, peeled whole garlic cloves and a sprinkle of salt. Saut, stirring occasionally, until the onions are softened and turning translucent, about 5 to 8 minutes.Cook the soup'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk together  cup water with arrowroot or cornstarch until thoroughly blended. During the last minute of soup cooking time, pour the water/starch mixture into the soup and stir to blend. Once your soup is done cooking, remove it from heat and allow it to cool for 5 minutes.Blend the soup (two options): For the creamiest soup, transfer soup to a stand blender in batches (do NOT fill your blender over halfway, soup will go everywhere!) and cover the top of the blender with a thick layer of kitchen towel (so the steam doesn't burn your hands).", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Transfer pured soup to another pot or a bowl and continue until all of the soup is blended. Or, use an immersion blender to blend the soup in the pot. Blend until the mixture is smooth and creamy. If you did not add the  cup water and starch mixture earlier, taste your soup and decide if you want to stretch out the soup with  cup water (in which case, stir it in now) or leave it as is.If necessary, transfer soup back to your cooking pot and rewarm gently on the stove. Divide soup into individual bowls. Top with crispy tortilla strips, diced avocado, chopped cilantro, optional crumbled feta and a light sprinkle of freshly ground black pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Serve!', u'number': 3, u'ingredients': []}], u'name': u'Transfer to a plate linked with a paper towel to cool.Optional but recommended step (yields super creamy soup)'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 469, u'instructions': u"Roast the peppers: Preheat oven to 450 degrees Fahrenheit with racks in the upper third and lower third of the oven. Arrange your halved peppers, cut side down, in a single layer on a large, rimmed baking sheet (use two sheets if necessary). Place the whole cloves of garlic in between the peppers. Roast on the upper rack (and lower rack, if you're using two baking sheets) until peppers are blackened across the top, around 20 minutes.Steam and peel the peppers: Once the peppers are deeply blackened, remove them from the oven and use kitchen tongs to transfer the peppers to a medium-sized bowl and cover (or transfer them to a plastic bag and seal). Let the peppers steam for at least 10 minutes. Remove the cover and let them cool until they are manageable. Use your fingers to peel off the charred top layer of skin and discard (you may want to wear kitchen gloves for this). Peel the skin off the garlic, too.In a 3 quart or larger Dutch oven or heavy-bottomed pot, warm 2 tablespoons of olive oil, then add the chopped onion, peeled whole garlic cloves and a sprinkle of salt. Saut, stirring occasionally, until the onions are softened and turning translucent, about 5 to 8 minutes.Cook the soup: Add the tomato paste, cumin, paprika, salt and optional cayenne pepper and cook for one minute, while stirring constantly. Add the peeled red peppers and vegetable stock and stir. Bring the soup to a gentle boil, then reduce heat to maintain a simmer and cook for 15 minutes, stirring occasionally.Meanwhile, make your crispy tortilla strips: Warm 1 tablespoon olive oil in a large saut pan over medium heat. Once warmed, add the tortilla strips and a dash of salt. Stir to coat the strips, then arrange them in roughly an even layer in the pan and let them cook, stirring occasionally, until both sides are golden and crispy, about 3 to 5 minutes. Transfer to a plate linked with a paper towel to cool.Optional but recommended step (yields super creamy soup): Whisk together  cup water with arrowroot or cornstarch until thoroughly blended. During the last minute of soup cooking time, pour the water/starch mixture into the soup and stir to blend. Once your soup is done cooking, remove it from heat and allow it to cool for 5 minutes.Blend the soup (two options): For the creamiest soup, transfer soup to a stand blender in batches (do NOT fill your blender over halfway, soup will go everywhere!) and cover the top of the blender with a thick layer of kitchen towel (so the steam doesn't burn your hands). Transfer pured soup to another pot or a bowl and continue until all of the soup is blended. Or, use an immersion blender to blend the soup in the pot. Blend until the mixture is smooth and creamy. If you did not add the  cup water and starch mixture earlier, taste your soup and decide if you want to stretch out the soup with  cup water (in which case, stir it in now) or leave it as is.If necessary, transfer soup back to your cooking pot and rewarm gently on the stove. Divide soup into individual bowls. Top with crispy tortilla strips, diced avocado, chopped cilantro, optional crumbled feta and a light sprinkle of freshly ground black pepper. Serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-red-pepper-tortilla-soup-616530', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 9, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}