{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542079-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 542079, u'veryPopular': False, u'lowFodmap': False, u'title': u'Golden Beets and Brussels Sprouts', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 210.01, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'2 Tbsp almond slivers, toasted', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'Tbsp'}, {u'originalString': u'10 brussels sprouts, trimmed of rough outer leaves and cut in half', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'trimmed', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11098, u'unit': u''}, {u'originalString': u'2 teaspoons fresh thyme, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'2 medium sized golden beets', u'aisle': u'Produce', u'name': u'golden beets', u'metaInformation': [u'medium sized'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets-golden.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011080, u'unit': u''}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'Salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 shallot, peeled and sliced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/golden_beets_and_brussels_sprouts/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'1 The beets take the longest to cook so start them first. Either boil them in water in a small saucepan for 45 minutes (or how ever long it takes to get them tender), or wrap them in foil and roast them in the oven at 350\xb0F for an hour fifteen minutes or until done. Roasting will give you better flavor, but takes longer and uses a lot more energy (unless you are already cooking something in the oven). When done, set the beets aside to cool for 10 minutes, then peel and chop them into 1 x 1/2 inch chunks.2 While beets are cooking toast your almond slivers if you are starting with raw almonds. Just heat a skillet to medium high heat and put in the almonds. Stir frequently with a spatula. When the almonds begin to brown, remove from pan into a small bowl.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Let cool, set aside.3\xa0Also while the beets are cooking, prepare the brussels sprouts. Bring\xa01 1/2 quarts of salted water (2 teaspoons salt) in a medium saucepan to a boil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the brussels sprouts to the water and\xa0blanch\xa0them for 2-3\xa0minutes. They should be almost all the way cooked through.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and rinse with cold water to stop the cooking.\xa0Set aside.4 In a medium sized skillet heat 1 Tbsp olive oil on medium heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the shallot slices and cook until translucent, a few minutes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add another tablespoon of olive oil and raise the heat to medium high.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the sprouts and beets to the pan, along with the thyme and mix well. Salt and pepper to taste. Cook for 1 minute more, stirring.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Remove from heat and serve. Can serve warm or at room temperature.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 63, u'instructions': u'1 The beets take the longest to cook so start them first. Either boil them in water in a small saucepan for 45 minutes (or how ever long it takes to get them tender), or wrap them in foil and roast them in the oven at 350\xb0F for an hour fifteen minutes or until done. Roasting will give you better flavor, but takes longer and uses a lot more energy (unless you are already cooking something in the oven). When done, set the beets aside to cool for 10 minutes, then peel and chop them into 1 x 1/2 inch chunks.2 While beets are cooking toast your almond slivers if you are starting with raw almonds. Just heat a skillet to medium high heat and put in the almonds. Stir frequently with a spatula. When the almonds begin to brown, remove from pan into a small bowl. Let cool, set aside.3\xa0Also while the beets are cooking, prepare the brussels sprouts. Bring\xa01 1/2 quarts of salted water (2 teaspoons salt) in a medium saucepan to a boil. Add the brussels sprouts to the water and\xa0blanch\xa0them for 2-3\xa0minutes. They should be almost all the way cooked through. Drain and rinse with cold water to stop the cooking.\xa0Set aside.4 In a medium sized skillet heat 1 Tbsp olive oil on medium heat. Add the shallot slices and cook until translucent, a few minutes. Add another tablespoon of olive oil and raise the heat to medium high. Add the sprouts and beets to the pan, along with the thyme and mix well. Salt and pepper to taste. Cook for 1 minute more, stirring. Remove from heat and serve. Can serve warm or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/golden-beets-and-brussels-sprouts-542079', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}