{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/412084-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 412084, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kielbasa and Kidney Beans', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 161.99, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 can (15 ounces) white kidney or cannellini beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned white cannellini beans', u'metaInformation': [u'white', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup chopped green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 pound fully cooked Johnsonville\xae Polish Kielbasa Sausage or Polish sausage, cut into 1/2-inch pieces', u'aisle': u'Meat', u'name': u'polish sausage', u'metaInformation': [u'fully cooked', u'cut into 1/2-inch pieces', u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7059, u'unit': u'pound'}, {u'originalString': u'1/2 cup chopped sweet red pepper', u'aisle': u'Produce', u'name': u'red sweet pepper', u'metaInformation': [u'sweet', u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'2 tablespoons steak sauce', u'aisle': u'Condiments', u'name': u'steak sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 27048, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/kielbasa-and-kidney-beans', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a skillet, cook sausage for 2-3 minutes. Stir in onion and peppers. Cook and stir until sausage is lightly browned and vegetables are tender; drain.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine brown sugar, steak sauce, vinegar and Worcestershire sauce; stir into skillet.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 27048, u'name': u'steak sauce'}]}, {u'equipment': [], u'step': u'Add beans. Cook and stir until heated through.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1041, u'instructions': u'Directions                                                                                In a skillet, cook sausage for 2-3 minutes. Stir in onion and peppers. Cook and stir until sausage is lightly browned and vegetables are tender; drain. Combine brown sugar, steak sauce, vinegar and Worcestershire sauce; stir into skillet. Add beans. Cook and stir until heated through.                                        Yield: 4 servings.                                                                                                                         Originally published as Kielbasa and Kidney Beans in  Quick CookingSeptember/October 1999, p22                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 511 calories, 31 g fat (11 g saturated fat), 76 mg cholesterol, 1,513 mg sodium, 36 g carbohydrate, 5 g fiber, 20 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/kielbasa-and-kidney-beans-412084', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}