{u'recipes': [{u'sourceName': u'The Green Forks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/506663-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 506663, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Cranberry-Nut Broccoli Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'pricePerServing': 63.07, u'creditText': u'The Green Forks', u'extendedIngredients': [{u'originalString': u'4 cups chopped broccoli florets (from about 1 large head or two small)', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'small', u'large', u'chopped', u'(from 1 head or two )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cups'}, {u'originalString': u'\xbe cup cashews, soaked overnight, drained and rinsed', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons vinegar (red wine, apple cider, etc.)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [u'red', u'( wine, apple cider, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons water, more as needed', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://thegreenforks.com/creamy-cranberry-nut-broccoli-salad/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place all the ingredients into a large bowl and toss with dressing. You may not need all the dressing, depending on how creamy you like your salads. Or you can use it all and add more ingredients (broccoli, nuts, etc.) if you need to.Cover and set in refrigerator to chill at least two hours for the flavors to meld. I like making it the night before, but if you want to keep your nuts crunchy then don't add them until right before serving.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}], u'name': u'Place all the ingredients into a high-speed blender and pur\xe9e until completely smooth and creamy. Refrigerate until ready to use.FOR THE SALAD'}, {u'steps': [], u'name': u'MAKE THE DRESSING'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 143, u'instructions': u"MAKE THE DRESSING: Place all the ingredients into a high-speed blender and pur\xe9e until completely smooth and creamy. Refrigerate until ready to use.FOR THE SALAD: Place all the ingredients into a large bowl and toss with dressing. You may not need all the dressing, depending on how creamy you like your salads. Or you can use it all and add more ingredients (broccoli, nuts, etc.) if you need to.Cover and set in refrigerator to chill at least two hours for the flavors to meld. I like making it the night before, but if you want to keep your nuts crunchy then don't add them until right before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-cranberry-nut-broccoli-salad-506663', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}