{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/388506-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 388506, u'veryPopular': False, u'lowFodmap': False, u'title': u"Beans 'n' Caramelized Onions", u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 54.17, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 bacon strips', u'aisle': u'Meat', u'name': u'bacon strips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'4-1/2 teaspoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19334, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds fresh green beans, trimmed', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'fresh', u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11052, u'unit': u'pounds'}, {u'originalString': u'2 large onions, cut into 1/2-inch wedges', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'cut into 1/2-inch wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/beans--n--caramelized-onions', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook bacon over medium heat until crisp.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove to paper towels.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drain, reserving 2 tablespoons drippings. Crumble bacon and set aside. Cook onions in drippings over medium-low heat until tender and golden brown, about 50 minutes.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Meanwhile, place the beans in a large saucepan and cover with water; bring to a boil. Cook, uncovered, for 8-10 minutes or until crisp-tender; drain. Stir the vinegar and brown sugar into onions; add beans. Cook, uncovered, over medium heat for 1 minute.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add bacon; toss gently. Season with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'aggregateLikes': 65, u'instructions': u"Directions                                                                                In a large skillet, cook bacon over medium heat until crisp. Remove to paper towels. Drain, reserving 2 tablespoons drippings. Crumble bacon and set aside. Cook onions in drippings over medium-low heat until tender and golden brown, about 50 minutes.                                                                                           Meanwhile, place the beans in a large saucepan and cover with water; bring to a boil. Cook, uncovered, for 8-10 minutes or until crisp-tender; drain. Stir the vinegar and brown sugar into onions; add beans. Cook, uncovered, over medium heat for 1 minute. Add bacon; toss gently. Season with salt and pepper.                                        Yield: 9 servings.                                                                                                                         Originally published as Beans 'n' Caramelized Onions in  Taste of HomeFebruary/March 2003, p19                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup equals 106 calories, 6 g fat (2 g saturated fat), 7 mg cholesterol, 146 mg sodium, 12 g carbohydrate, 4 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/beans-n-caramelized-onions-388506', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 9, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}