{u'recipes': [{u'sourceName': u'Lady Behind the Curtain', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/571795-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 16, u'id': 571795, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mini Focaccia Rounds', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 7.69, u'creditText': u'Lady Behind the Curtain', u'extendedIngredients': [{u'originalString': u'1 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried basil, crushed', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried rosemary, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 - 11-ounce cans Pillsbury soft breadsticks', u'aisle': u'Savory Snacks', u'name': u'grissini breadsticks', u'metaInformation': [u'soft', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grissini.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 98914, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon instant minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.ladybehindthecurtain.com/mini-focaccia-rounds/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.Line 2 cookie sheets with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix together the rosemary, basil, minced onion, pepper, salt and garlic powder.Take the dough out of the cans.  DO NOT UN ROLL THE DOUGH.Slice into 8 equal slices per bread stick can.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place facing up on parchment paper.Using the palm of your hand, press the rounds into 4-inch circles.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Brush on oil and sprinkle with herb mixture.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 14 to 16 minutes or until golden brown.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Focaccia. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Castello di Volpaia Chianti Classico Riserva. It has 4.1 out of 5 stars and a bottle costs about 24 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Color: Ruby red with a trace of garnet Nose: Elegant and intense with hints of spices connected with fruity scents Taste: Good structure with evident tannins and long persistence', u'title': u'Castello di Volpaia Chianti Classico Riserva', u'price': u'$23.99', u'id': 439055, u'link': u'https://www.wine.com/product/castello-di-volpaia-chianti-classico-riserva-2003/92756', u'imageUrl': u'https://spoonacular.com/productImages/439055-312x231.jpg'}]}, u'aggregateLikes': 1244, u'instructions': u'Preheat oven to 375 degrees.Line 2 cookie sheets with parchment paper.Mix together the rosemary, basil, minced onion, pepper, salt and garlic powder.Take the dough out of the cans.  DO NOT UN ROLL THE DOUGH.Slice into 8 equal slices per bread stick can. Place facing up on parchment paper.Using the palm of your hand, press the rounds into 4-inch circles.Brush on oil and sprinkle with herb mixture.Bake 14 to 16 minutes or until golden brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-focaccia-rounds-571795', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 31, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}