{u'recipes': [{u'sourceName': u'Amys Healthy Baking', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/703892-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 703892, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Butter Cup Protein Overnight Oats', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 170.56, u'creditText': u'Amys Healthy Baking', u'extendedIngredients': [{u'originalString': u'\xbd cup (120g) plain nonfat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 120.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'g'}, {u'originalString': u'\xbc cup (60mL) nonfat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 60.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'mL'}, {u'originalString': u'\xbc cup (25g) old-fashioned oats (gluten-free if necessary)', u'aisle': u'Cereal', u'name': u'old-fashioned oats', u'metaInformation': [u'gluten-free', u'( if necessary)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'1 tbsp (7g) peanut flour (I recommend Protein Plus)', u'aisle': u'Baking', u'name': u'peanut flour', u'metaInformation': [u'(I recommend Protein Plus)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 16100, u'unit': u'g'}, {u'originalString': u'16 drops vanilla cr\xe8me stevia, or to taste', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 16.0, u'consistency': u'solid', u'id': 93628, u'unit': u'drops'}, {u'originalString': u'1 tbsp (5g) unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 5.0, u'consistency': u'solid', u'id': 19165, u'unit': u'g'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://amyshealthybaking.com/blog/2016/01/05/peanut-butter-cup-protein-overnight-oats/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Add all of the ingredients to a glass jar or plastic container with a tight-fitting lid, and stir until thoroughly combined. Cover and refrigerate overnight, or at least 8 hours, before eating.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern works really well with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Pacific Rim Riesling. It has 4.2 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'Portraying bright crispness, subtle sweetness and aromas of jasmine, pear and apple, Pacific Rim Riesling exemplifies the harmony of Riesling. The sweetness plays wonderfully with fiery fare (from Thai to Mexican), while the natural acidity stands up to richer foods (from French to German).', u'title': u'Pacific Rim Riesling', u'price': u'$11.99', u'id': 446903, u'link': u'https://www.wine.com/product/pacific-rim-riesling-2011/119629', u'imageUrl': u'https://spoonacular.com/productImages/446903-312x231.jpg'}]}, u'aggregateLikes': 144, u'instructions': u'Add all of the ingredients to a glass jar or plastic container with a tight-fitting lid, and stir until thoroughly combined. Cover and refrigerate overnight, or at least 8 hours, before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-cup-protein-overnight-oats-703892', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}