{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/456981-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 456981, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Rum Cake', u'diets': [], u'pricePerServing': 131.32, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/2 cup dark rum', u'aisle': u'Alcoholic Beverages', u'name': u'dark rum', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14037, u'unit': u'cup'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 (3.5 ounce) package instant vanilla pudding mix', u'aisle': u'Baking', u'name': u'instant vanilla pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 19206, u'unit': u'ounce'}, {u'originalString': u'1/4 cup rum', u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14037, u'unit': u'cup'}, {u'originalString': u'1/2 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 cup chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'1/8 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.125, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1/2 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 (18.25 ounce) package yellow cake mix', u'aisle': u'Baking', u'name': u'yellow cake mix', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-cake.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.25, u'consistency': u'solid', u'id': 18144, u'unit': u'ounce'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Easy-Rum-Cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F (165 degrees C).  Grease and  flour a 10 inch tube or Bundt pan.  Sprinkle nuts over  the bottom of the pan.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix together the cake mix, 1/2 cup dark rum, eggs, 1/2 cup water, oil, and vanilla pudding mix.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'id': 19206, u'name': u'instant vanilla pudding mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'dark rum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour batter over the nuts in the pan.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 1 hour.  Cool, and invert cake on a serving plate.  Prick the top of the cake.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'To Make The Glaze:  Melt the butter in a saucepan.  Stir in 1/8 cup water and the 1/2 cup sugar.  Boil for 5 minutes, stirring constantly.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove glaze from heat, and stir in 1/4 cup rum.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u'Drizzle and smooth evenly over the top and sides.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Rum Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Preheat oven to 325 degrees F (165 degrees C).  Grease and  flour a 10 inch tube or Bundt pan.  Sprinkle nuts over  the bottom of the pan.                            Mix together the cake mix, 1/2 cup dark rum, eggs, 1/2 cup water, oil, and vanilla pudding mix.  Pour batter over the nuts in the pan.                            Bake for 1 hour.  Cool, and invert cake on a serving plate.  Prick the top of the cake.                            To Make The Glaze:  Melt the butter in a saucepan.  Stir in 1/8 cup water and the 1/2 cup sugar.  Boil for 5 minutes, stirring constantly.  Remove glaze from heat, and stir in 1/4 cup rum.  Drizzle and smooth evenly over the top and sides.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-rum-cake-456981', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}