{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/478841-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 478841, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Guacamole', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 187.36, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'2 tablespoons chopped Cilantro (heaping)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'3 whole ripe Hass Avocados', u'aisle': u'Produce', u'name': u'hass avocados', u'metaInformation': [u'whole', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 Jalapeno Pepper (or 2 if you like more heat)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'(or 2 if you like more heat)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 whole Lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'2 tablespoons chopped Red Onions (heaping)', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tablespoons'}, {u'originalString': u'3 Roma Tomatoes (or 2 medium size regular tomatoes)', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'medium size', u'(or 2 regular tomatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'4 dashes of Sea Salt (or salt to taste)', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'to taste', u'(or salt )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'dashes'}], u'healthScore': 50.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.couponclippingcook.com/easy-guacamole/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut each avocado in half and remove the seed.  Scoop out the avocado and add to a medium size bowl.  Smash the avocado with a fork leaving some bite size pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Add the juice from a lime and mix together.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the tomatoes in half and remove the seeds.  Chop the tomatoes and add them to the bowl.Then chop the red onion, cilantro, and jalapeno pepper (remove the seeds unless you prefer more heat), and add to the bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add the salt and mix the ingredients together.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Garnish with grated parmesan cheese (optional).', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve chilled or at room temperature.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 833, u'instructions': u'Cut each avocado in half and remove the seed.  Scoop out the avocado and add to a medium size bowl.  Smash the avocado with a fork leaving some bite size pieces.Add the juice from a lime and mix together.  Cut the tomatoes in half and remove the seeds.  Chop the tomatoes and add them to the bowl.Then chop the red onion, cilantro, and jalapeno pepper (remove the seeds unless you prefer more heat), and add to the bowl.  Add the salt and mix the ingredients together.Garnish with grated parmesan cheese (optional).  Serve chilled or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-guacamole-478841', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}