{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/598012-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 100, u'id': 598012, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel-Topped Turtle Brownies', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 26.97, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u"45 Hershey's caramels (about 10 ounces)", u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 19074, u'unit': u'ounces'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'Generous 2 cups pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'halve', u'unitShort': u'halves', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'halves'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 ounces semisweet chocolate, coarsely chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup plus 2 tablespoons unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020081, u'unit': u'cup'}, {u'originalString': u'12 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'3 ounces high-quality unsweetened chocolate, coarsely chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounces'}, {u'originalString': u'1 1/2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://leitesculinaria.com/3258/recipes-caramel-topped-turtle-brownies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Make the brownies1. Put a rack in the middle of the oven and preheat the oven to 350\xb0F (175\xb0C). Grease a 9-by-13-inch baking pan.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the butter and chocolate in a medium heavy saucepan and melt over low heat, stirring frequently until smooth.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the heat.3. In a large bowl, beat the eggs and both sugars with an electric mixer on low speed just until smooth. Beat in the salt. Beat in the melted chocolate mixture, and then beat in the vanilla. Scrape down the sides of the bowl. On low speed, beat in the flour in two additions.4. Scrape the batter into the prepared pan and smooth the top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 20 to 22 minutes, until just firm to the touch.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the pan to a wire rack.Make the caramel topping5. Meanwhile, melt the caramels with the cream in a large heavy saucepan over low heat, stirring frequently, until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the pecans and stir until well coated.6. Scrape the topping onto the hot brownie layer, gently spreading it evenly.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Let cool on the rack then refrigerate the brownie for 1 hour, or until the topping is chilled and set.Make the drizzle7.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine the chocolate and cream in a small heavy saucepan and heat over low heat, stirring frequently, until melted and smooth. Using a fork, drizzle or spatter the chocolate over the bars in a zigzag pattern. Refrigerate for 30 minutes, or until the chocolate is set.8. Using a sharp heavy knife, cut the brownie, in the pan, into 36 bars.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve chilled or at room temperature. (The bars can be refrigerated, tightly covered, for up to 5 days; they can also be frozen, well wrapped, for up to 2 weeks.)', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 7, u'instructions': u'Make the brownies1. Put a rack in the middle of the oven and preheat the oven to 350\xb0F (175\xb0C). Grease a 9-by-13-inch baking pan.2. Combine the butter and chocolate in a medium heavy saucepan and melt over low heat, stirring frequently until smooth. Remove from the heat.3. In a large bowl, beat the eggs and both sugars with an electric mixer on low speed just until smooth. Beat in the salt. Beat in the melted chocolate mixture, and then beat in the vanilla. Scrape down the sides of the bowl. On low speed, beat in the flour in two additions.4. Scrape the batter into the prepared pan and smooth the top. Bake for 20 to 22 minutes, until just firm to the touch. Transfer the pan to a wire rack.Make the caramel topping5. Meanwhile, melt the caramels with the cream in a large heavy saucepan over low heat, stirring frequently, until smooth. Add the pecans and stir until well coated.6. Scrape the topping onto the hot brownie layer, gently spreading it evenly. Let cool on the rack then refrigerate the brownie for 1 hour, or until the topping is chilled and set.Make the drizzle7. Combine the chocolate and cream in a small heavy saucepan and heat over low heat, stirring frequently, until melted and smooth. Using a fork, drizzle or spatter the chocolate over the bars in a zigzag pattern. Refrigerate for 30 minutes, or until the chocolate is set.8. Using a sharp heavy knife, cut the brownie, in the pan, into 36 bars. Serve chilled or at room temperature. (The bars can be refrigerated, tightly covered, for up to 5 days; they can also be frozen, well wrapped, for up to 2 weeks.)', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-topped-turtle-brownies-598012', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 140, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}