{u'recipes': [{u'sourceName': u'My Korean Kitchen', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/567375-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 567375, u'veryPopular': False, u'lowFodmap': False, u'title': u'Japanese Style Chicken Curry Rice', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 103.18, u'creditText': u'My Korean Kitchen', u'extendedIngredients': [{u'originalString': u'\xbc of a carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 piece of chicken breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'piece'}, {u'originalString': u'Steamed rice for 2 people', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'steamed', u'for 2 people'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'Curry 1 and a \xbd blocks', u'aisle': u'Ethnic Foods', u'name': u'curry paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93605, u'unit': u''}, {u'originalString': u'Olive oil 1 tbsp', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbd an onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 medium size potato', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'medium size'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'\xbc of a red capsicum', u'aisle': u'Produce', u'name': u'red capsicum', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Water 265 ml', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 265.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ml'}, {u'originalString': u'\xbc of a yellow capsicum', u'aisle': u'Produce', u'name': u'yellow capsicum', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://mykoreankitchen.com/2006/09/24/japanese-style-chicken-curry-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash all the vegetables and chicken in cold water. Peel off the skins as needed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Cut the onion, zucchini, potato, and carrot into small cubes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Cut the capsicums and chicken breast into small pieces.Pre heat the wok for 10 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [], u'step': u'Pour the olive oil.Put in all the vegetables (except capsicums)Stir it for about 3 minutes.japanese curry cooking process', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add capsicums and the chicken.Stir it for a bit. (For about 2 minutes)', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [], u'step': u'Add the water.Boil it until vegetable and chicken get soft. (For about 5 minutes)', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the curry. Stir it around until it melts in.Stir it well.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Put the rice on the plate.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the curry on the top of the rice.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Wash all the vegetables and chicken in cold water. Peel off the skins as needed.Cut the onion, zucchini, potato, and carrot into small cubes.Cut the capsicums and chicken breast into small pieces.Pre heat the wok for 10 seconds.Pour the olive oil.Put in all the vegetables (except capsicums)Stir it for about 3 minutes.japanese curry cooking processAdd capsicums and the chicken.Stir it for a bit. (For about 2 minutes)Add the water.Boil it until vegetable and chicken get soft. (For about 5 minutes)Add the curry. Stir it around until it melts in.Stir it well.Put the rice on the plate.Serve the curry on the top of the rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/japanese-style-chicken-curry-rice-567375', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}