{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214363-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 214363, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lemon & orange cake', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 69.6, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp gluten-free baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'250g pack butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u"chocolate eggs, to decorate, if you like (check they're gluten-free)", u'name': u'chocolate eggs', u'metaInformation': [u'gluten-free', u"(check they're )"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-easter-eggs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 99112, u'unit': u'servings'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'250g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'175g icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'2 lemons, zest and juice', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 orange, zest and juice', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u"250g mashed potatoes, forked through so it doesn't go in as one lump", u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'250g gluten-free self-raising flour (we used Doves Farm, which is also wheat-free)', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [u'gluten-free', u'(we used Doves Farm, which is also wheat-free)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1162651/lemon-and-orange-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Grease and line a deep, 20cm round caketin. Beat the butter and sugar togetheruntil pale and fluffy, then gradually beatin the eggs, one by one. Fold in the flour,baking powder, mashed potato, zests andjuices.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Scrape into the tin and level the top.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake for 45 mins until golden and a skewerpoked in comes out clean. Cool in the tinfor 10 mins, then move to a wire rack.Sift the icing sugar, then mix in enoughof the lemon juice to make a stiff, but stillrunny icing.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Spread over the cake so itdribbles down the sides a little.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Addsome chocolate eggs, if using. Leave untilthe icing has set, then slice and serve.Delicious with a dollop of natural yogurt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-easter-eggs.jpg', u'id': 99112, u'name': u'chocolate eggs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 171, u'instructions': u'Heat oven to 180C/160C fan/gas 4.Grease and line a deep, 20cm round caketin. Beat the butter and sugar togetheruntil pale and fluffy, then gradually beatin the eggs, one by one. Fold in the flour,baking powder, mashed potato, zests andjuices. Scrape into the tin and level the top.Bake for 45 mins until golden and a skewerpoked in comes out clean. Cool in the tinfor 10 mins, then move to a wire rack.Sift the icing sugar, then mix in enoughof the lemon juice to make a stiff, but stillrunny icing. Spread over the cake so itdribbles down the sides a little. Addsome chocolate eggs, if using. Leave untilthe icing has set, then slice and serve.Delicious with a dollop of natural yogurt.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-orange-cake-214363', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}