{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610243-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 610243, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Pork Chops with Hatch Chile Pico de Gallo', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 184.53, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'4 thick cut bone-in pork chops', u'aisle': u'Meat', u'name': u'bone-in pork chops', u'metaInformation': [u'thick cut', u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chop-bone-in.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10036, u'unit': u''}, {u'originalString': u'2 hatch chiles', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1/4 cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 clove garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1/2 cup diced onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'fresh cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon salt, plus more for seasoning pork chop', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'plus more for seasoning pork chop'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 medium tomatoes, seeded and diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'medium', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.lifesambrosia.com/2014/08/grilled-pork-chops-with-hatch-chile-pico-de-gallo-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Turn on your oven broiler.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place chilies on a baking sheet 6 inches away from the broiler. Broil 4 - 5 minutes on each side or until skin has started to blister and blacken.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [], u'step': u'Place chiles into a paper bag, close and let set for 15 minutes. After 15 minutes, peel away the skin of the chiles and remove the stem and seeds. The more seeds you leave the spicier the pico de gallo will be. Dice the chiles.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Combine diced chiles with onions, tomatoes, cilantro, garlic and 1/4 teaspoon salt. Cover and let sit at room temperature until you are ready to use. Preheat grill to medium high heat. Season both sides of the pork chops with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush with olive oil. Cook pork chops on preheated grill 4 - 5 minutes or until it lifts easily off the grill. Turn and cook on the other side 3 - 4 minutes or until the pork chops lift easily and a meat thermometer registers 160 degrees.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Remove from heat, allow to rest five minutes. Top with pico de gallo and serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pork Chops on the menu? Try pairing with Chardonnay, Pinot Noir, and Riesling. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Turn on your oven broiler. Place chilies on a baking sheet 6 inches away from the broiler. Broil 4 - 5 minutes on each side or until skin has started to blister and blacken. Place chiles into a paper bag, close and let set for 15 minutes. After 15 minutes, peel away the skin of the chiles and remove the stem and seeds. The more seeds you leave the spicier the pico de gallo will be. Dice the chiles. Combine diced chiles with onions, tomatoes, cilantro, garlic and 1/4 teaspoon salt. Cover and let sit at room temperature until you are ready to use. Preheat grill to medium high heat. Season both sides of the pork chops with salt and pepper. Brush with olive oil. Cook pork chops on preheated grill 4 - 5 minutes or until it lifts easily off the grill. Turn and cook on the other side 3 - 4 minutes or until the pork chops lift easily and a meat thermometer registers 160 degrees. Remove from heat, allow to rest five minutes. Top with pico de gallo and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-pork-chops-with-hatch-chile-pico-de-gallo-610243', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}