{u'recipes': [{u'sourceName': u'Back for Seconds', u'cuisines': [u'south american', u'latin american'], u'image': u'https://spoonacular.com/recipeImages/611496-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 611496, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Butterscotch Chocolate Fudge', u'diets': [u'gluten free'], u'pricePerServing': 6.74, u'creditText': u'Back for Seconds', u'extendedIngredients': [{u'originalString': u'1 cup butterscotch chips', u'aisle': u'Baking', u'name': u'butterscotch chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19070, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon coarse sea salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup semi sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 can sweetened condensed milk (7 oz)', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'1 1/2 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://backforsecondsblog.com/2014/09/salted-butterscotch-chocolate-fudge/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a microwave safe bowl melt the chocolate chips, butter, and sweetened condensed milk in 30 second intervals, stirring in between, until melted and smooth. Set aside.In a microwave safe bowl melt the butterscotch chips, butter, and sweetened condensed milk in 30 second intervals, stirring in between, until melted and smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 19070, u'name': u'butterscotch chips'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add salt and stir. Set aside.Line a 8x8" pan with lightly greased parchment paper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour chocolate layer into the pan and spread into an even layer.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour butterscotch layer over chocolate layer and carefully spread into an even layer.  Sprinkle with a little sea salt. Refrigerate at least 2 hours or until firm.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Cut into squares. Store covered in the refrigerator.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 992, u'instructions': u'In a microwave safe bowl melt the chocolate chips, butter, and sweetened condensed milk in 30 second intervals, stirring in between, until melted and smooth. Set aside.In a microwave safe bowl melt the butterscotch chips, butter, and sweetened condensed milk in 30 second intervals, stirring in between, until melted and smooth. Add salt and stir. Set aside.Line a 8x8" pan with lightly greased parchment paper. Pour chocolate layer into the pan and spread into an even layer. Pour butterscotch layer over chocolate layer and carefully spread into an even layer.  Sprinkle with a little sea salt. Refrigerate at least 2 hours or until firm. Cut into squares. Store covered in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/salted-butterscotch-chocolate-fudge-611496', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 64, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}