{u'recipes': [{u'sourceName': u'Alaska from Scratch', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/519626-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 519626, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chipotle Shredded Beef with Corn Salsa', u'diets': [u'gluten free'], u'pricePerServing': 527.49, u'creditText': u'Alaska from Scratch', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 16015, u'unit': u'servings'}, {u'originalString': u'1 (14oz) can corn, drained', u'aisle': u'Canned and Jarred', u'name': u'canned corn', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 11177, u'unit': u'oz'}, {u'originalString': u'2t canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u't'}, {u'originalString': u'2-3 chipotle peppers in adobo (depending on the level of heat you want)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle peppers in adobo', u'metaInformation': [u'(depending on the level of heat you want)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1/4c cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'c'}, {u'originalString': u'1T cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'T'}, {u'originalString': u'3 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'guacamole', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 1009037, u'unit': u'servings'}, {u'originalString': u'jack cheese, grated', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'servings'}, {u'originalString': u'1 small jalape\xf1o pepper, seeds removed and minced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeds removed and minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Juice of half a lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4c red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'c'}, {u'originalString': u'1/2 of a red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2.5-3lb beef bottom roast, seasoned generously with salt and pepper', u'aisle': u'Meat', u'name': u'roast beef', u'metaInformation': [u'with salt and pepper'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'liquid', u'id': 93713, u'unit': u'lb'}, {u'originalString': u'salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'servings'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'1t sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u't'}, {u'originalString': u'1c water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'c'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.alaskafromscratch.com/2012/03/14/chipotle-shredded-beef-with-corn-salsa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place all the ingredients into a slow-cooker and cook on low for 8 hours. Shred meat using two forks directly in pot and mix with juices. Use a slotted spoon when serving.!For Corn Salsa:In a bowl, mix all ingredients together. Refrigerate at least two hours prior to serving.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u'! For Shredded Beef'}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Garnet Monterey Pinot Noir. It has 4.2 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine.", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 194, u'instructions': u'! For Shredded Beef:Place all the ingredients into a slow-cooker and cook on low for 8 hours. Shred meat using two forks directly in pot and mix with juices. Use a slotted spoon when serving.!For Corn Salsa:In a bowl, mix all ingredients together. Refrigerate at least two hours prior to serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-shredded-beef-with-corn-salsa-519626', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}