{u'recipes': [{u'sourceName': u'Alidas Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/547340-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 547340, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Cinnamon French Toast', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 100.49, u'creditText': u'Alidas Kitchen', u'extendedIngredients': [{u'originalString': u'12 slices cinnamon bread or cinnamon raisin bread', u'aisle': u'Bakery/Bread', u'name': u'cinnamon raisin bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-raisin-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'solid', u'id': 18047, u'unit': u'slices'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups half and half (fat free works fine)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free half and half', u'metaInformation': [u'fat free', u'fine', u'( works )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1199, u'unit': u'cups'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons butter, melted (light better works fine)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'light butter', u'metaInformation': [u'light', u'melted', u'fine', u'( better works )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 4602, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://alidaskitchen.com/2013/05/10/baked-cinnamon-french-toast/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350 degrees.  Spray 13"x9" pan with cooking spray.In prepared pan, place six slices of bread and top with remaining 6 slices of bread.  In a large bowl, whisk together half and half, eggs, butter, vanilla and cinnamon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour over bread, pressing bread down so some liquid is absorbed.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 45 minutes until bread is golden brown.  Sprinkle with powdered sugar, if desired.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 71, u'instructions': u'Preheat oven to 350 degrees.  Spray 13"x9" pan with cooking spray.In prepared pan, place six slices of bread and top with remaining 6 slices of bread.  In a large bowl, whisk together half and half, eggs, butter, vanilla and cinnamon.  Pour over bread, pressing bread down so some liquid is absorbed. Bake for 45 minutes until bread is golden brown.  Sprinkle with powdered sugar, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-cinnamon-french-toast-547340', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}