{u'recipes': [{u'sourceName': u'Salu Salo Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/848128-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 140, u'id': 848128, u'veryPopular': False, u'lowFodmap': False, u'title': u'Nilagang Baka', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 366.73, u'creditText': u'Salu Salo Recipes', u'extendedIngredients': [{u'originalString': u'2 lbs bone-in beef shank, beef short ribs or beef brisket, cut into serving pieces', u'aisle': u'Meat', u'name': u'beef brisket', u'metaInformation': [u'bone-in', u'cut into serving pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-brisket.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 13023, u'unit': u'lbs'}, {u'originalString': u'Fish sauce or salt to taste', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'servings'}, {u'originalString': u'1 medium green cabbage, quartered and cored', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'green', u'cored', u'medium', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u''}, {u'originalString': u'1 tsp kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'2 medium onions, peeled and halved', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium', u'peeled', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'5 medium size yellow potatoes, peeled and quartered', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'yellow', u'medium size', u'peeled', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1 tsp whole peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'whole peppercorns', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'tsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://salu-salo.com/nilagang-baka/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Put beef in a big pot and add enough water to cover it. Bring to a boil over high heat. Skim off scum that rises on the surface.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, salt and peppercorns. Reduce heat to medium, cover and let simmer for 2 hours or until meat is fork tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add more water as needed.Increase heat to medium high.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add potatoes and cabbage and cook for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}]}, {u'equipment': [], u'step': u'Add plantain banana, if using; cook for another 5 minutes or until potatoes are fork tender.Correct seasonings using fish sauce or salt.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve hot with steamed rice and fish sauce with lemon juice on the side.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 209, u'instructions': u'Put beef in a big pot and add enough water to cover it. Bring to a boil over high heat. Skim off scum that rises on the surface.Add onion, salt and peppercorns. Reduce heat to medium, cover and let simmer for 2 hours or until meat is fork tender. Add more water as needed.Increase heat to medium high. Add potatoes and cabbage and cook for 10 minutes. Add plantain banana, if using; cook for another 5 minutes or until potatoes are fork tender.Correct seasonings using fish sauce or salt. Serve hot with steamed rice and fish sauce with lemon juice on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/nilagang-baka-848128', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 145, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}