{u'recipes': [{u'sourceName': u'Happy Herbivore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/262985-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 262985, u'veryPopular': True, u'lowFodmap': False, u'title': u"Soy-Free Mac n' Cheese", u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 103.14, u'creditText': u'Happy Herbivore', u'extendedIngredients': [{u'originalString': u'2 tbsp cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tbsp'}, {u'originalString': u'1 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1\xbc cups plant-based milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 tbsp yellow miso paste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16112, u'unit': u'tbsp'}, {u'originalString': u'1 tsp onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}, {u'originalString': u'1\xbc cups whole wheat pasta, uncooked', u'aisle': u'Pasta and Rice', u'name': u'whole wheat pasta', u'metaInformation': [u'whole wheat', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-spaghetti.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20124, u'unit': u'cups'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://happyherbivore.com/recipe/soy-free-mac-n-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to directions, immediately drain, rinse with cold water and set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all remaining ingredients together in a saucepan over medium heat. Bring to a near boil and turn heat down to low. Stirring occassionally, allow the sauce to thicken up.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine with macaroni, stirring to coat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with smoked paprika if desired.Nutritional Information', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'2Amount Per Serving', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Calories', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'292Fat', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'3g', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Carbohydrate', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'80gDietary Fiber12.80gSugars0.20gProtein20.70g', u'number': 6, u'ingredients': []}], u'name': u'Serving Size 1Servings Per Batch'}], u'winePairing': {}, u'aggregateLikes': 944, u'instructions': u'InstructionsCook pasta according to directions, immediately drain, rinse with cold water and set aside. Whisk all remaining ingredients together in a saucepan over medium heat. Bring to a near boil and turn heat down to low. Stirring occassionally, allow the sauce to thicken up. Combine with macaroni, stirring to coat. Garnish with smoked paprika if desired.Nutritional InformationServing Size: 1Servings Per Batch:                                     2Amount Per ServingCalories                                     292Fat                                     3g                                      Carbohydrate                                     49.80gDietary Fiber12.80gSugars0.20gProtein20.70g', u'spoonacularSourceUrl': u'https://spoonacular.com/soy-free-mac-n-cheese-262985', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}