{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552244-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 552244, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spicy Oven Chicken Wings with Apple Onion Dip', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 173.12, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u"3 Tb. Musselman's Apple Butter", u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apple butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-jelly.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 3.0, u'consistency': u'solid', u'id': 19294, u'unit': u'Tb'}, {u'originalString': u"1 tsp. Musselman's Apple Cider Vinegar", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tsp'}, {u'originalString': u'1 Tb. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tb'}, {u'originalString': u'3 lbs. chicken wings or drumettes', u'aisle': u'Meat', u'name': u'chicken wings', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 5100, u'unit': u'lbs'}, {u'originalString': u'1 Tb. sriracha chili sauce', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'solid', u'id': 6972, u'unit': u'Tb'}, {u'originalString': u'1/4 cup Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002046, u'unit': u'cup'}, {u'originalString': u'1 Tb. Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'Tb'}, {u'originalString': u'1 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1/4 cup maple syrup or honey', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 small onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup plain greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 Tb. vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 3.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'Tb'}, {u'originalString': u'1/4 cup spicy whole grain mustard (like Lusty Monk)', u'aisle': u'Condiments', u'name': u'whole-grain mustard', u'metaInformation': [u'whole', u'(like Lusty Monk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1012046, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.aspicyperspective.com/2013/06/oven-chicken-wings-apple-onion-dip.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees F and line a large rimmed baking sheet with foil. Dry the chicken wings thoroughly with paper towels, then toss with oil, garlic powder, 1 1/2 tsp. salt and 1/2 tsp. pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread evenly over the baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake the wings for 20 minutes. Flip, then bake another 15- 20 minutes until the skin is crisp.Meanwhile, whisk the mustards, maple syrup and sriracha together. Once the chicken has cooked through and the skin is crispy, pour the sauce over the chicken and toss to coat.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread the wings back out and bake another 10 \xa0minutes.For the Apple Onion Dip: While the chicken is baking, place a small skillet of medium-low heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [], u'step': u'Add the butter and onions and saute for 10-15 minutes until the onions are caramelized.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u"Mix the onions with the Mussleman's apple butter, greek yogurt, dijon, and Mussleman's apple cider vinegar. Salt and pepper to taste.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'id': 2048, u'name': u'apple cider vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-jelly.jpg', u'id': 19294, u'name': u'apple butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve the spicy chicken wings warm, with the apple onion dip.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken Wings. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 3604, u'instructions': u"Preheat the oven to 450 degrees F and line a large rimmed baking sheet with foil. Dry the chicken wings thoroughly with paper towels, then toss with oil, garlic powder, 1 1/2 tsp. salt and 1/2 tsp. pepper. Spread evenly over the baking sheet. Bake the wings for 20 minutes. Flip, then bake another 15- 20 minutes until the skin is crisp.Meanwhile, whisk the mustards, maple syrup and sriracha together. Once the chicken has cooked through and the skin is crispy, pour the sauce over the chicken and toss to coat. Spread the wings back out and bake another 10 \xa0minutes.For the Apple Onion Dip: While the chicken is baking, place a small skillet of medium-low heat. Add the butter and onions and saute for 10-15 minutes until the onions are caramelized.Mix the onions with the Mussleman's apple butter, greek yogurt, dijon, and Mussleman's apple cider vinegar. Salt and pepper to taste. Serve the spicy chicken wings warm, with the apple onion dip.", u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-oven-chicken-wings-with-apple-onion-dip-552244', u'dishTypes': [], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}