{u'recipes': [{u'sourceName': u'Tessa the Domestic Diva', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/543018-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 543018, u'veryPopular': False, u'lowFodmap': False, u'title': u"Corn-Free Millet 'Cornbread", u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 40.66, u'creditText': u'Tessa the Domestic Diva', u'extendedIngredients': [{u'originalString': u'4 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup egg whites or 2 whole eggs or 2 eggs worth egg replacer, or \xbc cup hot water w/ \xbe teaspoon gelatin', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'whole', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1124, u'unit': u'cup'}, {u'originalString': u'1 cup coarse ground millet (you make this yourself from whole millet and a spice/coffee grinder) or millet grits', u'aisle': u'Cereal;Baking', u'name': u'grits', u'metaInformation': [u'whole', u'(you make this yourself from millet and a spice/coffee grinder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8160, u'unit': u'cup'}, {u'originalString': u'1 teaspoon guar gum', u'aisle': u'Health Foods', u'name': u'guar gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93765, u'unit': u'teaspoon'}, {u'originalString': u'1 cup any milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbc cup millet flour', u'aisle': u'Gluten Free;Health Foods', u'name': u'millet flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20647, u'unit': u'cup'}, {u'originalString': u'\xbc cup Earth Balance or palm shortening', u'aisle': u'Ethnic Foods', u'name': u'palm oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4055, u'unit': u'cup'}, {u'originalString': u'\xbc cup potato starch (or any starch)', u'aisle': u'Baking', u'name': u'potato starch', u'metaInformation': [u'or any starch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11413, u'unit': u'cup'}, {u'originalString': u'\xbe teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup sorghum flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'sorghum flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20648, u'unit': u'cup'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbc cup sweet rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'sweet rice flour', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10020061, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.tessadomesticdiva.com/2011/10/corn-free-cornbread.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine all the ingredients through the guar gum and whisk together.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93765, u'name': u'guar gum'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Cut in the margarine or palm shortening using a pastry blender until mixture resembles coarse crumbs, much like scones or pie crusts.Make a well in the center of the ingredients and put the egg whites (or egg replacer) and milk in the center.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk until well incorporated.Coarsely grind whole millet in a coffee grinder until it resembles cornmeal. I did this in two batches. You don't want to do it too long to make more of a flour, you want some texture to mimic the corn texture in cornbread.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the millet grits . I have also used raw buckwheat groats for a different flavor but similar texture. The mixture will seem thin at first, and then will thicken quickly as the millet absorbs the liquid.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 8160, u'name': u'grits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place batter in a greased 9" pan. I used my Demarle Flower Mold which requires no greasing (you can follow the link to order your own from a mom friend if you\'re interested).', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in a 350 degree oven for about 30 minutes until a knife inserted in the center comes out clean.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Cornbread. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Eroica Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'This Eroica shows the crisp acidity of the 2007 vintage, which was the best acidity holding year in the past five years. The wine delivers mandarin orange and sweet lime aromas and flavors with subtle mineral notes. The cooler September, along with selecting fruit from higher elevation and cooler sites, contributed to the mouth-watering acidity balanced by beautiful Washington Riesling fruit.An amazing pairing with sweet, flavorful Dungeness crab.', u'title': u'Eroica Riesling', u'price': u'$23.99', u'id': 434655, u'link': u'https://www.wine.com/product/eroica-riesling-2007/96190', u'imageUrl': u'https://spoonacular.com/productImages/434655-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Preheat the oven to 350 degrees.Combine all the ingredients through the guar gum and whisk together.Cut in the margarine or palm shortening using a pastry blender until mixture resembles coarse crumbs, much like scones or pie crusts.Make a well in the center of the ingredients and put the egg whites (or egg replacer) and milk in the center. Whisk until well incorporated.Coarsely grind whole millet in a coffee grinder until it resembles cornmeal. I did this in two batches. You don\'t want to do it too long to make more of a flour, you want some texture to mimic the corn texture in cornbread.Whisk in the millet grits . I have also used raw buckwheat groats for a different flavor but similar texture. The mixture will seem thin at first, and then will thicken quickly as the millet absorbs the liquid.Place batter in a greased 9" pan. I used my Demarle Flower Mold which requires no greasing (you can follow the link to order your own from a mom friend if you\'re interested).Bake in a 350 degree oven for about 30 minutes until a knife inserted in the center comes out clean.', u'spoonacularSourceUrl': u'https://spoonacular.com/corn-free-millet-cornbread-543018', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}