{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/203163-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 203163, u'veryPopular': False, u'lowFodmap': False, u'title': u"Kosher Revolution's Be-All, End-All Chicken Soup", u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 151.48, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 medium celery stalks, cut into thirds', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'medium', u'cut into thirds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 4- to 5-pound stewing chicken, cut into eight parts, rinsed, any excess fat removed', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'rinsed', u'fat removed', u'cut into eight parts, , any excess '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pound'}, {u'originalString': u'3 pounds chicken legs, wings, bones and backs, any combination, rinsed, any excess fat removed', u'aisle': u'Meat', u'name': u'chicken legs', u'metaInformation': [u'rinsed', u'fat removed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 5075, u'unit': u'pounds'}, {u'originalString': u'3 leeks, white parts only, well cleaned', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'white', u'cleaned', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1 medium onion, unpeeled, quartered', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'unpeeled', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 medium parsnips, peeled and cut into 1/2-inch dice', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [u'medium', u'peeled', u'cut into 1/2-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'2 1/2-pound pieces flanken', u'aisle': u'?', u'name': u'flanken', u'metaInformation': [], u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'unit': u'pound'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/12/kosher-revolutions-be-all-end-all-chicken-sou.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large stockpot, combine the parsnips, celery, leeks, onion andbouquets garnis.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Place the flanken on top and top with all the chicken.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add cold water to cover by 1 inch. Bring to a boil slowly over mediumheat, 45 to 60 minutes. Reduce the heat and simmer for 1 hour, skimming to remove any surface solids every 10 minutes. Simmer another hour, skimming every 20 minutes, and transfer the breast to a medium bowl. Simmer, skimming as needed, for 11/41/4 hours more. With tongs or a slotted spatula, carefully remove the remaining chicken and the flanken and transfer to the bowl. (Reserve the chicken, skinned and boned, for chicken salad, or return to the soup.)', u'length': {u'number': 75, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Meanwhile, fill the sink with cold water and add ice.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a largeclean pot in the sink. Line a colander or strainer that fits over the potwith a double layer of cheesecloth. Carefully ladle the soup through thecheesecloth, trying not to disturb the ingredients at the bottom of thecooking pot. When only a little soup remains, carefully tilt the pot topour it off. (Discard the pot ingredients.)', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Allow the soup to cool to room temperature and transfer to therefrigerator to chill.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Remove any solidified fat from the soup and serve,or freeze in a tightly sealed plastic container.', u'number': 10, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 84, u'instructions': u'Procedures                                                                              1                                                                            In a large stockpot, combine the parsnips, celery, leeks, onion andbouquets garnis. Place the flanken on top and top with all the chicken.Add cold water to cover by 1 inch. Bring to a boil slowly over mediumheat, 45 to 60 minutes. Reduce the heat and simmer for 1 hour, skimming to remove any surface solids every 10 minutes. Simmer another hour, skimming every 20 minutes, and transfer the breast to a medium bowl. Simmer, skimming as needed, for 11/41/4 hours more. With tongs or a slotted spatula, carefully remove the remaining chicken and the flanken and transfer to the bowl. (Reserve the chicken, skinned and boned, for chicken salad, or return to the soup.)                                                                                                                            2                                                                            Meanwhile, fill the sink with cold water and add ice. Place a largeclean pot in the sink. Line a colander or strainer that fits over the potwith a double layer of cheesecloth. Carefully ladle the soup through thecheesecloth, trying not to disturb the ingredients at the bottom of thecooking pot. When only a little soup remains, carefully tilt the pot topour it off. (Discard the pot ingredients.)                                                                                                                            3                                                                             Allow the soup to cool to room temperature and transfer to therefrigerator to chill. Remove any solidified fat from the soup and serve,or freeze in a tightly sealed plastic container.', u'spoonacularSourceUrl': u'https://spoonacular.com/kosher-revolutions-be-all-end-all-chicken-soup-203163', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}