{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/760836-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760836, u'veryPopular': False, u'lowFodmap': True, u'title': u'Layered Melon Sorbet', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'pricePerServing': 162.53, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'2 large cantaloupes (about 3 lb.)', u'aisle': u'Produce', u'name': u'cantaloupes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cantaloupe.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 9181, u'unit': u'lb'}, {u'originalString': u'8 daylily flowers or other edible flowers', u'aisle': u'Produce', u'name': u'squash flowers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/squash-blossoms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11416, u'unit': u''}, {u'originalString': u'1 medium-sized honeydew (about 3 lb.)', u'aisle': u'Produce', u'name': u'honeydew', u'metaInformation': [u'medium-sized'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honeydew-melon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 9184, u'unit': u'lb'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/layered-melon-sorbet/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Peel and cube melons, and put in gallon-sized food storage bags. Freeze overnight.Put half cantaloupe in food processor, pur8Eeing until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cantaloupe.jpg', u'id': 9181, u'name': u'cantaloupe'}]}, {u'equipment': [], u'step': u'Pour into container, and freeze. Repeat with remaining melon.Repeat process with honeydew melon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honeydew-melon.jpg', u'id': 9184, u'name': u'honeydew melon'}]}, {u'equipment': [], u'step': u'Place 8 balloon wine glasses in freezer.Put frozen cantaloupe pur8Ee in processor when frozen for at least 4 hours. Process, and place 1/4 cup pur8Ee in each of 8 chilled wine glasses. Repeat with honeydew pur8Ee. Continue layering, alternating melon pur8Ees, until each wine glass is nearly full. Freeze overnight. To serve, garnish each wine glass or plate with a lily or other flower.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cantaloupe.jpg', u'id': 9181, u'name': u'cantaloupe'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honeydew-melon.jpg', u'id': 9184, u'name': u'honeydew melon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert can be paired with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 45, u'instructions': u'Peel and cube melons, and put in gallon-sized food storage bags. Freeze overnight.Put half cantaloupe in food processor, pur8Eeing until smooth. Pour into container, and freeze. Repeat with remaining melon.Repeat process with honeydew melon. Place 8 balloon wine glasses in freezer.Put frozen cantaloupe pur8Ee in processor when frozen for at least 4 hours. Process, and place 1/4 cup pur8Ee in each of 8 chilled wine glasses. Repeat with honeydew pur8Ee. Continue layering, alternating melon pur8Ees, until each wine glass is nearly full. Freeze overnight. To serve, garnish each wine glass or plate with a lily or other flower.', u'spoonacularSourceUrl': u'https://spoonacular.com/layered-melon-sorbet-760836', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}