{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570233-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 570233, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peanut Butter & Jelly Doughnuts', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 26.53, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'1 t baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u't'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1T fat free Greek yogurt (I used Fage 0%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free greek yogurt', u'metaInformation': [u'fat free', u'0%', u'(I used Fage )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'T'}, {u'originalString': u'\xbc c peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16098, u'unit': u'c'}, {u'originalString': u'2 T sugar free preserves (I used Smuckers Raspberry)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'preserves', u'metaInformation': [u'sugar free', u'(I used Smuckers Raspberry)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19297, u'unit': u'T'}, {u'originalString': u'\xbc t salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u't'}, {u'originalString': u'1/3 c plus 1 T skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1085, u'unit': u'c'}, {u'originalString': u'\xbc c sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'\xbd t vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u't'}, {u'originalString': u'1 c white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93824, u'unit': u'c'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.emilybites.com/2011/05/peanut-butter-jelly-doughnuts.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat the oven to 325. Lightly spray a doughnut pan with cooking spray.In a large bowl, add the peanut butter and sugar and blend with an electric mixer until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the milk, yogurt, vanilla and egg and mix again.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add flour, baking powder and salt and use mixer again until just combined.Using a spoon or piping bag, evenly distribute the batter mixture into the spaces in the doughnut pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Put the two rounded tablespoons of jelly into a small dish and microwave on high for 10-15 seconds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}]}, {u'equipment': [], u'step': u'Drizzle a teaspoon of melted jelly over the batter in each doughnut space.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for about 10 minutes or until golden brown and a toothpick stuck in comes out clean. Cool before eating.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 597, u'instructions': u'Preheat the oven to 325. Lightly spray a doughnut pan with cooking spray.In a large bowl, add the peanut butter and sugar and blend with an electric mixer until combined. Add the milk, yogurt, vanilla and egg and mix again. Add flour, baking powder and salt and use mixer again until just combined.Using a spoon or piping bag, evenly distribute the batter mixture into the spaces in the doughnut pan. Put the two rounded tablespoons of jelly into a small dish and microwave on high for 10-15 seconds. Drizzle a teaspoon of melted jelly over the batter in each doughnut space. Bake for about 10 minutes or until golden brown and a toothpick stuck in comes out clean. Cool before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-jelly-doughnuts-570233', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}