{u'recipes': [{u'sourceName': u'Mother Rimmy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/531636-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 531636, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Dessert Sweet Strawberry Shortcake and Peaches Verrine', u'diets': [u'gluten free'], u'pricePerServing': 207.84, u'creditText': u'Mother Rimmy', u'extendedIngredients': [{u'originalString': u'2 cups angel food cake, cut into small cubes', u'aisle': u'Bakery/Bread', u'name': u'angel food cake', u'metaInformation': [u'small', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 18088, u'unit': u'cups'}, {u'originalString': u'2 cups peaches, cut into small cubes', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'small', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u'cups'}, {u'originalString': u'2 cups strawberries, sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'4 medium walnut halves', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut halves', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 12155, u'unit': u''}, {u'originalString': u'2 cups light whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://motherrimmy.com/sweet-strawberry-and-peaches-verrine/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Taking a clear, small drinking glass, layer cake, strawberries and whipping cream. Top with a walnut half.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Taking a clear, small drinking glass, layer cake, strawberries and whipping cream. Top with a walnut half.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-dessert-sweet-strawberry-shortcake-and-peaches-verrine-531636', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}