{u'recipes': [{u'sourceName': u'Fat Girl Trapped in a Skinny Body', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/497093-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497093, u'veryPopular': True, u'lowFodmap': False, u'title': u'BBQ Beer Chicken, in the Crockpot', u'diets': [u'dairy free'], u'pricePerServing': 268.33, u'creditText': u'Fat Girl Trapped in a Skinny Body', u'extendedIngredients': [{u'originalString': u'4 cups (32 ounces) of barbecue sauce (and kind you like)', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'(and kind you like)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 6150, u'unit': u'ounces'}, {u'originalString': u'1 cup beer (any kind you like: dark, light, amber, whatever)', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'dark', u'light', u'(any kind you like: , , amber, whatever)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'1/2 tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'coleslaw', u'aisle': u'Produce', u'name': u'coleslaw mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10011109, u'unit': u'servings'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 18350, u'unit': u'servings'}, {u'originalString': u'1 tbsp onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3 pounds boneless, skinless chicken breasts (about 6 large)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'( 6 large)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.fatgirltrappedinaskinnybody.com/2012/05/bbq-beer-chicken-crockpot/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add everything, except the chicken, to the crockpot and stir to combine.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add the chicken to the crockpot, spoon the sauce on top so all the chicken has a little sauce on it.Cook on low for 6 hours (crockpot temperatures vary, yours may take more time), stirring a couple of times throughout if desired. After 6 hours, shred the chicken and add it back to the sauce in the crockpot. Toss chicken with the sauce and let sit for 15 minutes so it can absorb some of the sauce.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve on hamburger buns topped with coleslaw.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'id': 18350, u'name': u'hamburger bun'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 91763, u'instructions': u'Add everything, except the chicken, to the crockpot and stir to combine.  Add the chicken to the crockpot, spoon the sauce on top so all the chicken has a little sauce on it.Cook on low for 6 hours (crockpot temperatures vary, yours may take more time), stirring a couple of times throughout if desired. After 6 hours, shred the chicken and add it back to the sauce in the crockpot. Toss chicken with the sauce and let sit for 15 minutes so it can absorb some of the sauce. Serve on hamburger buns topped with coleslaw.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-beer-chicken-in-the-crockpot-497093', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}