{u'recipes': [{u'sourceName': u'Cravings of a Lunatic', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/538888-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 538888, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cauliflower Pizza with Peppers #SundaySupper', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 18, u'pricePerServing': 199.74, u'creditText': u'Cravings of a Lunatic', u'extendedIngredients': [{u'originalString': u'1 head of cauliflower', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 oz of goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1/2 green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'8 tablespoons of pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'tablespoons'}, {u'originalString': u'1/2 red pepper, chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.cravingsofalunatic.com/2013/02/cauliflower-pizza-with-peppers-sundaysupper.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Cook your cauliflower until it's soft. Mine was gigantic so it took about 10 minutes in the microwave. I added a bit of water to keep it from drying out. 10 minutes seems excessive so my cauliflower was probably not quite ready to plucked yet. Use discretion. You can also roast the cauliflower first, it adds a nice flavour profile. Once the cauliflower is soft, remove it and mash it up with a fork.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-ricer.jpg', u'id': 404790, u'name': u'potato ricer'}], u'step': u"Add the goat cheese and egg and whip it up a bit with a mixer or through a ricer. On a parchment lined cookie sheet divide the mixture into 4 tiny pizza bases. It helps to use a couple of spoons to flatten it out then you kind of drag the spoon and shape the edges. Sounds complicated but it's super easy.Use 2 tablespoons of pizza sauce per mini pizza. (you can totally use 1 if you are looking to keep calories down)Smooth out the sauce.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add your crumbled goat cheese over top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add your chopped peppers on top.Pop it in a preheated 400 degree F oven for about 10 to 12 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [], u'step': u'Remove carefully.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a big old skinny butt smile!', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 720, u'instructions': u"Cook your cauliflower until it's soft. Mine was gigantic so it took about 10 minutes in the microwave. I added a bit of water to keep it from drying out. 10 minutes seems excessive so my cauliflower was probably not quite ready to plucked yet. Use discretion. You can also roast the cauliflower first, it adds a nice flavour profile. Once the cauliflower is soft, remove it and mash it up with a fork. Add the goat cheese and egg and whip it up a bit with a mixer or through a ricer. On a parchment lined cookie sheet divide the mixture into 4 tiny pizza bases. It helps to use a couple of spoons to flatten it out then you kind of drag the spoon and shape the edges. Sounds complicated but it's super easy.Use 2 tablespoons of pizza sauce per mini pizza. (you can totally use 1 if you are looking to keep calories down)Smooth out the sauce.Add your crumbled goat cheese over top.Add your chopped peppers on top.Pop it in a preheated 400 degree F oven for about 10 to 12 minutes. Remove carefully.Serve with a big old skinny butt smile!", u'spoonacularSourceUrl': u'https://spoonacular.com/cauliflower-pizza-with-peppers-sundaysupper-538888', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}