{u'recipes': [{u'sourceName': u'The Beeroness', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/483739-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 483739, u'veryPopular': True, u'lowFodmap': False, u'title': u'Beer Battered Avocado Tacos with Fresh Corn Salsa', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 83.81, u'creditText': u'The Beeroness', u'extendedIngredients': [{u'originalString': u'3 avocados, ripe but still firm', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'firm', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbd tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'Canola oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'\xbc cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 ear of fresh sweet corn, kernels cut off', u'aisle': u'Produce', u'name': u'ear of corn', u'metaInformation': [u'fresh', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbd tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 jalapeno, stem and seeds removed, chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'seeds removed, chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'juice from one lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'2 cups masa harina', u'aisle': u'Ethnic Foods;Baking', u'name': u'masa harina', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20317, u'unit': u'cups'}, {u'originalString': u'\xbc cup red onions, diced', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 Tbs chopped scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'1 1/3 cup warm IPA', u'aisle': u'?', u'name': u'warm ipa', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://thebeeroness.com/2013/06/11/beer-battered-avocado-tacos-with-fresh-corn-salsa/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make the tortillas:In a large bowl, add the Masa and the salt, stir to combine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Add the beer and stir to combine. If the dough is too dry to hold together, add additional beer or water. If it is too wet, add more Masa. It should be the consistency of Play-Doh. Form into balls a bit larger than golf balls. Prepare a tortillas press by wrapping in plastic wrap or covering with parchment paper (you can place tortilla ball between two sheets of parchment and use a rolling pin).', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place one ball in the center. Press, rotate, press again.', u'number': 3, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine all ingredients in a bowl, stir to combine. Assemble tacos and serve.', u'number': 1, u'ingredients': []}], u'name': u'Remove from fryer and allow to drain on a stack of paper towels. (only fry 2-3 slices at a time or the oil temp will drop and batter will become overly oily). Make the salsa'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add about 4 inches of oil to a saucepan, clip a deep-fry thermometer onto the side (make sure the needle is not touching the bottom of the pot. Bring to 375-400 degrees (adjust heat to maintain that temperature). In a large bowl stir together the flour, salt, garlic powder, and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the beer and stir until combined (should have the consistency of pancake batter).', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the avocados into thick slices (about 4-5 per half) making sure the skin and seed is removed. Dip the avocado slices into the batter and fry for about 1 minutes, flip and fry until golden brown, about an additional 2 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-slices.jpg', u'id': 1019037, u'name': u'avocado slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u'Heat a griddle (or cast iron skillet) to a medium high heat (about 350 for electric griddles). Cook until slightly brown on the bottom (about 30 seconds to a minute) flip and cook on the other side. Don’t overcook.Make the Avocados'}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Tacos. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is SketchBook Pinot Noir Wine. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Sketchbook Pinot Noir is bright and juicy, with leather and earth on the nose and flavors of Bing cherry, crunchy red fruits, and a delicate, lingering finish.', u'title': u'SketchBook Pinot Noir Wine', u'price': u'$20.0', u'id': 428766, u'link': u'https://www.amazon.com/2014-SketchBook-Mendocino-County-Pinot/dp/B01FEFJBAU', u'imageUrl': u'https://spoonacular.com/productImages/428766-312x231.jpg'}]}, u'aggregateLikes': 2173, u'instructions': u'Make the tortillas:In a large bowl, add the Masa and the salt, stir to combine. Add the beer and stir to combine. If the dough is too dry to hold together, add additional beer or water. If it is too wet, add more Masa. It should be the consistency of Play-Doh. Form into balls a bit larger than golf balls. Prepare a tortillas press by wrapping in plastic wrap or covering with parchment paper (you can place tortilla ball between two sheets of parchment and use a rolling pin). Place one ball in the center. Press, rotate, press again. Heat a griddle (or cast iron skillet) to a medium high heat (about 350 for electric griddles). Cook until slightly brown on the bottom (about 30 seconds to a minute) flip and cook on the other side. Don’t overcook.Make the Avocados:Add about 4 inches of oil to a saucepan, clip a deep-fry thermometer onto the side (make sure the needle is not touching the bottom of the pot. Bring to 375-400 degrees (adjust heat to maintain that temperature). In a large bowl stir together the flour, salt, garlic powder, and pepper. Add the beer and stir until combined (should have the consistency of pancake batter). Cut the avocados into thick slices (about 4-5 per half) making sure the skin and seed is removed. Dip the avocado slices into the batter and fry for about 1 minutes, flip and fry until golden brown, about an additional 2 minutes. Remove from fryer and allow to drain on a stack of paper towels. (only fry 2-3 slices at a time or the oil temp will drop and batter will become overly oily). Make the salsa: Combine all ingredients in a bowl, stir to combine. Assemble tacos and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/beer-battered-avocado-tacos-with-fresh-corn-salsa-483739', u'dishTypes': [], u'occasions': [u"father's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}