{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219783-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 219783, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato sauce', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 31.84, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 tbsp tomato pur\xe9e', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11547, u'unit': u'tbsp'}, {u'originalString': u'2 x 400g cans chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2852676/tomato-sauce', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the olive oil in a large saucepan, add the onions and cook on a low heat until soft.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and tomato pur\xe9e. Cook for a few minutes then add the chopped tomatoes and oregano. Season generously and simmer for 20 mins, then allow to cool.Store in sterilised jars in the fridge for up to 1 week, or transfer to a container and freeze for up to 2 months.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'Heat the olive oil in a large saucepan, add the onions and cook on a low heat until soft. Add the garlic and tomato pur\xe9e. Cook for a few minutes then add the chopped tomatoes and oregano. Season generously and simmer for 20 mins, then allow to cool.Store in sterilised jars in the fridge for up to 1 week, or transfer to a container and freeze for up to 2 months.', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-sauce-219783', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}