{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/671385-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 671385, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato Eggplant Gratin', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 326.9, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'20 leaves fresh basil torn by hand', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 20.0, u'consistency': u'solid', u'id': 2044, u'unit': u'leaves'}, {u'originalString': u'\xbd teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Panko or regular bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 pound eggplant', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u'pound'}, {u'originalString': u'\xbd cup extra virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u"2 pounds large, fresh, meaty ripe tomatoes (if at all possible search farmstands or farmer's markets for fresh vine-ripened plump, juicy Big Beef, Big Boy or Heirloom variety tomatoes)", u'aisle': u'Cheese', u'name': u'farmer cheese', u'metaInformation': [u'fresh', u'juicy', u'ripe', u'large', u'for  vine-ripened plump,  big beef, big boy or heirloom variety tomatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 98933, u'unit': u'pounds'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 teaspoons kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 cup grated Romano cheese', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.afamilyfeast.com/tomato-eggplant-gratin/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'After coring, slice each tomato into very thick slices, about a half inch or so. Lay each slice on a rack set over a sheet pan. Sprinkle both sides with 2 teaspoons of the kosher salt. After 30 minutes flip each piece and let sit another 30 minutes to drain. You should have about  cup of water drained off from the tomatoes when done. Pat dry with paper towels and set aside.While tomatoes are draining, slice the skin-on eggplant into slices equal in thickness to the tomatoes. Salt both sides of each slice with the 2 teaspoons of the kosher salt and let sit on the cutting board for 30 minutes. Flip and let sit for another 30 minutes. This process will remove some liquid along with any bitterness. After an hour, rinse each piece in cold running water and then drain slightly but keep damp. Then sprinkle and rub in the two tablespoons of flour onto each side. Use more flour if needed to cover both sides. This will help the eggplant fry without absorbing too much oil.', u'length': {u'number': 120, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large saut pan with  cup of the oil over medium high to high. Once very hot, place half the eggplant slices in and fry about 1  minutes on each side until golden.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove to a plate and cook the second batch in the remaining oil. At the end, there should be some oil left in the pan, do not discard.In a 1  quart casserole dish drizzle a little of the oil from the pan to coat the bottom and begin layering alternate slices of tomato and eggplant around to fill, leaning them on each other like a fanned out deck of cards.Then place half the basil and repeat with the remaining tomato, eggplant and basil.In a medium bowl, mix bread crumbs, Romano cheese, salt and pepper and stir to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'romano cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour this mixture over the top of the tomato and eggplant slices. Then take the remaining oil from the pan and drizzle over the top. (If there is not enough oil, use more olive oil to coat the top of the crumb mixture, but dont drench it.)', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake uncovered for 30 minutes or until golden brown and a probe thermometer inserted into the center reads 140 degrees F.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 65, u'instructions': u'After coring, slice each tomato into very thick slices, about a half inch or so. Lay each slice on a rack set over a sheet pan. Sprinkle both sides with 2 teaspoons of the kosher salt. After 30 minutes flip each piece and let sit another 30 minutes to drain. You should have about  cup of water drained off from the tomatoes when done. Pat dry with paper towels and set aside.While tomatoes are draining, slice the skin-on eggplant into slices equal in thickness to the tomatoes. Salt both sides of each slice with the 2 teaspoons of the kosher salt and let sit on the cutting board for 30 minutes. Flip and let sit for another 30 minutes. This process will remove some liquid along with any bitterness. After an hour, rinse each piece in cold running water and then drain slightly but keep damp. Then sprinkle and rub in the two tablespoons of flour onto each side. Use more flour if needed to cover both sides. This will help the eggplant fry without absorbing too much oil.Heat a large saut pan with  cup of the oil over medium high to high. Once very hot, place half the eggplant slices in and fry about 1  minutes on each side until golden. Remove to a plate and cook the second batch in the remaining oil. At the end, there should be some oil left in the pan, do not discard.In a 1  quart casserole dish drizzle a little of the oil from the pan to coat the bottom and begin layering alternate slices of tomato and eggplant around to fill, leaning them on each other like a fanned out deck of cards.Then place half the basil and repeat with the remaining tomato, eggplant and basil.In a medium bowl, mix bread crumbs, Romano cheese, salt and pepper and stir to combine.Pour this mixture over the top of the tomato and eggplant slices. Then take the remaining oil from the pan and drizzle over the top. (If there is not enough oil, use more olive oil to coat the top of the crumb mixture, but dont drench it.)Bake uncovered for 30 minutes or until golden brown and a probe thermometer inserted into the center reads 140 degrees F.', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-eggplant-gratin-671385', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}