{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/699842-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 699842, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Brussels Sprouts and Butternut Squash with Dried Cranberries', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'pricePerServing': 61.23, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'2 cups Brussels sprouts, sliced in half', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11098, u'unit': u'cups'}, {u'originalString': u'2 cups butternut squash, peeled & diced', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'1 tbsp dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9079, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'2 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1/2 red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 80.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2015/12/roasted-brussels-sprouts-and-butternut-squash-with-dried-cranberries.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees. Coat the baking sheet with coconut oil cooking spray.Toss the sliced Brussels sprouts, diced butternut squash, and sliced onion together on the baking sheet with some olive oil until evenly coated. Season the veggies with sea salt and freshly cracked pepper, to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into the oven and roast for 7-8 minutes. Gently flip the vegetables with aspatula, then return to the oven to roast for another 7-8 minutes, or until the veggies are fork tender and golden.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven then sprinkle with the dried cranberries. Spooninto a serving bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'id': 9079, u'name': u'dried cranberries'}]}, {u'equipment': [], u'step': u'Serve immediately with balsamic glaze drizzled on top, if desired.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 10, u'instructions': u'Preheat the oven to 400 degrees. Coat the baking sheet with coconut oil cooking spray.Toss the sliced Brussels sprouts, diced butternut squash, and sliced onion together on the baking sheet with some olive oil until evenly coated. Season the veggies with sea salt and freshly cracked pepper, to taste. Place into the oven and roast for 7-8 minutes. Gently flip the vegetables with aspatula, then return to the oven to roast for another 7-8 minutes, or until the veggies are fork tender and golden.Remove from the oven then sprinkle with the dried cranberries. Spooninto a serving bowl. Serve immediately with balsamic glaze drizzled on top, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-brussels-sprouts-and-butternut-squash-with-dried-cranberries-699842', u'dishTypes': [u'side dish'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}