{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/173115-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 125, u'id': 173115, u'veryPopular': False, u'lowFodmap': False, u'title': u'Margarita Shrimp Cocktail', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 25, u'pricePerServing': 86.41, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'5 black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1022030, u'unit': u''}, {u'originalString': u'Handful of fresh cilantro', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Handful'}, {u'originalString': u'1/4 cup chopped fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1/4 cup lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 tablespoons lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'Dash of red pepper sauce', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'Dash'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 lb medium shrimp with shells (26 to 30 shrimp)', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'with shells (26 to 30 shrimp)', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'2 tablespoons tequila, if desired', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10814037, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups dry white wine or nonalcoholic wine', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14084, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.bettycrocker.com/recipes/margarita-shrimp-cocktail/155a68df-7d4b-4b79-b1f4-3b3a96d2b5ee', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove shells from shrimp, leaving tails intact. Set shells aside for the stock. Using a small, pointed knife or shrimp deveiner, make a shallow cut lengthwise down the back of each shrimp, then wash out the vein.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In 4-quart Dutch oven, heat shrimp shells, 4 cups water and 2 teaspoons salt to boiling over high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add wine, 2 tablespoons lime juice, the peppercorns and handful of cilantro. Reduce heat to medium. Cover and cook 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14084, u'name': u'wine'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Strain stock through strainer into large bowl and discard shells, peppercorns and cilantro. Return stock to same pan and heat to boiling over high heat.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add shrimp; remove pan from heat. Cover and let stand 8 to 10 minutes until shrimp are pink and firm.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Meanwhile, fill large bowl half full with ice and water. Strain stock through strainer and plunge shrimp into ice bath. (Strain stock over large bowl if you want to keep for another purpose.) Shrimp can be refrigerated in ice water for several hours.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'5', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In medium bowl, mix all sauce ingredients. (Dont use aluminum bowl because the acid in the sauce may react.) Stir in cooked shrimp to coat. Cover and refrigerate at least 30 minutes but no longer than 3 hours. (After 3 hours the acid in the sauce causes the shrimp to become chewy.)', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Serve cold.', u'number': 13, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 176, u'instructions': u'1                               Remove shells from shrimp, leaving tails intact. Set shells aside for the stock. Using a small, pointed knife or shrimp deveiner, make a shallow cut lengthwise down the back of each shrimp, then wash out the vein.                                                          2                               In 4-quart Dutch oven, heat shrimp shells, 4 cups water and 2 teaspoons salt to boiling over high heat. Add wine, 2 tablespoons lime juice, the peppercorns and handful of cilantro. Reduce heat to medium. Cover and cook 30 minutes.                                                          3                               Strain stock through strainer into large bowl and discard shells, peppercorns and cilantro. Return stock to same pan and heat to boiling over high heat. Add shrimp; remove pan from heat. Cover and let stand 8 to 10 minutes until shrimp are pink and firm.                                                          4                               Meanwhile, fill large bowl half full with ice and water. Strain stock through strainer and plunge shrimp into ice bath. (Strain stock over large bowl if you want to keep for another purpose.) Shrimp can be refrigerated in ice water for several hours.                                                          5                               In medium bowl, mix all sauce ingredients. (Dont use aluminum bowl because the acid in the sauce may react.) Stir in cooked shrimp to coat. Cover and refrigerate at least 30 minutes but no longer than 3 hours. (After 3 hours the acid in the sauce causes the shrimp to become chewy.) Serve cold.', u'spoonacularSourceUrl': u'https://spoonacular.com/margarita-shrimp-cocktail-173115', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 26, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}