{u'recipes': [{u'sourceName': u'Healthy Seasonal Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/524024-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 524024, u'veryPopular': False, u'lowFodmap': False, u'title': u'spaghetti squash with turkey sausage ragout', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 50, u'pricePerServing': 134.95, u'creditText': u'Healthy Seasonal Recipes', u'extendedIngredients': [{u'originalString': u'1 28-ounce can crushed tomatoes, preferably fire-roasted, such as Muir Glen', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u' such as muir glen', u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 carrots, peeled and cut into 1 \xbd-inch chunks', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled', u'cut into 1 \xbd-inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 stalks celery, cut into 1 \xbd-inch chunks', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into 1 \xbd-inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'\xbd cup dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14097, u'unit': u'cup'}, {u'originalString': u'Chopped fresh basil for garnish', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'6 cloves garlic, crushed and peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 teaspoons Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'2 medium onions, peeled, cored and cut into eighths', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'cored', u'medium', u'peeled', u'cut into eighths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Generous pinch of crushed red pepper, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'red', u'crushed', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 2 \xbd to 3-pound spaghetti squash', u'aisle': u'Produce', u'name': u'spaghetti squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 11492, u'unit': u'pound'}, {u'originalString': u'2 cups boiling hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot', u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.healthyseasonalrecipes.com/blog-table-of-contents/703-spaghetti-squash-with-turkey-sausage-ragout.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Cut spaghetti squash in half lengthwise. Scoop the seeds out with a spoon. Lay squash, cut-side-down in a 9 by 11-inch baking dish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'id': 11492, u'name': u'spaghetti squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour the boiling water in the dish and cover tightly with foil. Carefully transfer to the oven.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake 40 to 45 minutes until the squash is tender. To check if it is done, remove foil, carefully flip the squash over, and drag a fork over the flesh. If it is ready, the squash will pull away from the skin in tender strips. Scoop out into a bowl and gently “shred” apart with a fork if necessary.  Meanwhile, fit food processor with steel blade attachment, close lid and turn motor on. Drop garlic through feed spout and continue processing until the garlic is minced. Open lid and add carrot and celery. Process until the carrot and celery are finely chopped. Open lid, add onions and pulse until the onions are roughly chopped. Alternatively, use a knife to mince garlic, finely chop carrot and celery and dice onions.  If turkey sausage is in links remove the casings by slicing along the length of each sausage and slipping the casing off.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large skillet over high heat. Crumble in sausage, and cook, stirring and breaking up chunks of meat until browned, 4 to 5 minutes. Stir in the vegetable mixture, Italian seasoning, salt and pepper and cook, stirring occasionally until the vegetables are cooked down and browned slightly, 8 to 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Pour in wine and cook until mostly evaporated, 2 to 3 minutes. Stir in tomato and bring to a simmer. Reduce heat to maintain simmer and cook, stirring occasionally until the vegetables are tender, about 5 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the ragout ladled over the squash, sprinkled with basil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 182, u'instructions': u'Preheat oven to 400 degrees. Cut spaghetti squash in half lengthwise. Scoop the seeds out with a spoon. Lay squash, cut-side-down in a 9 by 11-inch baking dish. Pour the boiling water in the dish and cover tightly with foil. Carefully transfer to the oven. Bake 40 to 45 minutes until the squash is tender. To check if it is done, remove foil, carefully flip the squash over, and drag a fork over the flesh. If it is ready, the squash will pull away from the skin in tender strips. Scoop out into a bowl and gently “shred” apart with a fork if necessary.  Meanwhile, fit food processor with steel blade attachment, close lid and turn motor on. Drop garlic through feed spout and continue processing until the garlic is minced. Open lid and add carrot and celery. Process until the carrot and celery are finely chopped. Open lid, add onions and pulse until the onions are roughly chopped. Alternatively, use a knife to mince garlic, finely chop carrot and celery and dice onions.  If turkey sausage is in links remove the casings by slicing along the length of each sausage and slipping the casing off. Heat oil in a large skillet over high heat. Crumble in sausage, and cook, stirring and breaking up chunks of meat until browned, 4 to 5 minutes. Stir in the vegetable mixture, Italian seasoning, salt and pepper and cook, stirring occasionally until the vegetables are cooked down and browned slightly, 8 to 12 minutes. Pour in wine and cook until mostly evaporated, 2 to 3 minutes. Stir in tomato and bring to a simmer. Reduce heat to maintain simmer and cook, stirring occasionally until the vegetables are tender, about 5 minutes.  Serve the ragout ladled over the squash, sprinkled with basil.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-squash-with-turkey-sausage-ragout-524024', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}