{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/529236-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 529236, u'veryPopular': True, u'lowFodmap': False, u'title': u'Earl Grey Ice Cream', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 337.22, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'5 Egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 pint Heavy Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'pint'}, {u'originalString': u'1 cup Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 Earl Grey Tea Bags', u'aisle': u'Tea and Coffee', u'name': u'tea bags', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10111111, u'unit': u''}, {u'originalString': u'1 Tbsp Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'Tbsp'}, {u'originalString': u'1 pint Whole Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'pint'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.countrycleaver.com/2013/06/earl-grey-ice-cream.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 74, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For Ice Cream:In medium saucepan, heat milk and heavy cream until it begins to gently simmer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from heat and add in tea bags. Allow to steep for 5 minutes. Stir occasionally to evenly saturate the tea in the cream.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Remove tea bags and discard.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk eggs in large bowl along with the sugar, and then add the hot milk/tea mixture in a slow stream running to temper the egg and sugar mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour mixture back into saucepan and cook over medium heat until the mixture begins to thicken. Stirring constantly.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour custard through a fine-mesh sieve into a large bowl. Cover bowl with plastic wrap and place in fridge to chill for at least two hours.Freeze custard in ice cream maker according to manufacturer’s instructions. Scrape ice cream into freezer safe container and press plastic wrap to the surface of the ice cream. Seal container and freeze until solidified. Freeze about two hours.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve when frozen through.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 3132, u'instructions': u'For Ice Cream:In medium saucepan, heat milk and heavy cream until it begins to gently simmer. Remove from heat and add in tea bags. Allow to steep for 5 minutes. Stir occasionally to evenly saturate the tea in the cream. Remove tea bags and discard. Whisk eggs in large bowl along with the sugar, and then add the hot milk/tea mixture in a slow stream running to temper the egg and sugar mixture. Pour mixture back into saucepan and cook over medium heat until the mixture begins to thicken. Stirring constantly. Pour custard through a fine-mesh sieve into a large bowl. Cover bowl with plastic wrap and place in fridge to chill for at least two hours.Freeze custard in ice cream maker according to manufacturer’s instructions. Scrape ice cream into freezer safe container and press plastic wrap to the surface of the ice cream. Seal container and freeze until solidified. Freeze about two hours. Serve when frozen through.', u'spoonacularSourceUrl': u'https://spoonacular.com/earl-grey-ice-cream-529236', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}