{u'recipes': [{u'sourceName': u'Everyday Dishes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/850583-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 850583, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caprese Meatball Sliders', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 80.68, u'creditText': u'Everyday Dishes', u'extendedIngredients': [{u'originalString': u'Basil leaves, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'leaves'}, {u'originalString': u'2 tsp beef bouillon, or salt', u'aisle': u'Canned and Jarred', u'name': u'beef bouillon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'3/4 cup breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 lbs ground chuck', u'aisle': u'Meat', u'name': u'ground chuck', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lbs'}, {u'originalString': u'1 1/2 cups marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10111549, u'unit': u'cups'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'6 slices mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 1026, u'unit': u'slices'}, {u'originalString': u'1/2 cup onion, finely minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 dozen slider buns', u'aisle': u'Bakery/Bread', u'name': u'slider buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/slider-buns.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 93646, u'unit': u''}, {u'originalString': u'2 tsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://everydaydishes.com/simple-food-recipes/caprese-meatball-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place rack in center of oven then preheat to 400 degrees. Meanwhile, lightly coat baking sheet with non-stick spray then set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place ground beef into a large mixing bowl, add onion then set aside.In a small bowl, whisk together milk, eggs, bouillon, pepper and Worcestershire sauce until the eggs are well beaten and the bouillon has dissolved.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': None, u'id': 1006008, u'name': u'bouillon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour the liquid mixture over the beef then mix until combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Add breadcrumbs into the beef mixture then mix until they are evenly distributed and the mixture is thick.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Roll the meat into 24 golf ball-sized meatballs, place onto prepared baking sheet then bake 1820 minutes until nicely browned. For uniform balls, you can use a medium cookie scoop.While the meatballs bake, bring marinara sauce to a simmer in small saucepan.', u'length': {u'number': 1820, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10111549, u'name': u'marinara sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Cut each slice of cheese into four squares. Set aside. Using two 9" x13" baking pans, place bottom half of 12 slider buns in each pan. Spoon marinara on each bun then place a meatball on top. Spoon more marinara on top of each meatball and add a cheese square on each meatball.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/slider-buns.png', u'id': 93646, u'name': u'slider buns'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add tops to each sandwich, cover pans with foil, and bake 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil and bake 10 minutes more until cheese is completely melted.Stick a basil leaf under each meatball for garnish, place on a serving platter and enjoy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Piper-Heidsieck Brut Cuvee. It has 4.4 out of 5 stars and a bottle costs about 40 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance. View More', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Place rack in center of oven then preheat to 400 degrees. Meanwhile, lightly coat baking sheet with non-stick spray then set aside. Place ground beef into a large mixing bowl, add onion then set aside.In a small bowl, whisk together milk, eggs, bouillon, pepper and Worcestershire sauce until the eggs are well beaten and the bouillon has dissolved. Pour the liquid mixture over the beef then mix until combined.Add breadcrumbs into the beef mixture then mix until they are evenly distributed and the mixture is thick.Roll the meat into 24 golf ball-sized meatballs, place onto prepared baking sheet then bake 1820 minutes until nicely browned. For uniform balls, you can use a medium cookie scoop.While the meatballs bake, bring marinara sauce to a simmer in small saucepan. Cut each slice of cheese into four squares. Set aside. Using two 9" x13" baking pans, place bottom half of 12 slider buns in each pan. Spoon marinara on each bun then place a meatball on top. Spoon more marinara on top of each meatball and add a cheese square on each meatball. Add tops to each sandwich, cover pans with foil, and bake 10 minutes. Remove foil and bake 10 minutes more until cheese is completely melted.Stick a basil leaf under each meatball for garnish, place on a serving platter and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/caprese-meatball-sliders-850583', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}