{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/760010-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760010, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bulgur with Leeks and Swiss Chard', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 175.02, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 cup bulgur', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'bulgur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20012, u'unit': u'cup'}, {u'originalString': u'4 cloves garlic, minced (about 4 tsp.)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'2 medium-size leeks, white and tender green parts chopped', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'white', u'green', u'medium-size', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'2 cups sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'2 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 lb. Swiss chard, stems cut into 1-inch pieces, leaves torn into large pieces', u'aisle': u'Produce', u'name': u'swiss chard', u'metaInformation': [u'large', u'cut into 1-inch pieces, leaves torn into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11147, u'unit': u'lb'}, {u'originalString': u'2 \xbe cups low-sodium vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.75, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 92.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/bulgur-with-leeks-and-swiss-chard/', u'glutenFree': False, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil in large pot over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add leeks and chard stems, and cook 4 minutes, or until softened, stirring often.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add mushrooms, and cook 5 minutes, or until softened, stirring occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add garlic and chard leaves. Cover, and cook 5 minutes, or until leaves are wilted, stirring occasionally. Season with salt and pepper.2. Stir in broth and bulgur. Bring to a boil, reduce heat to medium low, cover, and simmer 10 minutes, or until liquid is absorbed and bulgur is tender.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'id': 20012, u'name': u'bulgur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat, and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 174, u'instructions': u'1. Heat oil in large pot over medium-high heat. Add leeks and chard stems, and cook 4 minutes, or until softened, stirring often. Add mushrooms, and cook 5 minutes, or until softened, stirring occasionally. Add garlic and chard leaves. Cover, and cook 5 minutes, or until leaves are wilted, stirring occasionally. Season with salt and pepper.2. Stir in broth and bulgur. Bring to a boil, reduce heat to medium low, cover, and simmer 10 minutes, or until liquid is absorbed and bulgur is tender. Remove pan from heat, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/bulgur-with-leeks-and-swiss-chard-760010', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}