{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570356-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 7, u'id': 570356, u'veryPopular': True, u'lowFodmap': True, u'title': u'Camping - Cheater Tex-Mex Chips N’ Dip', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 71.32, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'1 small can of chili', u'aisle': u'Produce', u'name': u'chili', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u'can'}, {u'originalString': u'1 eight ounce container cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1017, u'unit': u''}, {u'originalString': u'Bag of tortilla chip "scoops"', u'aisle': u'Savory Snacks', u'name': u'tortilla chip scoops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'Bag', u'unitShort': u'Bag', u'amount': 1.0, u'consistency': u'solid', u'id': 10019056, u'unit': u'Bag'}, {u'originalString': u'1 to two cups of shredded Tex Mex Cheese', u'aisle': u'?', u'name': u'to two cups of tex mex cheese', u'metaInformation': [u'shredded'], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/camping-recipe-cheater-tex-mex-chips-n-dip', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a layer of cream cheese on the bottom of the pan or pot that you are going to use. Make sure it’s BBQ safe!', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Pour the can of chili onto the cream cheese and spread out evenly to cover it up.Sprinkle as much cheese as you want on top, covering the whole area.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in a heated BBQ and warm up for 5-7 minutes, until the cheese is melted on top.(this can also be done in the oven at home, same time and cook at 375)', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 425, u'instructions': u'Place a layer of cream cheese on the bottom of the pan or pot that you are going to use. Make sure it’s BBQ safe!Pour the can of chili onto the cream cheese and spread out evenly to cover it up.Sprinkle as much cheese as you want on top, covering the whole area.Place in a heated BBQ and warm up for 5-7 minutes, until the cheese is melted on top.(this can also be done in the oven at home, same time and cook at 375)', u'spoonacularSourceUrl': u'https://spoonacular.com/camping-cheater-tex-mex-chips-n-dip-570356', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}