{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/216461-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 216461, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheese, bacon & onion puff', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 111.55, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'8 rashers smoked streaky bacon, chopped', u'aisle': u'Meat', u'name': u'bacon rashers', u'metaInformation': [u'smoked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'small knob of butter, plus extra for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'small', u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'140g cheddar, grated (this is about 200ml/7fl oz)', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'grated', u'(this is 200ml/7fl oz)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 1009, u'unit': u'g'}, {u'originalString': u'2 tbsp finely grated parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tbsp'}, {u'originalString': u'4 spring onions, thinly sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u"1 quantity of batter (see 'Goes well with', below)", u'aisle': u'?', u'name': u'quantity of batter', u'metaInformation': [u'well', u"(see 'Goes with', below)"], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/9018/cheese-bacon-and-onion-puff', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 230.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 230C/fan 210C/gas 8. Makeup the batter as stated in the pancake recipeand set aside. Grease a large, round, ceramicdish, about 22cm wide, and dust it with thegrated Parmesan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter in a frying pan. Sizzle thebacon for about 5 mins until crisp, then leaveto cool. Tip the bacon, onion and cheddarinto the batter and stir until completelycombined. Tip the batter into the prepareddish so it comes almost to the top, then bakefor 30-35 mins until puffed up and golden.Bring piping hot to the table and servestraight from the dish with a crisp salad.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 32, u'instructions': u'Heat oven to 230C/fan 210C/gas 8. Makeup the batter as stated in the pancake recipeand set aside. Grease a large, round, ceramicdish, about 22cm wide, and dust it with thegrated Parmesan.Heat the butter in a frying pan. Sizzle thebacon for about 5 mins until crisp, then leaveto cool. Tip the bacon, onion and cheddarinto the batter and stir until completelycombined. Tip the batter into the prepareddish so it comes almost to the top, then bakefor 30-35 mins until puffed up and golden.Bring piping hot to the table and servestraight from the dish with a crisp salad.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheese-bacon-onion-puff-216461', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}