{u'recipes': [{u'sourceName': u'Culinary Covers', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/491488-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 86, u'id': 491488, u'veryPopular': True, u'lowFodmap': False, u'title': u'Honey- Tomato Bruschetta with Ricotta', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 682.53, u'creditText': u'Culinary Covers', u'extendedIngredients': [{u'originalString': u'12 baguette slices, cut 1/2 inch thick on the bias', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'6 basil leaves, thinly sliced or torn', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 cup fresh ricotta (8 ounces)', u'aisle': u'Cheese', u'name': u'fresh ricotta', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'ounces'}, {u'originalString': u'2 pints cherry or grape tomatoes, halved lengthwise', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 2.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'pints'}, {u'originalString': u'1 tablespoon buckwheat or chestnut honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons clover honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/8 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons thyme leaves', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}], u'healthScore': 75.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.culinarycovers.com/2013/07/honey-tomato-bruschetta-with-ricotta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 44, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 300\xb0. Line a large rimmed baking sheet with parchment paper. 2.  In a large bowl, toss the tomatoes with the olive oil, honey, thyme leaves, salt and pepper. Scrape the tomatoes onto the prepared baking sheet and turn them cut side up.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Bake the tomatoes for about 1 hour and 25 minutes, until they begin to shrivel and brown.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Let cool.3.  Preheat the broiler.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread out the baguette slices on a baking sheet. Broil for about 30 seconds on each side, until the edges are golden brown.4.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [], u'step': u'Spread the ricotta over the baguette slices and top with the slow-roasted tomatoes. Lightly drizzle the tomatoes with the buckwheat honey, sprinkle with the sliced basil and serve with additional buckwheat honey on the side.MAKE AHEAD: The roasted tomatoes can be refrigerated for up to 2 days. Bring to room temperature before serving.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bruschetta can be paired with Chianti, Sparkling ros\xe9, and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Castello di Volpaia Chianti Classico Riserva. It has 4.1 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'chianti', u'sparkling rose', u'sparkling wine', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Color: Ruby red with a trace of garnet Nose: Elegant and intense with hints of spices connected with fruity scents Taste: Good structure with evident tannins and long persistence', u'title': u'Castello di Volpaia Chianti Classico Riserva', u'price': u'$23.99', u'id': 439055, u'link': u'https://www.wine.com/product/castello-di-volpaia-chianti-classico-riserva-2003/92756', u'imageUrl': u'https://spoonacular.com/productImages/439055-312x231.jpg'}]}, u'aggregateLikes': 506, u'instructions': u'1.  Preheat the oven to 300\xb0. Line a large rimmed baking sheet with parchment paper. 2.  In a large bowl, toss the tomatoes with the olive oil, honey, thyme leaves, salt and pepper. Scrape the tomatoes onto the prepared baking sheet and turn them cut side up. Bake the tomatoes for about 1 hour and 25 minutes, until they begin to shrivel and brown. Let cool.3.  Preheat the broiler. Spread out the baguette slices on a baking sheet. Broil for about 30 seconds on each side, until the edges are golden brown.4.  Spread the ricotta over the baguette slices and top with the slow-roasted tomatoes. Lightly drizzle the tomatoes with the buckwheat honey, sprinkle with the sliced basil and serve with additional buckwheat honey on the side.MAKE AHEAD: The roasted tomatoes can be refrigerated for up to 2 days. Bring to room temperature before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-tomato-bruschetta-with-ricotta-491488', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 106, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}