{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621693-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 14, u'id': 621693, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate-Dipped Chocolate Chip Cookies', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 40.99, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 pouch (1 lb 1.5 oz) Betty Chocolate Chip Cookie Mix', u'aisle': u'Sweet Snacks', u'name': u'chocolate chip cookie', u'metaInformation': [u'(1 lb 1.5 oz)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chip-cookie.png', u'unitLong': u'pouch', u'unitShort': u'pouch', u'amount': 1.0, u'consistency': u'solid', u'id': 28027, u'unit': u'pouch'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 10-ounce bag semi-sweet chocolate chips (milk chocolate or white chocolate may be substituted)', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'white', u'(milk chocolate or chocolate may be substituted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounce'}, {u'originalString': u'sprinkles or sanding sugar, for decorating', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'for decorating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'1/2 cup (1 stick) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.averiecooks.com/2014/12/chocolate-dipped-chocolate-chip-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"To a large bowl, add the cookie mix, butter, egg and stir to combine. Using alarge cookie scoop, 1/4-cup measure, or your hands, form approximately 8 equal-sized mounds of dough. Tip - Strategically place a few chocolate chips on top of each mound of dough by taking chips from the underside and adding them on top. I also supplemented the chocolate chips by adding a few extra from the bag of chips (you won't need the entire bag for dipping).", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place mounds on a large plate or tray, cover with plasticwrap, and refrigerate for at least 2 hours, or overnight. Do not bake with unchilled dough because cookies will bake thinner, flatter, and be more prone to spreading and this dough is already prone to spreading. Preheat oven to 350F, line a baking sheet with aSilpator spray with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place dough mounds on baking sheet, spaced at least 2 inches apart (do not bake more than 6cookies per sheet because these cookies spread)and bake for about 13 to 14 minutes (if your cookies are smaller, bake less; and keep a watchful eye on them since ovens very dramatically), or until edges have set and tops are just set, even if slightly undercooked, pale, and glossy in the center; don't overbake. Cookies firm up as they cool. Allow cookies to cool on baking sheet for about 20 minutes before dipping them. I let them cool on the baking sheet and don't use a rack. To a medium microwave-safe bowl, add about 1 cup chocolate chips and heat on high power to melt, about 1 minute. Stop to check and stir and heat in 15-second bursts until chocolate can be stirred smooth. Either dip one cookie halfway into the melted chocolate or hold cookie over chocolate bowl and spoon chocolate on, allowing the excess to drip off; I prefer the later method. Repeat dipping process with all cookies, heating additional chocolate as necessary.", u'length': {u'number': 34, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer dipped cookies to a parchment paper-lined baking tray. Before chocolate beings to set up, add the sprinkles, sanding sugar, or your favorite decorating items (chopped candy, nuts, etc.). Allow chocolate to set up for at least 2 hours, or until fully set (duration will depend on how thick the chocolate coating is and air temperature. Although you could speed this up by placing cookies in fridge or freezer, I waited it out at room temp. Cookies will keep airtight at cool room temperature for up to 1 week or in the freezer for up to 6 months.  Adapted from Chocolate Chip Christmas Cookies', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1860, u'instructions': u"To a large bowl, add the cookie mix, butter, egg and stir to combine. Using alarge cookie scoop, 1/4-cup measure, or your hands, form approximately 8 equal-sized mounds of dough. Tip - Strategically place a few chocolate chips on top of each mound of dough by taking chips from the underside and adding them on top. I also supplemented the chocolate chips by adding a few extra from the bag of chips (you won't need the entire bag for dipping). Place mounds on a large plate or tray, cover with plasticwrap, and refrigerate for at least 2 hours, or overnight. Do not bake with unchilled dough because cookies will bake thinner, flatter, and be more prone to spreading and this dough is already prone to spreading. Preheat oven to 350F, line a baking sheet with aSilpator spray with cooking spray. Place dough mounds on baking sheet, spaced at least 2 inches apart (do not bake more than 6cookies per sheet because these cookies spread)and bake for about 13 to 14 minutes (if your cookies are smaller, bake less; and keep a watchful eye on them since ovens very dramatically), or until edges have set and tops are just set, even if slightly undercooked, pale, and glossy in the center; don't overbake. Cookies firm up as they cool. Allow cookies to cool on baking sheet for about 20 minutes before dipping them. I let them cool on the baking sheet and don't use a rack. To a medium microwave-safe bowl, add about 1 cup chocolate chips and heat on high power to melt, about 1 minute. Stop to check and stir and heat in 15-second bursts until chocolate can be stirred smooth. Either dip one cookie halfway into the melted chocolate or hold cookie over chocolate bowl and spoon chocolate on, allowing the excess to drip off; I prefer the later method. Repeat dipping process with all cookies, heating additional chocolate as necessary.Transfer dipped cookies to a parchment paper-lined baking tray. Before chocolate beings to set up, add the sprinkles, sanding sugar, or your favorite decorating items (chopped candy, nuts, etc.). Allow chocolate to set up for at least 2 hours, or until fully set (duration will depend on how thick the chocolate coating is and air temperature. Although you could speed this up by placing cookies in fridge or freezer, I waited it out at room temp. Cookies will keep airtight at cool room temperature for up to 1 week or in the freezer for up to 6 months.  Adapted from Chocolate Chip Christmas Cookies", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-dipped-chocolate-chip-cookies-621693', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 24, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}