{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549608-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 549608, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Covered Peanut Butter Ritz Sandwiches…the Bunny edition', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 34.58, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'3 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoon Canola Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'3-4 cups chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cups'}, {u'originalString': u'1 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'2 cups flour, all-purpose', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'kosher salt, for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/4 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'6 tablespoon unsalted butter, cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.halfbakedharvest.com/chocolate-covered-peanut-butter-ritz-sandwiches-the-bunny-edition/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the filling by beating together the peanut butter and butter. Beat until you do not see any streaks of butter and the mixture is light and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the powdered sugar and vanilla and beat until combined. Cover and place in the fridge well you make the crackers.Preheat oven to 400 degrees.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put the flour, baking powder, sugar, and 1/2 tsp of salt in the food processor. Pulse to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the cold butter and pulse to combine.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add in the canola oil and pulse to combine. Stream in the water until a dough ball forms.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pasta-machine.jpg', u'id': 406908, u'name': u'pasta machine'}], u'step': u'Roll the dough out as thin as you can. (I actually used my pasta maker and it worked really well. I went to the second setting) Use a cookie cutter to cut the dough out into bunnies or circles or really anything you want!', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on a baking sheet and bake for 10-11 minutes. The tops wil begin to turn golden.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and brush with the melted butter and then sprinkle with kosher salt. Allow to cool completely (this only takes about 5 minutes) before filling with the peanut butter.Once the crackers have cooled, use a knife to spread the peanut butter filling on one side and then sandwich with another cracker. Repeat until all the crackers have been used. I had a total of 18 sandwiches (36 crackers).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the crackers in the freezer for about 10 minutes.In the meantime melt the chocolate in a shallow microwave safe bowl. Melt on high for 30 second intervals stirring each time until melted.Line a baking sheet with wax or parchment paper.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove three sandwiches from the freezer and dip in the melted chocolate. Use a knife to wipe off any excess chocolate and place on the baking sheet. If you would like to decorate these with sprinkle, do so now. Repeat until you have covered one side of all the sandwiches. After you have done all the sandwiches place them back in the freezer for anther 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and dip the other side in the melted chocolate.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place back on the baking sheet and use a knife to fill in the sides or any other blank spots.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Place back in the freezer for another 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the freezer and store in a sealed container, until ready to serve. I personally think these taste best cold right out of the fridge!', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 339, u'instructions': u'Make the filling by beating together the peanut butter and butter. Beat until you do not see any streaks of butter and the mixture is light and fluffy. Add the powdered sugar and vanilla and beat until combined. Cover and place in the fridge well you make the crackers.Preheat oven to 400 degrees. Put the flour, baking powder, sugar, and 1/2 tsp of salt in the food processor. Pulse to combine. Add the cold butter and pulse to combine. Add in the canola oil and pulse to combine. Stream in the water until a dough ball forms. Roll the dough out as thin as you can. (I actually used my pasta maker and it worked really well. I went to the second setting) Use a cookie cutter to cut the dough out into bunnies or circles or really anything you want! Place on a baking sheet and bake for 10-11 minutes. The tops wil begin to turn golden.Remove from the oven and brush with the melted butter and then sprinkle with kosher salt. Allow to cool completely (this only takes about 5 minutes) before filling with the peanut butter.Once the crackers have cooled, use a knife to spread the peanut butter filling on one side and then sandwich with another cracker. Repeat until all the crackers have been used. I had a total of 18 sandwiches (36 crackers). Place the crackers in the freezer for about 10 minutes.In the meantime melt the chocolate in a shallow microwave safe bowl. Melt on high for 30 second intervals stirring each time until melted.Line a baking sheet with wax or parchment paper. Remove three sandwiches from the freezer and dip in the melted chocolate. Use a knife to wipe off any excess chocolate and place on the baking sheet. If you would like to decorate these with sprinkle, do so now. Repeat until you have covered one side of all the sandwiches. After you have done all the sandwiches place them back in the freezer for anther 10 minutes. Remove and dip the other side in the melted chocolate. Place back on the baking sheet and use a knife to fill in the sides or any other blank spots. Place back in the freezer for another 10 minutes. Remove from the freezer and store in a sealed container, until ready to serve. I personally think these taste best cold right out of the fridge!', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-covered-peanut-butter-ritz-sandwichesthe-bunny-edition-549608', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}