{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/247866-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 247866, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Perfect Roast Beef', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 64.45, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'1 cup beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'1 oven roast beef such as sirloin tip, top sirloin, strip loin, etc.', u'aisle': u'Meat', u'name': u'beef sirloin tip roast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 23653, u'unit': u''}, {u'originalString': u'1 tablespoon butter (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1 cup red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.closetcooking.com/2011/11/perfect-roast-beef.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pat the beef dry, rub the salt and pepper all over it, place it in an oven safe roasting dish and stick a meat thermometer into the middle of the thickest part.Roast in a preheated 450F oven for 10 minutes, reduce the temperature to 275F and continue roasting until the temperature reaches the desired done-ness.  (see chart below)', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the roast from the oven and set aside to rest, covered.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Drain all but one or two tablespoons of any grease and heat the roasting pan over medium heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the red wine and deglaze the pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}]}, {u'equipment': [], u'step': u'Add the broth and simmer to reduce by half.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the corn starch into the water, add to the gravy and simmer until it thickens.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat, mix in the butter and season with salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Roast Beef works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. One wine you could try is Director's Merlot. It has 5 out of 5 stars and a bottle costs about 21 dollars.", u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': None, u'title': u"Director's Merlot", u'price': u'$21.0', u'id': 428445, u'link': u'https://www.amazon.com/2014-Directors-Merlot-750-mL/dp/B073XVS4MB', u'imageUrl': u'https://spoonacular.com/productImages/428445-312x231.jpg'}]}, u'aggregateLikes': 7412, u'instructions': u'Pat the beef dry, rub the salt and pepper all over it, place it in an oven safe roasting dish and stick a meat thermometer into the middle of the thickest part.Roast in a preheated 450F oven for 10 minutes, reduce the temperature to 275F and continue roasting until the temperature reaches the desired done-ness.  (see chart below)Remove the roast from the oven and set aside to rest, covered.Drain all but one or two tablespoons of any grease and heat the roasting pan over medium heat.Add the red wine and deglaze the pan.Add the broth and simmer to reduce by half.Mix the corn starch into the water, add to the gravy and simmer until it thickens.Remove from heat, mix in the butter and season with salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-perfect-roast-beef-247866', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}