{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/772538-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 140, u'id': 772538, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Rhubarb Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 228.55, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 cups all purpose flour, plus additional bench flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 tablespoon flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'Granulated sugar, for sprinkling', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'Pinch ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'pinch'}, {u'originalString': u'1/2 cup ice water, plus more as needed', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10014412, u'unit': u'cup'}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Milk, for brushing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'servings'}, {u'originalString': u'1 1/4 pounds rhubarb, trimmed, cut in 1/2-inch pieces', u'aisle': u'Produce', u'name': u'rhubarb', u'metaInformation': [u'trimmed', u'cut in 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 9307, u'unit': u'pounds'}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'2 pints strawberries, hulled and sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'hulled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'pints'}, {u'originalString': u'1 cup unsalted butter, chunked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 13.0, u'imageType': u'jpeg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/nancy-fuller/strawberry-rhubarb-pie0.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the flour, salt and butter in a large bowl. With a bench scraper or pastry cutter, cut the butter into the flour until it forms pea-size chunks. Slowly add the ice water, folding it into the flour until it comes together in a dough; be mindful not to overwork the dough. If the dough is too dry, add another tablespoon of water at a time. Turn the dough out onto a lightly floured work surface. Divide in half and form into disks. Wrap the two disks in plastic wrap and refrigerate for at least 30 minutes to let the dough rest.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out one of the disks into a 12-inch round on a lightly floured work surface.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Roll it up onto the rolling pin and carefully transfer to a 9-inch pie plate. Gently press the bottom crust into the plate with your fingers. Leave the edges untrimmed.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'To the bottom crust, add the rhubarb, strawberries, sugar, cinnamon, flour, salt, lemon juice and vanilla. Dot with pats of the butter.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'id': 9307, u'name': u'rhubarb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'On the same lightly floured work surface, roll the second disk of dough into a 12-inch round. Lay the top crust over the pie and crimp the edges.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the top crust lightly with milk and sprinkle with granulated sugar.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Cut vent holes in the center.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 20 minutes; lower the temperature to 375 degrees F and bake for another 45 to 60 minutes, or until the filling is bubbling.', u'length': {u'number': 65, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Cool completely before serving to allow time for the filling to set up.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie on the menu? Try pairing with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Vineyards Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 1572, u'instructions': u'Watch how to make this recipe.                    Combine the flour, salt and butter in a large bowl. With a bench scraper or pastry cutter, cut the butter into the flour until it forms pea-size chunks. Slowly add the ice water, folding it into the flour until it comes together in a dough; be mindful not to overwork the dough. If the dough is too dry, add another tablespoon of water at a time. Turn the dough out onto a lightly floured work surface. Divide in half and form into disks. Wrap the two disks in plastic wrap and refrigerate for at least 30 minutes to let the dough rest.                          Preheat the oven to 425 degrees F.                          Roll out one of the disks into a 12-inch round on a lightly floured work surface. Roll it up onto the rolling pin and carefully transfer to a 9-inch pie plate. Gently press the bottom crust into the plate with your fingers. Leave the edges untrimmed.                          To the bottom crust, add the rhubarb, strawberries, sugar, cinnamon, flour, salt, lemon juice and vanilla. Dot with pats of the butter.                          On the same lightly floured work surface, roll the second disk of dough into a 12-inch round. Lay the top crust over the pie and crimp the edges.                          Brush the top crust lightly with milk and sprinkle with granulated sugar. Cut vent holes in the center. Bake for 20 minutes; lower the temperature to 375 degrees F and bake for another 45 to 60 minutes, or until the filling is bubbling.                          Cool completely before serving to allow time for the filling to set up.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-rhubarb-pie-772538', u'dishTypes': [u'dessert'], u'occasions': [u'spring', u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}