{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/742108-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 95, u'id': 742108, u'veryPopular': True, u'lowFodmap': False, u'title': u'Curried Chicken and Rice Casserole', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 302.06, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup basmati rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020444, u'unit': u'cup'}, {u'originalString': u'2 15-ounce cans chickpeas, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'4 carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/2 habanero chile pepper, seeded', u'aisle': u'Produce', u'name': u'chile pepper', u'metaInformation': [u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1 1/2 cups coconut water', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12119, u'unit': u'cups'}, {u'originalString': u'2 tablespoons curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2015, u'unit': u'tablespoons'}, {u'originalString': u'1 cup roughly chopped fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 tablespoon fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'5 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Golden raisins, for topping', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9297, u'unit': u'servings'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/4 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 bunches scallions, roughly chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunches', u'unitShort': u'bunches', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunches'}, {u'originalString': u'3 pounds skinless, boneless chicken thighs, cut into 2-inch pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'boneless', u'skinless', u'cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 5096, u'unit': u'pounds'}, {u'originalString': u'1 10-ounce box frozen chopped spinach, thawed and squeezed dry', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'frozen', u'dry', u'thawed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup unsweetened shredded coconut', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}], u'healthScore': 49.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/curried-chicken-and-rice-casserole.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the rice, coconut water, 1/2 cup water and 1/2 teaspoon salt in a large saucepan. Bring to a boil, then reduce the heat to low and cover; cook until the rice is tender, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'id': 12119, u'name': u'coconut water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat; let stand, covered, 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and toss with the butter and coconut; set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Meanwhile, combine the scallions, cilantro, thyme, garlic, habanero and 1/2 cup water in a food processor or blender; puree to make a smooth paste.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer 1 tablespoon to a small bowl; stir in the curry powder, turmeric, cumin, 1 teaspoon pepper and 1/4 cup water.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the remaining paste to a large bowl and add the chicken and 1 teaspoon salt; toss to coat.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat the olive oil in a large pot or Dutch oven over medium-high heat.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the curry-scallion paste; cook, stirring, until the paste darkens and starts to separate, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the chicken to the pot. Reduce the heat to medium; cover and cook, stirring occasionally, until almost cooked through, 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Increase the heat to medium high. Uncover and cook, stirring occasionally, until thickened, 15 more minutes. Stir in 1 1/2 cups water, the carrots, chickpeas and spinach. Bring to a boil, then reduce the heat to medium. Simmer until the chicken is tender, 15 more minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer the chicken mixture to a 9-by-13-inch baking dish and top with the rice mixture.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Bake until golden brown and bubbling, about 25 minutes. Top with golden raisins.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'id': 9297, u'name': u'golden raisins'}]}, {u'equipment': [], u'step': u'Photograph by Justin Walker', u'number': 14, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 900, u'instructions': u'Preheat the oven to 425 degrees F. Combine the rice, coconut water, 1/2 cup water and 1/2 teaspoon salt in a large saucepan. Bring to a boil, then reduce the heat to low and cover; cook until the rice is tender, about 20 minutes. Remove from the heat; let stand, covered, 5 minutes. Transfer to a bowl and toss with the butter and coconut; set aside.                          Meanwhile, combine the scallions, cilantro, thyme, garlic, habanero and 1/2 cup water in a food processor or blender; puree to make a smooth paste. Transfer 1 tablespoon to a small bowl; stir in the curry powder, turmeric, cumin, 1 teaspoon pepper and 1/4 cup water. Transfer the remaining paste to a large bowl and add the chicken and 1 teaspoon salt; toss to coat.                          Heat the olive oil in a large pot or Dutch oven over medium-high heat. Add the curry-scallion paste; cook, stirring, until the paste darkens and starts to separate, about 5 minutes. Add the chicken to the pot. Reduce the heat to medium; cover and cook, stirring occasionally, until almost cooked through, 15 minutes.                          Increase the heat to medium high. Uncover and cook, stirring occasionally, until thickened, 15 more minutes. Stir in 1 1/2 cups water, the carrots, chickpeas and spinach. Bring to a boil, then reduce the heat to medium. Simmer until the chicken is tender, 15 more minutes.                          Transfer the chicken mixture to a 9-by-13-inch baking dish and top with the rice mixture. Bake until golden brown and bubbling, about 25 minutes. Top with golden raisins.                          Photograph by Justin Walker', u'spoonacularSourceUrl': u'https://spoonacular.com/curried-chicken-and-rice-casserole-742108', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}