{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/611856-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 611856, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Chili Queso', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 226.53, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'black pepper, to garnish', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 1/2 ounces green chiles, canned', u'aisle': u'Canned and Jarred', u'name': u'canned green chiles', u'metaInformation': [u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.5, u'consistency': u'solid', u'id': 11980, u'unit': u'ounces'}, {u'originalString': u'2 cups hickory wood chips or chunks', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19003, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons fresh cilantro, chopped', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 jalape\xf1o pepper, seeded and diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'diced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'12 ounces mild cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'mild cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1009, u'unit': u'ounces'}, {u'originalString': u'3/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'8 ounces monterey jack cheese, shredded', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'1 1/2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'10 ounces diced tomatoes with green chilies, canned', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'with green chilies, canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11529, u'unit': u'ounces'}, {u'originalString': u'1/2 medium white onion, diced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'diced', u'white', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'2 cloves garlics, diced', u'aisle': u'?', u'name': u'garlics', u'metaInformation': [u'diced'], u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'unit': u'cloves'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.foodfanatic.com/2014/09/smoked-chili-queso/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Soak the hickory chips in water for at least 30 minutes before using.Meanwhile, prepare the grill for indirect heat. (If using a gas grill, turn burners on one side to high and leave burners on other side off. If using a charcoal grill, bank the charcoal up against one side of the grill.)Using an 8"-10" cast iron skillet, place the shredded cheese evenly across the bottom of the skillet.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the hickory chips directly on the coals and wait for the smoke to appear. (If using a gas grill, make an aluminum foil pouch for the hickory chips. Seal pouch, but poke several holes in the top to allow smoke to escape.)Once hickory chips are smoking, place the cast iron skillet on the opposite side from the charcoal or lit burners. Cover grill and cook for approximately 30 minutes, or until cheese has fully melted. (Note: Check on the cheese occasionally and rotate the skillet as needed.)Meanwhile, place the olive oil, diced onion and diced jalapeo in a medium fry pan. Cook over medium-high heat for 5-6 minutes, or until onions begin to turn translucent.', u'length': {u'number': 36, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add diced garlic and cook for 2 more minutes, stirring frequently.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Whisk the flour and cumin into the fry pan and cook for about 45 seconds, stirring constantly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the milk and whisk until mixture is well combined. Cook for 3-4 more minutes, or until mixture begins to thicken slightly.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in the cilantro, canned diced tomatoes and canned diced chilies. Set mixture aside.Once the cheese has melted fully, add the sour cream and sauted onion mixture. Stir together until fully combined.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer mixture to a serving bowl and garnish with freshly cracked black pepper.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot with tortilla chips.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 109, u'instructions': u'Soak the hickory chips in water for at least 30 minutes before using.Meanwhile, prepare the grill for indirect heat. (If using a gas grill, turn burners on one side to high and leave burners on other side off. If using a charcoal grill, bank the charcoal up against one side of the grill.)Using an 8"-10" cast iron skillet, place the shredded cheese evenly across the bottom of the skillet.Place the hickory chips directly on the coals and wait for the smoke to appear. (If using a gas grill, make an aluminum foil pouch for the hickory chips. Seal pouch, but poke several holes in the top to allow smoke to escape.)Once hickory chips are smoking, place the cast iron skillet on the opposite side from the charcoal or lit burners. Cover grill and cook for approximately 30 minutes, or until cheese has fully melted. (Note: Check on the cheese occasionally and rotate the skillet as needed.)Meanwhile, place the olive oil, diced onion and diced jalapeo in a medium fry pan. Cook over medium-high heat for 5-6 minutes, or until onions begin to turn translucent. Add diced garlic and cook for 2 more minutes, stirring frequently.Whisk the flour and cumin into the fry pan and cook for about 45 seconds, stirring constantly. Add the milk and whisk until mixture is well combined. Cook for 3-4 more minutes, or until mixture begins to thicken slightly. Remove from heat and stir in the cilantro, canned diced tomatoes and canned diced chilies. Set mixture aside.Once the cheese has melted fully, add the sour cream and sauted onion mixture. Stir together until fully combined. Transfer mixture to a serving bowl and garnish with freshly cracked black pepper. Serve hot with tortilla chips.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-chili-queso-611856', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}