{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610862-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 610862, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Peanut Butter Cups', u'diets': [], u'pricePerServing': 16.94, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u"1 cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 cup crunchy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'crunchy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10016098, u'unit': u'cup'}, {u'originalString': u'2/3 cup graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10018617, u'unit': u'cup'}, {u'originalString': u'2 cups milk chocolate chips', u'aisle': u'Baking', u'name': u'milk chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cups'}, {u'originalString': u'2 tablespoons shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4615, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Homemade-Peanut-Butter-Cups/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [], u'winePairing': {}, u'aggregateLikes': 921, u'instructions': u"In 1-quart saucepan combine chocolate chips and shortening.  Cook over low heat, stirring occasionally, until melted and smooth (3 to 5 minutes).Loosen top paper cup from stack, but leave in stack for greater stability while being coated.  With small paint brush, coat inside top cup evenly with about 1 teaspoon melted chocolate to about 1/8-inch thickness, bringing coating almost to top of cup, but not over edge.  Repeat until 30 cups are coated; refrigerate cups.In 2-quart saucepan combine butter or margarine and peanut butter.  Cook over medium heat, stirring occasionally, until melted (4 to 6 minutes). Stir in confectioners' sugar and graham cracker crumbs.  Press about 1/2 tablespoon filling into each chocolate cup.Spoon about 1/2 teaspoon melted chocolate on top of filling; spread to cover.  Freeze until firm (about 2 hours) carefully peel off paper cups.  Store refrigerated.Kitchen-Friendly View", u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-peanut-butter-cups-610862', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}