{u'recipes': [{u'sourceName': u'Musings of a House Wife', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/593906-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 593906, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Caesar Salad with Grilled Romaine', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 262.84, u'creditText': u'Musings of a House Wife', u'extendedIngredients': [{u'originalString': u'Caesar salad dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar salad dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 43015, u'unit': u'servings'}, {u'originalString': u'grilled chicken breast strips', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'strip', u'unitShort': u'strips', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'strips'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'6 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'shredded Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'3 heads Romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'heads', u'unitShort': u'heads', u'amount': 3.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'heads'}, {u'originalString': u'2 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'2 tomatos, sliced', u'aisle': u'Produce', u'name': u'tomatos', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 46.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.musingsofahousewife.com/2013/05/chicken-caesar-salad-with-grilled-romaine.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat your grill to medium and prepare your toppings because this comes together fast!Slice each head of Romaine lengthwise.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}]}, {u'equipment': [], u'step': u"Place the olive oil, sea salt and garlic in a gallon-sized Ziplock bag, shake it up. Then add the Romaine, seal, and mix it around till it's thoroughly coated.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the Romaine on the grill, cut sides down, for about a minute.Flip it and grill for 1-2 more minutes; remove to dinner plates.Top with salad dressing, grilled chicken, tomato slices and cheese. Feel free to add other toppings such as bacon bits and croutons.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-tomato.jpg', u'id': 10511529, u'name': u'tomato slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}]}, {u'equipment': [], u'step': u'Serve warm or at room temp.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Gavi, Albarino, and Pinot Grigio are my top picks for Chicken Caesar Salad. We recommend a crisp, dry white wine such as a Gavi, Albari\xf1o, or Pinot Grigio. These wines stand up to the pungent dressing and complement the other flavors. One wine you could try is Martin Codax Albarino. It has 4.1 out of 5 stars and a bottle costs about 17 dollars.', u'pairedWines': [u'gavi', u'albarino', u'pinot grigio'], u'productMatches': [{u'description': u'The Martin Codax 2011 Rias Baixas Albarino is delicate and medium-bodied with a crisp, dry finish. Flavors of ripe apple, peach, pear and lemon zest are framed by bright minerality and hints of spice. This Albari\xf1o displays intense floral aromas and an attractive acidity, making it a versatile, food-friendly wine. View More', u'title': u'Martin Codax Albarino', u'price': u'$16.99', u'id': 436904, u'link': u'https://www.wine.com/product/martin-codax-albarino-2011/121023', u'imageUrl': u'https://spoonacular.com/productImages/436904-312x231.jpg'}]}, u'aggregateLikes': 152, u'instructions': u"Heat your grill to medium and prepare your toppings because this comes together fast!Slice each head of Romaine lengthwise.Place the olive oil, sea salt and garlic in a gallon-sized Ziplock bag, shake it up. Then add the Romaine, seal, and mix it around till it's thoroughly coated.Place the Romaine on the grill, cut sides down, for about a minute.Flip it and grill for 1-2 more minutes; remove to dinner plates.Top with salad dressing, grilled chicken, tomato slices and cheese. Feel free to add other toppings such as bacon bits and croutons. Serve warm or at room temp.", u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-caesar-salad-with-grilled-romaine-593906', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}