{u'recipes': [{u'sourceName': u'Pies and Plots', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/585375-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 585375, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel Cheerio Treats', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 74.78, u'creditText': u'Pies and Plots', u'extendedIngredients': [{u'originalString': u'1 cup homemade Caramel Sauce', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19364, u'unit': u'cup'}, {u'originalString': u'3 cups Cheerios', u'aisle': u'Cereal', u'name': u'cheerios', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheerios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 8013, u'unit': u'cups'}, {u'originalString': u'2 cups Peanut Butter Cheerios', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16098, u'unit': u'cups'}, {u'originalString': u'\xbe cup lightly salted peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16091, u'unit': u'cup'}, {u'originalString': u'1 10.5 ounce bag Jet Puffed Mini Marshmallows (I highly recommend using this brand)', u'name': u'puffed rice', u'metaInformation': [u'mini', u'(I highly recommend using this brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puffed-rice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.5, u'consistency': u'solid', u'id': 8156, u'unit': u'ounce'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://piesandplots.net/caramel-cheerio-treats/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line a 9 by 13 inch pan with parchment. Butter the parchment generously.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the marshmallows and caramel in a large microwave safe bowl. Microwave on high in 30 second increments, stirring well between each session. It will take a couple of minutes to fully melt the marshmallows. Continue microwaving in increments until everything is completely melted and when stirred together forms a homogeneous mixture.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in the cereal and peanuts. It is okay to add the cereal a couple cups at a time to make stirring easier. Once the mixture is fully incorporated with the marshmallow mixture completely covering the cereal and peanuts, pour it into the prepared pan. Smooth it out with buttered fingers or spatula; this is a messy job. Refrigerate for at least 1 hour and up to 3 days before cutting into bars and serving (though tasting while warm is entirely acceptable). May also be stored in the freezer, wrapped in parchment and foil and placed in a zipper bag for up to 3 months. Thaw at room temperature for just a few minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Treat. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Line a 9 by 13 inch pan with parchment. Butter the parchment generously.Place the marshmallows and caramel in a large microwave safe bowl. Microwave on high in 30 second increments, stirring well between each session. It will take a couple of minutes to fully melt the marshmallows. Continue microwaving in increments until everything is completely melted and when stirred together forms a homogeneous mixture.Pour in the cereal and peanuts. It is okay to add the cereal a couple cups at a time to make stirring easier. Once the mixture is fully incorporated with the marshmallow mixture completely covering the cereal and peanuts, pour it into the prepared pan. Smooth it out with buttered fingers or spatula; this is a messy job. Refrigerate for at least 1 hour and up to 3 days before cutting into bars and serving (though tasting while warm is entirely acceptable). May also be stored in the freezer, wrapped in parchment and foil and placed in a zipper bag for up to 3 months. Thaw at room temperature for just a few minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-cheerio-treats-585375', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}