{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/264575-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 264575, u'veryPopular': False, u'lowFodmap': False, u'title': u'Double-Cheese and Veggie Macaroni', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 136.03, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1/4 cup KRAFT Lite Zesty Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian dressing', u'metaInformation': [u'italian', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'1 pkg. (14 oz.) KRAFT Deluxe Macaroni & Cheese Dinner Made With 2% Milk Cheese', u'aisle': u'Pasta and Rice', u'name': u'macaroni & cheese dinner', u'metaInformation': [u'2%', u'with  milk cheese', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 32004, u'unit': u'oz'}, {u'originalString': u'1/2 cup KRAFT 2% Milk Shredded Sharp Cheddar Cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded', u'2%', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1 large tomato, chopped', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'2 small zucchini, chopped', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/double-cheese-veggie-macaroni-106714.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare Dinner in large saucepan as directed on package.  Meanwhile, heat dressing in large skillet on medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add zucchini; cook 5 min. or until crisp-tender, stirring occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Add zucchini and tomatoes to Dinner; mix well.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Top with cheddar.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14, u'instructions': u'Prepare Dinner in large saucepan as directed on package.  Meanwhile, heat dressing in large skillet on medium heat.  Add zucchini; cook 5 min. or until crisp-tender, stirring occasionally.                                              Add zucchini and tomatoes to Dinner; mix well.                                              Top with cheddar.', u'spoonacularSourceUrl': u'https://spoonacular.com/double-cheese-and-veggie-macaroni-264575', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}