{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/695692-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 695692, u'veryPopular': True, u'lowFodmap': False, u'title': u'Manhattan Crab Chowder', u'diets': [u'gluten free', u'dairy free', u'whole 30', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 200.18, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 cups canned crushed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'cups'}, {u'originalString': u'1 pound pasteurized crabmeat, drained if necessary', u'aisle': u'Seafood', u'name': u'crabmeat', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10015136, u'unit': u'pound'}, {u'originalString': u'1 cup cored fennel bulb, finely diced, plus 2 tablespoons chopped fronds, divided', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'diced', u'divided', u'cored', u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u'cup'}, {u'originalString': u'2 tablespoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup finely diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 cups precooked diced potatoes, (see Tip)', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'diced', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u'cups'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons Italian seasoning blend', u'aisle': u'Spices and Seasonings', u'name': u'seasoning blend', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'teaspoons'}, {u'originalString': u'1 14-ounce can reduced-sodium chicken broth, or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'reduced-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 58.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/manhattan_crab_chowder.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in a large saucepan over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, diced fennel, garlic, Italian seasoning, salt and pepper and cook, stirring often, until the vegetables are just starting to brown, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add broth, water and potatoes; bring to a boil. Reduce heat to a simmer and cook until the vegetables are tender, 3 to 5 minutes. Stir in tomatoes, crabmeat and fennel fronds. Return to a boil, stirring often; immediately remove from heat.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 10015136, u'name': u'crabmeat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 451, u'instructions': u'Heat oil in a large saucepan over medium heat. Add onion, diced fennel, garlic, Italian seasoning, salt and pepper and cook, stirring often, until the vegetables are just starting to brown, 6 to 8 minutes.Add broth, water and potatoes; bring to a boil. Reduce heat to a simmer and cook until the vegetables are tender, 3 to 5 minutes. Stir in tomatoes, crabmeat and fennel fronds. Return to a boil, stirring often; immediately remove from heat.', u'spoonacularSourceUrl': u'https://spoonacular.com/manhattan-crab-chowder-695692', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}