{u'recipes': [{u'sourceName': u'The Roasted Root', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/512526-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 512526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Southwest Veggie Burgers with Black Bean and Corn Salsa', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 46.97, u'creditText': u'The Roasted Root', u'extendedIngredients': [{u'originalString': u'1/3 cup black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 16015, u'unit': u'cup'}, {u'originalString': u'1 14-ounce can white beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned white beans', u'metaInformation': [u'white', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16051, u'unit': u'ounce'}, {u'originalString': u'1 cup cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20041, u'unit': u'cup'}, {u'originalString': u'Southwest Black Bean and Corn Salsa for serving', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [u'black', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 11168, u'unit': u'servings'}, {u'originalString': u'1/3 cup corn kernels (about 1/2 an ear of corn)', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'( 1/2 an ear of corn)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11172, u'unit': u'cup'}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 small jalape\xf1o, seeded and chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'small', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup red bell pepper, finely chopped (about \xbc of a bell pepper)', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'finely chopped', u'( \xbc of a bell pepper)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'2 tablespoons finely chopped white onion', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10611282, u'unit': u'tablespoons'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.theroastedroot.net/southwest-veggie-burgers-black-bean-corn-salsa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare the Black Bean and Corn Salsa and refrigerate until ready to use.Rinse the white beans well and pat them dry.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the beans at the cooked rice to a food processor and pulse until well combined. Its okay if the mixture is slightly chunky.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the white bean/rice mixture to a mixing bowl and mix in the lightly beaten egg.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining ingredients and stir together until combined. Note: If youre using canned black beans and corn, be sure to rinse them and pat them dry before adding them to the mixture.In a cast iron skillet, heat 3 tablespoons of grapeseed or canola oil over medium (or enough oil to coat the surface well).Measure 1/3 cup of the burger mixture and form a patty using your hands (the mixture will be sticky, and thats okay!). Carefully place the burger on the hot cast iron skillet and allow it to cook for 5 minutes. Carefully flip to the other side and cook an additional 5 minutes.Repeat for remaining burger mixture.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger can be paired with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Luigi Bosca Malbec. It has 4.2 out of 5 stars and a bottle costs about 23 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Luigi Bosca Malbec is an intense purple colour wine, with distinct aromas of ripe red fruits, spices and black pepper. The intensity of the entry in the mouth is complemented with the softness and sweetness of tannins, respecting the characteristics of the grape variety in Argentina. A pure, full-bodied, well-structured red wine with character and all the juiciness typical of this variety. A long lingering and elegant finish.', u'title': u'Luigi Bosca Malbec', u'price': u'$22.99', u'id': 438334, u'link': u'https://www.wine.com/product/luigi-bosca-malbec-2011/132493', u'imageUrl': u'https://spoonacular.com/productImages/438334-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Prepare the Black Bean and Corn Salsa and refrigerate until ready to use.Rinse the white beans well and pat them dry. Add the beans at the cooked rice to a food processor and pulse until well combined. Its okay if the mixture is slightly chunky.Add the white bean/rice mixture to a mixing bowl and mix in the lightly beaten egg.Add the remaining ingredients and stir together until combined. Note: If youre using canned black beans and corn, be sure to rinse them and pat them dry before adding them to the mixture.In a cast iron skillet, heat 3 tablespoons of grapeseed or canola oil over medium (or enough oil to coat the surface well).Measure 1/3 cup of the burger mixture and form a patty using your hands (the mixture will be sticky, and thats okay!). Carefully place the burger on the hot cast iron skillet and allow it to cook for 5 minutes. Carefully flip to the other side and cook an additional 5 minutes.Repeat for remaining burger mixture.', u'spoonacularSourceUrl': u'https://spoonacular.com/southwest-veggie-burgers-with-black-bean-and-corn-salsa-512526', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 7, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}