{u'recipes': [{u'sourceName': u'Southern Bite', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582389-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 582389, u'veryPopular': False, u'lowFodmap': False, u'title': u'Valentine’s Truffles and A “Little” Love Story', u'diets': [u'gluten free'], u'preparationMinutes': 45, u'pricePerServing': 21.42, u'creditText': u'Southern Bite', u'extendedIngredients': [{u'originalString': u'coatings – I used some powdered sugar, cocoa powder, and some finely chopped pecans. Be creative!', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 36.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'3 cups semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}, {u'originalString': u'1 – 14 oz can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'1 tablespoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://southernbite.com/2011/02/09/valentines-truffles-and-a-little-love-story/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Melt the chocolate chips in the microwave using 30 second intervals.  Stir between each until chocolate is completely melted and smooth.Stir in sweetened condensed milk and vanilla.  (You can also stir in another flavoring too like raspberry, strawberry, or even orange.)Allow the mixture to cool to room temperature (about 2 hours).  Waiting too long will cause the chocolate to get too hard.  If that happens, you can just zap it in the microwave again to soften it up.Then roll into 3/4 inch balls and gently roll in any of your favorite coatings.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'aggregateLikes': 16, u'instructions': u'Melt the chocolate chips in the microwave using 30 second intervals.  Stir between each until chocolate is completely melted and smooth.Stir in sweetened condensed milk and vanilla.  (You can also stir in another flavoring too like raspberry, strawberry, or even orange.)Allow the mixture to cool to room temperature (about 2 hours).  Waiting too long will cause the chocolate to get too hard.  If that happens, you can just zap it in the microwave again to soften it up.Then roll into 3/4 inch balls and gently roll in any of your favorite coatings.', u'spoonacularSourceUrl': u'https://spoonacular.com/valentines-truffles-and-a-little-love-story-582389', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}