{u'recipes': [{u'sourceName': u'Laa Loosh', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548800-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 548800, u'veryPopular': False, u'lowFodmap': False, u'title': u'Poached Salmon Pasta Salad – 5 Points', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 245.73, u'creditText': u'Laa Loosh', u'extendedIngredients': [{u'originalString': u'1 can artichoke hearts, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 93828, u'unit': u'can'}, {u'originalString': u'3 tbsp capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tbsp'}, {u'originalString': u'2 tsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1/4 cup fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'2 lemons, 1 sliced \xbc-inch thick, 1 juiced', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [u'thick', u'juiced', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'8 oz dry whole wheat pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'whole wheat', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'oz'}, {u'originalString': u'1 cup plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 small red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'8 oz salmon fillets', u'aisle': u'Seafood', u'name': u'salmon fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 15076, u'unit': u'oz'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 small shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.laaloosh.com/2012/04/05/poached-salmon-pasta-salad-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare pasta according to package directions; drain and set aside.Arrange the lemon slices in a single layer across the bottom of a 12-inch skillet. Scatter the shallots evenly over the lemon slices; add the water and wine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the salmon fillets in the skillet, skin side down on top of the lemon slices; set the pan over high heat and bring the liquid to a simmer. Reduce the heat to medium-low, cover, and cook until the sides of the salmon are opaque but the center of the thickest part is still translucent, 11 to 16 minutes.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and carefully transfer the salmon to a cutting board. When cooled, remove the skin and cut the salmon into bite-sized chunks.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine lemon juice, mustard, parsley, capers, yogurt, and in a large bowl. Fold in the pasta, artichokes red onions, and salmon.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately or chill for several hours.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 254, u'instructions': u'InstructionsPrepare pasta according to package directions; drain and set aside.Arrange the lemon slices in a single layer across the bottom of a 12-inch skillet. Scatter the shallots evenly over the lemon slices; add the water and wine. Place the salmon fillets in the skillet, skin side down on top of the lemon slices; set the pan over high heat and bring the liquid to a simmer. Reduce the heat to medium-low, cover, and cook until the sides of the salmon are opaque but the center of the thickest part is still translucent, 11 to 16 minutes. Remove the pan from the heat and carefully transfer the salmon to a cutting board. When cooled, remove the skin and cut the salmon into bite-sized chunks.Combine lemon juice, mustard, parsley, capers, yogurt, and in a large bowl. Fold in the pasta, artichokes red onions, and salmon. Serve immediately or chill for several hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/poached-salmon-pasta-salad-5-points-548800', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}