{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/215479-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 215479, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken & lentil stew with gremolata', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 137.78, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'400g can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'g'}, {u'originalString': u'8 chicken drumsticks, skin left on', u'aisle': u'Meat', u'name': u'chicken drumsticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 5066, u'unit': u''}, {u'originalString': u'1 chicken stock cube, crumbled', u'aisle': u'Canned and Jarred', u'name': u'chicken stock cube', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6080, u'unit': u''}, {u'originalString': u'crusty bread, to serve', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'servings'}, {u'originalString': u'small handful parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, finely chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'zest 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 onions, very finely chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'very finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'6 tbsp red lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red lentils', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 10016069, u'unit': u'tbsp'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipe/chicken-lentil-stew-gremolata', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Heat half the oil in a large flameproofcasserole dish, brown the drumstickson all sides, then transfer to a plate.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onions and remaining oil tothe pan, and cook for 5 mins or so untilsoft.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the lentils, tomatoes, 1 canof water and the stock cube. Returnthe drumsticks to the pan. Bring to theboil, then turn down the heat, put ona lid and simmer for 30 mins or untiltender. Keep an eye on the stew andadd a little water if it is drying out.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'id': 5066, u'name': u'chicken drumsticks'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Remove the lid and cook for another10 mins, or until the sauce hasthickened, then season.Meanwhile, make the gremolata.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the lemon zest, garlic and parsleytogether. Sprinkle over the cooked stewand serve with a chunk of crusty bread.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 10018029, u'name': u'crusty bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u'Heat half the oil in a large flameproofcasserole dish, brown the drumstickson all sides, then transfer to a plate.Add the onions and remaining oil tothe pan, and cook for 5 mins or so untilsoft. Add the lentils, tomatoes, 1 canof water and the stock cube. Returnthe drumsticks to the pan. Bring to theboil, then turn down the heat, put ona lid and simmer for 30 mins or untiltender. Keep an eye on the stew andadd a little water if it is drying out.Remove the lid and cook for another10 mins, or until the sauce hasthickened, then season.Meanwhile, make the gremolata.Mix the lemon zest, garlic and parsleytogether. Sprinkle over the cooked stewand serve with a chunk of crusty bread.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-lentil-stew-with-gremolata-215479', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}