{u'recipes': [{u'sourceName': u"Swasthi's Recipes", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666059-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 666059, u'veryPopular': False, u'lowFodmap': False, u'title': u'broken wheat upma, dalia , how to make dalia upma', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 180.3, u'creditText': u"Swasthi's Recipes", u'extendedIngredients': [{u'originalString': u'1 large carrot chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 green chillies slit (adjust as per the taste)', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'green', u'per the taste)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'\xbd tsp. jeera / cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 sprig curry leaves', u'aisle': u'Ethnic Foods', u'name': u'curry leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 93604, u'unit': u'sprig'}, {u'originalString': u'\xbc cup green peas', u'aisle': u'Produce', u'name': u'green peas', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'Pinch of hing', u'aisle': u'Spices and Seasonings', u'name': u'hing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032035, u'unit': u'pinch'}, {u'originalString': u'\xbd tsp. mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2046, u'unit': u'tsp'}, {u'originalString': u'3 tbsp. oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1 onion chopped or sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 potato peeled and cubed small', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'small', u'cubed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1.5 cups roasted broken wheat 4.5 cups water', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'Roasted Green Wheat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freekeh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 98869, u'unit': u'cups'}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://indianhealthyrecipes.com/broken-wheat-upma-veg-dalia-in-pressure-cooker/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Dry roast rava till you get a nice aroma.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a pan or kadai, add mustard, jeera, and curry leaves.Allow them to splutter, add hing , onions, potatoes, carrots, peas and fry for 3 to 4 mins.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'id': 93604, u'name': u'curry leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 1032035, u'name': u'asafoetida'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add water, turmeric & salt, bring the water to a rapid boil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Add broken wheat slowly stirring with one of your hands. Stir well and close the lidcook till the veggies are cooked fully or pressure cook for 1 to 2 whistles on a low flame (low flame otherwise upma can get burnt). If you are not making it in a pressure cooker, then just cook it till it is fully done', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Once the pressure is down, mix well and serve with your favorite side. A chutney or pickle or sambar or pappu podi goes well.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 24, u'instructions': u'Dry roast rava till you get a nice aroma. Heat oil in a pan or kadai, add mustard, jeera, and curry leaves.Allow them to splutter, add hing , onions, potatoes, carrots, peas and fry for 3 to 4 mins.Add water, turmeric & salt, bring the water to a rapid boil. Add broken wheat slowly stirring with one of your hands. Stir well and close the lidcook till the veggies are cooked fully or pressure cook for 1 to 2 whistles on a low flame (low flame otherwise upma can get burnt). If you are not making it in a pressure cooker, then just cook it till it is fully doneOnce the pressure is down, mix well and serve with your favorite side. A chutney or pickle or sambar or pappu podi goes well.', u'spoonacularSourceUrl': u'https://spoonacular.com/broken-wheat-upma-dalia-how-to-make-dalia-upma-666059', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}