{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/537400-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 537400, u'veryPopular': False, u'lowFodmap': False, u'title': u'Guacamole Omelet', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 165.15, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1 large avocado, mashed', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'large', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 teaspoon butter per omelet', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'per omelet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon fresh cilantro, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'Fresh cilantro, garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'Dash of hot sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'Dash'}, {u'originalString': u'Hot sauce, garnish', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'1/2 lime, juice only', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 Serrano pepper, seeded and minced', u'aisle': u'Produce', u'name': u'serrano pepper', u'metaInformation': [u'minced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/serrano-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11977, u'unit': u''}, {u'originalString': u'1 shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'Tortilla chips, garnish', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.macheesmo.com/2013/01/guacamole-omelet/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add a dab of butter to an omelet skillet (nonstick) over medium heat. Once the butter is melted, add scrambled eggs (2 eggs scrambled well with 1 tablespoon water). 4) As egg cooks, use a spatula to push the cooked egg to the center of the pan. Tilt the pan as you do this so the uncooked egg flows out and comes in contact with hot pan. Keep doing this until the egg is mostly cooked. There should be a light layer of uncooked egg on top of the omelet.5)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add half of the guacamole to half of the omelet and return to heat. Cook for 20-30 seconds.6) Slide omelet out of the pan onto a plate, folding it as you slide to form the traditional omelet shape. If you want the egg cooked more, you can fold it over in the pan using a spatula and continue to cook until the egg is completely cooked through.7)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Garnish omelet with cilantro and hot sauce and serve with tortilla chips!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Omelet works really well with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. You could try Piper-Heidsieck Brut Cuvee. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 40 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance.', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 177, u'instructions': u"Directions1) To make guacamole, mince shallot and Serrano very finely. Cube avocado and add it the bowl and mash everything together. It's okay to keep it a bit chunky.2) Stir in lime juice, cilantro, and season with hot sauce, salt, and pepper.3) Add a dab of butter to an omelet skillet (nonstick) over medium heat. Once the butter is melted, add scrambled eggs (2 eggs scrambled well with 1 tablespoon water). 4) As egg cooks, use a spatula to push the cooked egg to the center of the pan. Tilt the pan as you do this so the uncooked egg flows out and comes in contact with hot pan. Keep doing this until the egg is mostly cooked. There should be a light layer of uncooked egg on top of the omelet.5) Add half of the guacamole to half of the omelet and return to heat. Cook for 20-30 seconds.6) Slide omelet out of the pan onto a plate, folding it as you slide to form the traditional omelet shape. If you want the egg cooked more, you can fold it over in the pan using a spatula and continue to cook until the egg is completely cooked through.7) Garnish omelet with cilantro and hot sauce and serve with tortilla chips!", u'spoonacularSourceUrl': u'https://spoonacular.com/guacamole-omelet-537400', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}