{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/700555-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 700555, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grandma’s Famous Pinwheel Cookies', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 14.42, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 Teaspoon Baking Soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'Teaspoon'}, {u'originalString': u'1 cup Brown Sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 Large Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 cups Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'3 cups Raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 9299, u'unit': u'cups'}, {u'originalString': u'\xbd Teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'1 cup Shortening (or half butter half shortening)', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [u'(or half butter half shortening)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'\xbc Cup Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'Cup'}, {u'originalString': u'1 cup Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd Teaspoon McCormick Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'Teaspoon'}, {u'originalString': u'\xbd Cup Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'Cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.ohsweetbasil.com/grandmas-famous-pinwheel-cookies-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 350 degrees.In a blender, combine the raisins, water, sugar and vanilla, mix until smooth and pour into a small saucepan. Boil for 5 minutes and set aside.In the bowl of a standing mixer, cream the shortening and sugars for 1 minute.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the eggs and mix again.In a separate bowl, whisk together the dry ingredients and add into the wet ingredients until a thick dough forms.On a lightly floured surface, roll out the dough in a big rectangle.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread the raisin mixture all over the dough and roll the dough like pinwheels or cinnamon rolls. Slice into cookies and place on a parchment lined baking sheet.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 10-12 minutes, and allow to cool for 2-5 minutes on the pan then remove to a cooling rack.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 59, u'instructions': u'Preheat your oven to 350 degrees.In a blender, combine the raisins, water, sugar and vanilla, mix until smooth and pour into a small saucepan. Boil for 5 minutes and set aside.In the bowl of a standing mixer, cream the shortening and sugars for 1 minute. Add the eggs and mix again.In a separate bowl, whisk together the dry ingredients and add into the wet ingredients until a thick dough forms.On a lightly floured surface, roll out the dough in a big rectangle. Spread the raisin mixture all over the dough and roll the dough like pinwheels or cinnamon rolls. Slice into cookies and place on a parchment lined baking sheet. Bake for 10-12 minutes, and allow to cool for 2-5 minutes on the pan then remove to a cooling rack.', u'spoonacularSourceUrl': u'https://spoonacular.com/grandmas-famous-pinwheel-cookies-700555', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 48, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}