{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/736794-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 736794, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cavatelli with Sausage and Radicchio', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 178.54, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons extra-virgin olive oil, plus more for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup freshly grated Parmigiano-Reggiano, plus more for topping', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'freshly grated', u'plus more for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pound pasta, such as cavatelli or orecchiette', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u' such as cavatelli or orecchiette'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'pound'}, {u'originalString': u'4 pork sausages (about 1 pound), casings removed', u'aisle': u'Meat', u'name': u'pork sausages', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1007063, u'unit': u'pound'}, {u'originalString': u'1/2 head radicchio, thinly sliced', u'aisle': u'Produce', u'name': u'radicchio', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11952, u'unit': u'head'}, {u'originalString': u'Pinch red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'1/2 cup walnuts, toasted and hand-crushed', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'1/2 white onion, diced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'diced', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'1/2 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 14.0, u'imageType': u'jpeg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/cavatelli-with-sausage-and-radicchio.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In an 8- to 12-quart pot, bring 6 quarts (24 cups) salted water to a rolling boil.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large nonstick skillet, heat 2 tablespoons of the olive oil over medium-high heat until hot but not smoking.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add the sausage and cook, breaking it up with a wooden spoon, until browned but not yet crispy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the meat from the skillet with a slotted spoon and set aside.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onions and remaining tablespoon of olive oil to the skillet and saute until the onions are soft.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the sausage back along with a pinch of red pepper flakes and saute an additional minute. Reduce the flame to medium low and pour in the wine, cooking until it is reduced by half, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Remove the sauce from the heat.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pasta to the boiling water and cook until al dente.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the pasta and add it to the sauce in the skillet.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the Parmigiano-Reggiano and radicchio and toss to combine the ingredients.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}]}, {u'equipment': [], u'step': u'Garnish with the crushed walnuts, a drop of extra-virgin olive oil and a light dusting of freshly grated Parmigiano-Reggiano.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 424, u'instructions': u'Watch how to make this recipe.                    In an 8- to 12-quart pot, bring 6 quarts (24 cups) salted water to a rolling boil.                          In a large nonstick skillet, heat 2 tablespoons of the olive oil over medium-high heat until hot but not smoking. Add the sausage and cook, breaking it up with a wooden spoon, until browned but not yet crispy. Remove the meat from the skillet with a slotted spoon and set aside.                          Add the onions and remaining tablespoon of olive oil to the skillet and saute until the onions are soft. Add the sausage back along with a pinch of red pepper flakes and saute an additional minute. Reduce the flame to medium low and pour in the wine, cooking until it is reduced by half, 3 to 4 minutes. Remove the sauce from the heat.                          Add the pasta to the boiling water and cook until al dente. Drain the pasta and add it to the sauce in the skillet. Add the Parmigiano-Reggiano and radicchio and toss to combine the ingredients. Garnish with the crushed walnuts, a drop of extra-virgin olive oil and a light dusting of freshly grated Parmigiano-Reggiano.', u'spoonacularSourceUrl': u'https://spoonacular.com/cavatelli-with-sausage-and-radicchio-736794', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}