{u'recipes': [{u'sourceName': u'In Katrinas Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587584-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 285, u'id': 587584, u'veryPopular': True, u'lowFodmap': False, u'title': u'Frozen Blueberry Basil Lemonade Mini Pies', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 65.99, u'creditText': u'In Katrinas Kitchen', u'extendedIngredients': [{u'originalString': u'1/2 cup blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'2 fresh basil leaves (optional)', u'aisle': u'Produce', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 cup frozen lemonade concentrate', u'aisle': u'Frozen', u'name': u'lemonade concentrate', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonade.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14292, u'unit': u'cup'}, {u'originalString': u'8 oz Cool Whip, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'14 oz can of sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.inkatrinaskitchen.com/2012/06/frozen-blueberry-basil-lemonade-mini.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl combine the Cool Whip and sweetened condensed milk. Then add the lemonade concentrate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonade.jpg', u'id': 14292, u'name': u'lemonade concentrate'}]}, {u'equipment': [], u'step': u'Add the blueberries (halve them if small children will be enjoying this dessert). Finely chop the basil and fold into the mixture.Spoon the mixture into 12 mini pie crusts or small containers. Freeze for 5 hours or overnight.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 710, u'instructions': u'In a large bowl combine the Cool Whip and sweetened condensed milk. Then add the lemonade concentrate.Add the blueberries (halve them if small children will be enjoying this dessert). Finely chop the basil and fold into the mixture.Spoon the mixture into 12 mini pie crusts or small containers. Freeze for 5 hours or overnight.', u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-blueberry-basil-lemonade-mini-pies-587584', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 300, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}