{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618466-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 618466, u'veryPopular': True, u'lowFodmap': False, u'title': u'Clean Eating Stuffed Peppers {Clean Eating Freezer Meals Cookbook Giveaway}', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 283.64, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'5 bell peppers (assorted colors make a pretty presentation)', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'assorted', u'( colors make a pretty presentation)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 cup carrots, thinly sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 tablespoon fresh rosemary, chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon fresh thyme, chopped', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'6 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 teaspoons garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoons'}, {u'originalString': u'1 pound ground turkey', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'pound'}, {u'originalString': u'1/2 cup low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1 cup mushrooms, chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoons'}, {u'originalString': u'1 red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt and fresh ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 cup no-sodium added tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/2014/11/clean-eating-stuffed-pepper.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut tops off of bell peppers; scoop out membranes and seeds using a spoon or your fingers. Slice off part of the pepper bottoms if needed to help them stand up. Chop up "lids" of peppers.In a large skillet, heat the oil over medium; add chopped pepper, onion, mushrooms, carrots, garlic, rosemary and thyme; cook until vegetables soften, about 5-6 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add turkey and brown; season to taste with salt and pepper. In a small bowl, mix together tomato sauce, chicken broth, garlic powder, onion powder, salt and pepper.Fill peppers with meat stuffing.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour tomato sauce in the bottom of  a snug casserole or baking dish (choose a dish to fit the size of your peppers), reserving 1/2 cup to spoon on top of peppers.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Place peppers upright in casserole dish. Spoon reserved sauce on top of peppers.To freeze, cool completely, then cover with an airtight lid for up to 4 months. To serve, thaw completely in the refrigerator.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 degrees Fahrenheit for 35-40 minutes, or until peppers are completely heated through.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with tomato sauce ladled over peppers.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 544, u'instructions': u'Cut tops off of bell peppers; scoop out membranes and seeds using a spoon or your fingers. Slice off part of the pepper bottoms if needed to help them stand up. Chop up "lids" of peppers.In a large skillet, heat the oil over medium; add chopped pepper, onion, mushrooms, carrots, garlic, rosemary and thyme; cook until vegetables soften, about 5-6 minutes. Add turkey and brown; season to taste with salt and pepper. In a small bowl, mix together tomato sauce, chicken broth, garlic powder, onion powder, salt and pepper.Fill peppers with meat stuffing. Pour tomato sauce in the bottom of  a snug casserole or baking dish (choose a dish to fit the size of your peppers), reserving 1/2 cup to spoon on top of peppers. Place peppers upright in casserole dish. Spoon reserved sauce on top of peppers.To freeze, cool completely, then cover with an airtight lid for up to 4 months. To serve, thaw completely in the refrigerator. Bake at 375 degrees Fahrenheit for 35-40 minutes, or until peppers are completely heated through. Serve with tomato sauce ladled over peppers.', u'spoonacularSourceUrl': u'https://spoonacular.com/clean-eating-stuffed-peppers-clean-eating-freezer-meals-cookbook-giveaway-618466', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}