{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/449960-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 449960, u'veryPopular': True, u'lowFodmap': False, u'title': u'Honey-Citrus Chicken Sandwiches', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 271.74, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/8 to 1/4 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'Shredded lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'6 slices Monterey Jack or Muenster cheese, optional', u'aisle': u'Cheese', u'name': u'muenster cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 1030, u'unit': u'slices'}, {u'originalString': u'1 tablespoon prepared mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon poultry seasoning', u'aisle': u'Spices and Seasonings', u'name': u'poultry seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2034, u'unit': u'teaspoon'}, {u'originalString': u'6 red onion slices', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'slices'}, {u'originalString': u'6 boneless skinless chicken breast halves (4 ounces each)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast halves', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 1045062, u'unit': u'ounces'}, {u'originalString': u'6 kaiser rolls, split', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'6 thin tomato slices', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 11529, u'unit': u'slices'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/honey-citrus-chicken-sandwiches', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Flatten chicken breast evenly to 1/4-in. thickness; set aside. In a large resealable plastic bag, combine the orange and lemon juices, honey, oil, mustard, poultry seasoning and cayenne pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'id': 2034, u'name': u'poultry seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add chicken breasts; seal bag and turn to coat. Refrigerate for 6-8 hours or overnight.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Drain; discard marinade. Grill, uncovered, over medium-low heat, turning occasionally, for 10-12 minutes or until juices run clear. If desired, top each chicken breast with a slice of cheese and grill 1-2 minutes longer or until cheese begins to melt.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Serve on rolls with tomato, onion and lettuce.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 1686, u'instructions': u'Directions                                                                                Flatten chicken breast evenly to 1/4-in. thickness; set aside. In a large resealable plastic bag, combine the orange and lemon juices, honey, oil, mustard, poultry seasoning and cayenne pepper. Add chicken breasts; seal bag and turn to coat. Refrigerate for 6-8 hours or overnight.                                                                                             Drain; discard marinade. Grill, uncovered, over medium-low heat, turning occasionally, for 10-12 minutes or until juices run clear. If desired, top each chicken breast with a slice of cheese and grill 1-2 minutes longer or until cheese begins to melt. Serve on rolls with tomato, onion and lettuce.                                        Yield: 6 servings.                                                                                                                         Originally published as Honey-Citrus Chicken Sandwiches in  Country Chicken Cookbook1995, p92                                                                                                                                                                                                        Nutritional Facts                                                                            Diabetic Exchanges: One serving (prepared without cheese) equals 3 lean meat, 2 starch, 1 vegetable, 1/2 fruit; also, 388 calories, 602 mg sodium, 73 mg cholesterol, 46 gm carbohydrate, 34 gm protein, 8 gm fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-citrus-chicken-sandwiches-449960', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}