{u'recipes': [{u'sourceName': u'Gluten Free Home Maker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/558099-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 558099, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breadsticks (Dairy Free)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 16.94, u'creditText': u'Gluten Free Home Maker', u'extendedIngredients': [{u'originalString': u'1 teaspoon apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons instant or bread machine yeast', u'aisle': u'Baking', u'name': u'bread machine yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10218375, u'unit': u'teaspoons'}, {u'originalString': u'1 egg white, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'\xbd cup warm milk substitute (105\xb0-115\xb0)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(105\xb0-115\xb0)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 Tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'1 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup potato starch', u'aisle': u'Baking', u'name': u'potato starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11413, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup sorghum flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'sorghum flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20648, u'unit': u'cup'}, {u'originalString': u'2 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'\xbc cup tapioca starch', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93696, u'unit': u'cup'}, {u'originalString': u'1 teaspoon xanthan gum', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'xanthan gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93626, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://glutenfreehomemaker.com/breadsticks-dairy-free/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Grease a large baking sheet.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut \xbd inch off one corner of a quart size plastic bag.In the bowl of your mixer, combine the sorghum flour, starches, xanthan gum, onion and garlic powders, salt, sugar, and instant yeast.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 10118375, u'name': u'instant yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'id': 20648, u'name': u'sorghum flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93626, u'name': u'xanthan gum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the milk substitute, oil, and vinegar and beat on medium speed for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Add the dough to the plastic bag, pressing the dough into the cut corner and twisting the bag closed behind the dough. Squeeze the dough onto the baking sheet in 6 inch long ropes.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the tops with the beaten egg white.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the baking sheet into a cold oven and set the temperature to 400\xb0. Begin timing when the oven is turned on and bake about 15 minutes or until lightly browned.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Banfi Rosa Regale Brachetto ( half-bottle). It has 4.4 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"This sparkling red wine made from Brachetto d'Acqui in Piedmont, Italy is love at first sip and a perpetual crowd pleaser. The color is a festive cranberry. Aromatic with hints of raspberries, strawberries and rose petals. There is a taste of fresh raspberries, with crisp acidity, enticing the palate with an initial softness, graduating to a clean and dry finish. Perfect for any occasion. A unique and festive sparkling wine, seductive aperitif, and elegant dessert wine. Pairs well with seafood, cheeses, spicy fare and chocolate. Serve chilled.", u'title': u'Banfi Rosa Regale Brachetto ( half-bottle)', u'price': u'$12.99', u'id': 448167, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-375ml-half-bottle-2012/130015', u'imageUrl': u'https://spoonacular.com/productImages/448167-312x231.jpg'}]}, u'aggregateLikes': 185, u'instructions': u'Grease a large baking sheet.Cut \xbd inch off one corner of a quart size plastic bag.In the bowl of your mixer, combine the sorghum flour, starches, xanthan gum, onion and garlic powders, salt, sugar, and instant yeast.Add the milk substitute, oil, and vinegar and beat on medium speed for 1 minute.Add the dough to the plastic bag, pressing the dough into the cut corner and twisting the bag closed behind the dough. Squeeze the dough onto the baking sheet in 6 inch long ropes.Brush the tops with the beaten egg white.Place the baking sheet into a cold oven and set the temperature to 400\xb0. Begin timing when the oven is turned on and bake about 15 minutes or until lightly browned.Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/breadsticks-dairy-free-558099', u'dishTypes': [u'fingerfood', u'side dish', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}