{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/216523-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 110, u'id': 216523, u'veryPopular': False, u'lowFodmap': False, u'title': u'Double-the-love chocolate cake', u'diets': [], u'preparationMinutes': 120, u'pricePerServing': 62.92, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp bicarbonate of soda', u'aisle': u'Baking', u'name': u'bicarbonate of soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'550g softened butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 550.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'400ml buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'solid', u'id': 1230, u'unit': u'ml'}, {u'originalString': u'2 x 200g bars white chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate candy bars', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 10019904, u'unit': u''}, {u'originalString': u'200g plain chocolate', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19081, u'unit': u'g'}, {u'originalString': u'100g cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19165, u'unit': u'g'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'550g icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 550.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'700g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 700.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'800g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'2-3 x 80g bags white chocolate buttons, flowers and ribbons, optional', u'aisle': u'Tea and Coffee', u'name': u'tea bags', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111111, u'unit': u''}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1276636/doublethelove-chocolate-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Grease and line the base and sides ofdeep, round 20cm and 15cm cake tinswith baking parchment – making sure thepaper comes a few cms above the sides.Boil the kettle. Put half the butter andchocolate in a pan and gently melt,stirring.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Mix together half of the flour,sugar, cocoa and bicarb with a pinchof salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk 2 of the eggs and 200mlbuttermilk together. Scrape the meltedchocolate mixture and egg mixture intothe dry ingredients.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 150ml boilingwater and whizz everything togetherwith an electric whisk until lump-free.Divide between the tins and bake for40-45 mins, swapping round after30 mins if they’re on different shelves(the 15cm one should be done after40 mins). To test they’re cooked, push ina skewer and check it comes out clean.Cool the cakes in their tins.Repeat steps 1 and 2 again, so youend up with 2 x 20cm cakes and2 x 15cm cakes.Melt the white chocolate in a bowl overa pan of barely simmering water. Beattogether the butter and icing sugar, thenbeat in the white chocolate. When thecakes are cool, split each one in half.Use the icing to sandwich back togetherso you end up with 2 x four-layeredcakes. Sit the 20cm cake on your servingplate and spread some more icing overthe top. Sit the smaller cake on top ofthat, and completely cover with icing.Decorate with the chocolate buttons.If you want to add some flowerschoose something edible, like roses.Make a posy, wrapping the stems ina little damp kitchen paper then somecling film, add a ribbon and add to thecake on the day of the wedding.', u'length': {u'number': 115, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 137, u'instructions': u'Heat oven to 180C/160C fan/gas 4.Grease and line the base and sides ofdeep, round 20cm and 15cm cake tinswith baking parchment – making sure thepaper comes a few cms above the sides.Boil the kettle. Put half the butter andchocolate in a pan and gently melt,stirring. Mix together half of the flour,sugar, cocoa and bicarb with a pinchof salt. Whisk 2 of the eggs and 200mlbuttermilk together. Scrape the meltedchocolate mixture and egg mixture intothe dry ingredients. Add 150ml boilingwater and whizz everything togetherwith an electric whisk until lump-free.Divide between the tins and bake for40-45 mins, swapping round after30 mins if they’re on different shelves(the 15cm one should be done after40 mins). To test they’re cooked, push ina skewer and check it comes out clean.Cool the cakes in their tins.Repeat steps 1 and 2 again, so youend up with 2 x 20cm cakes and2 x 15cm cakes.Melt the white chocolate in a bowl overa pan of barely simmering water. Beattogether the butter and icing sugar, thenbeat in the white chocolate. When thecakes are cool, split each one in half.Use the icing to sandwich back togetherso you end up with 2 x four-layeredcakes. Sit the 20cm cake on your servingplate and spread some more icing overthe top. Sit the smaller cake on top ofthat, and completely cover with icing.Decorate with the chocolate buttons.If you want to add some flowerschoose something edible, like roses.Make a posy, wrapping the stems ina little damp kitchen paper then somecling film, add a ribbon and add to thecake on the day of the wedding.', u'spoonacularSourceUrl': u'https://spoonacular.com/double-the-love-chocolate-cake-216523', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 230, u'servings': 25, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}