{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/206776-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206776, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Farro Risotto with Rapini', u'diets': [], u'pricePerServing': 372.04, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'\xbe cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 \xbd cups farro', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'farro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020005, u'unit': u'cups'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbd medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbe cup freshly grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'3 cups rapini, chopped', u'aisle': u'Produce', u'name': u'rapini', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11096, u'unit': u'cups'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'4 cups vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/05/farro-risotto-with-rapini-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour stock into a medium saucepan set over medium-low heat. Meanwhile, pour olive oil to a heavy-bottomed [lidded] saucepan set over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add onion and garlic and cook until onion is soft and translucent, three to four minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add farro and let toast for 30 seconds, stirring often.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}]}, {u'equipment': [], u'step': u'Pour in the white wine. Stir well, and let cook until wine has evaporated.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}]}, {u'equipment': [], u'step': u'2', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}], u'step': u'Add a few ladles full of the stock. Cook, stirring occasionally, until the liquid has evaporated. Continue adding stock a few ladles full at a time until farro is tender, about 25 minutes. You might not use all of the stock. With about ten minutes left on your timer, add the chopped rapini.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'id': 11096, u'name': u'broccoli rabe'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'When farro is done, turn off the heat, add the butter, cheese, and a pinch of salt and pepper. Stir well.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}]}, {u'equipment': [], u'step': u'Add more salt and pepper if needed at this point.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 11, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 47, u'instructions': u'Procedures                                                                              1                                                                            Pour stock into a medium saucepan set over medium-low heat. Meanwhile, pour olive oil to a heavy-bottomed [lidded] saucepan set over medium heat. Add onion and garlic and cook until onion is soft and translucent, three to four minutes. Add farro and let toast for 30 seconds, stirring often. Pour in the white wine. Stir well, and let cook until wine has evaporated.                                                                                                                             2                                                                            Add a few ladles full of the stock. Cook, stirring occasionally, until the liquid has evaporated. Continue adding stock a few ladles full at a time until farro is tender, about 25 minutes. You might not use all of the stock. With about ten minutes left on your timer, add the chopped rapini.                                                                                                                              3                                                                            When farro is done, turn off the heat, add the butter, cheese, and a pinch of salt and pepper. Stir well. Add more salt and pepper if needed at this point. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-farro-risotto-with-rapini-206776', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}