{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/549102-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 549102, u'veryPopular': True, u'lowFodmap': False, u'title': u'Over the Top Burger', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 311.25, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 Large Avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'2 lbs Angus Beef, ground', u'aisle': u'Frozen;Meat', u'name': u'beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23572, u'unit': u'lbs'}, {u'originalString': u'Cheese (we used Colby Jack)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'(we used Colby Jack)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'lb'}, {u'originalString': u'2 Tablespoons plus 1 teaspoon Sweet Red Chili Sauce *see note', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [u'sweet', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6972, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 Teaspoon Garlic Powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'Teaspoon'}, {u'originalString': u'1/2 Teaspoon Garlic Salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062047, u'unit': u'Teaspoon'}, {u'originalString': u'Hamburger Buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18350, u'unit': u'servings'}, {u'originalString': u'1/2 Teaspoon Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'Teaspoon'}, {u'originalString': u'5 Tablespoons Light Mayonnaise', u'aisle': u'Condiments', u'name': u'light mayonnaise', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4641, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 Teaspoon Lime Juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'Teaspoon'}, {u'originalString': u'Zest of 1/2 Lime', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'of', u'unitShort': u'of', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'of'}, {u'originalString': u'1/2 Large Mango, chopped', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'1 Teaspoon Orange Juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u'Teaspoon'}, {u'originalString': u'Sauteed Peppers', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10111333, u'unit': u'servings'}, {u'originalString': u'Salt and Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2013/07/burger-mango-guacamole-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Pat out each burger, making an indentation in the center to avoid a puffy, dry burger and sprinkle with salt and pepper on each side. Get a paper towel and drizzle with canola oil. Holding the paper towel with tongs, wipe down the grill grate and heat to medium high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the burgers on the grill and walk away. Allow the burgers to cook without pressing down on them or turning until at least 5-6 minutes depending on the size of the burger. See note Flip the burgers and add the cheese, allow to cook for another 4-3 minutes.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Remove from the grill and either stack on a platter tented with foil or start assembling your burger.Ok, I like a slightly chunky guacamole and I think it's more authentic than these avocado sauces that I see. So, I remove the pit and scoop out each half into a bowl, add the lime, orange, salt and pepper, and garlic. Use a fork to slightly smash and mix that guacamole and then fold in the mango. *See note", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add all of the ingredients into a bowl and stir to combine.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Spread a little (or a lot if you're going for over the top slather that baby), add the burger, sauteed peppers, and guacamole then top with the bun lid. Enjoy!", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Belasco de Baquedano Llama Malbec with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'As its namesake, this wine embodies the distinctive spirit of our vineyards, spanning the foothills of the Andes. Llama is a rich ruby-purple color, and boasts elegant flavors of black berries, ripe plum and robust spices with good balance and structure.', u'title': u'Belasco de Baquedano Llama Malbec', u'price': u'$16.99', u'id': 449922, u'link': u'https://www.wine.com/product/belasco-de-baquedano-llama-malbec-2013/132727', u'imageUrl': u'https://spoonacular.com/productImages/449922-312x231.jpg'}]}, u'aggregateLikes': 1491, u'instructions': u"Pat out each burger, making an indentation in the center to avoid a puffy, dry burger and sprinkle with salt and pepper on each side. Get a paper towel and drizzle with canola oil. Holding the paper towel with tongs, wipe down the grill grate and heat to medium high heat. Place the burgers on the grill and walk away. Allow the burgers to cook without pressing down on them or turning until at least 5-6 minutes depending on the size of the burger. See note Flip the burgers and add the cheese, allow to cook for another 4-3 minutes. Remove from the grill and either stack on a platter tented with foil or start assembling your burger.Ok, I like a slightly chunky guacamole and I think it's more authentic than these avocado sauces that I see. So, I remove the pit and scoop out each half into a bowl, add the lime, orange, salt and pepper, and garlic. Use a fork to slightly smash and mix that guacamole and then fold in the mango. *See noteAdd all of the ingredients into a bowl and stir to combine. Spread a little (or a lot if you're going for over the top slather that baby), add the burger, sauteed peppers, and guacamole then top with the bun lid. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/over-the-top-burger-549102', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}