{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/534130-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 534130, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Yakitori', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 135.06, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'8 Bamboo skewers, soaked in water for 1 hour', u'aisle': u'Ethnic Foods', u'name': u'bamboo shoots', u'metaInformation': [u'for 1 hour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11028, u'unit': u''}, {u'originalString': u'4 Chicken thighs, skinned, boned, 1” by 1 \xbc” pieces', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5091, u'unit': u''}, {u'originalString': u'1 tsp Fresh ginger root, grated', u'aisle': u'Produce', u'name': u'fresh ginger root', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'\xbd cup Mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93830, u'unit': u'cup'}, {u'originalString': u'1 cup Onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'\xbc cup Sake', u'aisle': u'Alcoholic Beverages', u'name': u'sake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 43479, u'unit': u'cup'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'\xbc cup Shoyu', u'aisle': u'Ethnic Foods;Condiments', u'name': u'shoyu', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16123, u'unit': u'cup'}, {u'originalString': u'2 tbsp Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.jessicagavin.com/test-kitchen/appetizers/chicken-yakitori-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'To make basting sauce, over medium heat, combine the mirin and sake for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'id': 43479, u'name': u'sake'}]}, {u'equipment': [], u'step': u'Add shoyu and sugar; stir to dissolve the sugar.Cook over low heat for 25 minutes; cool before using.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16123, u'name': u'shoyu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Combine remaining ingredients with sauce and marinate 1 hour.Preheat broiler or grill.Thread the chicken on skewers and season with salt.Grill (broil) for 3 minutes on each side, basting frequently with the marinade.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve immediately', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sake, and Sauvignon Blanc are my top picks for Yakitori. Sak\xe9 is an obvious choice when it comes to Japanese food. If you want to stick to grape wine, though, you might opt for sauvignon blanc or riesling. The Schmitt Sohne Relax Riesling with a 4.4 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'riesling', u'sake', u'sauvignon blanc'], u'productMatches': [{u'description': u'Relax Riesling is fermented slightly dry with a wonderful fruity bouquet and intense flavors of apples and peaches with just a hint of citrus. The natural acidity gives this wine a perfect balance that is refreshingly crisp and leaves your mouth watering. A perfect party wine, or can be enjoyed with a variety of foods from seafood and poultry to oriental food and fresh salads.', u'title': u'Schmitt Sohne Relax Riesling', u'price': u'$9.49', u'id': 434166, u'link': u'https://www.wine.com/product/schmitt-sohne-relax-riesling-2008/99841', u'imageUrl': u'https://spoonacular.com/productImages/434166-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'To make basting sauce, over medium heat, combine the mirin and sake for 5 minutes. Add shoyu and sugar; stir to dissolve the sugar.Cook over low heat for 25 minutes; cool before using.Combine remaining ingredients with sauce and marinate 1 hour.Preheat broiler or grill.Thread the chicken on skewers and season with salt.Grill (broil) for 3 minutes on each side, basting frequently with the marinade. Serve immediately', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-yakitori-534130', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 16, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}