{u'recipes': [{u'sourceName': u'My San Francisco Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/516515-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 516515, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pistachio Crusted Fish', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 374.13, u'creditText': u'My San Francisco Kitchen', u'extendedIngredients': [{u'originalString': u'\xbc cup cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'\xbd cup shelled pistachios', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 boneless, skinless tilapia fillets', u'aisle': u'Seafood', u'name': u'tilapia', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 3.0, u'consistency': u'solid', u'id': 15261, u'unit': u'fillet'}], u'healthScore': 57.0, u'imageType': u'png', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.mysanfranciscokitchen.com/pistachio-crusted-fish/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Rinse tilapia fillets and place in a shallow bowl filled with milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'id': 15261, u'name': u'tilapia fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Let stand 10 minutes, then turn over and let stand another 10 minutes. In the meantime, coarsely grind pistachios in a mini food processor or chopper (you can also chop finely by hand). I used my magic bullet.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}]}, {u'equipment': [], u'step': u'Transfer ground up pistachios to a large plat and mix in corn meal with a fork.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a few tablespoons of olive oil over medium high heat (should not be smoking) in a large skillet.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Remove the fillets from the milk one at a time and sprinkle both sides with salt and pepper.Press each side into the pistachio cornmeal mixture until each side is well coated.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place into the skillet and fry each side about 4 minutes. Check underneath to make sure the crust is not burning-if it is, turn down the heat!When done the crust should be golden brown and crispy, and the fillet should be opaque and flake easily.Slice a fresh lemon and place on top of each fillet.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Maso Canali Pinot Grigio with a 4.6 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 293, u'instructions': u'Rinse tilapia fillets and place in a shallow bowl filled with milk. Let stand 10 minutes, then turn over and let stand another 10 minutes. In the meantime, coarsely grind pistachios in a mini food processor or chopper (you can also chop finely by hand). I used my magic bullet. Transfer ground up pistachios to a large plat and mix in corn meal with a fork. Heat a few tablespoons of olive oil over medium high heat (should not be smoking) in a large skillet.Remove the fillets from the milk one at a time and sprinkle both sides with salt and pepper.Press each side into the pistachio cornmeal mixture until each side is well coated.Place into the skillet and fry each side about 4 minutes. Check underneath to make sure the crust is not burning-if it is, turn down the heat!When done the crust should be golden brown and crispy, and the fillet should be opaque and flake easily.Slice a fresh lemon and place on top of each fillet.', u'spoonacularSourceUrl': u'https://spoonacular.com/pistachio-crusted-fish-516515', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}