{u'recipes': [{u'sourceName': u'Who Needs a Cape', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521009-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 521009, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shamrock No-Bake Cake Batter Truffles', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 67.93, u'creditText': u'Who Needs a Cape', u'extendedIngredients': [{u'originalString': u'16 oz. milk or white chocolate coating', u'aisle': u'Baking', u'name': u'chocolate coating', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 98857, u'unit': u'oz'}, {u'originalString': u'1-1/2 c. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'5-6 drops, green food coloring', u'aisle': u'Sweet Snacks', u'name': u'gum drops', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spice-drops-or-gumdrops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 19106, u'unit': u''}, {u'originalString': u'3-4 tbsp. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'2 tsp. peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022050, u'unit': u'tsp'}, {u'originalString': u'Pop sticks or fork (for dipping)', u'aisle': u'Savory Snacks', u'name': u'pop corn', u'metaInformation': [u'(for dipping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'stick', u'unitShort': u'sticks', u'amount': 1.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'sticks'}, {u'originalString': u'1/8 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Holiday sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1/2 c. unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'c'}, {u'originalString': u'1/8 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 c. white cake mix', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'c'}, {u'originalString': u'1/2 c. white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://whoneedsacape.com/2013/03/shamrock-no-bake-cake-batter-truffles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'For the truffles: Beat together butter and sugar using an electric mixer until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add cake mix, flour, salt, peppermint extract and vanilla extract and mix thoroughly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1022050, u'name': u'peppermint extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add 3–4 tbsp. of milk (I used 3) if needed to make a dough consistency.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Mix in sprinkles by hand.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Roll dough into one-inch balls and place on parchment or wax paper on a cookie sheet. Chill balls in the refrigerator for 15 minutes to firm up.For the coating: While dough balls are chilling, melt chocolate coating in the microwave in 30 second intervals until melted. Stir between intervals.Using a pop stick or fork, dip truffles into melted chocolate and gently twirl or tap to remove excess coating.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place truffle back on cookie sheet and top with sprinkles. Repeat with remaining balls until finished.Chill truffles in the refrigerator until ready to serve.Makes approximately 24–30 truffles.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 4254, u'instructions': u'For the truffles: Beat together butter and sugar using an electric mixer until combined. Add cake mix, flour, salt, peppermint extract and vanilla extract and mix thoroughly. Add 3–4 tbsp. of milk (I used 3) if needed to make a dough consistency. Mix in sprinkles by hand.Roll dough into one-inch balls and place on parchment or wax paper on a cookie sheet. Chill balls in the refrigerator for 15 minutes to firm up.For the coating: While dough balls are chilling, melt chocolate coating in the microwave in 30 second intervals until melted. Stir between intervals.Using a pop stick or fork, dip truffles into melted chocolate and gently twirl or tap to remove excess coating. Place truffle back on cookie sheet and top with sprinkles. Repeat with remaining balls until finished.Chill truffles in the refrigerator until ready to serve.Makes approximately 24–30 truffles.', u'spoonacularSourceUrl': u'https://spoonacular.com/shamrock-no-bake-cake-batter-truffles-521009', u'dishTypes': [u'dessert'], u'occasions': [u'st patricks day'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}