{u'recipes': [{u'sourceName': u'Culinary Covers', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/491499-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 491499, u'veryPopular': False, u'lowFodmap': False, u'title': u'Irish Coffee Cups', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 225.44, u'creditText': u'Culinary Covers', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'9 tablespoons (125g) butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 tablespoon coffee extract (essence) (ideally Camp or Irel brand)', u'aisle': u'Baking', u'name': u'coffee extract', u'metaInformation': [u'(essence)', u'(ideally Camp or Irel brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 13111111, u'unit': u'tablespoon'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'10 tablespoons (125g) superfine (caster) or granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'(caster)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1/2 cup packed (125g) light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'1 cup (125g) all-purpose (plain) flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain', u'all-purpose', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'6 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup (150ml) heavy or whipping (double or regular) cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [u'(double or regular)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'ml'}, {u'originalString': u'4 tablespoons whiskey (preferably Irish)', u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [u'(preferably Irish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 14052, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.culinarycovers.com/2013/12/irish-coffee-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350-degrees Fahrenheit (180 Celcius/Gas mark 4), and butter the insides of four small ovenproof teacups or four 2 1/2-inch (6cm) diameter ramekins, if you intend to tip the cakes out of them for serving.Cream the butter until soft in a large bowl or with an electric stand mixer with the paddle attachment.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the brown sugar and beat until the mixture is light and fluffy.2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the eggs with the coffee extract in a small bowl for just a few seconds until mixed, then gradually add to the creamed butter mixture, beating all the time. Sift in the flour and baking powder and fold in gently to combine.3. Divide the mixture among the teacups or ramekins and place these in a deep-sided ovenproof dish or roasting pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 13111111, u'name': u'coffee extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour boiling water into the dish so it comes to halfway up the sides of the cups.4.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Bake for 25 to 30 minutes, until the center of each cake is springy to the touch.5. While the cakes are baking, make the sauce.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Combine the superfine sugar and water in a saucepan and bring to a boil, stirring to dissolve the sugar as the mixture heats up. Turn the heat up to high and continue to boil, but without stirring, until the syrup becomes a deep golden caramel color. Cook the sauce just to the point when it starts smoking. (If it's not cooked enough you won't get a strong enough caramel flavor, but if overcooked it will taste slightly bitter.) You may need to swirl the pan, rather than stirring the mixture, toward the end of caramelizing to ensure it cooks evenly.6. Turn down the heat and immediately stir in the cream and whiskey, taking care as it may bubble and split; then set aside. You may need to whisk it for a few seconds over low heat to help the caramel dissolve into the cream and whiskey.7. When the cakes are done, remove from the oven and allow to cool for a couple of minutes.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Place on saucers or serving plates, or tip them out onto warm plates if you prefer. To serve, pour a tablespoon of the warm whiskey sauce over each, then top that with a spoonful of softly whipped cream.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 232, u'instructions': u"1. Preheat the oven to 350-degrees Fahrenheit (180 Celcius/Gas mark 4), and butter the insides of four small ovenproof teacups or four 2 1/2-inch (6cm) diameter ramekins, if you intend to tip the cakes out of them for serving.Cream the butter until soft in a large bowl or with an electric stand mixer with the paddle attachment. Add the brown sugar and beat until the mixture is light and fluffy.2. Whisk the eggs with the coffee extract in a small bowl for just a few seconds until mixed, then gradually add to the creamed butter mixture, beating all the time. Sift in the flour and baking powder and fold in gently to combine.3. Divide the mixture among the teacups or ramekins and place these in a deep-sided ovenproof dish or roasting pan. Pour boiling water into the dish so it comes to halfway up the sides of the cups.4. Bake for 25 to 30 minutes, until the center of each cake is springy to the touch.5. While the cakes are baking, make the sauce. Combine the superfine sugar and water in a saucepan and bring to a boil, stirring to dissolve the sugar as the mixture heats up. Turn the heat up to high and continue to boil, but without stirring, until the syrup becomes a deep golden caramel color. Cook the sauce just to the point when it starts smoking. (If it's not cooked enough you won't get a strong enough caramel flavor, but if overcooked it will taste slightly bitter.) You may need to swirl the pan, rather than stirring the mixture, toward the end of caramelizing to ensure it cooks evenly.6. Turn down the heat and immediately stir in the cream and whiskey, taking care as it may bubble and split; then set aside. You may need to whisk it for a few seconds over low heat to help the caramel dissolve into the cream and whiskey.7. When the cakes are done, remove from the oven and allow to cool for a couple of minutes. Place on saucers or serving plates, or tip them out onto warm plates if you prefer. To serve, pour a tablespoon of the warm whiskey sauce over each, then top that with a spoonful of softly whipped cream.", u'spoonacularSourceUrl': u'https://spoonacular.com/irish-coffee-cups-491499', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u'st patricks day'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}