{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/754059-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 754059, u'veryPopular': True, u'lowFodmap': False, u'title': u'Potato Hash', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 35, u'pricePerServing': 95.66, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup chopped red bell peppers', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1/2 red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 russet potato, scrubbed', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoons'}, {u'originalString': u'1 sweet potato, scrubbed', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 cup chopped yellow squash', u'aisle': u'Produce', u'name': u'yellow squash', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11641, u'unit': u'cup'}, {u'originalString': u'1 cup chopped zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpeg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/potato-hash.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Pierce both potatoes a few times, put in the microwave and cook on high until cooked through, 5 to 10 minutes. Carefully remove the skin from the sweet potato. Dice both potatoes and set aside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a medium skillet, melt 2 tablespoons of the butter over medium heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the bell peppers, squash, zucchini and onions and cook for a few minutes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the diced potatoes to the veggies and cook until golden brown. Season with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a separate pan, melt the remaining tablespoon of butter over medium heat and crack in the eggs. Cook until the whites have set, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve up the hash with a fried egg on top of each portion.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1375, u'instructions': u'Watch how to make this recipe.                    Pierce both potatoes a few times, put in the microwave and cook on high until cooked through, 5 to 10 minutes. Carefully remove the skin from the sweet potato. Dice both potatoes and set aside.                          In a medium skillet, melt 2 tablespoons of the butter over medium heat. Add the bell peppers, squash, zucchini and onions and cook for a few minutes. Add the diced potatoes to the veggies and cook until golden brown. Season with salt and pepper.                          In a separate pan, melt the remaining tablespoon of butter over medium heat and crack in the eggs. Cook until the whites have set, 3 to 4 minutes.                          Serve up the hash with a fried egg on top of each portion.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-hash-754059', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}