{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758561-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758561, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chickpea, Beet, and Apple Panini', u'diets': [u'dairy free'], u'pricePerServing': 165.52, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'8 slices sesame semolina bread (8 oz.)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 18064, u'unit': u'oz'}, {u'originalString': u'1 \xbd cups cooked chickpeas, or 1 15-oz. can chickpeas, rinsed and drained', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16057, u'unit': u'cups'}, {u'originalString': u'1 tsp. chopped fresh tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh tarragon', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'tsp'}, {u'originalString': u'1 medium golden beet, peeled and sliced', u'aisle': u'Produce', u'name': u'golden beet', u'metaInformation': [u'medium', u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets-golden.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011080, u'unit': u''}, {u'originalString': u'1 Granny smith apple, thinly sliced', u'aisle': u'Produce', u'name': u'granny smith apple', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'1 Tbs. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbs'}, {u'originalString': u'4 Tbs. prepared black olive tapenade', u'aisle': u'Canned and Jarred', u'name': u'olive tapenade', u'metaInformation': [u'black', u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-tapenade.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 4.0, u'consistency': u'solid', u'id': 98862, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup broccoli or radish sprouts', u'aisle': u'Produce', u'name': u'radish sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11676, u'unit': u'cup'}, {u'originalString': u'3 Tbs. vegan mayonnaise', u'aisle': u'Condiments', u'name': u'vegan mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'liquid', u'id': 98975, u'unit': u'Tbs'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/chickpea-beet-and-apple-panini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Pulse chickpeas, mayonnaise, lemon juice, and tarragon in food processor until chunky.\xa0 2.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}]}, {u'equipment': [], u'step': u'Spread chickpea mixture on 4 bread slices. Top with beet and apple slices, and sprouts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread remaining 4 bread slices with tapenade; close sandwiches. 3. Spray panini with cooking spray. Coat skillet or grill pan with cooking spray; heat over medium heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place panini in pan; weight with smaller-diameter saucepan weighted with 2 cans. Cook 3 minutes. Flip, replace weight, and cook 2 minutes. (Or cook 4 minutes in panini maker.)', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 3018, u'instructions': u'1. Pulse chickpeas, mayonnaise, lemon juice, and tarragon in food processor until chunky.\xa0 2. Spread chickpea mixture on 4 bread slices. Top with beet and apple slices, and sprouts. Spread remaining 4 bread slices with tapenade; close sandwiches. 3. Spray panini with cooking spray. Coat skillet or grill pan with cooking spray; heat over medium heat. Place panini in pan; weight with smaller-diameter saucepan weighted with 2 cans. Cook 3 minutes. Flip, replace weight, and cook 2 minutes. (Or cook 4 minutes in panini maker.)', u'spoonacularSourceUrl': u'https://spoonacular.com/chickpea-beet-and-apple-panini-758561', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}