{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217173-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 217173, u'veryPopular': False, u'lowFodmap': False, u'title': u'Family meals: Easy fish cakes', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 64.67, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'handful of grated cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'handful'}, {u'originalString': u'75g frozen sweetcorn, defrosted', u'aisle': u'Produce', u'name': u'ear sweetcorn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 11167, u'unit': u'g'}, {u'originalString': u'1 large egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'olive oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'450g potatoes, peeled, large ones cut in half', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'large', u'peeled', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 450.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'1 x pack fish pie mix (cod, salmon, smoked haddock etc, weight around 320g-400g depending on pack size)', u'aisle': u'Baking', u'name': u'pumpkin pie mix', u'metaInformation': [u'smoked', u'(cod, salmon, haddock etc, weight around 320g-400g depending on pack size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11426, u'unit': u''}, {u'originalString': u'3 spring onions, finely chopped', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2303639/family-meals-easy-fish-cakes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the potatoes in boiling water until just tender.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain well and return to the pan on a low heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Heat for another minute or two to evaporate excess liquid. Mash the potato with a small knob of butter. Allow to cool.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the fish spring onions and milk in a shallow dish, cover with cling film and cook in the microwave for 1 \xbd - 2 mins until just cooked. If you don’t have a microwave, put everything in a saucepan and gently cook until just opaque and cooked through.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Drain the fish and spring onions through a fine sieve. Gently mix through the potatoes, avoiding breaking up the fish too much, along with the sweetcorn, cheddar and a generous grind of black pepper. Form into 6 - 8 patties. The cooler the mash potato is when you do this, the easier it will be to form the patties as the mixture will be very soft when warm.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Pour the egg on one plate and scatter flour on the other. Dip the patties in egg and then flour and arrange on a sheet of baking paper on a tray.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Put the patties in the fridge for at least half an hour to firm up if the patties feel very soft. At this point you can freeze the patties, wrapped individually. Defrost throughly before moving onto the next stage.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large frying pan with a generous glug of olive oil. When the oil is hot, carefully lower the fish cakes into the pan. Cook for 5 - 7 minutes or until golden brown underneath and then carefully flip them over. Fry for another 5 - 7 minutes or until golden on the bottom and heated all the way through.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 219, u'instructions': u'Cook the potatoes in boiling water until just tender. Drain well and return to the pan on a low heat. Heat for another minute or two to evaporate excess liquid. Mash the potato with a small knob of butter. Allow to cool.Put the fish spring onions and milk in a shallow dish, cover with cling film and cook in the microwave for 1 \xbd - 2 mins until just cooked. If you don’t have a microwave, put everything in a saucepan and gently cook until just opaque and cooked through.Drain the fish and spring onions through a fine sieve. Gently mix through the potatoes, avoiding breaking up the fish too much, along with the sweetcorn, cheddar and a generous grind of black pepper. Form into 6 - 8 patties. The cooler the mash potato is when you do this, the easier it will be to form the patties as the mixture will be very soft when warm. Pour the egg on one plate and scatter flour on the other. Dip the patties in egg and then flour and arrange on a sheet of baking paper on a tray. Put the patties in the fridge for at least half an hour to firm up if the patties feel very soft. At this point you can freeze the patties, wrapped individually. Defrost throughly before moving onto the next stage.Heat a large frying pan with a generous glug of olive oil. When the oil is hot, carefully lower the fish cakes into the pan. Cook for 5 - 7 minutes or until golden brown underneath and then carefully flip them over. Fry for another 5 - 7 minutes or until golden on the bottom and heated all the way through.', u'spoonacularSourceUrl': u'https://spoonacular.com/family-meals-easy-fish-cakes-217173', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}