{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/549587-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 3, u'id': 549587, u'veryPopular': True, u'lowFodmap': True, u'title': u'Gorgonzola Butternut Squash Ravioli', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 120, u'pricePerServing': 20.76, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'1 stick butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'3 pounds Butternut Squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 11485, u'unit': u'pounds'}, {u'originalString': u'1 Egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 pounds fresh pasta dough, rolled into sheets', u'name': u'fresh pasta dough', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dough.jpg', u'unitLong': u'poundssheets', u'unitShort': u'poundssheets', u'amount': 2.0, u'consistency': u'solid', u'id': 10118334, u'unit': u'poundssheets'}, {u'originalString': u'8 ounces Gorgonzola Cheese, crumbled', u'aisle': u'Cheese', u'name': u'gorgonzola cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1011004, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoons Nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup Parmesan Cheese, shredded and packed', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 Sage leaves, chopped', u'aisle': u'Spices and Seasonings', u'name': u'sage leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'salt + pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 48.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'salt +pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 48.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup Mozzarella Cheese, shredded and packed', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.halfbakedharvest.com/gorgonzola-butternut-squash-ravioli/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.Peel the squash and cut into cubes and placing them on a baking sheet.  Coat them with olive oil, salt & pepper.  Roast the squash at 400 degrees for 45 minutes until it is tender.Allow to cool for 15 minutes or so.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Transfer squash to a food processor add the egg, gorgonzola cheese, mozzarella cheese and parmesan cheese. Puree until smooth.Taste and season with salt and pepper.Lightly flour your ravioli mold or counter. Lay one sheet of pasta on the mold, making sure the entire mold is covered.  Take a tablespoon of filling and place into each well.  Spritz the pasta sheet with a little water. Lay the second sheet on top and run a rolling pin over to seal.  Turn the mold over and release the ravioli.  They will not be separated.  Use a fluted pastry wheel to cut apart.  Lay the ravioli on a floured baking pan and continue making ravioli until you've used all the pasta sheets. Make sure to cover the raviolis as you work.*", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'id': 1011004, u'name': u'gorgonzola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large pot of water for the ravioli.For the sauce, melt the butter in a sauce pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add sage leaves and nutmeg. Cook on medium-low for 2-3 minutes, just until the butter starts to brown.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'Remove from the heat and set aside.Cook the ravioli in the boiling water for 2 minutes, until it is floating.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from water and add directly to butter sauce.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve with freshly grated parmesan cheese', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Ruffino Riserva Ducale Oro Chianti Classico. It has 4.3 out of 5 stars and a bottle costs about 35 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with garnet hues. The wine expresses a distinctive Tuscan bouquet of violet, cherry, and plum, with aromas of chocolate and spice. Intense aromas of violet, blackberry, cherry, and ripe plum with intriguing notes of cinnamon and clove. Classic elegance and structure in which the fruit, tannins, and spices form a tightly woven balance, with a lingering fi nish of chocolate and coffee.Pairs exquisitely with traditional Italian dishes such as a classic bisteca Fiorentina, pasta Bolognese, wild boar ragu, and eggplant Parmesan. It’s also wonderful with dishes such as grilled ribeye and roasted vegetables.', u'title': u'Ruffino Riserva Ducale Oro Chianti Classico', u'price': u'$34.99', u'id': 442701, u'link': u'https://www.wine.com/product/ruffino-riserva-ducale-oro-chianti-classico-2011/166890', u'imageUrl': u'https://spoonacular.com/productImages/442701-312x231.jpg'}]}, u'aggregateLikes': 1069, u'instructions': u"Preheat oven to 400 degrees.Peel the squash and cut into cubes and placing them on a baking sheet.  Coat them with olive oil, salt & pepper.  Roast the squash at 400 degrees for 45 minutes until it is tender.Allow to cool for 15 minutes or so.Transfer squash to a food processor add the egg, gorgonzola cheese, mozzarella cheese and parmesan cheese. Puree until smooth.Taste and season with salt and pepper.Lightly flour your ravioli mold or counter. Lay one sheet of pasta on the mold, making sure the entire mold is covered.  Take a tablespoon of filling and place into each well.  Spritz the pasta sheet with a little water. Lay the second sheet on top and run a rolling pin over to seal.  Turn the mold over and release the ravioli.  They will not be separated.  Use a fluted pastry wheel to cut apart.  Lay the ravioli on a floured baking pan and continue making ravioli until you've used all the pasta sheets. Make sure to cover the raviolis as you work.*Heat a large pot of water for the ravioli.For the sauce, melt the butter in a sauce pan.  Add sage leaves and nutmeg. Cook on medium-low for 2-3 minutes, just until the butter starts to brown.  Remove from the heat and set aside.Cook the ravioli in the boiling water for 2 minutes, until it is floating.  Remove from water and add directly to butter sauce.Serve with freshly grated parmesan cheese", u'spoonacularSourceUrl': u'https://spoonacular.com/gorgonzola-butternut-squash-ravioli-549587', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 123, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}