{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/223929-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 223929, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thai sticky chicken & ribs', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 539.82, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u"1 red bird's-eye chilli, finely sliced", u'aisle': u'Produce;Ethnic Foods', u'name': u"bird's eye chilli", u'metaInformation': [u'red', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11670, u'unit': u''}, {u'originalString': u'8 tbsp palm or soft brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'4 chicken thighs, skin on', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5091, u'unit': u''}, {u'originalString': u'2 tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'steamed rice, to serve', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'steamed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'small bunch coriander with stems, stems chopped and leaves used for the dipping sauce', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'with stems, stems chopped and leaves used for the dipping sauce', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'bunch'}, {u'originalString': u'1 tbsp fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tbsp'}, {u'originalString': u'handful coriander leaves (from coriander in the marinade), chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander leaves', u'metaInformation': [u'chopped', u'(from coriander in the marinade)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, finely sliced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3cm/1 \xbc inch piece ginger, chopped', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 1.25, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'3 small green chillies, chopped', u'aisle': u'Produce', u'name': u'green chillies', u'metaInformation': [u'green', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'1 tsp ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}, {u'originalString': u'juice 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'2 slabs pork loin ribs, about 1kg 2lb 4oz', u'aisle': u'Meat', u'name': u'pork ribs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-ribs.jpg', u'unitLong': u'slabs', u'unitShort': u'slabs', u'amount': 2.0, u'consistency': u'solid', u'id': 10204, u'unit': u'slabs'}, {u'originalString': u'2 tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'200g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'3 tbsp white vinegar (rice or wine)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white', u'(rice or wine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tbsp'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1377637/thai-sticky-chicken-and-ribs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'To make the marinade, put the chillies, coriander stalks, garlic, ginger, turmeric, soy sauce, fish sauce, sugar and honey in a food processor. Whizz to a rough paste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Cut each chicken thigh into 2 pieces down the side of bone (so one side keeps the bone). Put all the chicken and ribs in a ceramic dish or suitable plastic container and pour over the marinade. Turn the meat over so it is coated, cover and put it in the fridge until needed (up to 24 hrs).Make the sauce.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the sugar in a pan with 250ml water, bring to the boil, simmer for a few mins to make a sugar syrup, then stir in garlic, vinegar, lime juice, fish sauce and chilli. Cool, then stir in coriander. Will keep for 24 hrs in the fridge.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 160C/140C fan/gas 3. Lift the ribs into a baking dish, cover with foil and put in the oven for 1 hr.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Add the chicken pieces around the ribs, turn up the oven to 200C/180C fan/gas 6 and cook, uncovered, for 20 mins or so until the chicken is cooked through. By now the surface of the ribs and chicken should be quite brown and the marinade slightly sticky; if it isn’t, put the lot under the grill – but keep an eye on it.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the ribs into sections and pile onto a platter with the chicken, drizzle over some sauce and serve the rest alongside with the salad and some steamed rice.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220445, u'name': u'cooked rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 65, u'instructions': u'To make the marinade, put the chillies, coriander stalks, garlic, ginger, turmeric, soy sauce, fish sauce, sugar and honey in a food processor. Whizz to a rough paste. Cut each chicken thigh into 2 pieces down the side of bone (so one side keeps the bone). Put all the chicken and ribs in a ceramic dish or suitable plastic container and pour over the marinade. Turn the meat over so it is coated, cover and put it in the fridge until needed (up to 24 hrs).Make the sauce. Put the sugar in a pan with 250ml water, bring to the boil, simmer for a few mins to make a sugar syrup, then stir in garlic, vinegar, lime juice, fish sauce and chilli. Cool, then stir in coriander. Will keep for 24 hrs in the fridge.Heat oven to 160C/140C fan/gas 3. Lift the ribs into a baking dish, cover with foil and put in the oven for 1 hr. Add the chicken pieces around the ribs, turn up the oven to 200C/180C fan/gas 6 and cook, uncovered, for 20 mins or so until the chicken is cooked through. By now the surface of the ribs and chicken should be quite brown and the marinade slightly sticky; if it isn’t, put the lot under the grill – but keep an eye on it.Cut the ribs into sections and pile onto a platter with the chicken, drizzle over some sauce and serve the rest alongside with the salad and some steamed rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-sticky-chicken-ribs-223929', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}