{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577576-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 577576, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Artichoke Gratin', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 165.33, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'1/4 cup plain breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon coarse ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup freshly grated Gruyere cheese', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1023, u'unit': u'cup'}, {u'originalString': u'1 14.75 oz jar Marinated Artichoke Hearts', u'aisle': u'Canned and Jarred', u'name': u'marinated artichoke hearts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.75, u'consistency': u'solid', u'id': 93828, u'unit': u'oz'}, {u'originalString': u'1 teaspoon Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.simplyscratch.com/2014/06/easy-artichoke-gratin.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 400 degrees and drizzle one teaspoon of olive oil into the bottom of an oven-safe baking dish.In a small 8-inch skillet, add the butter and heat over medium heat. Continue to heat the butter until it turns lightly golden in color and smells nutty.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add in the breadcrumbs and stir to coat until the breadcrumbs have absorbed all the browned butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the skillet from the heat and set off to the side In a medium bowl combine the marinated artichoke hearts with chopped fresh parsley and black pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'marinated artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the artichoke hearts evenly on the bottom of the prepared oven-safe baking dish. Sprinkle the Gruyere cheese over top of the artichoke hearts, top with the browned butter breadcrumbs and bake for 10-15 minutes or until the cheese is bubbly and the breadcrumbs are a deeper golden.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'id': 1023, u'name': u'gruyere'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve and enjoy!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 67, u'instructions': u'Preheat your oven to 400 degrees and drizzle one teaspoon of olive oil into the bottom of an oven-safe baking dish.In a small 8-inch skillet, add the butter and heat over medium heat. Continue to heat the butter until it turns lightly golden in color and smells nutty. Add in the breadcrumbs and stir to coat until the breadcrumbs have absorbed all the browned butter. Remove the skillet from the heat and set off to the side In a medium bowl combine the marinated artichoke hearts with chopped fresh parsley and black pepper. Place the artichoke hearts evenly on the bottom of the prepared oven-safe baking dish. Sprinkle the Gruyere cheese over top of the artichoke hearts, top with the browned butter breadcrumbs and bake for 10-15 minutes or until the cheese is bubbly and the breadcrumbs are a deeper golden.Serve and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-artichoke-gratin-577576', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}