{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/177822-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 177822, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Black Bean Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 140.84, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'1 can (15 oz) Progresso\xae black beans, drained, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'progresso\xae', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'8 cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'2 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 cups shredded pizza cheese blend (8 oz)', u'aisle': u'Cheese', u'name': u'pizza cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93651, u'unit': u'oz'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon dried oregano leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'3 to 4 dashes red pepper sauce', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'dashes'}, {u'originalString': u'1 can (11 oz) Pillsbury\xae refrigerated thin pizza crust', u'aisle': u'Refrigerated', u'name': u'refrigerated pizza crust', u'metaInformation': [u'refrigerated', u'thin', u'pillsbury\xae', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 93610, u'unit': u'oz'}, {u'originalString': u'1/4 cup ranch dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}, {u'originalString': u'2 cups shredded romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'https://www.bettycrocker.com/recipes/easy-black-bean-pizza/79771d82-c149-48f8-bb32-2d30cc07075f', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 400\xb0F. Spray or grease 15x10-inch or larger dark or nonstick cookie sheet. Unroll dough onto cookie sheet. Starting at center, press dough into 15x10-inch rectangle.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, in 10-inch skillet, heat oil over medium heat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add garlic and oregano; cook 30 seconds. Stir in black beans and pepper sauce.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Add water; cook until reduced by half. Using potato masher or fork, mash beans into a paste. Taste for seasoning; add salt or additional pepper sauce to taste.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Spread bean mixture evenly over partially baked crust. Top evenly with cheese.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 8 to 10 minutes longer or until crust is golden brown and cheese has melted.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Cut pizza into 4 rows by 3 rows to make 12 squares. Top each with lettuce, tomatoes and a drizzle of ranch dressing.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Felsina Chianti Colli Senesi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 21 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'1                               Heat oven to 400\xb0F. Spray or grease 15x10-inch or larger dark or nonstick cookie sheet. Unroll dough onto cookie sheet. Starting at center, press dough into 15x10-inch rectangle. Bake 5 minutes.                                                          2                               Meanwhile, in 10-inch skillet, heat oil over medium heat. Add garlic and oregano; cook 30 seconds. Stir in black beans and pepper sauce. Add water; cook until reduced by half. Using potato masher or fork, mash beans into a paste. Taste for seasoning; add salt or additional pepper sauce to taste.                                                          3                               Spread bean mixture evenly over partially baked crust. Top evenly with cheese.                                                          4                               Bake 8 to 10 minutes longer or until crust is golden brown and cheese has melted.                                                          5                               Cut pizza into 4 rows by 3 rows to make 12 squares. Top each with lettuce, tomatoes and a drizzle of ranch dressing.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-black-bean-pizza-177822', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}