{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/875033-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 875033, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skillet Roasted Chicken', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 3, u'pricePerServing': 104.34, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'6-8 chicken thighs, skin on', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5091, u'unit': u''}, {u'originalString': u'1-2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'fresh thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprig', u'unitShort': u'sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'6 whole garlic cloves, peeled', u'aisle': u'Produce', u'name': u'whole garlic cloves', u'metaInformation': [u'whole', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'https://addapinch.com/skillet-roasted-chicken-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 475 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Heat 12-inch cast iron skillet over medium-high heat on stove or cooktop.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drizzle in olive oil and heat, but do not overheat to allow it to smoke. Sprinkle salt and pepper on chicken thighs and place the chicken skin side down into skillet. Cook 2 minutes or until chicken skin has browned. Turn and reduce heat to medium. Cook chicken until fat has rendered off, about 10-12 more minutes.Sprinkle chicken with paprika, nestle in whole garlic cloves throughout chicken thighs, and top with thyme sprigs.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place in oven and roast until chicken temperature registers 160 F when checked with an internal temperature prob, about 12-13 more minutes.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to rest for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Roasted Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Preheat oven to 475 degrees.Heat 12-inch cast iron skillet over medium-high heat on stove or cooktop. Drizzle in olive oil and heat, but do not overheat to allow it to smoke. Sprinkle salt and pepper on chicken thighs and place the chicken skin side down into skillet. Cook 2 minutes or until chicken skin has browned. Turn and reduce heat to medium. Cook chicken until fat has rendered off, about 10-12 more minutes.Sprinkle chicken with paprika, nestle in whole garlic cloves throughout chicken thighs, and top with thyme sprigs. Place in oven and roast until chicken temperature registers 160 F when checked with an internal temperature prob, about 12-13 more minutes. Remove from oven and allow to rest for about 5 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-roasted-chicken-875033', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}