{u'recipes': [{u'sourceName': u'Budget Gourmet Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496100-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 496100, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet and Spicy Pork Stir-Fry', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 157.96, u'creditText': u'Budget Gourmet Mom', u'extendedIngredients': [{u'originalString': u'1 tblsp apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u''}, {u'originalString': u'1 large bell pepper, sliced into strips', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'large', u'sliced into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 head of broccoli, cut into bite size florets', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'cut into bite size florets'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11090, u'unit': u'head'}, {u'originalString': u'1 tblsp light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u''}, {u'originalString': u'1 tblsp canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u''}, {u'originalString': u'1/4 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 tsp corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'1 clove of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/2 tsp ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'2 heaping tablespoons orange marmalade', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'orange marmalade', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-marmalade.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19303, u'unit': u'tablespoons'}, {u'originalString': u'2-3 large pork chops, 5-6 oz each', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'1 medium red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.budgetgourmetmom.com/sweet-and-spicy-pork-stir-fry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat a skillet over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add oil.Slice the pork chops into 1" strips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to skillet and brown, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the vegetables and gently toss.  Cook until vegetables are tender, 4-5 minutes. In a small bowl combine the soy sauce, broth, vinegar, brown sugar, ginger, red pepper, and garlic.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the corn starch and mix until smooth.  Stir in marmalade.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Add the sauce to the meat and vegetables.  Bring to a boil and cook until sauce has slightly thickened.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately over rice.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 106, u'instructions': u'Preheat a skillet over medium-high heat.  Add oil.Slice the pork chops into 1" strips.  Add to skillet and brown, about 2 minutes.Add the vegetables and gently toss.  Cook until vegetables are tender, 4-5 minutes. In a small bowl combine the soy sauce, broth, vinegar, brown sugar, ginger, red pepper, and garlic.  Add the corn starch and mix until smooth.  Stir in marmalade.Add the sauce to the meat and vegetables.  Bring to a boil and cook until sauce has slightly thickened.Serve immediately over rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-spicy-pork-stir-fry-496100', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}