{u'recipes': [{u'sourceName': u'Sugar Free Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556945-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 556945, u'veryPopular': True, u'lowFodmap': True, u'title': u'Sugar-Free & Dairy Free Chocolate Coconut MilkShake', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 182.97, u'creditText': u'Sugar Free Mom', u'extendedIngredients': [{u'originalString': u'1 cup dairy free chocolate ice cream', u'aisle': u'Frozen', u'name': u'chocolate ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-ice-cream.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19270, u'unit': u'cup'}, {u'originalString': u'1 teaspoon liquid coconut stevia', u'aisle': u'Baking', u'name': u'liquid stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia-drops.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10811111, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoon unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoon'}, {u'originalString': u'1 cup unsweetened coconut milk', u'aisle': u'Canned and Jarred', u'name': u'unsweetened coconut milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'cup'}, {u'originalString': u'\xbd cup unsweetened shredded coconut', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.sugarfreemom.com/recipes/sugar-free-dairy-free-chocolate-coconut-milkshake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Let your ice cream soften about 15-20 minutes on the counter if not made for this recipe or once made in ice cream maker scoop right into your blender and freeze the rest of the ice cream for another time.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the rest of the ingredients into the blender and blend until incorporated.Top with DF whipped cream and chocolate syrup if desired!', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 584, u'instructions': u'Let your ice cream soften about 15-20 minutes on the counter if not made for this recipe or once made in ice cream maker scoop right into your blender and freeze the rest of the ice cream for another time.Add the rest of the ingredients into the blender and blend until incorporated.Top with DF whipped cream and chocolate syrup if desired!', u'spoonacularSourceUrl': u'https://spoonacular.com/sugar-free-dairy-free-chocolate-coconut-milkshake-556945', u'dishTypes': [u'dessert', u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}