{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/195787-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 195787, u'veryPopular': True, u'lowFodmap': False, u'title': u'Whiskey Wieners', u'diets': [u'dairy free'], u'pricePerServing': 104.19, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 cup bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'cup'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'3 pounds cocktail wieners (or you can use hot dogs cut into bite-sized pieces)', u'aisle': u'Meat', u'name': u'wieners', u'metaInformation': [u'cut into bite-sized pieces)', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 21118, u'unit': u'pounds'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/02/whiskey-wieners-weenies-hot-dogs-party-food-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add ketchup, brown sugar, and bourbon to slow cooker and stir to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}, {u'equipment': [], u'step': u'Add wieners and cook on low for 6 hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Serve straight out of the cooker with toothpicks. Wieners can also be cooked on the stovetop.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine the ingredients in a large saucepan, then place it on top of a large skillet over low heat and cook at below a simmer for 6 hours.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Gewurztraminer, and ros\xe9 Wine are my top picks for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. The Schmitt Sohne Relax Riesling with a 4.4 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'Relax Riesling is fermented slightly dry with a wonderful fruity bouquet and intense flavors of apples and peaches with just a hint of citrus. The natural acidity gives this wine a perfect balance that is refreshingly crisp and leaves your mouth watering. A perfect party wine, or can be enjoyed with a variety of foods from seafood and poultry to oriental food and fresh salads. View More', u'title': u'Schmitt Sohne Relax Riesling', u'price': u'$9.49', u'id': 434166, u'link': u'https://www.wine.com/product/schmitt-sohne-relax-riesling-2008/99841', u'imageUrl': u'https://spoonacular.com/productImages/434166-312x231.jpg'}]}, u'aggregateLikes': 1851, u'instructions': u'Procedures                                                                              1                                                                            Add ketchup, brown sugar, and bourbon to slow cooker and stir to combine. Add wieners and cook on low for 6 hours. Serve straight out of the cooker with toothpicks. Wieners can also be cooked on the stovetop. Combine the ingredients in a large saucepan, then place it on top of a large skillet over low heat and cook at below a simmer for 6 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/whiskey-wieners-195787', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 360, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}