{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/217244-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 217244, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ravioli with squash & crunchy crumbs', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 185.84, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'85g fresh white breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'\xbd butternut squash, peeled and cut into small cubes', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'small', u'peeled', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'500ml pack cheese-filled ravioli', u'aisle': u'Refrigerated;Frozen', u'name': u'cheese ravioli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'solid', u'id': 93832, u'unit': u'ml'}, {u'originalString': u'pinch crushed chilli flakes', u'aisle': u'Spices and Seasonings', u'name': u'chilli flakes', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'small handful sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'zest 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'50g vegetarian parmesan -style cheese, (we used Twineham Grange Italian-style cheese), finely grated, plus extra to serve', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'italian-style', u'finely grated', u'(we used Twineham Grange cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3218/ravioli-with-squash-and-crunchy-crumbs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large pan and fry thesquash for 10 mins until golden, turning thecubes now and then.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the garlic and fryfor 1 min until softened.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 300ml water,the grated Parmesan, chilli flakes and lemonzest. Stir well, turn the heat down and cookfor 3-4 mins. Mash well and season to taste.In a small pan, heat the rest of the oil, thenstir in the breadcrumbs. Fry until golden,stirring every so often. Stir in the sage.Cook the ravioli according to packinstructions (they usually only take a few mins).', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'id': 93832, u'name': u'ravioli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain,then spoon into bowls.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over the squashsauce, then sprinkle with sage breadcrumbs.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Ricasoli Castello di Brolio Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 46 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage. View More', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Heat the oil in a large pan and fry thesquash for 10 mins until golden, turning thecubes now and then. Add the garlic and fryfor 1 min until softened. Add 300ml water,the grated Parmesan, chilli flakes and lemonzest. Stir well, turn the heat down and cookfor 3-4 mins. Mash well and season to taste.In a small pan, heat the rest of the oil, thenstir in the breadcrumbs. Fry until golden,stirring every so often. Stir in the sage.Cook the ravioli according to packinstructions (they usually only take a few mins). Drain,then spoon into bowls. Pour over the squashsauce, then sprinkle with sage breadcrumbs.', u'spoonacularSourceUrl': u'https://spoonacular.com/ravioli-with-squash-crunchy-crumbs-217244', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}