{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/248282-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 248282, u'veryPopular': False, u'lowFodmap': False, u'title': u'One World Reuben Vegan Sandwich', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 40, u'pricePerServing': 253.79, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'8 slices rye or swirl bread', u'aisle': u'Bakery/Bread', u'name': u'cinnamon swirl bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-raisin-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18047, u'unit': u'slices'}, {u'originalString': u'\xbc cup (56 g) dairy-free buttery spread', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy free buttery spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/light-buttery-spread.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'solid', u'id': 4673, u'unit': u'g'}, {u'originalString': u'1 tablespoon (15 ml) dill pickle juice', u'aisle': u'Canned and Jarred', u'name': u'dill pickle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 15.0, u'consistency': u'solid', u'id': 10011937, u'unit': u'ml'}, {u'originalString': u'\xbe teaspoon garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 93663, u'unit': u'teaspoon'}, {u'originalString': u'\xbe teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon harissa paste, or more to taste', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'teaspoons'}, {u'originalString': u'\xbe teaspoon dried mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 2046, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon prepared mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon (10 g) minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 10.0, u'consistency': u'solid', u'id': 11282, u'unit': u'g'}, {u'originalString': u'1\xbd teaspoons onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons ume plum vinegar', u'aisle': u'Ethnic Foods', u'name': u'plum vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 98954, u'unit': u'teaspoons'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3 cups (426 g) sauerkraut, drained and heated, with a pinch of black pepper', u'aisle': u'Canned and Jarred', u'name': u'sauerkraut', u'metaInformation': [u'with a pinch of black pepper', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauerkraut.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 426.0, u'consistency': u'solid', u'id': 11439, u'unit': u'g'}, {u'originalString': u'1 pound (454 g) seitan, thinly sliced', u'aisle': u'Refrigerated', u'name': u'seitan', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seitan.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 454.0, u'consistency': u'solid', u'id': 93654, u'unit': u'g'}, {u'originalString': u'1 tablespoon (15 g) sweet pickle relish', u'aisle': u'Condiments', u'name': u'sweet pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 15.0, u'consistency': u'solid', u'id': 11945, u'unit': u'g'}, {u'originalString': u'4 ounces (113 g) firm tofu, drained', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'firm', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 113.0, u'consistency': u'solid', u'id': 16162, u'unit': u'g'}, {u'originalString': u'1 tomato, thinly sliced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/reuben-vegan-sandwich', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine all the ingredients except the relish in a blender. Blend until smooth. Stir in the relish.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Let sit at least 30 minutes to meld. Store covered airtight in the refrigerator until using.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine all the ingredients in a 9 x 13-inch (23 x 33 cm) pan. Toss to coat. To cook, heat the oil in a large skillet over medium-high heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the seitan to the skillet and cook 4 to 5 minutes, stirring occasionally, until lightly browned.Preheat a panini press fitted with the smooth plates to high. Butter the outsides of the bread.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seitan.jpg', u'id': 93654, u'name': u'seitan'}]}, {u'equipment': [], u'step': u'Spread the inside of each piece of bread with a tablespoon (14 g) of spread. Divide the seitan evenly among the four sandwiches. Top with the sauerkraut and tomato slices.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-tomato.jpg', u'id': 10511529, u'name': u'tomato slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauerkraut.jpg', u'id': 11439, u'name': u'sauerkraut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seitan.jpg', u'id': 93654, u'name': u'seitan'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Put the tops on the sandwiches and grill with the press open 4 to 5 minutes, or until golden. Carefully turn over to cook the second side, 3 to 4 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 66, u'instructions': u'Combine all the ingredients except the relish in a blender. Blend until smooth. Stir in the relish. Let sit at least 30 minutes to meld. Store covered airtight in the refrigerator until using.Combine all the ingredients in a 9 x 13-inch (23 x 33 cm) pan. Toss to coat. To cook, heat the oil in a large skillet over medium-high heat. Transfer the seitan to the skillet and cook 4 to 5 minutes, stirring occasionally, until lightly browned.Preheat a panini press fitted with the smooth plates to high. Butter the outsides of the bread. Spread the inside of each piece of bread with a tablespoon (14 g) of spread. Divide the seitan evenly among the four sandwiches. Top with the sauerkraut and tomato slices. Put the tops on the sandwiches and grill with the press open 4 to 5 minutes, or until golden. Carefully turn over to cook the second side, 3 to 4 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-world-reuben-vegan-sandwich-248282', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}