{u'recipes': [{u'sourceName': u'I Wash You Dry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/671986-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 671986, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Cookies and Cream Hazelnut Pies', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 21.78, u'creditText': u'I Wash You Dry', u'extendedIngredients': [{u'originalString': u"1 jar of Jif Swirled Cookies 'n Cream Hazelnut Spread", u'aisle': u'Nut butters, Jams, and Honey', u'name': u'chocolate hazelnut spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 19125, u'unit': u'jar'}, {u'originalString': u'1 tub of Cool Whip, thawed*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'tub', u'unitShort': u'tub', u'amount': 1.0, u'consistency': u'solid', u'id': 1200, u'unit': u'tub'}, {u'originalString': u'24 mini Oreo cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1 box Pillsbury pie crust (two pie crust rounds)', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'(two pie crust rounds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u'box'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.iwashyoudry.com/2015/08/17/mini-cookies-and-cream-hazelnut-pies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Roll out pie crust on a clean surface and use a 3 inch round (or flower shape) cookie cutter to cut out 12 mini crusts from each round, making 24 total pie crusts. Drape the pie crusts over the back side of a mini muffin tin, space them out so they do not touch.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [], u'step': u'Bake the crusts for 8 to 10 minutes or until golden brown.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u"Let cool slightly on the muffin tin before carefully removing to cool completely.Fill each pie crust with a teaspoon of Jif's Cookies 'n Cream Hazelnut", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [], u'step': u'Spread, followed by a dollop of Cool Whip and a mini Oreo cookie. Keep chilled until ready to serve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'aggregateLikes': 17, u'instructions': u"Preheat oven to 450 degrees F.Roll out pie crust on a clean surface and use a 3 inch round (or flower shape) cookie cutter to cut out 12 mini crusts from each round, making 24 total pie crusts. Drape the pie crusts over the back side of a mini muffin tin, space them out so they do not touch. Bake the crusts for 8 to 10 minutes or until golden brown. Let cool slightly on the muffin tin before carefully removing to cool completely.Fill each pie crust with a teaspoon of Jif's Cookies 'n Cream Hazelnut Spread, followed by a dollop of Cool Whip and a mini Oreo cookie. Keep chilled until ready to serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/mini-cookies-and-cream-hazelnut-pies-671986', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}