{u'recipes': [{u'sourceName': u'Just One Cookbook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/540961-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 540961, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beef Donburi with Shiso Garlic Soy Sauce', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 86.01, u'creditText': u'Just One Cookbook', u'extendedIngredients': [{u'originalString': u'\xbe lb (1 pkg) thinly sliced beef for Shabu Shabu', u'aisle': u'Frozen;Meat', u'name': u'beef', u'metaInformation': [u'thinly sliced', u'for shabu shabu'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 23572, u'unit': u'pkg'}, {u'originalString': u'1 Tbsp. corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'Fresh ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1 medium onion, sliced thin', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 small potato', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'3-4 Servings Japanese rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 20444, u'unit': u''}, {u'originalString': u'1 Tbsp. sake', u'aisle': u'Alcoholic Beverages', u'name': u'sake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 43479, u'unit': u'Tbsp'}, {u'originalString': u'\xbc tsp. sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'2 shiitake mushrooms (*I prepared but I forgot to add this time…)', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [u'prepared', u'(*I but I forgot to add this time…)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11238, u'unit': u''}, {u'originalString': u'3 Tbsp. Shiso Garlic Soy Sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.justonecookbook.com/recipes/beef-donburi-with-shiso-garlic-soy-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the meat into strips. Slice onion and shiitake mushrooms thinly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'id': 11238, u'name': u'shiitake mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut potato into thin strips. In a medium bowl, combine seasonings and mix well.In the medium bowl, add meat and mix well with hands.Sprinkle corn starch and mix with hands again.In a non-stick frying pan heat oil on medium high heat. Corn starch will easily stick to the pan, so I would recommend using non-stick frying pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the onion and potato and cook until they are soft.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the meat and shiitake mushrooms in the pan and cook thoroughly until the meat is done (*shiitake is missing from the picture below).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'id': 11238, u'name': u'shiitake mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add sugar and Shiso Garlic Soy Sauce and mix all together.Cook for a few minutes. Put rice in a donburi bowl and serve the beef on top of the rice. Take out shiso from the container and cut into thin strips.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Put them on top of the beef and serve immediately.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u'Cut the meat into strips. Slice onion and shiitake mushrooms thinly. Cut potato into thin strips. In a medium bowl, combine seasonings and mix well.In the medium bowl, add meat and mix well with hands.Sprinkle corn starch and mix with hands again.In a non-stick frying pan heat oil on medium high heat. Corn starch will easily stick to the pan, so I would recommend using non-stick frying pan. Add the onion and potato and cook until they are soft.Add the meat and shiitake mushrooms in the pan and cook thoroughly until the meat is done (*shiitake is missing from the picture below).Add sugar and Shiso Garlic Soy Sauce and mix all together.Cook for a few minutes. Put rice in a donburi bowl and serve the beef on top of the rice. Take out shiso from the container and cut into thin strips. Put them on top of the beef and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/beef-donburi-with-shiso-garlic-soy-sauce-540961', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}