{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/620089-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 620089, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Orange Bread with a Light Orange Glaze', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 53.17, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 tbsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'1 1/4 cups fresh cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 9078, u'unit': u'cups'}, {u'originalString': u'2 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2/3 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'Zest of 1 large orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1 cup of powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/2 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2014/11/cranberry-orange-bread-with-a-light-orange-glaze.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Coat a small loaf pan with cooking spray and set aside.Sift the flour, sugar, baking powder, and salt into a mixing bowl. Stir in orange zest until well combined. Make a well in the center and add the orange juice, eggs, melted butter, and melted coconut oil. Stir from the center until the ingredients are blended. Be careful not to overmix.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the cranberries. Stir until just blended.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Pour the batter into the loaf pan and bake until a tester inserted into the center comes out clean, about 55-60 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the bread cool in the pan for 10 minutes before transferring to a rack to cool completely. Make the glaze by combining the powdered sugar and orange juice together until you reach your desired glaze thickness.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place some wax paper under the bread on the rack.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the glaze evenly over the cooled bread. Slice and serve plain or slathered in butter. Enjoy.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 21, u'instructions': u'Preheat oven to 350 degrees. Coat a small loaf pan with cooking spray and set aside.Sift the flour, sugar, baking powder, and salt into a mixing bowl. Stir in orange zest until well combined. Make a well in the center and add the orange juice, eggs, melted butter, and melted coconut oil. Stir from the center until the ingredients are blended. Be careful not to overmix. Add the cranberries. Stir until just blended.Pour the batter into the loaf pan and bake until a tester inserted into the center comes out clean, about 55-60 minutes. Let the bread cool in the pan for 10 minutes before transferring to a rack to cool completely. Make the glaze by combining the powdered sugar and orange juice together until you reach your desired glaze thickness. Place some wax paper under the bread on the rack. Pour the glaze evenly over the cooled bread. Slice and serve plain or slathered in butter. Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-orange-bread-with-a-light-orange-glaze-620089', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}