{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'caribbean', u'central american'], u'image': u'https://spoonacular.com/recipeImages/518395-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 518395, u'veryPopular': False, u'lowFodmap': False, u'title': u'Jamaican Jerk Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 112.96, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'8 chicken drumsticks, skinned and trimmed of excess fat', u'aisle': u'Meat', u'name': u'chicken drumsticks', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 5066, u'unit': u''}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 bunch green onions (some of the green part too), chopped (3/4 cup)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped', u'(some of the green part too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 medium jalape\xf1o chile, chopped (seeds and ribs removed for less heat, if desired)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno chile', u'metaInformation': [u'medium', u'chopped', u'for less heat, if desired)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons freshly squeezed lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.recipegirl.com/2008/09/15/jamaican-jerk-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Make the marinade: In a blender, combine scallions, garlic, jalape\xf1o, lime juice, oil, sugar, allspice, thyme, cinnamon, 1 teaspoon salt, and 2 Tablespoons water; blend until smooth. Set aside 1/4 cup for drizzling after baking.2.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place chicken in a large zip baggie.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour remaining marinade over chicken and roll it around in the bag to coat. Zip it closed and refrigerate, turning once or twice, at least 2 hours, or up to overnight.3. Preheat the oven to 375 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the drumsticks in a 9x13-inch pan and pour \xa0marinade on top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'id': 5066, u'name': u'chicken drumsticks'}]}, {u'equipment': [], u'step': u'Bake until chicken is cooked through, 50 to 60 minutes.4.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Heat the reserved marinade and drizzle on top of baked chicken for serving.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Jerk Chicken can be paired with Pinot Gris, Gewurztraminer, and Riesling. You'll want to opt for wines with a bit of sweetness when dealing with spicy Caribbean dishes. Serve these wines chilled so they're even more refreshing. One wine you could try is Lucien Albrecht Reserve Gewurztraminer. It has 4.2 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'pinot gris', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'The Gewurztraminer Reserve is made from selected (prime) grapes. Bursting with the aroma of honey, red roses and tropical fruit, yet dryand rich on the palate, this wine is lovely to drink on a warm afternoon by itself or paired in a meal with rich, creamy poultry dishes. It releasesboth to the mouth and the nose litchi, rose petal and spice aroma.', u'title': u'Lucien Albrecht Reserve Gewurztraminer', u'price': u'$17.99', u'id': 445421, u'link': u'https://www.wine.com/product/lucien-albrecht-reserve-gewurztraminer-2010/114394', u'imageUrl': u'https://spoonacular.com/productImages/445421-312x231.jpg'}]}, u'aggregateLikes': 92, u'instructions': u'1. Make the marinade: In a blender, combine scallions, garlic, jalape\xf1o, lime juice, oil, sugar, allspice, thyme, cinnamon, 1 teaspoon salt, and 2 Tablespoons water; blend until smooth. Set aside 1/4 cup for drizzling after baking.2. Place chicken in a large zip baggie. Pour remaining marinade over chicken and roll it around in the bag to coat. Zip it closed and refrigerate, turning once or twice, at least 2 hours, or up to overnight.3. Preheat the oven to 375 degrees F. Place the drumsticks in a 9x13-inch pan and pour \xa0marinade on top. Bake until chicken is cooked through, 50 to 60 minutes.4. Heat the reserved marinade and drizzle on top of baked chicken for serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/jamaican-jerk-chicken-518395', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}