{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601116-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 601116, u'veryPopular': False, u'lowFodmap': False, u'title': u'Triple Chocolate Party Balls', u'diets': [u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 112.48, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'chocolate candy coating (or almond bark) for dipping', u'aisle': u'Baking', u'name': u'candy coating', u'metaInformation': [u'for dipping', u'(or almond bark)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 98857, u'unit': u'servings'}, {u'originalString': u'\xbc cup corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'\xbd cup liqueur (I used rum)', u'aisle': u'Alcoholic Beverages', u'name': u'pear liqueur', u'metaInformation': [u'(I used rum)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 98988, u'unit': u'cup'}, {u'originalString': u'2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'3 cups crushed shortbread cookies', u'aisle': u'Sweet Snacks', u'name': u'shortbread cookies', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 18192, u'unit': u'cups'}, {u'originalString': u'\xbe cup chocolate chips or chocolate bar, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate bar', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 10019904, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://pinchofyum.com/triple-chocolate-party-balls', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix dry ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add wet ingredients.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Mix well until a "dough" forms.Freeze dough for 30 minutes, or until hard enough to form balls. Break off small pieces and roll between your palms until you have lots of small truffle-sized balls. Re-freeze until ready to dip.Melt chocolate candy coating in a double boiler. Dip each frozen ball in the chocolate. Set to dry on wax paper.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 12, u'instructions': u'Mix dry ingredients. Add wet ingredients. Mix well until a "dough" forms.Freeze dough for 30 minutes, or until hard enough to form balls. Break off small pieces and roll between your palms until you have lots of small truffle-sized balls. Re-freeze until ready to dip.Melt chocolate candy coating in a double boiler. Dip each frozen ball in the chocolate. Set to dry on wax paper.', u'spoonacularSourceUrl': u'https://spoonacular.com/triple-chocolate-party-balls-601116', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}