{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/716647-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 716647, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mediterranean Smashed Chickpeas', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 0, u'pricePerServing': 83.34, u'extendedIngredients': [{u'originalString': u'cup finely diced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'teaspoon coarsely ground toasted cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'cups chickpeas (garbanzo beans), cooked or canned', u'aisle': u'Sweet Snacks', u'name': u'pb cups', u'metaInformation': [u'canned', u'cooked', u'(garbanzo beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19150, u'unit': u'cups'}, {u'originalString': u'teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://cooking.nytimes.com/recipes/1016072-mediterranean-smashed-chickpeas', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put 3 tablespoons olive oil in a heavy-bottomed saucepan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion, season with salt and pepper, and cook gently until softened, about 10 minutes. Raise heat to medium-high.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, cumin, red pepper flakes and celery. Stir to combine let sizzle without browning for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add chickpeas and let them heat through. With a potato masher or wooden spoon, crush about half the beans. Stir well, taste and adjust seasoning.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1/2 cup water (or bean cooking liquid if you have it) and let mixture simmer briskly for a minute or two. Stir in lemon juice and 2 tablespoons olive oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Serve warm in pita or as a dip or side dish.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with quartered eggs, accompanied by minted yogurt and tahini sauce, if desired.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14995, u'instructions': u'Put 3 tablespoons olive oil in a heavy-bottomed saucepan over medium heat. Add onion, season with salt and pepper, and cook gently until softened, about 10 minutes. Raise heat to medium-high. Add garlic, cumin, red pepper flakes and celery. Stir to combine let sizzle without browning for 1 minute.                   Add chickpeas and let them heat through. With a potato masher or wooden spoon, crush about half the beans. Stir well, taste and adjust seasoning. Add 1/2 cup water (or bean cooking liquid if you have it) and let mixture simmer briskly for a minute or two. Stir in lemon juice and 2 tablespoons olive oil. Serve warm in pita or as a dip or side dish. Garnish with quartered eggs, accompanied by minted yogurt and tahini sauce, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/mediterranean-smashed-chickpeas-716647', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}