{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497366-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 497366, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pan Grilled Asparagus with Lemon Shallot Vinaigrette', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 175.48, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 bunch of asparagus, wooden ends trimmed', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'1 clove of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Juice & zest of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'Parmesan cheese, shredded', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 tbsp shallot, finely diced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tbsp'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2012/06/pan-grilled-asparagus-with-lemon-shallot-vinaigrette.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Combine the olive oil, lemon zest, lemon juice, shallot, garlic, sea salt, and freshly cracked pepper together with a whisk until well combined.  Set aside to let the flavors mingle.  Side Note:  If your shallot's flavor is too strong, soak in cold water for a few minutes prior to making the vinaigrette.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Heat a grill pan over medium heat; coat with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Place the asparagus into the grill pan and season with sea salt and freshly cracked pepper, to taste.  Cook the asparagus  for 3-4 minutes then flip and cook for another 2-3 minutes or until tender.Toss the asparagus with some of the lemon vinaigrette then place onto a serving platter and sprinkle with Parmesan cheese.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Serve the asparagus with the remaining sauce on the side.  Enjoy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 266, u'instructions': u"Combine the olive oil, lemon zest, lemon juice, shallot, garlic, sea salt, and freshly cracked pepper together with a whisk until well combined.  Set aside to let the flavors mingle.  Side Note:  If your shallot's flavor is too strong, soak in cold water for a few minutes prior to making the vinaigrette.Heat a grill pan over medium heat; coat with cooking spray.  Place the asparagus into the grill pan and season with sea salt and freshly cracked pepper, to taste.  Cook the asparagus  for 3-4 minutes then flip and cook for another 2-3 minutes or until tender.Toss the asparagus with some of the lemon vinaigrette then place onto a serving platter and sprinkle with Parmesan cheese.  Serve the asparagus with the remaining sauce on the side.  Enjoy.", u'spoonacularSourceUrl': u'https://spoonacular.com/pan-grilled-asparagus-with-lemon-shallot-vinaigrette-497366', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}