{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598182-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 598182, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skate Grenobloise', u'diets': [u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 127.96, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'4 tablespoons (56 g) butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 tablespoon (14g) capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 14.0, u'consistency': u'solid', u'id': 2054, u'unit': u'g'}, {u'originalString': u'1/2 cup (112 g) croutons', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'croutons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 112.0, u'consistency': u'solid', u'id': 18242, u'unit': u'g'}, {u'originalString': u'1 sprig flat parsley, finely chopped', u'aisle': u'Produce', u'name': u'flat leaf parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'sprig'}, {u'originalString': u'1/4 cup (56 g) flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Salt and finely ground white pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'white', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 skate wings, skinned and boned out', u'aisle': u'Seafood', u'name': u'skate wings', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/skate-wings.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93835, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://leitesculinaria.com/6258/recipes-skate-grenobloise.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the flour in the shallow bowl and season it with salt and pepper. Dredge the fish in the flour and shake off the excess. Re-season the fish with salt and pepper.2. In the saute pan, heat 1 tablespoon (14 g) of the butter over medium-high heat. When the butter has foamed and subsided, add the fish and cook over high heat for 2 minutes.3.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add 1 more tablespoon (14 g) of butter and turn the fish, cooking the other side for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the fish to the serving platter.4. Discard the butter from the pan and then add the remaining 2 tablespoons (28 g) of butter. Cook over high heat until it foams and subsides, then add the capers and croutons. Cook for 30 seconds, then add the lemon juice and parsley. (You can add the lemon segments at this point as well.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18242, u'name': u'croutons'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}, {u'equipment': [], u'step': u'Remove from the heat and spoon the sauce over the fish.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'1. Put the flour in the shallow bowl and season it with salt and pepper. Dredge the fish in the flour and shake off the excess. Re-season the fish with salt and pepper.2. In the saute pan, heat 1 tablespoon (14 g) of the butter over medium-high heat. When the butter has foamed and subsided, add the fish and cook over high heat for 2 minutes.3. Add 1 more tablespoon (14 g) of butter and turn the fish, cooking the other side for 2 minutes. Transfer the fish to the serving platter.4. Discard the butter from the pan and then add the remaining 2 tablespoons (28 g) of butter. Cook over high heat until it foams and subsides, then add the capers and croutons. Cook for 30 seconds, then add the lemon juice and parsley. (You can add the lemon segments at this point as well.) Remove from the heat and spoon the sauce over the fish.', u'spoonacularSourceUrl': u'https://spoonacular.com/skate-grenobloise-598182', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}