{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/209731-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 209731, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry tarts', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 133.84, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'150ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'1 tbsp lemon curd', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'lemon curd', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-curd.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93834, u'unit': u'tbsp'}, {u'originalString': u'350g ready-made sweet shortcrust pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'shortcrust pastry', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dough.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 10018338, u'unit': u'g'}, {u'originalString': u'\xbd punnet strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'2 tbsp strawberry jam, without any whole strawberries in it', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry jam', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10819297, u'unit': u'tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/531633/strawberry-tarts', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Ask a grown-upto turn the oven to180C/fan 160C/gas 4.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the pastry out ona floured surface untilit’s as thick as \xa31 coin.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Cut round a saucer tomake 4 circles. Puteach one into the tin.Put a square ofgreaseproofpaper and somerice in each. Ask agrown-up to putthem in the oven for25 minutes, thentake paper and riceout. Leave to cool.Use a whisk towhisk the creamuntil it starts to getthick, then stir inthe lemon curd.Pull the greenhulls out of thestrawberries, and cuteach one carefullyinto slices with asmall knife.Spoon thecream into4 pastry cases.Arrange thestrawberry slicesin a spiral or inrows on top ofthe lemon cream.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-curd.jpg', u'id': 93834, u'name': u'lemon curd'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Mix the jam in abowl with 1 tbsphot water, thenbrush it over thestrawberries.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 117, u'instructions': u'Ask a grown-upto turn the oven to180C/fan 160C/gas 4.Roll the pastry out ona floured surface untilit’s as thick as \xa31 coin.Cut round a saucer tomake 4 circles. Puteach one into the tin.Put a square ofgreaseproofpaper and somerice in each. Ask agrown-up to putthem in the oven for25 minutes, thentake paper and riceout. Leave to cool.Use a whisk towhisk the creamuntil it starts to getthick, then stir inthe lemon curd.Pull the greenhulls out of thestrawberries, and cuteach one carefullyinto slices with asmall knife.Spoon thecream into4 pastry cases.Arrange thestrawberry slicesin a spiral or inrows on top ofthe lemon cream.Mix the jam in abowl with 1 tbsphot water, thenbrush it over thestrawberries.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-tarts-209731', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}