{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549912-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 549912, u'veryPopular': True, u'lowFodmap': False, u'title': u'Burnt Peanut Butter Caramel Oatmeal Chocolate Chip Cookies', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 26.74, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 1/2 cup old fashioned oats', u'aisle': u'Cereal', u'name': u'old fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}, {u'originalString': u'1/4 cup smooth peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16150, u'unit': u'cup'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.halfbakedharvest.com/burnt-peanut-butter-caramel-oatmeal-chocolate-chip-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'To make the burnt peanut butter caramel sauce. Grease or spray a bread pan or small square pyrex pan with cooking spray.In a small saucepan, heat the butter over medium heat. Butter will foam, then settle down. Continue to cook and the now separated solids will begin to brown and develop a toasty, nut aroma.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat.In a large saucepan, heat sugar over medium high heat. As the sugar begins to melt, swirl the pan side to side frequently to help the sugar melt evenly. Continue to cook and swirl until the caramel begins to smoke slightly and is a deep amber color. Cook for about 1 minute longer.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from heat, then pour in the browned butter.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in the heavy cream. It will bubble up quite a bit so be careful.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Whisk fast to incorporate. Once the sauce is smooth and the butter and cream are well incorporated, whisk in the peanut butter until smooth. Return the pot back to the stove and bring to a gentle boil. Cook one minute, remove from the heat and pour into the greased pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the freezer while you make the cookies.Preheat the oven to 350 degrees.Grease a baking sheet or line with a silpat or parchment paper.In a large mixing bowl, or bowl of a stand mixer, add the oatmeal, flour, sugar, brown sugar, baking soda, salt, canola oil, eggs and vanilla and mix until combined. The dough will be crumbly.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in the chocolate chips.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the caramel from the freezer and dump the square out onto the counter. The caramels may still be warm, but this is ok.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cute the square into bite size pieces.The next step is a little tricky. This oatmeal cookie dough is very crumbly so you need to do your best to form the dough around the caramels. First scoop about 1 1/2 tablespoons of dough out, then place one or two caramels in the center and use you hands to tightly squeeze the dough around the caramels. At first it may seem too dry, but just give it 2 or 3 good squeezes and it will come together. Do this over the bowl so any dough that falls out goes back into the bowl.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the cookie on the prepared baking sheet and repeat with remaining dough.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 10 -12 minutes or until set and golden.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool five minutes.These are awesome all hot and gooey, but they are still delicious the next day!', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 646, u'instructions': u'To make the burnt peanut butter caramel sauce. Grease or spray a bread pan or small square pyrex pan with cooking spray.In a small saucepan, heat the butter over medium heat. Butter will foam, then settle down. Continue to cook and the now separated solids will begin to brown and develop a toasty, nut aroma. Remove from heat.In a large saucepan, heat sugar over medium high heat. As the sugar begins to melt, swirl the pan side to side frequently to help the sugar melt evenly. Continue to cook and swirl until the caramel begins to smoke slightly and is a deep amber color. Cook for about 1 minute longer.Remove from heat, then pour in the browned butter. Pour in the heavy cream. It will bubble up quite a bit so be careful. Whisk fast to incorporate. Once the sauce is smooth and the butter and cream are well incorporated, whisk in the peanut butter until smooth. Return the pot back to the stove and bring to a gentle boil. Cook one minute, remove from the heat and pour into the greased pan. Place in the freezer while you make the cookies.Preheat the oven to 350 degrees.Grease a baking sheet or line with a silpat or parchment paper.In a large mixing bowl, or bowl of a stand mixer, add the oatmeal, flour, sugar, brown sugar, baking soda, salt, canola oil, eggs and vanilla and mix until combined. The dough will be crumbly. Mix in the chocolate chips.Remove the caramel from the freezer and dump the square out onto the counter. The caramels may still be warm, but this is ok. Cute the square into bite size pieces.The next step is a little tricky. This oatmeal cookie dough is very crumbly so you need to do your best to form the dough around the caramels. First scoop about 1 1/2 tablespoons of dough out, then place one or two caramels in the center and use you hands to tightly squeeze the dough around the caramels. At first it may seem too dry, but just give it 2 or 3 good squeezes and it will come together. Do this over the bowl so any dough that falls out goes back into the bowl. Place the cookie on the prepared baking sheet and repeat with remaining dough.Bake for 10 -12 minutes or until set and golden.Let cool five minutes.These are awesome all hot and gooey, but they are still delicious the next day!', u'spoonacularSourceUrl': u'https://spoonacular.com/burnt-peanut-butter-caramel-oatmeal-chocolate-chip-cookies-549912', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}