{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557567-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 557567, u'veryPopular': True, u'lowFodmap': False, u'title': u'It’s 5:00 Somewhere Friday: “The Frozen Turkey”', u'diets': [u'gluten free'], u'pricePerServing': 201.36, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'1 oz Amaretto', u'aisle': u'Alcoholic Beverages', u'name': u'amaretto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/temporary-orange-liqueur.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 10014534, u'unit': u'oz'}, {u'originalString': u'1/2 cup cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 cup dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'I pint container H\xe4agen-Dazs butter pecan ice cream', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'pint'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 oz Wild Turkey 101', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'wild'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 5165, u'unit': u'oz'}, {u'originalString': u'4 Tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2013/11/its-500-somewhere-friday-the-frozen-turkey.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 72, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Make the caramel sauce by mixing the sugar, cream, butter and salt in a saucepan and heating to a simmer.  Cook for 5 minutes, then pour into a jar and let cool. If the sauce thickens too much after cooling, microwave it for a few seconds. For the cocktail, blend the ice cream, the Wild Turkey and the Amaretto in a blender until smooth.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/temporary-orange-liqueur.jpg', u'id': 10014534, u'name': u'amaretto liqueur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u"Serve in fancy glasses garnished with a drizzle of the sauce.If you'd like to make this ahead, put the whole blender back in the freezer after blending and then give it a quick re-blend right before serving.", u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 389, u'instructions': u"Make the caramel sauce by mixing the sugar, cream, butter and salt in a saucepan and heating to a simmer.  Cook for 5 minutes, then pour into a jar and let cool. If the sauce thickens too much after cooling, microwave it for a few seconds. For the cocktail, blend the ice cream, the Wild Turkey and the Amaretto in a blender until smooth.  Serve in fancy glasses garnished with a drizzle of the sauce.If you'd like to make this ahead, put the whole blender back in the freezer after blending and then give it a quick re-blend right before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/its-5-00-somewhere-friday-the-frozen-turkey-557567', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}