{u'recipes': [{u'sourceName': u'The First Year Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/607877-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 607877, u'veryPopular': False, u'lowFodmap': True, u'title': u'Habanero Buffalo Chicken Dip', u'diets': [u'gluten free', u'fodmap friendly'], u'pricePerServing': 226.13, u'creditText': u'The First Year Blog', u'extendedIngredients': [{u'originalString': u'1 cup shredded colby jack cheese', u'aisle': u'Cheese', u'name': u'colby jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1011, u'unit': u'cup'}, {u'originalString': u'4 oz cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'2 tbsp El Yucateco Red Habanero Hot Sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup ranch dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}, {u'originalString': u'1 cup shredded chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cup'}, {u'originalString': u'Chips, crackers or fresh vegetables for serving', u'aisle': u'?', u'name': u'fresh vegetables', u'metaInformation': [u'for serving'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'unit': u'servings'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://thefirstyearblog.com/habanero-buffalo-chicken-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Spray a small crock pot (2qt) with non-stick cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Put the El Yucateco hot sauce, ranch dressing, shredded cheese, shredded chicken, and cream cheese in the crock pot and set to low. After 20 minutes stir everything together, as the cream cheese and cheese are starting to melt. Continue to cook the dip on low for 40 additional minutes, until everything is combined and hot.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'id': 5348, u'name': u'shredded chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}]}, {u'equipment': [], u'step': u'Serve with chips, crackers, or fresh vegetables.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Buffalo Chicken Dip on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Spray a small crock pot (2qt) with non-stick cooking spray. Put the El Yucateco hot sauce, ranch dressing, shredded cheese, shredded chicken, and cream cheese in the crock pot and set to low. After 20 minutes stir everything together, as the cream cheese and cheese are starting to melt. Continue to cook the dip on low for 40 additional minutes, until everything is combined and hot. Serve with chips, crackers, or fresh vegetables.', u'spoonacularSourceUrl': u'https://spoonacular.com/habanero-buffalo-chicken-dip-607877', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}