{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/733101-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 733101, u'veryPopular': True, u'lowFodmap': False, u'title': u'Asian Noodle Salad', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 197.14, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 6-ounce bag baby sweet peppers, seeded and sliced thinly into rings (about 1 cup)', u'aisle': u'Produce', u'name': u'baby bell peppers', u'metaInformation': [u'sweet', u'seeded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311821, u'unit': u'cup'}, {u'originalString': u'1 8-ounce bag julienne/fine-cut carrots (about 1 1/2 cups)', u'aisle': u'Produce', u'name': u'baby cut carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11960, u'unit': u'cups'}, {u'originalString': u'1 4-ounce bag bean sprouts (about 1 cup)', u'aisle': u'Produce;Ethnic Foods', u'name': u'bean sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11043, u'unit': u'cup'}, {u'originalString': u'1/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'Up to 1 bunch fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'3 English cucumbers, halved, seeds removed and sliced', u'aisle': u'Produce', u'name': u'english cucumbers', u'metaInformation': [u'english', u'seeds removed and sliced', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10111205, u'unit': u''}, {u'originalString': u'3 tablespoons chopped fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'2 to 3 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 bunch kale, leaves torn off the stalks and shredded', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11233, u'unit': u'bunch'}, {u'originalString': u'1/3 cup low-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'1/2 head or more napa cabbage, sliced', u'aisle': u'Produce', u'name': u'napa cabbage leaves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/napa-cabbage.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 10011970, u'unit': u'head'}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/4 cup oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6176, u'unit': u'cup'}, {u'originalString': u'2 cups peanuts, chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16091, u'unit': u'cups'}, {u'originalString': u'1/2 head or more purple cabbage, sliced', u'aisle': u'Produce', u'name': u'purple cabbage', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11112, u'unit': u'head'}, {u'originalString': u'1/4 cup rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022053, u'unit': u'cup'}, {u'originalString': u'3 scallions, sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 tablespoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces thin spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'ounces'}], u'healthScore': 92.0, u'imageType': u'jpeg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/asian-noodle-salad.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'For the salad: Bring a pot of water to a boil. Cook the spaghetti to al dente according to the package directions.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [], u'step': u'Drain, rinse and let cool.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix together the cooked spaghetti, carrots, peppers, bean sprouts, cucumbers, scallions, cilantro, napa cabbage, purple cabbage and kale.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'id': 11112, u'name': u'red cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'id': 11043, u'name': u'bean sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Add the peanuts and toss together.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the olive oil, soy sauce, oyster sauce, rice wine vinegar, brown sugar, ginger, sesame oil and garlic in a medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'id': 6176, u'name': u'oyster sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u"Pour the dressing over the salad and mix together with tongs or your hands. If the salad seems a little dry, just mix up a little more of the wet ingredients of the dressing and throw it in. It's a very organic process.", u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to a large platter and serve.', u'number': 3, u'ingredients': []}], u'name': u'For the dressing'}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 17340, u'instructions': u"Watch how to make this recipe.                    For the salad: Bring a pot of water to a boil. Cook the spaghetti to al dente according to the package directions. Drain, rinse and let cool.                          Mix together the cooked spaghetti, carrots, peppers, bean sprouts, cucumbers, scallions, cilantro, napa cabbage, purple cabbage and kale. Add the peanuts and toss together.                          For the dressing: Whisk together the olive oil, soy sauce, oyster sauce, rice wine vinegar, brown sugar, ginger, sesame oil and garlic in a medium bowl.                          Pour the dressing over the salad and mix together with tongs or your hands. If the salad seems a little dry, just mix up a little more of the wet ingredients of the dressing and throw it in. It's a very organic process.                          Transfer to a large platter and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/asian-noodle-salad-733101', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}