{u'recipes': [{u'sourceName': u'The Wanderlust Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/506843-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 506843, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chipotle Chicken & Sweet Potato Tamale Pie', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 101.72, u'creditText': u'The Wanderlust Kitchen', u'extendedIngredients': [{u'originalString': u'\xbd tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 cup shredded, cooked chicken breast', u'aisle': u'Meat', u'name': u'cooked shredded chicken breast', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cup'}, {u'originalString': u'\xbc tsp. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'1 to 2 canned chipotle peppers in adobe sauce, minced', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle peppers', u'metaInformation': [u'canned', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'4 Tbsp. chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tbsp'}, {u'originalString': u'\xbc tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 cup masa harina (instant corn flour)', u'aisle': u'Ethnic Foods;Baking', u'name': u'masa harina', u'metaInformation': [u'(instant corn flour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20317, u'unit': u'cup'}, {u'originalString': u'1 cup Shredded Jack, Montery, or Oaxaca Cheese', u'aisle': u'Cheese', u'name': u'oaxaca cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98989, u'unit': u'cup'}, {u'originalString': u'1 (8oz) can of red enchilada sauce, divided', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'red enchilada sauce', u'metaInformation': [u'red', u'divided', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 6599, u'unit': u'oz'}, {u'originalString': u'4 Tbsp. chopped scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp. Goya all-purpose seasoning, or salt', u'name': u'seasoning', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'tsp'}, {u'originalString': u'1 cup peeled sweet potato, cut into half-inch cubes', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'peeled', u'cut into half-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://thewanderlustkitchen.com/2013/11/06/chipotle-chicken-sweet-potato-tamale-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees Fahrenheit. Bring 6 cups of water to a boil and keep hot.Beat the lard with a hand mixer or the paddle attachment of an electric mixer until fluffy (60-90 seconds).', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add in in the masa harina, chili powder, cumin, baking powder, and salt. Beat until all ingredients are well incorporated and there are no lumps. Slowly add in the chicken broth or water a little at a time until the mixture resembles the consistency of cake icing. Beat for another 6 minutes, then set aside for 15 minutes to let the ingredients moisten and rise.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-flour.jpg', u'id': 20317, u'name': u'masa harina'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine 2 Tablespoons of enchilada sauce, the shredded chicken, sweet potato, chipotle peppers, Goya (or salt), and cumin in a large bowl and toss to combine. Set aside.Scoop the tamale dough into a 9x9 baking dish and smooth with a spatula.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'id': 5348, u'name': u'shredded chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread 3 Tablespoons of enchilada sauce over the top of the dough.Arrange the filling mixture evenly over the top of the sauce.Cover the dish with foil, then place on top of a rimmed baking sheet or other large oven-proof dish with tall sides (such as a roasting pan), and place in the oven. Once in the oven, pour the very hot water into the rimmed baking sheet so the tamale pie bakes in a bath of about two inches of water.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake for 45 minutes, then remove the foil and top with the remaining enchilada sauce and shredded cheese.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}]}, {u'equipment': [], u'step': u'Bake for another 10-15 minutes, or until the tamale base is set and the sweet potatoes are cooked through.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Serve topped with chopped cilantro and scallions.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Chehalem INOX Chardonnay. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 910, u'instructions': u'Preheat the oven to 350 degrees Fahrenheit. Bring 6 cups of water to a boil and keep hot.Beat the lard with a hand mixer or the paddle attachment of an electric mixer until fluffy (60-90 seconds). Add in in the masa harina, chili powder, cumin, baking powder, and salt. Beat until all ingredients are well incorporated and there are no lumps. Slowly add in the chicken broth or water a little at a time until the mixture resembles the consistency of cake icing. Beat for another 6 minutes, then set aside for 15 minutes to let the ingredients moisten and rise.Combine 2 Tablespoons of enchilada sauce, the shredded chicken, sweet potato, chipotle peppers, Goya (or salt), and cumin in a large bowl and toss to combine. Set aside.Scoop the tamale dough into a 9x9 baking dish and smooth with a spatula. Spread 3 Tablespoons of enchilada sauce over the top of the dough.Arrange the filling mixture evenly over the top of the sauce.Cover the dish with foil, then place on top of a rimmed baking sheet or other large oven-proof dish with tall sides (such as a roasting pan), and place in the oven. Once in the oven, pour the very hot water into the rimmed baking sheet so the tamale pie bakes in a bath of about two inches of water.Bake for 45 minutes, then remove the foil and top with the remaining enchilada sauce and shredded cheese. Bake for another 10-15 minutes, or until the tamale base is set and the sweet potatoes are cooked through.Serve topped with chopped cilantro and scallions.', u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-chicken-sweet-potato-tamale-pie-506843', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}