{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/601364-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 601364, u'veryPopular': False, u'lowFodmap': False, u'title': u'21 Club Hamburger', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 372.44, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1/4 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup finely chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1/4 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'Salt and freshly ground pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 pounds ground top sirloin', u'aisle': u'Meat', u'name': u'Top Sirloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/top-sirloin-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 23584, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.copykat.com/2009/05/12/21-club-hamburger-nothing-tastes-as-good-as-a-good-hamburger-give-this-copy-cat-recipe-a-try/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine celery and chicken broth in a small saucepan over very low heat; poach the celery for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Drain and cool.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine celery with remaining ingredients except the butter, mixing well with your hands. Gently shape into 4 large patties, being careful not to compact the meat any more than necessary.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the butter in a large, heavy skillet over moderate heat until the butter is amber in color. Brown the burgers 6 minutes on each side, then place the skillet in a preheated 350F oven for 6 to 8 minutes for medium rare, a few additional minutes for better done.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger on the menu? Try pairing with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Ernesto Catena Padrillos Malbec. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Ripe, concentrated dark fruit aromas with hints of chocolate, black cherry and red currant fruit flavors with notes of sweet spices, soft, supple tannins and balanced bright acidity.', u'title': u'Ernesto Catena Padrillos Malbec', u'price': u'$14.99', u'id': 438162, u'link': u'https://www.wine.com/product/ernesto-catena-padrillos-malbec-2013/134759', u'imageUrl': u'https://spoonacular.com/productImages/438162-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Combine celery and chicken broth in a small saucepan over very low heat; poach the celery for 20 minutes. Drain and cool. Combine celery with remaining ingredients except the butter, mixing well with your hands. Gently shape into 4 large patties, being careful not to compact the meat any more than necessary. Heat the butter in a large, heavy skillet over moderate heat until the butter is amber in color. Brown the burgers 6 minutes on each side, then place the skillet in a preheated 350F oven for 6 to 8 minutes for medium rare, a few additional minutes for better done.', u'spoonacularSourceUrl': u'https://spoonacular.com/21-club-hamburger-601364', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}