{u'recipes': [{u'sourceName': u'Once A Month Meals', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/631076-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631076, u'veryPopular': False, u'lowFodmap': False, u'title': u'Basil Eggplant Parmesan', u'diets': [], u'pricePerServing': 253.9, u'creditText': u'Once A Month Meals', u'extendedIngredients': [{u'originalString': u'1 cup chop Basil, Fresh', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'1 \xbe cups Bread Crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 18079, u'unit': u'cups'}, {u'originalString': u'4 individual beat Egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 \xbe cups slice Eggplant', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.75, u'consistency': u'solid', u'id': 11209, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Garlic Powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons Italian Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'6 cups Marinara a la Seaton', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'cups'}, {u'originalString': u'\xbc cups Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cups'}, {u'originalString': u'\xbc cups Parmesan Cheese #1', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cups'}, {u'originalString': u'\xbd cups Parmesan Cheese #2', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cups'}, {u'originalString': u'1 \xbd cups Mozzarella Cheese, Shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'cups'}, {u'originalString': u'6 cups cook Spaghetti, Whole Wheat', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'cups'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://onceamonthmom.com/basil-eggplant-parmesan/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 46, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In another shallow dish, whisk together breadcrumbs, Italian seasoning, garlic powder, salt, pepper, and Parmesan cheese #1. Beat eggs in a shallow dish.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil on medium heat in a large skillet. Dredge eggplant slices in egg, then cover in breadcrumbs. Cook it in hot oil 2-4 minutes each side until breading is crisp and eggplant is cooked.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove to a paper towel. Repeat until all of the eggplant slices are cooked. Measure out one quarter of marinara sauce pour into the bottom of indicated number of baking dishes. Lay eggplant slices in a single layer and cover with another 1/4 of marinara sauce. Sprinkle with 1/3 mozzarella cheese, 1/3 Parmesan cheese (for layering), and 1/3 basil leaves. Repeat layers twice {you should end with sauce, cheese and basil on top}.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10111549, u'name': u'marinara sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Bake at 350 degrees for 30-40 minutes until sauce and cheese are bubbling.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over hot cooked pasta.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Verdicchio, and Trebbiano are my top picks for Eggplant Parmigiana. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Ricasoli Castello di Brolio Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 46 dollars per bottle.', u'pairedWines': [u'chianti', u'verdicchio', u'trebbiano'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage. View More', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 32, u'instructions': u'In another shallow dish, whisk together breadcrumbs, Italian seasoning, garlic powder, salt, pepper, and Parmesan cheese #1. Beat eggs in a shallow dish. Heat oil on medium heat in a large skillet. Dredge eggplant slices in egg, then cover in breadcrumbs. Cook it in hot oil 2-4 minutes each side until breading is crisp and eggplant is cooked. Remove to a paper towel. Repeat until all of the eggplant slices are cooked. Measure out one quarter of marinara sauce pour into the bottom of indicated number of baking dishes. Lay eggplant slices in a single layer and cover with another 1/4 of marinara sauce. Sprinkle with 1/3 mozzarella cheese, 1/3 Parmesan cheese (for layering), and 1/3 basil leaves. Repeat layers twice {you should end with sauce, cheese and basil on top}. Bake at 350 degrees for 30-40 minutes until sauce and cheese are bubbling. Serve over hot cooked pasta.', u'spoonacularSourceUrl': u'https://spoonacular.com/basil-eggplant-parmesan-631076', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}