{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/421725-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 421725, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole Grain Caprese Sandwich Bites', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 158.51, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'8 (8-inch) bamboo skewers', u'aisle': u'Ethnic Foods', u'name': u'bamboo shoots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 8.0, u'consistency': u'solid', u'id': 11028, u'unit': u'inch'}, {u'originalString': u'8 slices Roman Meal Bread, toasted or grilled', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'32 fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 32.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'8 ounces mozzarella cheese, cut into 1/2-inch pieces', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoons'}, {u'originalString': u'4 Roma tomatoes, cut into 4 slices each', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'cut into 4 slices each'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Whole-Grain-Caprese-Sandwich-Bites/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Trim crusts and cut each piece of toast into quarters for a total of 32 pieces.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread pesto onto each toast quarter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Assemble on each skewer: toast quarter, 2 basil leaves, 1 tomato slice, 1 cheese slice, and toast quarter. Repeat, for a total of 2 sandwich bites per skewer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 16, u'instructions': u'Trim crusts and cut each piece of toast into quarters for a total of 32 pieces. Spread pesto onto each toast quarter.                            Assemble on each skewer: toast quarter, 2 basil leaves, 1 tomato slice, 1 cheese slice, and toast quarter. Repeat, for a total of 2 sandwich bites per skewer.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/whole-grain-caprese-sandwich-bites-421725', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}