{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/583309-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 583309, u'veryPopular': True, u'lowFodmap': False, u'title': u'World’s Best Creamiest Mashed Potato', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 118.7, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'4 oz. cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 jumbo garlic clove, pressed or finely chopped (I also use garlic powder)', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'pressed', u'finely chopped', u'(I also use garlic powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd cup of milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 tsp. onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u"\xbd tsp. Lawry's seasoning salt", u'aisle': u'Spices and Seasonings', u'name': u'seasoning salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1042047, u'unit': u'tsp'}, {u'originalString': u'1 c. sour cream (add more to taste)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour', u'to taste', u'(add more )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'c'}, {u'originalString': u'1 stick unsalted butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}, {u'originalString': u'10 - 12 medium Yukon Gold Potatoes (do not cut or peel)', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'medium', u'(do not cut or peel)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10211362, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://dailydishrecipes.com/ccc-worlds-best-creamiest-homemade-mashed-potato-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Scrub your potatoes. Drop into a pot of salted boiling water. Boil them about 40-50 minutes or so.Carefully drain them. Don’t allow them to cool too much.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut them into 4 smaller pieces.Put everything into a huge bowl and then begin to mash them up. You can use a potato masher, but I actually use my handheld mixer.Now, add your seasonings, the garlic (I used powder for this recipe, but I do use the garlic cloves most of the time), the cream cheese, and the butter. Blend well.Now add the milk and sour cream. You can add more milk or sour cream to taste or to add to the creaminess.Blend well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Serve immediately! You can freeze these too, just remove from freezer, allow to sit about 20-30 minutes before putting in the oven.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 325 covered (in tinfoil) for about 20-30 minutes or so.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Mix well and check to be sure there are no cold spots.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 484, u'instructions': u'<p>Scrub your potatoes. Drop into a pot of salted boiling water. Boil them about 40-50 minutes or so.Carefully drain them. Don’t allow them to cool too much. Cut them into 4 smaller pieces.Put everything into a huge bowl and then begin to mash them up. You can use a potato masher, but I actually use my handheld mixer.Now, add your seasonings, the garlic (I used powder for this recipe, but I do use the garlic cloves most of the time), the cream cheese, and the butter. Blend well.Now add the milk and sour cream. You can add more milk or sour cream to taste or to add to the creaminess.Blend well.Serve immediately! You can freeze these too, just remove from freezer, allow to sit about 20-30 minutes before putting in the oven. Bake at 325 covered (in tinfoil) for about 20-30 minutes or so. Mix well and check to be sure there are no cold spots.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/worlds-best-creamiest-mashed-potato-583309', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving', u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}