{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/581636-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 581636, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oreo Cupcakes: The Champion of Chunky', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 83.9, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u"1 box devil's food cake mix", u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18087, u'unit': u'box'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 small package instant chocolate fudge pudding mix', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 19184, u'unit': u'package'}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'55 oreos, divided', u'aisle': u'Sweet Snacks', u'name': u'oreos', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 55.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'4 sifted cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'2 cups semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}, {u'originalString': u'1/2 cup shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.foodfanatic.com/2013/06/oreo-cupcakes-the-champion-of-chunky/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350\xb0F.Line 24 muffin tin cups and place an Oreo in each one. Scoop cake batter over the Oreos, only filling each cup to be about 2/3 of the way full.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake for 20 minutes.Meanwhile, use a stand mixer to whisk together the butter and shortening.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the powdered sugar and milk, alternating 1 cup of powdered sugar with 1 tablespoon of milk and whisking in between each addition until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the vanilla.Hand crumble 15 Oreos into the butter cream. Use a spatula to mix in well.Once the cupcakes have cooled, spread the Oreo butter cream on top. Crumble another Oreo on top of the butter cream (you could easily spread one Oreo over two cupcakes).\xa0', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 146, u'instructions': u'Preheat the oven to 350\xb0F.Line 24 muffin tin cups and place an Oreo in each one. Scoop cake batter over the Oreos, only filling each cup to be about 2/3 of the way full.Bake for 20 minutes.Meanwhile, use a stand mixer to whisk together the butter and shortening. Add the powdered sugar and milk, alternating 1 cup of powdered sugar with 1 tablespoon of milk and whisking in between each addition until smooth. Whisk in the vanilla.Hand crumble 15 Oreos into the butter cream. Use a spatula to mix in well.Once the cupcakes have cooled, spread the Oreo butter cream on top. Crumble another Oreo on top of the butter cream (you could easily spread one Oreo over two cupcakes).\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/oreo-cupcakes-the-champion-of-chunky-581636', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}