{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/225563-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 225563, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow-roast pork rolls with apple chilli chutney', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 235.16, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 eating apples, peeled, cored and cut into small chunks', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'cored', u'small', u'peeled', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'buttered soft bread rolls, to serve', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18064, u'unit': u'servings'}, {u'originalString': u'1-2 red chillies, deseeded and finely chopped', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'red', u'deseeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'4 tbsp cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tbsp'}, {u'originalString': u'1 tsp fennel seed', u'aisle': u'Spices and Seasonings', u'name': u'fennel seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2018, u'unit': u'tsp'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 onions, finely chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2\xbd kg 5lb 8oz pork shoulder joint, scored and tied (we used a tied carvery joint from Waitrose, bone in one end and rolled and tied at other end)', u'aisle': u'Meat', u'name': u'pork shoulder joint', u'metaInformation': [u'bone in', u'(we used a tied carvery joint from Waitrose, one end and rolled and tied at other end)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shoulder-joint-of-pork.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 2.5, u'consistency': u'solid', u'id': 10083, u'unit': u'kg'}, {u'originalString': u'4 tbsp caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 thyme sprig, leaves picked', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'leaves picked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'2 tsp thyme leaves', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/335613/slowroast-pork-rolls-with-apple-chilli-chutney', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 240.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 240C/220C fan/gas 9.Sit the pork in a large roasting tin. If theskin isn’t already scored for you, scoreit with a small, sharp knife.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 140.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Mix togetherthe thyme, fennel seeds, oil and 1 tsp saltwith a good grinding of black pepper. Rubthis over the top and ends of the pork.Roast for 30 mins, then cover the wholetin with a large sheet of foil, reduce theoven temperature to 140C/120C fan/gas 1and return the pork to the oven for afurther 5 hrs.While the pork is cooking, make thechutney.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 240.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat the oil in a large saucepan.Soften the onion and chilli together for10-15 mins. Once soft, stir in the applechunks, vinegar and sugar with 50mlwater. Cover and cook over a low heatfor 15-20 mins, stirring occasionally, untilthe apple is very soft. Blitz half the applemixture with a hand blender, or scoophalf into a food processor and whizz untilsmooth, before stirring back into the panwith the leaves from the thyme sprig.Take the pork from the oven – the meatshould be very tender – and increase thetemperature to 240C/220C fan/gas 9.When the oven has reached temperature,discard the foil and put the pork back infor 30 mins to crisp up the skin a little.For really crisp crackling, remove the skinfrom the meat, wrap the meat in foil tokeep warm, and return only the skin tothe oven for 30 mins. Use a couple offorks to shred the pork from the joint.Sandwich in soft buttered rolls withapple chilli chutney, warm or at roomtemperature.', u'length': {u'number': 95, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Serve with pieces of crispcrackling on the side.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 322, u'instructions': u'Heat oven to 240C/220C fan/gas 9.Sit the pork in a large roasting tin. If theskin isn’t already scored for you, scoreit with a small, sharp knife. Mix togetherthe thyme, fennel seeds, oil and 1 tsp saltwith a good grinding of black pepper. Rubthis over the top and ends of the pork.Roast for 30 mins, then cover the wholetin with a large sheet of foil, reduce theoven temperature to 140C/120C fan/gas 1and return the pork to the oven for afurther 5 hrs.While the pork is cooking, make thechutney. Heat the oil in a large saucepan.Soften the onion and chilli together for10-15 mins. Once soft, stir in the applechunks, vinegar and sugar with 50mlwater. Cover and cook over a low heatfor 15-20 mins, stirring occasionally, untilthe apple is very soft. Blitz half the applemixture with a hand blender, or scoophalf into a food processor and whizz untilsmooth, before stirring back into the panwith the leaves from the thyme sprig.Take the pork from the oven – the meatshould be very tender – and increase thetemperature to 240C/220C fan/gas 9.When the oven has reached temperature,discard the foil and put the pork back infor 30 mins to crisp up the skin a little.For really crisp crackling, remove the skinfrom the meat, wrap the meat in foil tokeep warm, and return only the skin tothe oven for 30 mins. Use a couple offorks to shred the pork from the joint.Sandwich in soft buttered rolls withapple chilli chutney, warm or at roomtemperature. Serve with pieces of crispcrackling on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-roast-pork-rolls-with-apple-chilli-chutney-225563', u'dishTypes': [], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 375, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}