{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/620553-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 620553, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Chicken Pesto Sandwich', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 247.98, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 tablespoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'tablespoon'}, {u'originalString': u'1 loaf french bread', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18029, u'unit': u'loaf'}, {u'originalString': u'1 1/2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 tablespoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'1/3 cup pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93698, u'unit': u'cup'}, {u'originalString': u'4 slices provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'6 tablespoons roasted red peppers', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 11916, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 tomato, sliced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.foodfanatic.com/2014/11/grilled-chicken-pesto-sandwich/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Wrap bricks in aluminum foil; set aside.Preheat grill to medium-high heat.Butterfly the chicken breasts to create 4 thin chicken breasts.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Brush chicken breasts with olive oil and then sprinkle with spices (oregano, basil, salt and pepper).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the chicken breasts on the grill and top with foil-covered bricks. (If you place the 4 chicken breasts near each other, then 3 bricks should be plenty.) Grill for 6 minutes, flip (replacing the brick after flipping) and grill for 6-7 more minutes or until chicken is fully cooked.Meanwhile, slice the loaf of French bread into 4 sections. Split each section in half.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Spread the pesto evenly on the 4 bottom halves of bread. Set aside.Once the chicken is fully cooked, remove it from the grill and slice into strips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Place chicken breasts onto the pesto-rubbed pieces of French bread. Top each sandwich with a slice of provolone cheese, several strips of roasted red peppers and a slice of tomato.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11916, u'name': u'roasted red peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place top piece of bread on sandwiches.(Optional) While the grill is still hot (but with the burners turned off), place sandwiches on the grill for 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve sandwiches hot.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Wrap bricks in aluminum foil; set aside.Preheat grill to medium-high heat.Butterfly the chicken breasts to create 4 thin chicken breasts. Brush chicken breasts with olive oil and then sprinkle with spices (oregano, basil, salt and pepper).Place the chicken breasts on the grill and top with foil-covered bricks. (If you place the 4 chicken breasts near each other, then 3 bricks should be plenty.) Grill for 6 minutes, flip (replacing the brick after flipping) and grill for 6-7 more minutes or until chicken is fully cooked.Meanwhile, slice the loaf of French bread into 4 sections. Split each section in half. Spread the pesto evenly on the 4 bottom halves of bread. Set aside.Once the chicken is fully cooked, remove it from the grill and slice into strips. Place chicken breasts onto the pesto-rubbed pieces of French bread. Top each sandwich with a slice of provolone cheese, several strips of roasted red peppers and a slice of tomato. Place top piece of bread on sandwiches.(Optional) While the grill is still hot (but with the burners turned off), place sandwiches on the grill for 2-3 minutes. Serve sandwiches hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-chicken-pesto-sandwich-620553', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}