{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/221988-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 221988, u'veryPopular': False, u'lowFodmap': False, u'title': u'Split pea & green pea smoked ham soup', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 60.8, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 carrots, roughly chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stick celery, roughly chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stick'}, {u'originalString': u'crusty bread and butter, to serve', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'servings'}, {u'originalString': u'1kg gammon or ham hock', u'aisle': u'Meat', u'name': u'ham hock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 93669, u'unit': u'kg'}, {u'originalString': u'2 onions, roughly chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'300g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1022639/split-pea-and-green-pea-smoked-ham-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Put the gammon in a very large panwith 2 litres water and bring to the boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat and drain off thewater – this helps to get rid of some ofthe saltiness. Recover with 2 litres coldwater and bring to the boil again. Puteverything but the frozen peas into thepan and bring to the boil. Reduce toa simmer and cook for 1\xbd-2\xbd hrs,topping up the water as and when youneed to, to a similar level it started at.As the ham cooks and softens, you canhalve it if you want, so it is all submergedunder the liquid. When the ham is tenderenough to pull into shreds, it is ready.Lift out the ham, peel off and discard theskin. While it is still hot (wear a clean pairof rubber gloves), shred the meat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Removebay from the soup and stir in the frozenpeas. Simmer for 1 min, then blend untilsmooth.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a splash of water if too thick,and return to the pan to heat through ifit has cooled, or if you are making ahead.When you are ready to serve, mix thehot soup with most of the ham – gentlyreheat if made ahead.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve in bowlswith the remaining ham scattered ontop, and eat with crusty bread and butter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 10018029, u'name': u'crusty bread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 181, u'instructions': u'Put the gammon in a very large panwith 2 litres water and bring to the boil.Remove from the heat and drain off thewater – this helps to get rid of some ofthe saltiness. Recover with 2 litres coldwater and bring to the boil again. Puteverything but the frozen peas into thepan and bring to the boil. Reduce toa simmer and cook for 1\xbd-2\xbd hrs,topping up the water as and when youneed to, to a similar level it started at.As the ham cooks and softens, you canhalve it if you want, so it is all submergedunder the liquid. When the ham is tenderenough to pull into shreds, it is ready.Lift out the ham, peel off and discard theskin. While it is still hot (wear a clean pairof rubber gloves), shred the meat. Removebay from the soup and stir in the frozenpeas. Simmer for 1 min, then blend untilsmooth. Add a splash of water if too thick,and return to the pan to heat through ifit has cooled, or if you are making ahead.When you are ready to serve, mix thehot soup with most of the ham – gentlyreheat if made ahead. Serve in bowlswith the remaining ham scattered ontop, and eat with crusty bread and butter.', u'spoonacularSourceUrl': u'https://spoonacular.com/split-pea-green-pea-smoked-ham-soup-221988', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 210, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}