{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/215226-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 215226, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy-bake bread', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 22.24, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'500g strong bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'g'}, {u'originalString': u'1 tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'300ml hand-hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ml'}, {u'originalString': u'7g sachet fast-action dried yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 18375, u'unit': u'g'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1916656/easybake-bread', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Tip the flour into a bowl and mix in theyeast with the salt. Stir in the water, oiland honey. Now bring together to make asoft dough – I use my hands, but awooden spoon or knife from the cutlerydrawer is fine. Tip onto a lightly flouredsurface and knead for 10 mins. It is worthputting in the time to do this as it will payoff later with lovely airy bread.Don’t keep adding flour, a wet doughis better than a dry one, which will baketo a tough texture, so if you don’t like thedough sticking to your hands, lightly oilthem. If you are adding flavourings,knead them in gently now.Turn the dough into an oiled 1kg breadtin and cover with oiled cling film (orbetter still, a free unused shower capfrom your last hotel stay!). Put in a warmplace until the bread fills the tin, it shouldtake between 1-2 hrs.Uncover and bake your bread at200C/180C fan/gas 6 for 30-35 mins untilgolden. Tip out of the tin and tap the baseof the loaf. It should sound hollow whenfully cooked. If not cooked, put loaf backin the oven out of the tin and test againafter 10 mins. Cool.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 39, u'instructions': u'Tip the flour into a bowl and mix in theyeast with the salt. Stir in the water, oiland honey. Now bring together to make asoft dough – I use my hands, but awooden spoon or knife from the cutlerydrawer is fine. Tip onto a lightly flouredsurface and knead for 10 mins. It is worthputting in the time to do this as it will payoff later with lovely airy bread.Don’t keep adding flour, a wet doughis better than a dry one, which will baketo a tough texture, so if you don’t like thedough sticking to your hands, lightly oilthem. If you are adding flavourings,knead them in gently now.Turn the dough into an oiled 1kg breadtin and cover with oiled cling film (orbetter still, a free unused shower capfrom your last hotel stay!). Put in a warmplace until the bread fills the tin, it shouldtake between 1-2 hrs.Uncover and bake your bread at200C/180C fan/gas 6 for 30-35 mins untilgolden. Tip out of the tin and tap the baseof the loaf. It should sound hollow whenfully cooked. If not cooked, put loaf backin the oven out of the tin and test againafter 10 mins. Cool.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-bake-bread-215226', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 185, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}