{u'recipes': [{u'sourceName': u'Olgas Flavor Factory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485322-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 485322, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crepe Cake With Pastry Cream and Raspberries', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 133.11, u'creditText': u'Olgas Flavor Factory', u'extendedIngredients': [{u'originalString': u'6 Tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 teaspoon butter or oil, to grease the skillet for the crepes', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for the crepes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoon'}, {u'originalString': u'2 batches of Pastry Cream', u'aisle': u'Baking', u'name': u'pastry cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10019170, u'unit': u''}, {u'originalString': u'powdered sugar, to sprinkle on top of the raspberries', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1 pint raspberries, to garnish the cake', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'pint'}, {u'originalString': u'\xbc tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3 Tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tablespoons'}, {u'originalString': u'2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.olgasflavorfactory.com/sweets/desserts/crepe-cake-with-pastry-cream-and-raspberries/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u"I would recommend making the Pastry Cream ahead of time, but it can be done either way.Make the crepe batter by mixing all the ingredients in a blender. Chill the crepe batter at least for 1 hour. I usually make it the night before I'm planning to make the crepes. If you make the batter and the pastry cream the day before, assembling this cake will be a cinch.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'id': 10019170, u'name': u'pastry cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a nonstick skillet over medium high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Brush with a little bit of butter or oil, using a paper towel to distribute an even amount over the skillet. When the skillet is hot, pour in some crepe batter (a little bit more than half of a \xbc measuring cup for an 8 inch skillet) and tilt the skillet, distributing the batter evenly over the surface of the skillet.Flip the crepe over when the edges are slightly dry, about 1 min on the first side and 30 seconds on the second side.Repeat with all the batter, putting the crepes on a round dinner plate and covering with aluminum foil while you’re cooking the next crepe, to prevent the crepes from drying around the edges. You should have 30-32 crepes, if you're using an 8 or 9 inch skillet.Cool the crepes. Assemble the cake by placing a crepe on a plate or cake stand. Scoop out about \xbc cup of the pastry cream and spread it out all over the surface of the crepe. Repeat with all the crepes and pastry cream. Chill the cake for at least an hour, since the pastry cream needs to set. You won't be able to cut the cake right away, since it will be too wobbly and unsteady.", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'id': 10019170, u'name': u'pastry cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Garnish with fresh raspberries or any other berries, fruit, chocolate shavings and sprinkle on some powdered sugar.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 12019, u'instructions': u"I would recommend making the Pastry Cream ahead of time, but it can be done either way.Make the crepe batter by mixing all the ingredients in a blender. Chill the crepe batter at least for 1 hour. I usually make it the night before I'm planning to make the crepes. If you make the batter and the pastry cream the day before, assembling this cake will be a cinch.Heat a nonstick skillet over medium high heat. Brush with a little bit of butter or oil, using a paper towel to distribute an even amount over the skillet. When the skillet is hot, pour in some crepe batter (a little bit more than half of a \xbc measuring cup for an 8 inch skillet) and tilt the skillet, distributing the batter evenly over the surface of the skillet.Flip the crepe over when the edges are slightly dry, about 1 min on the first side and 30 seconds on the second side.Repeat with all the batter, putting the crepes on a round dinner plate and covering with aluminum foil while you’re cooking the next crepe, to prevent the crepes from drying around the edges. You should have 30-32 crepes, if you're using an 8 or 9 inch skillet.Cool the crepes. Assemble the cake by placing a crepe on a plate or cake stand. Scoop out about \xbc cup of the pastry cream and spread it out all over the surface of the crepe. Repeat with all the crepes and pastry cream. Chill the cake for at least an hour, since the pastry cream needs to set. You won't be able to cut the cake right away, since it will be too wobbly and unsteady. Garnish with fresh raspberries or any other berries, fruit, chocolate shavings and sprinkle on some powdered sugar.", u'spoonacularSourceUrl': u'https://spoonacular.com/crepe-cake-with-pastry-cream-and-raspberries-485322', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}