{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/471447-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 471447, u'veryPopular': False, u'lowFodmap': True, u'title': u'Feta-Stuffed Hamburgers', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 217.41, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 teaspoon dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoon'}, {u'originalString': u'1 cup crumbled feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 pound lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Feta-Stuffed-Hamburgers/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat an outdoor grill for medium heat, and lightly oil the grate.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Knead together the ground beef, Worcestershire sauce, parsley, salt, and pepper in a bowl. Form the mixture into 8 equal-sized balls; flatten to make thin patties.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place about 1/4 cup of feta cheese onto each of four of the patties. Top each of the patties with cheese with one of the patties without; press the edges together to seal the cheese into the center.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Cook on the preheated grill until the burgers are cooked to your desired degree of doneness, 7 to 8 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Gordon Estate Malbec Wine with a 5 out of 5 star rating seems like a good match. It costs about 23 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'blackberry , currant , spice', u'title': u'Gordon Estate Malbec Wine', u'price': u'$22.99', u'id': 469190, u'link': u'https://www.amazon.com/2013-Gordon-Estate-Malbec-Wine/dp/B01E68602I', u'imageUrl': u'https://spoonacular.com/productImages/469190-312x231.jpg'}]}, u'aggregateLikes': 246, u'instructions': u'Preheat an outdoor grill for medium heat, and lightly oil the grate.                            Knead together the ground beef, Worcestershire sauce, parsley, salt, and pepper in a bowl. Form the mixture into 8 equal-sized balls; flatten to make thin patties. Place about 1/4 cup of feta cheese onto each of four of the patties. Top each of the patties with cheese with one of the patties without; press the edges together to seal the cheese into the center.                            Cook on the preheated grill until the burgers are cooked to your desired degree of doneness, 7 to 8 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/feta-stuffed-hamburgers-471447', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}