{u'recipes': [{u'sourceName': u'Lemons and Anchovies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/568508-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 568508, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pear, Prosciutto and Truffled Brie Tart', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 117.86, u'creditText': u'Lemons and Anchovies', u'extendedIngredients': [{u'originalString': u'A couple ounces Brie cheese (I used brie with truffles)', u'aisle': u'Cheese', u'name': u'brie cheese', u'metaInformation': [u'with truffles)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1006, u'unit': u'ounces'}, {u'originalString': u'Olive oil for brushing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'\xbd pear, peeled, seeded and sliced thinly', u'aisle': u'Produce', u'name': u'pear', u'metaInformation': [u'peeled', u'seeded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'2 - 3 slices prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}, {u'originalString': u'1 sheet frozen puff pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://lemonsandanchovies.com/2012/11/pear-prosciutto-and-truffled-brie-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 375\xb0FTrim about \xbd inch from the edges of the puff pastry sheet and set back on top of the sheet to form a border. Trim the excess to fit. Press the edges slightly to bind together. Pierce the surface of the pastry sheet with a fork to prevent puffing while you pre-bake.Arrange the pastry sheet on a baking sheet (I lined mine with nonstick foil), brush very lightly with olive oil and bake for about 5 minutes, until it starts to color a little.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the pre-baked pastry from the oven and scatter the toppings, cheese first, then the prosciutto followed by the pears.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [], u'step': u'Brush the top very lightly with olive oil just to aid in browning.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Bake for about 20 minutes or until the edges are golden. The toppings should be a little golden, too.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut in small squares; serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Preheat your oven to 375\xb0FTrim about \xbd inch from the edges of the puff pastry sheet and set back on top of the sheet to form a border. Trim the excess to fit. Press the edges slightly to bind together. Pierce the surface of the pastry sheet with a fork to prevent puffing while you pre-bake.Arrange the pastry sheet on a baking sheet (I lined mine with nonstick foil), brush very lightly with olive oil and bake for about 5 minutes, until it starts to color a little.Remove the pre-baked pastry from the oven and scatter the toppings, cheese first, then the prosciutto followed by the pears. Brush the top very lightly with olive oil just to aid in browning. Bake for about 20 minutes or until the edges are golden. The toppings should be a little golden, too.Cut in small squares; serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/pear-prosciutto-and-truffled-brie-tart-568508', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}