{u'recipes': [{u'sourceName': u'Tidy Mom', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/612209-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 612209, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kicked Up Smoked Sausage Alfredo', u'diets': [], u'preparationMinutes': 3, u'pricePerServing': 172.85, u'creditText': u'Tidy Mom', u'extendedIngredients': [{u'originalString': u'1 cup baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1/2 tablespoon Italian Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022027, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pound penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'pound'}, {u'originalString': u'1/4 cup julienne sun dried tomatoes in oil', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun dried tomatoes', u'metaInformation': [u'dried', u'in oil'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11955, u'unit': u'cup'}, {u'originalString': u'1 package (14 ounces) Butterball\xae Smoked Turkey Dinner Sausage, diagonally cut into 1/4-inch thick slices', u'aisle': u'Meat', u'name': u'turkey sausage', u'metaInformation': [u'smoked', u'cut into 1/ slices', u'butterball\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 7955, u'unit': u'ounces'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://tidymom.net/2014/smoked-sausage-alfredo/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook turkey sausage and garlic in large skillet over medium-high heat turning occasionally for 5 minutes or until sausage is lightly browned.Meanwhile, prepare penne pasta according to package directions and drain.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'id': 7955, u'name': u'turkey sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add cream, dry mustard and crushed red pepper to skillet with sausage; bring to a boil. Reduce heat; simmer gently for 3-4 minutes or until mixture begins to thicken. STIR in spinach and sun dried tomatoes; stir gently until spinach wilts.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Remove from heat, stir in Parmesan cheese, add pasta to sauce and toss.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately with a sprinkle of Italian seasoning and garnish with parsley.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Felsina Chianti Colli Senesi. It has 4.1 out of 5 stars and a bottle costs about 21 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 2930, u'instructions': u'Cook turkey sausage and garlic in large skillet over medium-high heat turning occasionally for 5 minutes or until sausage is lightly browned.Meanwhile, prepare penne pasta according to package directions and drain.Add cream, dry mustard and crushed red pepper to skillet with sausage; bring to a boil. Reduce heat; simmer gently for 3-4 minutes or until mixture begins to thicken. STIR in spinach and sun dried tomatoes; stir gently until spinach wilts. Remove from heat, stir in Parmesan cheese, add pasta to sauce and toss.  Serve immediately with a sprinkle of Italian seasoning and garnish with parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/kicked-up-smoked-sausage-alfredo-612209', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}