{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/517335-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 517335, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dried Fig Souvlaki', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 56.57, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'18 large dried figs', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 9094, u'unit': u''}, {u'originalString': u'18 (1/2-inch) cubes feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'inch'}, {u'originalString': u'18 large fresh sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'18 thin slices prosciutto, pastourma, or bresaola', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 18.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}, {u'originalString': u'18 large toothpicks', u'aisle': u'?', u'name': u'toothpicks', u'metaInformation': [u'large'], u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.recipegirl.com/2007/03/02/dried-fig-souvlaki/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Make ahead:  Using small sharp knife, cut stem from top of each fig, then cut straight down from top center to make 3/4-inch-deep, 1/2-inch-long slit in fig. Fill slit in each fig with cube of feta cheese, then press opening closed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [], u'step': u'Place 1 slice of prosciutto on work surface; top with sage leaf.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Remove plate of appetizers from the refrigerator.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand at room temperature 1 hour before continuing.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour enough oil into large skillet to cover bottom.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Heat over medium-high heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add figs. Cook until prosciutto begins to crisp, about 2 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [], u'step': u'Transfer to large platter.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 7, u'ingredients': []}], u'name': u'Place stuffed fig at 1 end and roll up to enclose fig. Secure with toothpick. Repeat with remaining prosciutto, sage, and figs.   Arrange on plate, cover tightly with plastic wrap, and chill until ready to cook.2.  Cooking the Souvlaki'}], u'winePairing': {u'pairingText': u'Assyrtiko and Moschofilero are my top picks for Souvlaki. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. One wine you could try is Sigalas Assyrtiko Santorini. It has 4.2 out of 5 stars and a bottle costs about 22 dollars.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko. View More', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 140, u'instructions': u'1.  Make ahead:  Using small sharp knife, cut stem from top of each fig, then cut straight down from top center to make 3/4-inch-deep, 1/2-inch-long slit in fig. Fill slit in each fig with cube of feta cheese, then press opening closed. Place 1 slice of prosciutto on work surface; top with sage leaf. Place stuffed fig at 1 end and roll up to enclose fig. Secure with toothpick. Repeat with remaining prosciutto, sage, and figs.   Arrange on plate, cover tightly with plastic wrap, and chill until ready to cook.2.  Cooking the Souvlaki:  Remove plate of appetizers from the refrigerator.  Let stand at room temperature 1 hour before continuing. Pour enough oil into large skillet to cover bottom. Heat over medium-high heat. Add figs. Cook until prosciutto begins to crisp, about 2 minutes per side. Transfer to large platter. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/dried-fig-souvlaki-517335', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}