{u'recipes': [{u'sourceName': u'Good Life Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537793-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 537793, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon Curd and Fresh Fruit Phyllo Tarts', u'diets': [], u'pricePerServing': 113.23, u'creditText': u'Good Life Eats', u'extendedIngredients': [{u'originalString': u'3 6-cup muffin tins', u'aisle': u'Bakery/Bread', u'name': u'english muffin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/English-muffins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 18.0, u'consistency': u'solid', u'id': 18439, u'unit': u'cup'}, {u'originalString': u'1 bag DOVE\xae PROMISES\xae Milk Chocolates', u'aisle': u'Sweet Snacks', u'name': u'hersheys kisses brand milk chocolates', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hersheys-kisses-or-chocolate-kisses.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 93743, u'unit': u'bag'}, {u'originalString': u'4 oranges, sectioned', u'aisle': u'Produce', u'name': u'oranges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'16 sheets phyllo dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 16.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}, {u'originalString': u'4 cups strawberries, sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'1/4 cup (1/2 stick) unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 cup prepared lemon curd or vanilla pudding', u'aisle': u'Baking', u'name': u'vanilla pudding mix', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19206, u'unit': u'cup'}, {u'originalString': u'Damp kitchen towel or plastic wrap', u'aisle': u'Bakery/Bread', u'name': u'wrap', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 10018364, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.goodlifeeats.com/2014/04/lemon-curd-and-fresh-fruit-phyllo-tarts.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'While working with phyllo dough, keep it covered with damp cloth or plastic wrap. Work in small batches. Begin by stacking 4 sheets of phyllo dough, brushing each sheet with melted butter before stacking.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [], u'step': u'Cut stack into eight squares. Arrange 2 squares, overlapping, in each muffin cup, filling eight cups. Repeat process with remaining sheets of dough.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in a preheated 375\xba oven for 6-8 minutes. Cool completely.Set aside twelve DOVE\xae PROMISES\xae Milk Chocolate. Melt remaining chocolate and brush it inside phyllo cups. Fill with orange segments and strawberries.Top with dollop of lemon curd or pudding and a DOVE\xae PROMISES\xae Milk Chocolate.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-slices.png', u'id': 1019200, u'name': u'orange slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 2726, u'instructions': u'While working with phyllo dough, keep it covered with damp cloth or plastic wrap. Work in small batches. Begin by stacking 4 sheets of phyllo dough, brushing each sheet with melted butter before stacking. Cut stack into eight squares. Arrange 2 squares, overlapping, in each muffin cup, filling eight cups. Repeat process with remaining sheets of dough.Bake in a preheated 375\xba oven for 6-8 minutes. Cool completely.Set aside twelve DOVE\xae PROMISES\xae Milk Chocolate. Melt remaining chocolate and brush it inside phyllo cups. Fill with orange segments and strawberries.Top with dollop of lemon curd or pudding and a DOVE\xae PROMISES\xae Milk Chocolate.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-curd-and-fresh-fruit-phyllo-tarts-537793', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}