{u'recipes': [{u'sourceName': u'Bellalimento', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601800-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 601800, u'veryPopular': False, u'lowFodmap': True, u'title': u'Grilled Poundcake with Berries', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 51.35, u'creditText': u'Bellalimento', u'extendedIngredients': [{u'originalString': u'1/4 cup fresh blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'6 ounces Liberte Mediterranee lemon yogurt', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 9150, u'unit': u'ounces'}, {u'originalString': u'fresh mint leaves - to garnish, optional', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'leaves'}, {u'originalString': u'1 pound cake - sliced into 1 1/2" thick slices', u'aisle': u'Bakery/Bread', u'name': u'pound cake', u'metaInformation': [u'thick', u'sliced into 1 1/2"  slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 18133, u'unit': u''}, {u'originalString': u'Dixie Crystals powdered sugar - to dust', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'2 tablespoons unsalted butter - melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.bellalimento.com/2013/06/01/grilled-pound-cake-with-berries/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Place a non-stick grill pan over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Brush both sides of pound cake with butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'id': 18133, u'name': u'pound cake'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place onto grill pan and cook for approximately 1 minute on each side OR until grill marks have formed. Top pound cake with powdered sugar, yogurt, blueberries and mint.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'id': 18133, u'name': u'pound cake'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Pound Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Place a non-stick grill pan over medium heat. Brush both sides of pound cake with butter. Place onto grill pan and cook for approximately 1 minute on each side OR until grill marks have formed. Top pound cake with powdered sugar, yogurt, blueberries and mint.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-poundcake-with-berries-601800', u'dishTypes': [], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}