{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219554-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 219554, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mustard pork fillet with apple lentils & herb aioli', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 331.76, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 apple, cored and diced', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'diced', u'cored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'2 tbsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tbsp'}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'green beans, to serve', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11052, u'unit': u'servings'}, {u'originalString': u'zest and juice 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'350g Puy lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 16069, u'unit': u'g'}, {u'originalString': u'200g jar good-quality mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'g'}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1kg pork loin fillet', u'aisle': u'Meat', u'name': u'pork loin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 10225, u'unit': u'kg'}, {u'originalString': u'small bunch tarragon, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'tarragon', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'bunch'}, {u'originalString': u'1l vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'l'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1580649/mustard-pork-fillet-with-apple-lentils-and-herb-ai', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Rub the pork with a tbsp of oil, add someseasoning, then seal the outside of themeat all over in a hot frying pan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transferthe pork to a baking sheet, brush theoutside with the mustard, then press onhalf of the tarragon and cook for 20 mins.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and cover withfoil for 5 mins.Meanwhile, cook the lentils in the stockuntil just tender, about 12 mins, drain,then toss with the remaining olive oil,half the lemon juice and the apple.To make the aioli, mix the mayo, garlic,lemon zest and remaining juice andtarragon with some seasoning, then setaside. Slice the pork into thick slices andserve on a platter with the lentils, a bowlof aioli to dip into and some green beans.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Malbec, Pinot Noir, and Sangiovese are my top picks for Pork Tenderloin. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. One wine you could try is Luigi Bosca Malbec. It has 4.2 out of 5 stars and a bottle costs about 23 dollars.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'Luigi Bosca Malbec is an intense purple colour wine, with distinct aromas of ripe red fruits, spices and black pepper. The intensity of the entry in the mouth is complemented with the softness and sweetness of tannins, respecting the characteristics of the grape variety in Argentina. A pure, full-bodied, well-structured red wine with character and all the juiciness typical of this variety. A long lingering and elegant finish. View More', u'title': u'Luigi Bosca Malbec', u'price': u'$22.99', u'id': 438334, u'link': u'https://www.wine.com/product/luigi-bosca-malbec-2011/132493', u'imageUrl': u'https://spoonacular.com/productImages/438334-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Rub the pork with a tbsp of oil, add someseasoning, then seal the outside of themeat all over in a hot frying pan. Transferthe pork to a baking sheet, brush theoutside with the mustard, then press onhalf of the tarragon and cook for 20 mins.Remove from the oven and cover withfoil for 5 mins.Meanwhile, cook the lentils in the stockuntil just tender, about 12 mins, drain,then toss with the remaining olive oil,half the lemon juice and the apple.To make the aioli, mix the mayo, garlic,lemon zest and remaining juice andtarragon with some seasoning, then setaside. Slice the pork into thick slices andserve on a platter with the lentils, a bowlof aioli to dip into and some green beans.', u'spoonacularSourceUrl': u'https://spoonacular.com/mustard-pork-fillet-with-apple-lentils-herb-aioli-219554', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}