{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/212440-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 212440, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lamb, lemon & dill souvlaki', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 692.13, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'700g lean lamb such as neck fillet or boneless leg, trimmed, then cut into large chunks', u'aisle': u'Meat', u'name': u'boar leg', u'metaInformation': [u'boneless', u'lean', u'large', u'trimmed', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 700.0, u'consistency': u'liquid', u'id': 10417158, u'unit': u'g'}, {u'originalString': u'pitta bread or flatbread, to serve', u'aisle': u'Bakery/Bread', u'name': u'flatbread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10018413, u'unit': u'servings'}, {u'originalString': u'1 tbsp finely chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tbsp'}, {u'originalString': u'2 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'zest and juice 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'4 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/12226/lamb-lemon-and-dill-souvlaki', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Pound the garlic with sea salt in apestle and mortar (or use a small foodprocessor), until the garlic forms a paste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the oil, lemon juice, zest,dill and garlic.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/skewer-metal.jpg', u'id': 404712, u'name': u'metal skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Mix in the lamb andcombine well. Cover and marinate forat least 2 hrs or overnight in the fridge.If you’re going to use bamboo skewers,soak them in cold water.If you’ve prepared the lamb the previousday, take it out of the fridge 30 minsbefore cooking. Thread the meat ontothe soaked or metal skewers.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat thegrill to high or have a hot griddle pan orbarbecue ready. Cook the skewers for2-3 mins on each side, basting with theremaining marinade.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Heat the pitta orflatbreads briefly, then stuff with thesouvlaki.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Add Greek salad (see 'Goes well with', right) and Tzatziki (below), if you like.", u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Souvlaki can be paired with Assyrtiko and Moschofilero. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. One wine you could try is Sigalas Assyrtiko Santorini. It has 4.2 out of 5 stars and a bottle costs about 22 dollars.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko.', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 74, u'instructions': u"Pound the garlic with sea salt in apestle and mortar (or use a small foodprocessor), until the garlic forms a paste.Whisk together the oil, lemon juice, zest,dill and garlic. Mix in the lamb andcombine well. Cover and marinate forat least 2 hrs or overnight in the fridge.If you’re going to use bamboo skewers,soak them in cold water.If you’ve prepared the lamb the previousday, take it out of the fridge 30 minsbefore cooking. Thread the meat ontothe soaked or metal skewers. Heat thegrill to high or have a hot griddle pan orbarbecue ready. Cook the skewers for2-3 mins on each side, basting with theremaining marinade. Heat the pitta orflatbreads briefly, then stuff with thesouvlaki. Add Greek salad (see 'Goes well with', right) and Tzatziki (below), if you like.", u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-lemon-dill-souvlaki-212440', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}