{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223402-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 223402, u'veryPopular': False, u'lowFodmap': False, u'title': u'Three-cheese cheesecake', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 299.23, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g butter, plus extra for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'150g digestive biscuits, crushed', u'aisle': u'Sweet Snacks', u'name': u'digestive biscuits', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/digestive-biscuits.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 18173, u'unit': u'g'}, {u'originalString': u'4 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'300g pot full-fat soft cheese', u'aisle': u'Cheese', u'name': u'full-fat cottage cheese', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 1012, u'unit': u'g'}, {u'originalString': u"150g pot mild, creamy goat's cheese", u'aisle': u'Meat', u'name': u'pot roast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pot-roast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 23612, u'unit': u'g'}, {u'originalString': u'250g pot mascarpone', u'aisle': u'Meat', u'name': u'pot roast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pot-roast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 23612, u'unit': u'g'}, {u'originalString': u'250ml punnet raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 250.0, u'consistency': u'solid', u'id': 9302, u'unit': u'ml'}, {u'originalString': u'strawberries, to serve', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9316, u'unit': u'servings'}, {u'originalString': u'1 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'50g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'50g walnuts, finely chopped', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12155, u'unit': u'g'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2264/threecheese-cheesecake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oven to 180C/fan 160C/gas 4. Butter 8 x 150ml ramekins. Melt the butter in a pan, then mix in the digestives, walnuts and sugar. Divide the mixture equally between the ramekins, so the base of each is covered with a layer about 1cm thick. Press down lightly on each, then cook in the oven for 10 mins until crisp and golden. Leave to cool, then turn oven down to 150C/fan 130C/gas 2.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together all remaining ingredients until you have a smooth mixture.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the ramekins on a baking tray and pour some mixture into each one, filling to about 1cm below the rim. Carefully slide them into the oven and cook for 25-30 mins until just set. The mixture should give the faintest jiggle in the centre when gently tapped. Don’t worry if the mixture falls a little and cracks.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and leave to cool completely before covering with cling film and putting in the fridge. You can make to this point up to 2 days in advance.Make the sauce by gently heating together the sugar and 50ml/2fl oz water until syrupy, about 5 mins. Then stir in half the raspberries and cook for 2 mins until they begin to burst. Strain the mixture through a sieve to remove the pips, then toss through the remaining raspberries and leave to cool.When ready to serve, remove the cheesecakes from the fridge. Run a knife dipped in hot water around the edges. Invert, one at a time, onto a board, then turn over again onto a serving plate so the biscuit base is on the bottom. Finish by drizzling with raspberry sauce and top with strawberries.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 79, u'instructions': u'Heat oven to 180C/fan 160C/gas 4. Butter 8 x 150ml ramekins. Melt the butter in a pan, then mix in the digestives, walnuts and sugar. Divide the mixture equally between the ramekins, so the base of each is covered with a layer about 1cm thick. Press down lightly on each, then cook in the oven for 10 mins until crisp and golden. Leave to cool, then turn oven down to 150C/fan 130C/gas 2.Whisk together all remaining ingredients until you have a smooth mixture. Place the ramekins on a baking tray and pour some mixture into each one, filling to about 1cm below the rim. Carefully slide them into the oven and cook for 25-30 mins until just set. The mixture should give the faintest jiggle in the centre when gently tapped. Don’t worry if the mixture falls a little and cracks. Remove from the oven and leave to cool completely before covering with cling film and putting in the fridge. You can make to this point up to 2 days in advance.Make the sauce by gently heating together the sugar and 50ml/2fl oz water until syrupy, about 5 mins. Then stir in half the raspberries and cook for 2 mins until they begin to burst. Strain the mixture through a sieve to remove the pips, then toss through the remaining raspberries and leave to cool.When ready to serve, remove the cheesecakes from the fridge. Run a knife dipped in hot water around the edges. Invert, one at a time, onto a board, then turn over again onto a serving plate so the biscuit base is on the bottom. Finish by drizzling with raspberry sauce and top with strawberries.', u'spoonacularSourceUrl': u'https://spoonacular.com/three-cheese-cheesecake-223402', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}