{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520656-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 520656, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Gluten Free Pancakes', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 56.36, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 small apple (or 1/4 c applesauce)', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 Tsp Baking Powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tsp', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'Tsp'}, {u'originalString': u'1/2 Tsp Baking Soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tsps', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'Tsp'}, {u'originalString': u'1 small to medium ripe banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'small to medium', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 Tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tsp', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tsp'}, {u'originalString': u'2 Tbsp Coconut Flour (or the flour of your liking; wheat, pastry, almond, rice, etc.)', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [u'(or the flour of your liking; wheat, pastry, almond, rice, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93747, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp coconut oil, melted; optional', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp Flax Seeds', u'aisle': u'Health Foods;Baking', u'name': u'flax seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10012220, u'unit': u'Tbsp'}, {u'originalString': u"1/4 c of nut milk (I used TJ's lowfat vanilla almond milk)", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hazel nut milk', u'metaInformation': [u"(I used TJ's lowfat vanilla almond milk)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 99132, u'unit': u'c'}, {u'originalString': u'1/4 c more water or nut milk only if the batter is very thick, for me this was necessary', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hazel nut milk', u'metaInformation': [u'thick', u'for me this was necessary'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 99132, u'unit': u'c'}, {u'originalString': u'1/2 Tsp nutmeg, optional', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'Tsps', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'Tsp'}, {u'originalString': u'1/3 c dry oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 8120, u'unit': u'c'}, {u'originalString': u'pinch salt, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 Tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Tsp', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'Tsp'}, {u'originalString': u'coconut oil or vegetable oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.averiecooks.com/2010/01/vegan-gluten-free-pancakes.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend first 4 ingredients in Vita, Food Proc, or blender.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Let this sit for 10 mins to give the flax seeds time to gel, thereby producing an egg-like effect.  The apple & banana help with this, too Then add the oats, coconut flour, coconut oil (optional) cinnamon, vanilla, nutmeg, salt, baking powder, baking soda, and blend until smooth. If batter is very thick, add up to about 1/4 cup additional water or nut milk to thin it out. For frying, I used 2 Tbsp Coconut Oil to fry pancakes pancakes on the first side, about 4 minutes on the first side and about 3 minutes on the second side, adding about 2 more tablespoons coconut oil for the second side.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93747, u'name': u'coconut flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 10012220, u'name': u'flaxseed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Serve immediately with syrup, a dusting of confectioners' sugar, berries, or favorite pancake topping.", u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 70, u'instructions': u"Blend first 4 ingredients in Vita, Food Proc, or blender.   Let this sit for 10 mins to give the flax seeds time to gel, thereby producing an egg-like effect.  The apple & banana help with this, too Then add the oats, coconut flour, coconut oil (optional) cinnamon, vanilla, nutmeg, salt, baking powder, baking soda, and blend until smooth. If batter is very thick, add up to about 1/4 cup additional water or nut milk to thin it out. For frying, I used 2 Tbsp Coconut Oil to fry pancakes pancakes on the first side, about 4 minutes on the first side and about 3 minutes on the second side, adding about 2 more tablespoons coconut oil for the second side. Serve immediately with syrup, a dusting of confectioners' sugar, berries, or favorite pancake topping.", u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-gluten-free-pancakes-520656', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}