{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/471898-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 471898, u'veryPopular': False, u'lowFodmap': False, u'title': u'Garlic Chicken Pizza', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 252.89, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 teaspoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'3 cups bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'2 tablespoons cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 35137, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon granulated garlic', u'aisle': u'Spices and Seasonings', u'name': u'granulated garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002020, u'unit': u'teaspoon'}, {u'originalString': u'1 green bell pepper, seeded and diced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'diced', u'green', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 tablespoons dry milk powder', u'aisle': u'Baking', u'name': u'milk powder', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1090, u'unit': u'tablespoons'}, {u'originalString': u'1/4 red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 cup roasted garlic and parmesan cheese sauce', u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cup'}, {u'originalString': u'1 1/4 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'10 ounces mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'ounces'}, {u'originalString': u'1 tomato, cut into thin wedges', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'cut into thin wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 1/2 teaspoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'teaspoons'}, {u'originalString': u'1 1/8 cups warm water (110 degrees F/45 degrees C)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(110 degrees F/45 degrees C)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.125, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'2 grilled skinless, boneless chicken breast, diced', u'aisle': u'?', u'name': u'grilled', u'metaInformation': [u'diced', u'boneless', u'skinless'], u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'unit': u''}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Garlic-Chicken-Pizza/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bread-machine.jpg', u'id': 5607, u'name': u'bread machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 475.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 475 degrees F (245 degrees C). Sprinkle a large pizza pan with cornmeal.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll or pat dough out on a lightly floured surface until it is the diameter of the pizza pan; place on pan.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread dough with sauce, then sprinkle with garlic. Cover with cheese. On top of the pizza, arrange chicken, green pepper, onion and tomato.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 20 to 25 minutes, or until dough is baked, cheese is melted and toppings are lightly browned.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Selvapiana Chianti Rufina. It has 4.3 out of 5 stars and a bottle costs about 14 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses.', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 70, u'instructions': u'Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.                            Preheat oven to 475 degrees F (245 degrees C). Sprinkle a large pizza pan with cornmeal. Roll or pat dough out on a lightly floured surface until it is the diameter of the pizza pan; place on pan.                            Spread dough with sauce, then sprinkle with garlic. Cover with cheese. On top of the pizza, arrange chicken, green pepper, onion and tomato.                            Bake in preheated oven for 20 to 25 minutes, or until dough is baked, cheese is melted and toppings are lightly browned.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-chicken-pizza-471898', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 170, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}