{u'recipes': [{u'sourceName': u'Curious Cuisiniere', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615342-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 615342, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Stuffed Pork Chops', u'diets': [u'dairy free'], u'preparationMinutes': 35, u'pricePerServing': 313.4, u'creditText': u'Curious Cuisiniere', u'extendedIngredients': [{u'originalString': u'2 large, sweet apples (like Gala), peeled, cored, and diced', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'diced', u'sweet', u'cored', u'large', u'peeled', u'(like Gala)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'\xbc c balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'c'}, {u'originalString': u'4 c whole wheat bread, cut into \xbd” cubes and left to air dry overnight', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'whole wheat', u'dry', u'cut into \xbd” cubes and left to air  overnight'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 18064, u'unit': u'c'}, {u'originalString': u'2 celery stalks, diced', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'4 tsp olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'4 Pork Chops, 1\xbd” thick', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 small, sweet onion, diced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'\xbd c water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'c'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.curiouscuisiniere.com/apple-stuffed-pork-chops/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 300F.Using a sharp knife, cut a pocket into the pork chops by slicing horizontally through the side of the chop, being careful not to slice all the way through.In a large, cast iron skillet, heat 2 tsp of olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add apples, celery and onion. Saut over medium-high heat until everything is soft and golden, 3-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Add the dried bread cubes and salt. Stir to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18064, u'name': u'bread cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in the balsamic vinegar and water, until everything is moist. Cook over medium heat, stirring often, until the mixture is heated through, 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the pan from the heat and stuff each pork chop. (You may not use all of the stuffing, simply place any extra in a bowl to the side.)Return the skillet to the heat and heat the remaining 2 tsp of the olive oil over high heat. When the oil is hot, sear the pork chops 1-2 minutes per side, until lightly golden.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and arrange the seared pork chops in the pan. Arrange any extra stuffing around the chops and cover the pan with aluminum foil.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the covered skillet in your preheated oven and bake for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pork Chops on the menu? Try pairing with Chardonnay, Pinot Noir, and Riesling. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 64, u'instructions': u'Preheat your oven to 300F.Using a sharp knife, cut a pocket into the pork chops by slicing horizontally through the side of the chop, being careful not to slice all the way through.In a large, cast iron skillet, heat 2 tsp of olive oil. Add apples, celery and onion. Saut over medium-high heat until everything is soft and golden, 3-5 minutes.Add the dried bread cubes and salt. Stir to combine.Mix in the balsamic vinegar and water, until everything is moist. Cook over medium heat, stirring often, until the mixture is heated through, 2-3 minutes.Remove the pan from the heat and stuff each pork chop. (You may not use all of the stuffing, simply place any extra in a bowl to the side.)Return the skillet to the heat and heat the remaining 2 tsp of the olive oil over high heat. When the oil is hot, sear the pork chops 1-2 minutes per side, until lightly golden.Remove the pan from the heat and arrange the seared pork chops in the pan. Arrange any extra stuffing around the chops and cover the pan with aluminum foil.Place the covered skillet in your preheated oven and bake for 30 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-stuffed-pork-chops-615342', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}