{u'recipes': [{u'sourceName': u'Garnish with Lemon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621411-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 621411, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spinach Artichoke Stuffed Mushrooms', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 25, u'pricePerServing': 36.35, u'creditText': u'Garnish with Lemon', u'extendedIngredients': [{u'originalString': u'1 (14-ounce) can small artichoke hearts, drained and coarsely chopped', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'small', u'drained', u'coarsely chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 93828, u'unit': u'ounce'}, {u'originalString': u'36 Baby Bella mushrooms', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 36.0, u'consistency': u'solid', u'id': 11266, u'unit': u''}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 36.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1\xbd cups shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'cups'}, {u'originalString': u'\xbd cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 (10-ounce) package frozen chopped spinach, thawed, drained and squeezed dry', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'frozen', u'dry', u'thawed', u'drained', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounce'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.garnishwithlemon.com/spinach-artichoke-stuffed-mushrooms/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees. Clean and destem the mushrooms.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place them cap side down on a baking pan and lightly spray with olive oil. Roast for 10-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool slightly and wipe away any released juices.While mushrooms are roasting, combine sour cream, garlic, artichoke hearts, spinach, cream cheese, mozzarella cheese and 2 tablespoons Pecorino in a bowl. Stir until thoroughly incorporated. Season to taste with salt and pepper.Generously stuff the mushrooms with dip and then sprinkle with remaining Pecorino cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Bake for 20-25 minutes or until cheese starts to brown.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 534, u'instructions': u'Preheat the oven to 400 degrees. Clean and destem the mushrooms. Place them cap side down on a baking pan and lightly spray with olive oil. Roast for 10-15 minutes. Let cool slightly and wipe away any released juices.While mushrooms are roasting, combine sour cream, garlic, artichoke hearts, spinach, cream cheese, mozzarella cheese and 2 tablespoons Pecorino in a bowl. Stir until thoroughly incorporated. Season to taste with salt and pepper.Generously stuff the mushrooms with dip and then sprinkle with remaining Pecorino cheese. Bake for 20-25 minutes or until cheese starts to brown. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-artichoke-stuffed-mushrooms-621411', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}