{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507771-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 507771, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fresh Strawberry Pie', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 174.42, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'2 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'1\xbc cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbc cup ice water', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10014412, u'unit': u'cup'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1\xbd teaspoons Sure-Jell for low-sugar recipes (the pink box)', u'aisle': u'Baking', u'name': u'lime jell-o', u'metaInformation': [u'for low-sugar recipes (the pink box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-jello.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 10019172, u'unit': u'teaspoons'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'4 pints (about 3 pounds) fresh strawberries, gently rinsed and dried, hulled', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'dried', u'fresh', u'hulled', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 9316, u'unit': u'pounds'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'6 tablespoons cold unsalted butter, cut into \xbc-inch slices', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into \xbc-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup chilled vegetable shortening, cut into 4 pieces', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [u'chilled', u'cut into 4 pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.browneyedbaker.com/2011/06/14/fresh-strawberry-pie-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Make the Pie Crust: Process \xbe cup flour, salt and sugar together in food processor until combined, about two 1-second pulses.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add butter and shortening and process until homogenous dough just starts to collect in uneven clumps, about 10 seconds (dough will resemble cottage cheese curds with some very small pieces of butter remaining, but there should be no uncoated flour). Scrap down sides and bottom of bowl with rubber spatula and redistribute dough evenly around processor blade.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add \xbd cup flour and pulse until mixture is evenly distributed around bowl and mass of dough has been broken up, 4 to 6 quick pulses. Empty mixture into a medium bowl.2. Sprinkle the water over the mixture. With a rubber spatula, use a folding motion to mix, pressing down on dough until dough is slightly tacky and sticks together. Flatten dough into a 4-inch disk. Wrap in plastic wrap and refrigerate at least 45 minutes or up to 2 days.3. Adjust oven rack to lowest position and preheat oven to 425 degrees F.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove dough from refrigerator and roll out on generously floured work surface to 12-inch circle about 1/8-inch thick.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Roll dough loosely around a rolling pin and unroll into pie plate, leaving at least 1-inch overhang on each side. Working around circumference, ease dough into plate by gently lifting edge of dough with 1 hand while pressing into plate bottom with other hand. Leave overhanging dough in place; refrigerate until dough is firm, about 30 minutes.4. Trim overhang to \xbd inch beyond lip of pie plate. Fold overhang under itself; folded edge should be flush with edge of pie plate. Flute dough or press tines of fork against dough to flatten against rim of pie plate. Refrigerate dough-lined plate until firm, about 15 minutes.5.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove pie plate from refrigerator and use a fork to prick the bottom of the dough. Line the crust with foil, and fill with pie weights or dried beans.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil and weight, rotate plate, and bake for 5 to 10 additional minutes, until crust is golden brown and crisp.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool to room temperature.6. Make the Filling: Select 6 ounces misshapen, underripe, or otherwise unattractive berries, halving those that are large; you should have about 1\xbd cups. In a food processor, process the berries to a smooth puree, 20 to 30 seconds, scraping down the bowl as needed.7.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Whisk the sugar, cornstarch, Sure-Jell, and salt in a medium saucepan. Stir in the berry puree, making sure to scrape the corners of the pan. Cook over medium-high heat, stirring constantly with a heatproof rubber spatula, and bring to a full boil. Boil, scraping the bottom and sides of the pan to prevent scorching, for 2 minutes to ensure that the cornstarch is fully cooked (mixture will appear frothy when it first reaches a boil, then will darken and thicken with further cooking).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a large bowl and stir in lemon juice.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Let cool to room temperature.8. Meanwhile, pick over the remaining berries and measure out 2 pounds of the most attractive ones; halve only extra-large berries.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the berries to the bowl with the glaze and fold gently with a rubber spatula until the berries are evenly coated. Scoop the berries into the pie shell, piling into a mound. If any cut sides face up on top, turn them face down. If necessary, rearrange the berries so that holes are filled and the mound looks attractive. Refrigerate pie until chilled, about 2 hours.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Serve within 5 hours of chilling.', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Angel Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 5418, u'instructions': u'1. Make the Pie Crust: Process \xbe cup flour, salt and sugar together in food processor until combined, about two 1-second pulses. Add butter and shortening and process until homogenous dough just starts to collect in uneven clumps, about 10 seconds (dough will resemble cottage cheese curds with some very small pieces of butter remaining, but there should be no uncoated flour). Scrap down sides and bottom of bowl with rubber spatula and redistribute dough evenly around processor blade. Add \xbd cup flour and pulse until mixture is evenly distributed around bowl and mass of dough has been broken up, 4 to 6 quick pulses. Empty mixture into a medium bowl.2. Sprinkle the water over the mixture. With a rubber spatula, use a folding motion to mix, pressing down on dough until dough is slightly tacky and sticks together. Flatten dough into a 4-inch disk. Wrap in plastic wrap and refrigerate at least 45 minutes or up to 2 days.3. Adjust oven rack to lowest position and preheat oven to 425 degrees F. Remove dough from refrigerator and roll out on generously floured work surface to 12-inch circle about 1/8-inch thick. Roll dough loosely around a rolling pin and unroll into pie plate, leaving at least 1-inch overhang on each side. Working around circumference, ease dough into plate by gently lifting edge of dough with 1 hand while pressing into plate bottom with other hand. Leave overhanging dough in place; refrigerate until dough is firm, about 30 minutes.4. Trim overhang to \xbd inch beyond lip of pie plate. Fold overhang under itself; folded edge should be flush with edge of pie plate. Flute dough or press tines of fork against dough to flatten against rim of pie plate. Refrigerate dough-lined plate until firm, about 15 minutes.5. Remove pie plate from refrigerator and use a fork to prick the bottom of the dough. Line the crust with foil, and fill with pie weights or dried beans. Bake for 15 minutes. Remove foil and weight, rotate plate, and bake for 5 to 10 additional minutes, until crust is golden brown and crisp. Let cool to room temperature.6. Make the Filling: Select 6 ounces misshapen, underripe, or otherwise unattractive berries, halving those that are large; you should have about 1\xbd cups. In a food processor, process the berries to a smooth puree, 20 to 30 seconds, scraping down the bowl as needed.7. Whisk the sugar, cornstarch, Sure-Jell, and salt in a medium saucepan. Stir in the berry puree, making sure to scrape the corners of the pan. Cook over medium-high heat, stirring constantly with a heatproof rubber spatula, and bring to a full boil. Boil, scraping the bottom and sides of the pan to prevent scorching, for 2 minutes to ensure that the cornstarch is fully cooked (mixture will appear frothy when it first reaches a boil, then will darken and thicken with further cooking). Transfer to a large bowl and stir in lemon juice. Let cool to room temperature.8. Meanwhile, pick over the remaining berries and measure out 2 pounds of the most attractive ones; halve only extra-large berries. Add the berries to the bowl with the glaze and fold gently with a rubber spatula until the berries are evenly coated. Scoop the berries into the pie shell, piling into a mound. If any cut sides face up on top, turn them face down. If necessary, rearrange the berries so that holes are filled and the mound looks attractive. Refrigerate pie until chilled, about 2 hours. Serve within 5 hours of chilling.', u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-strawberry-pie-507771', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}