{u'recipes': [{u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/631354-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 631354, u'veryPopular': False, u'lowFodmap': False, u'title': u'Healthy Black Bean Tostadas with Cilantro Sauce', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 120.52, u'extendedIngredients': [{u'originalString': u'1 whole Avocado, Cubed', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'whole', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'2 cans (15 Oz. Size) Black Beans', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'(15 Oz. Size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 16018, u'unit': u'cans'}, {u'originalString': u'\xbc teaspoons Cayenne Pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon Chili Powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cups Packed Cilantro Leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'4 whole Flour Tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'3 cloves Garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 cups Shredded Lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11252, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 whole Tomatoes, Chopped', u'aisle': u'Canned and Jarred', u'name': u'whole tomatoes', u'metaInformation': [u'whole', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10011531, u'unit': u''}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://tastykitchen.com/blog/2013/04/healthy-black-bean-tostadas-with-cilantro-sauce/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Preheat the broiler. Rinse and drain the beans. Puree the black beans, chili powder, cumin, and cayenne in a blender or food processor, adding a tablespoon of water at a time to help the mixture move, if necessary. I ended up using about 2 tablespoons water and pureed for a minute or two but still left some texture.In a food processor or blender, puree the cilantro, yogurt, garlic, and salt, adjusting the seasoning with more cilantro/salt/yogurt to your taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place tortillas in the oven directly on the rack, taking care that the edges are all supported by the rack (otherwise they will bend through the cracks and it will be bent in a funny shape).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Let the tortillas bake for 3-5 minutes on both sides until they are browned and crispy.Top the crispy tortillas with black beans, tomatoes, avocados, and lettuce.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}]}, {u'equipment': [], u'step': u'Drizzle with cilantro sauce.Notes:Holding the tostadas while you spread the bean mixture helps them not to break apart.Other topping ideas include cotija cheese, lime wedges, salsa, ranch dressing, or roasted corn or peppers.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Tostadas on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Dutton-Goldfield Dutton Ranch Pinot Noir. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 43 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'The ripening season was classic Russian River, with warm days and cool nights—and with no major heat spells, the fruit ripening was perfect to give lush tannins, bright berry fruit and bright acidity. The wine shows rich, dense black cherry and blackberry fruit and nuances of strawberry, raspberry, and nutmeg in the nose. In the mouth, the first impression is fresh berry fruit, then the soft, broad tannins carry notes of marionberries, nutmeg and sandalwood through a lingering finish. Thanks partially to the moderate alcohol and bright acidity, the finish lingers with fresh cherry fruit and creamy berry compote.This wine has a broad range of food pairings, whether alone with some well chosen cheeses, richer fish preparations or a good old steak on the barbeque.', u'title': u'Dutton-Goldfield Dutton Ranch Pinot Noir', u'price': u'$42.99', u'id': 438099, u'link': u'https://www.wine.com/product/dutton-goldfield-dutton-ranch-pinot-noir-2014/154141', u'imageUrl': u'https://spoonacular.com/productImages/438099-312x231.jpg'}]}, u'aggregateLikes': 226, u'instructions': u'Preheat the broiler. Rinse and drain the beans. Puree the black beans, chili powder, cumin, and cayenne in a blender or food processor, adding a tablespoon of water at a time to help the mixture move, if necessary. I ended up using about 2 tablespoons water and pureed for a minute or two but still left some texture.In a food processor or blender, puree the cilantro, yogurt, garlic, and salt, adjusting the seasoning with more cilantro/salt/yogurt to your taste.Place tortillas in the oven directly on the rack, taking care that the edges are all supported by the rack (otherwise they will bend through the cracks and it will be bent in a funny shape). Let the tortillas bake for 3-5 minutes on both sides until they are browned and crispy.Top the crispy tortillas with black beans, tomatoes, avocados, and lettuce. Drizzle with cilantro sauce.Notes:Holding the tostadas while you spread the bean mixture helps them not to break apart.Other topping ideas include cotija cheese, lime wedges, salsa, ranch dressing, or roasted corn or peppers.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-black-bean-tostadas-with-cilantro-sauce-631354', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}