{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225543-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 225543, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sherried squash soup', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 135.37, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1kg butternut squash peeled, deseeded and chopped', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'peeled', u'deseeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u'kg'}, {u'originalString': u'4 tbsp dry (fino) sherry', u'aisle': u'Alcoholic Beverages', u'name': u'dry sherry', u'metaInformation': [u'dry', u'(fino)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 10114106, u'unit': u'tbsp'}, {u'originalString': u'seed bread cro\xfbtons and flat leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaf'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 large onion, halved', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'600ml hot vegetable stock (we like Marigold)', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'hot', u'(we like Marigold)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 600.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/4983/sherried-squash-soup', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Fry the onion in the oil for 5 mins until softened.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the sherry and squash and sizzle for 1-2 mins.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour in the stock, then cover and simmer for 20 mins until the squash is tender when pierced with a knife.Whizz in a food processor until smooth. Will keep in the fridge for 2 days, or freeze for 6 weeks. When ready to eat, reheat until bubbling and serve in small portions topped with seed-bread cro\xfbtons (see above right) and a parsley sprig.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 28, u'instructions': u'Fry the onion in the oil for 5 mins until softened. Add the sherry and squash and sizzle for 1-2 mins. Pour in the stock, then cover and simmer for 20 mins until the squash is tender when pierced with a knife.Whizz in a food processor until smooth. Will keep in the fridge for 2 days, or freeze for 6 weeks. When ready to eat, reheat until bubbling and serve in small portions topped with seed-bread cro\xfbtons (see above right) and a parsley sprig.', u'spoonacularSourceUrl': u'https://spoonacular.com/sherried-squash-soup-225543', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}