{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/437946-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 437946, u'veryPopular': False, u'lowFodmap': False, u'title': u"Caramel Crackers 'n' Nuts", u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 34.28, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 cup butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 packages (6.6 ounces each) miniature cheddar cheese fish-shaped crackers', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'miniature', u'fish-shaped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.2, u'consistency': u'solid', u'id': 1009, u'unit': u'ounces'}, {u'originalString': u'1/2 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'1 cup dry roasted peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'dry roasted peanuts', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16090, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/caramel-crackers--n--nuts', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large greased bowl, combine crackers and peanuts; set aside. In a large heavy saucepan, combine the brown sugar, butter and corn syrup. Cook over medium heat until a candy thermometer reads 280\xb0 (soft-crack stage), stirring occasionally.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Remove from the heat. Stir in baking soda and vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Pour over cracker mixture; quickly stir until evenly coated.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to two greased 15-in. x 10-in. x 1-in. baking pans.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 250\xb0 for 1 hour, stirring every 15 minutes. Cool; break apart. Store in airtight containers.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 13, u'instructions': u"Directions                                                                                In a large greased bowl, combine crackers and peanuts; set aside. In a large heavy saucepan, combine the brown sugar, butter and corn syrup. Cook over medium heat until a candy thermometer reads 280\xb0 (soft-crack stage), stirring occasionally.                                                                                            Remove from the heat. Stir in baking soda and vanilla. Pour over cracker mixture; quickly stir until evenly coated.                                                                                            Transfer to two greased 15-in. x 10-in. x 1-in. baking pans. Bake at 250\xb0 for 1 hour, stirring every 15 minutes. Cool; break apart. Store in airtight containers.                                        Yield: about 3 quarts.                                                                                                     Editor's Note: We recommend that you test your candy thermometer before each use by bringing water to a boil; the thermometer should read 212\xb0.  Adjust your recipe temperature up or down based on your test.                                                                                                Originally published as Caramel Crackers 'n' Nuts in  Country Woman ChristmasAnnual 2008, p64                                                                                                                                                                                                        Nutritional Facts                                                                             1/2 cup equals 196 calories, 10 g fat (4 g saturated fat), 15 mg cholesterol, 240 mg sodium, 25 g carbohydrate, 1 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-crackers-n-nuts-437946', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}