{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/472219-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 472219, u'veryPopular': False, u'lowFodmap': False, u'title': u'Iowa Maid-Rites', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 158.54, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 1/2 (10.5 ounce) cans condensed French onion soup', u'aisle': u'Canned and Jarred', u'name': u'condensed french onion soup', u'metaInformation': [u'french', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.5, u'consistency': u'liquid', u'id': 6354, u'unit': u'ounce'}, {u'originalString': u'4 pounds ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'16 hamburger buns, split', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1 (1 ounce) envelope dry onion soup mix', u'aisle': u'Canned and Jarred', u'name': u'dry onion soup mix', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 6094, u'unit': u'ounce'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Iowa-Maid-Rites/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Crumble the ground beef into a large skillet over medium-high heat. Cook and stir until evenly browned, crumbling even more as it cooks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Drain off the grease. Stir in the onion soup mix and French onion soup. Cover, and simmer over low heat for about 2 hours, or you may transfer to a slow cooker for this part.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'id': 6094, u'name': u'dry onion soup mix'}]}, {u'equipment': [], u'step': u'To serve, spoon onto hamburger buns like a sloppy Joe.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'id': 18350, u'name': u'hamburger bun'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 179, u'instructions': u'Crumble the ground beef into a large skillet over medium-high heat. Cook and stir until evenly browned, crumbling even more as it cooks. Drain off the grease. Stir in the onion soup mix and French onion soup. Cover, and simmer over low heat for about 2 hours, or you may transfer to a slow cooker for this part.                            To serve, spoon onto hamburger buns like a sloppy Joe.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/iowa-maid-rites-472219', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}