{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556565-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 556565, u'veryPopular': False, u'lowFodmap': False, u'title': u'Autumn Butternut Squash Salad with Maple Balsamic Vinaigrette', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 142.88, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'3 T balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'T'}, {u'originalString': u'\xbd medium butternut squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'3 T maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'T'}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Salt & Pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 small shallot, finely diced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'diced', u'small', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 43016, u'unit': u'servings'}, {u'originalString': u'8 cups spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}], u'healthScore': 75.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/autumn-butternut-squash-salad-maple-balsamic-vinaigrette/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.To prepare butternut squash, peel skin and remove seeds from interior. Dice into \xbd inch cubes.Put squash onto pregreased, foil lined baking pan. Spray with olive oil spray and season with salt and pepper. Put into oven and roast for 25-30 minutes, or until soft and slightly charred.For the Salad, toss spinach, cranberries, and almonds together in serving dish. Once squash is done cooking and cooled, mix into salad gently so not to break apart the squash.For the Dressing, in a small dish, whisk together all salad ingredients. Season, to taste.To serve, toss salad with dressing and enjoy!', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Preheat oven to 350 degrees.To prepare butternut squash, peel skin and remove seeds from interior. Dice into \xbd inch cubes.Put squash onto pregreased, foil lined baking pan. Spray with olive oil spray and season with salt and pepper. Put into oven and roast for 25-30 minutes, or until soft and slightly charred.For the Salad, toss spinach, cranberries, and almonds together in serving dish. Once squash is done cooking and cooled, mix into salad gently so not to break apart the squash.For the Dressing, in a small dish, whisk together all salad ingredients. Season, to taste.To serve, toss salad with dressing and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/autumn-butternut-squash-salad-with-maple-balsamic-vinaigrette-556565', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}