{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/203524-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 203524, u'veryPopular': False, u'lowFodmap': False, u'title': u'Make-Ahead Overstuffed Burrito with Mushrooms, Cheddar and Tomato Rice', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 208.37, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/2 cup basmati rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020444, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'10 ounces baby bella or cremini mushrooms, sliced 1/4-inch thick', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11266, u'unit': u'ounces'}, {u'originalString': u'1 large green bell pepper, halved, seeded, cut into strips', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'large', u'halved', u'seeded', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 1/2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup shredded Cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'About 1 cup tomato juice, preferably from canned San Marzano tomatoes', u'aisle': u'Beverages', u'name': u'tomato juice', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 11886, u'unit': u'cup'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 medium yellow onion, halved and sliced into 1/4-inch-thick half-moons', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'halved', u'sliced into 1/4-inch-thick half-moons'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/02/overstuffed-burrito-mushrooms-cheddar-tomato-rice-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F. Toss onions and peppers with 3 teaspoons oil, chili powder, 1/2 teaspoon salt and 1/4 teaspoon black pepper until well coated. Lay in single layer on parchment-lined baking sheet. Roast until onions are charred in spots and peppers are tender and beginning to brown, about 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook rice according to package instructions with tomato juice (instead of water or stock) and butter. Meanwhile, heat 1 teaspoon oil in large skillet over high heat until shimmering.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'id': 11886, u'name': u'tomato juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add mushrooms. Sprinkle with 1/4 teaspoon each salt and black pepper. Cook without moving until well-browned, about 2 minutes. Reduce heat to medium-high and cook, stirring, until mushrooms release juices and brown.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add remaining 1/2 teaspoon oil if needed. Turn heat down slightly and cook, stirring occasionally, until thoroughly browned and lightly crisped, about 5 minutes longer.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let vegetables and rice cool, then toss together in a large bowl. Sprinkle 2 tablespoons Cheddar onto each tortilla; divide rice and vegetable mixture between them on top of cheese. Sprinkle 2 more tablespoons Cheddar into each tortilla over vegetables. Fold in sides of tortillas and tightly wrap. Store in refrigerator until ready to eat. To reheat, cover with lightly damp paper towel and microwave about 1 minute 30 seconds to heat through and melt cheese, flipping halfway through.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Let sit 1 minute before cutting.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Sparkling ros\xe9, and Riesling are my top picks for Burrito. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Mark West Black Label Monterey County Pinot Noir. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'pinot noir', u'sparkling rose', u'riesling'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches.", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 150, u'instructions': u'Procedures                                                                              1                                                                            Preheat oven to 450 degrees F. Toss onions and peppers with 3 teaspoons oil, chili powder, 1/2 teaspoon salt and 1/4 teaspoon black pepper until well coated. Lay in single layer on parchment-lined baking sheet. Roast until onions are charred in spots and peppers are tender and beginning to brown, about 25 minutes.                                                                                                                            2                                                                            Cook rice according to package instructions with tomato juice (instead of water or stock) and butter. Meanwhile, heat 1 teaspoon oil in large skillet over high heat until shimmering. Add mushrooms. Sprinkle with 1/4 teaspoon each salt and black pepper. Cook without moving until well-browned, about 2 minutes. Reduce heat to medium-high and cook, stirring, until mushrooms release juices and brown. Add remaining 1/2 teaspoon oil if needed. Turn heat down slightly and cook, stirring occasionally, until thoroughly browned and lightly crisped, about 5 minutes longer.                                                                                                                            3                                                                            Let vegetables and rice cool, then toss together in a large bowl. Sprinkle 2 tablespoons Cheddar onto each tortilla; divide rice and vegetable mixture between them on top of cheese. Sprinkle 2 more tablespoons Cheddar into each tortilla over vegetables. Fold in sides of tortillas and tightly wrap. Store in refrigerator until ready to eat. To reheat, cover with lightly damp paper towel and microwave about 1 minute 30 seconds to heat through and melt cheese, flipping halfway through. Let sit 1 minute before cutting.', u'spoonacularSourceUrl': u'https://spoonacular.com/make-ahead-overstuffed-burrito-with-mushrooms-cheddar-and-tomato-rice-203524', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}