{u'recipes': [{u'sourceName': u'Simply Sugar and Gluten Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/539790-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 539790, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Teff Almond Butter Cookies Sandwiched with Ice Cream', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 56.51, u'creditText': u'Simply Sugar and Gluten Free', u'extendedIngredients': [{u'originalString': u'1 cup (322 grams) almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 322.0, u'consistency': u'solid', u'id': 12195, u'unit': u'grams'}, {u'originalString': u'1/2 cup (127 grams) unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 127.0, u'consistency': u'solid', u'id': 9019, u'unit': u'grams'}, {u'originalString': u'1 teaspoon (4 grams) baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 4.0, u'consistency': u'solid', u'id': 18371, u'unit': u'grams'}, {u'originalString': u'1/2 generous cup (179 grams) gluten-free brown rice syrup', u'aisle': u'Health Foods;Baking', u'name': u'brown rice syrup', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 179.0, u'consistency': u'solid', u'id': 93784, u'unit': u'grams'}, {u'originalString': u'1 1/2 teaspoons chia seed meal', u'aisle': u'Health Foods', u'name': u'chia seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 12006, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon (1 gram) sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'gram', u'unitShort': u'g', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'gram'}, {u'originalString': u'1 1/2 cups (240 grams) teff flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'teff flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/teff-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 240.0, u'consistency': u'solid', u'id': 93760, u'unit': u'grams'}, {u'originalString': u'1 teaspoon (4 grams) pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 4.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'grams'}, {u'originalString': u'OR…make it Vegan with this vanilla ice cream', u'aisle': u'Cheese;Health Foods', u'name': u'vegan cheese', u'metaInformation': [u'with this vanilla ice cream'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 93701, u'unit': u'servings'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://simplysugarandglutenfree.com/vegan-teff-almond-butter-cookies-sandwiched-with-ice-cream/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper or silpats.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix together the applesauce and chia seed meal. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'id': 12006, u'name': u'chia seeds'}]}, {u'equipment': [], u'step': u'Combine the teff flour, sea salt, and baking powder and set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/teff-flour.jpg', u'id': 93760, u'name': u'teff flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Heat the almond butter for about 20 seconds in the microwave. Stir the brown rice syrup, vanilla, and applesauce into the warm almond butter. Make a well in the dry ingredients and add the wet ingredients. Stir until combined.Use a cookie scoop to portion the dough and roll each one. Set them on the prepared cookie trays about 1 1/2 inches apart from each other. Use the tines of a fork to press down the center of the cookie.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 93784, u'name': u'brown rice syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-butter.jpg', u'id': 12195, u'name': u'almond butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Bake for 10 – 13 minutes until the cookies are set. Don’t overbake. Store in an airtight container at room temperature.If desired, once cool place one scoop of vanilla bean ice cream (regular or healthier) on top of one cookie and top with a second cookie. If not eating immediately, wrap each sandwich in plastic and freeze.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let them sit at room temperature for 5 minutes or until soft enough to bite into.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 318, u'instructions': u'Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper or silpats. Mix together the applesauce and chia seed meal. Set aside.Combine the teff flour, sea salt, and baking powder and set aside.  Heat the almond butter for about 20 seconds in the microwave. Stir the brown rice syrup, vanilla, and applesauce into the warm almond butter. Make a well in the dry ingredients and add the wet ingredients. Stir until combined.Use a cookie scoop to portion the dough and roll each one. Set them on the prepared cookie trays about 1 1/2 inches apart from each other. Use the tines of a fork to press down the center of the cookie. Bake for 10 – 13 minutes until the cookies are set. Don’t overbake. Store in an airtight container at room temperature.If desired, once cool place one scoop of vanilla bean ice cream (regular or healthier) on top of one cookie and top with a second cookie. If not eating immediately, wrap each sandwich in plastic and freeze. Let them sit at room temperature for 5 minutes or until soft enough to bite into.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-teff-almond-butter-cookies-sandwiched-with-ice-cream-539790', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}