{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/599562-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 599562, u'veryPopular': False, u'lowFodmap': False, u'title': u'Radish Ravioli with Yellow Tomato Sauce', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 60, u'pricePerServing': 1003.77, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 teaspoon chopped basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons opal basil flowers, or micro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u'teaspoons'}, {u'originalString': u'1 1/4 cups Herb Cheese', u'aisle': u'Cheese', u'name': u'boursin herb cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 99188, u'unit': u'cups'}, {u'originalString': u'2 1/2 tablespoons chopped chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon large flake nutritional yeast', u'aisle': u'Spices and Seasonings;Health Foods', u'name': u'nutritional yeast', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93690, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'40 very thin slices peeled bleeding heart radish, each at least 2 1/4 inches in diameter', u'aisle': u'Produce', u'name': u'radish', u'metaInformation': [u'peeled', u'very thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 40.0, u'consistency': u'solid', u'id': 11429, u'unit': u'slices'}, {u'originalString': u'1 cup raw cashews, soaked for 10 to 12 hours in filtered water and drained', u'aisle': u'Nuts;Savory Snacks', u'name': u'raw cashews', u'metaInformation': [u'raw', u'filtered', u'drained', u'for 10 to 12 hours in  water and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Celtic sea salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'Dash Celtic sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'Dash'}, {u'originalString': u'Celtic sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'Celtic sea salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon minced shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sherry wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012068, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon chopped thyme leaves', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'4 teaspoons filtered water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'filtered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'teaspoons'}, {u'originalString': u'2 large very ripe yellow tomatoes, seeded and cut into medium dice', u'aisle': u'Produce', u'name': u'yellow tomatoes', u'metaInformation': [u'yellow', u'very ripe', u'medium', u'large', u'seeded', u'cut into  dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-yellow.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11696, u'unit': u''}, {u'originalString': u'1 cup Cashew Cheese', u'aisle': u'?', u'name': u'cashew cheese', u'metaInformation': [], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'cup'}, {u'originalString': u'1 tablespoon plus 1 teaspoon Rejuvelac (the fermented liquid that is drained from sprouted grains, usually rye or wheat berries; available in health food stores)', u'aisle': u'?', u'name': u'rejuvelac', u'metaInformation': [u'drained', u'(the fermented liquid that is from sprouted grains, usually rye or wheat berries; available in health food stores)'], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tablespoon'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://leitesculinaria.com/1384/recipes-radish-ravioli-with-yellow-tomato-sauce.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/juicer.jpg', u'id': 404683, u'name': u'juicer'}], u'step': u'Make the Cashew Cheese1. In a high-speed blender or a Champion juicer with the blank plate in place, process the cashews until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and stir in the Rejuvelac and salt, mixing well. Line a sieve with a double thickness of cheesecloth and place over a bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Transfer the mixture to the sieve, drape the cheesecloth over the top, and leave in a warm place to ripen for 12 hours.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Remove the cheese from the cloth-lined sieve.2. Shape the mixture into a round, place in a covered container, and refrigerate for at least 24 hours, or until it firms up. Use immediately, or store in an airtight container in the refrigerator for up to 3 days.Make the Herb Cheese3.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the Cashew Cheese, water, shallot, lemon juice, yeast, and 1/4 teaspoon salt in a bowl and stir until thoroughly mixed. Stir in the basil and thyme until evenly distributed. Taste and adjust with additional salt, if needed. Use immediately, or store in a covered container in the refrigerator for up to 3 days.Make the ravioli4. Use a 2-inch ring mold to cut each radish slice into a perfect round. Rub the radish slices with the olive oil and lemon juice and season with salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'id': 11429, u'name': u'radish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place 1 tablespoon of the cheese in the center of half of the radish slices. Carefully place a second radish slice on top of the spoonful of cheese and gently press the outer edges together to create a seal.5. Repeat to make 20 ravioli in all.6.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'id': 11429, u'name': u'radish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the tomatoes, chives, olive oil, and vinegar in a bowl and mix gently. Season to taste with salt and pepper.Assemble the dish7. Using a slotted spoon, spoon one-fourth of the tomato mixture into the center of each plate. Arrange 5 ravioli over the tomatoes, overlapping them slightly. Spoon some of the juices from the tomatoes on top. Sprinkle with the basil flowers.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Tiamo Chianti. It has 4.3 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Intense ruby red with garnet tones. Intense, fruity with persistent aromas of spices and licorice. Full with good acidity and balanced tannins.Tiamo is bottled at Chianti DOCG, and certified as made with 100% organic grapes.', u'title': u'Tiamo Chianti', u'price': u'$9.95', u'id': 441645, u'link': u'https://www.wine.com/product/tiamo-chianti-2009/107710', u'imageUrl': u'https://spoonacular.com/productImages/441645-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Make the Cashew Cheese1. In a high-speed blender or a Champion juicer with the blank plate in place, process the cashews until smooth. Transfer to a bowl and stir in the Rejuvelac and salt, mixing well. Line a sieve with a double thickness of cheesecloth and place over a bowl. Transfer the mixture to the sieve, drape the cheesecloth over the top, and leave in a warm place to ripen for 12 hours. Remove the cheese from the cloth-lined sieve.2. Shape the mixture into a round, place in a covered container, and refrigerate for at least 24 hours, or until it firms up. Use immediately, or store in an airtight container in the refrigerator for up to 3 days.Make the Herb Cheese3. Combine the Cashew Cheese, water, shallot, lemon juice, yeast, and 1/4 teaspoon salt in a bowl and stir until thoroughly mixed. Stir in the basil and thyme until evenly distributed. Taste and adjust with additional salt, if needed. Use immediately, or store in a covered container in the refrigerator for up to 3 days.Make the ravioli4. Use a 2-inch ring mold to cut each radish slice into a perfect round. Rub the radish slices with the olive oil and lemon juice and season with salt. Place 1 tablespoon of the cheese in the center of half of the radish slices. Carefully place a second radish slice on top of the spoonful of cheese and gently press the outer edges together to create a seal.5. Repeat to make 20 ravioli in all.6. Combine the tomatoes, chives, olive oil, and vinegar in a bowl and mix gently. Season to taste with salt and pepper.Assemble the dish7. Using a slotted spoon, spoon one-fourth of the tomato mixture into the center of each plate. Arrange 5 ravioli over the tomatoes, overlapping them slightly. Spoon some of the juices from the tomatoes on top. Sprinkle with the basil flowers.', u'spoonacularSourceUrl': u'https://spoonacular.com/radish-ravioli-with-yellow-tomato-sauce-599562', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}