{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/783743-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 783743, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Baked Broccoli Macaroni and Cheese', u'diets': [], u'pricePerServing': 138.13, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'12 oz fresh broccoli florets (I used pre-cut bag)', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'fresh', u'(I used pre-cut bag)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'oz'}, {u'originalString': u'1 1/2 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 cup fat free chicken broth (vegetarians use vegetable broth)', u'aisle': u'Canned and Jarred', u'name': u'fat free chicken broth', u'metaInformation': [u'fat free', u'(vegetarians use vegetable broth)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6984, u'unit': u'cup'}, {u'originalString': u'1/4 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'12 oz high fiber elbows like Ronzoni Smart Taste', u'aisle': u'Baking', u'name': u'high gluten flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 98883, u'unit': u'oz'}, {u'originalString': u'1/4 cup minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tbsp grated parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tbsp'}, {u'originalString': u'salt and fresh pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup seasoned bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}, {u'originalString': u'8 oz (2 cups) reduced-fat sharp cheddar (Cabot 50%)', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'50%', u'reduced-fat', u'(Cabot )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cups'}, {u'originalString': u'2 cups skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.skinnytaste.com/skinny-baked-broccoli-macaroni-and/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Add onion and cook over low heat about 2 minutes, add flour and cook another minute, or until the flour is golden and well combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add milk and chicken broth and whisk, raising heat to medium-high until it comes to a boil; cook about 5 minutes or until the sauce becomes smooth and thick. Season with salt and pepper.Once the sauce is thick, remove from heat, add cheese and mix well until cheese is melted. Adjust salt and pepper to taste, add cooked macaroni and broccoli and mix well.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour into prepared baking dish. Top with grated cheese and breadcrumbs. Spray a little more cooking spray on top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Bake for 15-20 minutes, then broil for a few minutes to get the breadcrumbs golden.Calories 314.9; serving size 1 cup; fat 9.8; protein 17.7; carb 44.3; fiber 6.3; sugar 4; sodium 215.7', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese can be paired with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. One wine you could try is Mulderbosch Chenin Blanc. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food. View More', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 1989, u'instructions': u'<p>Directions:</p><p>Cook pasta and broccoli together in a large pot of salted water, according to package directions for al dente (or slightly under cook 2 minutes). Spray a baking dish with cooking spray. Preheat oven to 375.</p><p>In a large, heavy skillet, <b>melt</b> butter. <b>Add</b> onion and cook over low heat about 2 minutes, <b>add</b> flour and cook another minute, or until the flour is golden and well combined. <b>Add</b> milk and chicken broth and whisk, <b>raising heat</b> to medium-high until it comes to a boil; cook about 5 minutes or until the sauce becomes smooth and thick.<b> Season</b> with salt and pepper.<br><br></p><p>Once the sauce is thick, <b>remove from heat</b>, <b>add</b> cheese and <b>mix</b> well until cheese is melted. <b>Adjust</b> salt and pepper to taste, <b>add</b> cooked macaroni and broccoli and mix well. <b>Pour</b> into prepared baking dish. <b>Top </b>with grated cheese and breadcrumbs. <b>Spray</b> a little more cooking spray on top.<br></p><p><b>Bake</b> for 15-20 minutes, then broil for a few minutes to get the breadcrumbs golden.<br><br></p><p><br></p><p>Calories 314.9; serving size 1 cup; fat 9.8; protein 17.7; carb 44.3; fiber 6.3; sugar 4; sodium 215.7</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-baked-broccoli-macaroni-and-cheese-783743', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}