{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549628-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 549628, u'veryPopular': True, u'lowFodmap': False, u'title': u'Towering Flourless Chocolate Stout Cakes', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 97.93, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'melted semi-sweet or bitter sweet chocolate, for drizzling', u'aisle': u'Baking', u'name': u'bitter chocolate', u'metaInformation': [u'sweet', u'melted', u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 19078, u'unit': u'servings'}, {u'originalString': u'6 ounces bittersweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup stout beer (such as Guinness) or you can also use coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'canned', u'(such as Guinness)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'1 tablespoon brown rice syrup or light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoon'}, {u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups heavy whipping cream, cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 tablespoons powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'4 ounces semisweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 1/2 sticks unsalted butter, cut into pieces and softened to room temp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'cut into pieces and  to room temp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 2.5, u'consistency': u'solid', u'id': 1145, u'unit': u'sticks'}, {u'originalString': u'6 ounces unsweetened chocolate, chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 19078, u'unit': u'ounces'}, {u'originalString': u'2 teaspoon vanilla extract, divided', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.halfbakedharvest.com/towering-flourless-chocolate-stout-cakes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make the cakes: Preheat the oven to 325 degrees F. Line two cupcake pans with 18 cupcake liners.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the bittersweet and unsweetened chocolate in a heatproof bowl and set over a saucepan of simmering water (do not let the bowl touch the water). Stir until the chocolate melts, then remove the bowl from the pan. (This can also be done in the microwave on 30 second intervals, stirring every time until melted.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 19078, u'name': u'unsweetened baking chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the eggs, sugar and salt in the bowl of a stand mixer. Set the bowl over the same pan of simmering water and whisk until the mixture is warm, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the bowl to the stand mixer; beat with the whisk attachment on medium speed until tripled in volume, about 5 minutes. (you can also use a hand mixer for this)Meanwhile, bring the beer and 1 teaspoon vanilla to a low boil in a saucepan. Reduce the mixer speed to low and beat in the beer mixture, then the melted chocolate, until combined, about 2 minutes. Gradually beat in the butter and remaining 1 teaspoon vanilla until incorporated.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Pour the batter into the prepared cupcake liners, filling about 3/4 of the way full.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake about 15-20 minutes, until the tops are just set and no longer jiggle. Cool in the pan for five minutes and then move to a wire rack to cool.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool completely. While the cakes cool make the chocolate swirled whipped cream. Microwave the chocolate, butter and brown rice syrup (or corn syrup) in a microwave-safe bowl in 30-second intervals, stirring, until the chocolate melts.In a large bowl add the cold cream and whip until stiff peaks are just about to form (about 3-5 minutes). Beat in vanilla and sugar until peaks form. Make sure not to over-beat, cream will then become lumpy and butter-like. Gently fold in the melted chocolate so it looks swirled. Using an ice cream scoop, scoop the whipped cream onto each cake and then drizzle with melted chocolate.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'aggregateLikes': 907, u'instructions': u'To make the cakes: Preheat the oven to 325 degrees F. Line two cupcake pans with 18 cupcake liners. Put the bittersweet and unsweetened chocolate in a heatproof bowl and set over a saucepan of simmering water (do not let the bowl touch the water). Stir until the chocolate melts, then remove the bowl from the pan. (This can also be done in the microwave on 30 second intervals, stirring every time until melted.)Put the eggs, sugar and salt in the bowl of a stand mixer. Set the bowl over the same pan of simmering water and whisk until the mixture is warm, about 2 minutes. Transfer the bowl to the stand mixer; beat with the whisk attachment on medium speed until tripled in volume, about 5 minutes. (you can also use a hand mixer for this)Meanwhile, bring the beer and 1 teaspoon vanilla to a low boil in a saucepan. Reduce the mixer speed to low and beat in the beer mixture, then the melted chocolate, until combined, about 2 minutes. Gradually beat in the butter and remaining 1 teaspoon vanilla until incorporated. Pour the batter into the prepared cupcake liners, filling about 3/4 of the way full. Bake about 15-20 minutes, until the tops are just set and no longer jiggle. Cool in the pan for five minutes and then move to a wire rack to cool. Let cool completely. While the cakes cool make the chocolate swirled whipped cream. Microwave the chocolate, butter and brown rice syrup (or corn syrup) in a microwave-safe bowl in 30-second intervals, stirring, until the chocolate melts.In a large bowl add the cold cream and whip until stiff peaks are just about to form (about 3-5 minutes). Beat in vanilla and sugar until peaks form. Make sure not to over-beat, cream will then become lumpy and butter-like. Gently fold in the melted chocolate so it looks swirled. Using an ice cream scoop, scoop the whipped cream onto each cake and then drizzle with melted chocolate.', u'spoonacularSourceUrl': u'https://spoonacular.com/towering-flourless-chocolate-stout-cakes-549628', u'dishTypes': [u'dessert'], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}