{u'recipes': [{u'sourceName': u'Cup Cake Project', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/624627-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 624627, u'veryPopular': False, u'lowFodmap': False, u'title': u'No Bake Crispy Chocolate Peanut Butter Bacon Cookies', u'diets': [], u'pricePerServing': 13.59, u'creditText': u'Cup Cake Project', u'extendedIngredients': [{u'originalString': u'1/4 cup + 2 tablespoons bacon bits or very finely chopped cooked bacon', u'aisle': u'Meat', u'name': u'bacon bits', u'metaInformation': [u'cooked', u'very finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10862, u'unit': u'cup'}, {u'originalString': u'3 cups Corn Flakes, crushed (stick them in a sealed sandwich bag and roll over them with a rolling pin)', u'aisle': u'Cereal', u'name': u'corn flakes', u'metaInformation': [u'with a rolling pin)', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 8020, u'unit': u'cups'}, {u'originalString': u'1 tablespoon light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoon'}, {u'originalString': u'3 1/2 ounces dark chocolate, melted in the microwave or a double boiler', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [u'dark', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ounces'}, {u'originalString': u'1/4 cup peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.cupcakeproject.com/2014/12/no-bake-crispy-chocolate-peanut-butter-bacon-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Mix all ingredients.Line a cookie sheet with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Place a 2 1/2 inch round cookie cutter on the paper and put a heaping tablespoon of the chocolate mixture in the center.  Pack down firmly.  Ease away the cutter and repeat until all of the chocolate mixture is used up.Chill for at least one hour.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the edges of the cookies in powdered sugar.Store in the refrigerator in a sealed container with cookie layers separated by parchment for up to a week.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Mix all ingredients.Line a cookie sheet with parchment paper.  Place a 2 1/2 inch round cookie cutter on the paper and put a heaping tablespoon of the chocolate mixture in the center.  Pack down firmly.  Ease away the cutter and repeat until all of the chocolate mixture is used up.Chill for at least one hour.Roll the edges of the cookies in powdered sugar.Store in the refrigerator in a sealed container with cookie layers separated by parchment for up to a week.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-crispy-chocolate-peanut-butter-bacon-cookies-624627', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}