{u'recipes': [{u'sourceName': u'Joanne Eats Well with Others', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/562862-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 562862, u'veryPopular': True, u'lowFodmap': False, u'title': u'Black Tea Spring Rolls with Eggplant and Mango Dipping Sauce', u'diets': [u'dairy free'], u'pricePerServing': 57.14, u'creditText': u'Joanne Eats Well with Others', u'extendedIngredients': [{u'originalString': u'1 lb eggplant, chopped', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u'lb'}, {u'originalString': u'12 oz extra-firm tofu, crumbled', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'oz'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3/4 cup mango chutney', u'aisle': u'Ethnic Foods', u'name': u'mango chutney', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango-chutney.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 10119297, u'unit': u'cup'}, {u'originalString': u'1/4 cup rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022053, u'unit': u'cup'}, {u'originalString': u'3 tbsp sesame oil, divided', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'3 shallots, chopped', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'4 tbsp shoyu sauce, divided', u'aisle': u'Ethnic Foods;Condiments', u'name': u'shoyu', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 16123, u'unit': u'tbsp'}, {u'originalString': u'1 tsp black tea leaves, Lapsang Souchong if you can find it', u'aisle': u'Tea and Coffee', u'name': u'tea', u'metaInformation': [u'black', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14355, u'unit': u'tsp'}, {u'originalString': u'16 (6-inch) wonton wrappers', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 16.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'6-inch'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://joanne-eatswellwithothers.com/2014/05/black-tea-spring-rolls-eggplant-mango-dipping-sauce.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400F.Grind the tea into a fine powder in a spice grinder or with a mortar and pestle. Set aside.In a large skillet, heat 1 tbsp of sesame oil over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'tea'}]}, {u'equipment': [], u'step': u'Add in the shallots, garlic, and eggplant. Cook, stirring frequently, until the eggplant is softened and cooked through, about 6-8 minutes. Stir in the tofu and half of the shoyu, stirring until combined. Cook for a minute or so to heat through.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16123, u'name': u'shoyu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Add in a few pinches of the ground tea. Season to taste with shoyu.To assemble the spring rolls, place a wonton wrapper in front of you so that it looks like a diamond.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16123, u'name': u'shoyu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'tea'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread a few spoonfuls of the filling on the wrapper, not too far from the corner nearest you. Take the corner and fold it so that it covers the filling. After one roll, fold in the left and right corners, then continue rolling. Dab a bit of water on the far corner to seal. Repeat with remaining wrappers and filling.Arrange on a parchment-lined baking sheet, seam-side down.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Brush with the sesame oil and bake for 20 minutes, turning halfway through. While the spring rolls cook, make the dipping sauce by whisking together the chutney, vinegar, and remaining 2 tbsp of shoyu. Stir in the remaining ground tea to taste.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16123, u'name': u'shoyu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'tea'}]}, {u'equipment': [], u'step': u'Serve the spring rolls with the dipping sauce.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 465, u'instructions': u'Preheat the oven to 400F.Grind the tea into a fine powder in a spice grinder or with a mortar and pestle. Set aside.In a large skillet, heat 1 tbsp of sesame oil over medium-high heat. Add in the shallots, garlic, and eggplant. Cook, stirring frequently, until the eggplant is softened and cooked through, about 6-8 minutes. Stir in the tofu and half of the shoyu, stirring until combined. Cook for a minute or so to heat through. Add in a few pinches of the ground tea. Season to taste with shoyu.To assemble the spring rolls, place a wonton wrapper in front of you so that it looks like a diamond. Spread a few spoonfuls of the filling on the wrapper, not too far from the corner nearest you. Take the corner and fold it so that it covers the filling. After one roll, fold in the left and right corners, then continue rolling. Dab a bit of water on the far corner to seal. Repeat with remaining wrappers and filling.Arrange on a parchment-lined baking sheet, seam-side down. Brush with the sesame oil and bake for 20 minutes, turning halfway through. While the spring rolls cook, make the dipping sauce by whisking together the chutney, vinegar, and remaining 2 tbsp of shoyu. Stir in the remaining ground tea to taste.Serve the spring rolls with the dipping sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-tea-spring-rolls-with-eggplant-and-mango-dipping-sauce-562862', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'super bowl', u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}