{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520765-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 520765, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken, shrimp and pasta salad', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 87.57, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'toasted almond slices', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'slices'}, {u'originalString': u'2 to 3 celery stalks', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/2 c. (or more) of mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'c'}, {u'originalString': u'200 g. of pasta (whatever shape but the best are the ones with lots of grooves to catch the dressing)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'with lots of grooves to catch the dressing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20420, u'unit': u'g'}, {u'originalString': u'1/4 to 1/3 c. of pickle relish', u'aisle': u'Condiments', u'name': u'pickle relish', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 11944, u'unit': u'c'}, {u'originalString': u'1 to 1 1/2 c. of pineapple pieces (depending on how much pineapples you like in your salad), drained', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'drained', u'(depending on how much pineapples you like in your salad)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'c'}, {u'originalString': u'salt, pepper and sugar to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'cooked shrimp, peeled and cut up if large (amount is variable since I used leftovers, remember?)', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'cooked', u'peeled', u'(amount is variable since I used leftovers, remember?)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'servings'}, {u'originalString': u'500 g. of chicken (I used half of a whole)', u'aisle': u'Meat', u'name': u'whole chicken', u'metaInformation': [u'whole', u'(I used half of a )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 5006, u'unit': u'g'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://casaveneracion.com/chicken-shrimp-and-pasta-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Boil the chicken in a large pot of salted water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove scum as it rises. For a really flavorful chicken (and pasta since you’re going to cook the pasta in the broth), add a whole onion, a few cloves of garlic, a bay leaf and some peppercorns. Cover the pot and let the chicken simmer for about 40 minutes.Lift the chicken, transfer to a plate and cool.Strain the broth and reheat. When boiling, add the pasta and cook according to package directions.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Drain. That’s tasty pasta, trust me.Debone the chicken, discard the bones (save the skin if you prefer not to include them in the salad) and cut the meat into half-inch cubes.Slice the celery stalks, anywhere from 1/8-inch to 1/4-inch would be good.Toss everything together, except the almonds. If, however, there are members of your family who are allergic to shrimps like I am, I suggest you add the shrimps just before serving and only to the portions of the people who are okay with shrimps.Adjust the seasonings and amount of mayo (and lemon juice, perhaps), as needed. Chill for a couple of hours.To serve, ladle into salad bowls and sprinkle with toasted almond slices.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery stalk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Fetzer Vineyards Valley Oaks Pinot Grigio with a 5 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This Pinot Grigio is clean with a fruit forward character and a crisp acid backbone . There are aromas of mango, pear, orange spice, lemongrass and pineapple. In the mouth, there are flavors of tropical fruit, apples, pears and a nice orange citrus note, balanced with minerality and a wonderful, round finish.', u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'InstructionsBoil the chicken in a large pot of salted water. Remove scum as it rises. For a really flavorful chicken (and pasta since you’re going to cook the pasta in the broth), add a whole onion, a few cloves of garlic, a bay leaf and some peppercorns. Cover the pot and let the chicken simmer for about 40 minutes.Lift the chicken, transfer to a plate and cool.Strain the broth and reheat. When boiling, add the pasta and cook according to package directions. Drain. That’s tasty pasta, trust me.Debone the chicken, discard the bones (save the skin if you prefer not to include them in the salad) and cut the meat into half-inch cubes.Slice the celery stalks, anywhere from 1/8-inch to 1/4-inch would be good.Toss everything together, except the almonds. If, however, there are members of your family who are allergic to shrimps like I am, I suggest you add the shrimps just before serving and only to the portions of the people who are okay with shrimps.Adjust the seasonings and amount of mayo (and lemon juice, perhaps), as needed. Chill for a couple of hours.To serve, ladle into salad bowls and sprinkle with toasted almond slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-shrimp-and-pasta-salad-520765', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}