{u'recipes': [{u'sourceName': u'Lovely Little Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/794408-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 794408, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole Lemon Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 73.27, u'creditText': u'Lovely Little Kitchen', u'extendedIngredients': [{u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'2 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 whole lemon*', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'Lemon slices for garnish', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u'slices'}, {u'originalString': u'1 stick salted butter, chilled and cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'chilled', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'stick'}, {u'originalString': u'1 stick salted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'stick'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons (more or less as needed) very cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'very cold', u'as needed', u'(more or less )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://lovelylittlekitchen.com/whole-lemon-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place butter, sugar, and flour into a food processor or blender, and pulse until you have coarse (pea sized) crumbs. Scrape down sides as needed. Slowly add chilled water and pulse, until the dough begins to come together. It should still be slightly crumbly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Pour the dough onto a piece of plastic wrap and knead a few times to bring together. If the dough is too crumbly, sprinkle a little water over it and knead again. Wrap the dough up in the plastic wrap and chill for at least 3 hours.To roll out the crust, allow the dough to sit at room temperature for about 15 minutes. Then unwrap and place the dough on a well-floured surface.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Roll the dough out so you have a large circle that is a few inches wider than your pie tin. Be patient as you roll, turning the dough to check for sticking and adding more flour as needed.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Roll the dough around the rolling pin to transfer it to the pie dish.Without stretching the dough, place it into the pie dish, and trim excess dough around the edges, leaving about a 1-inch overhang.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Roll the edge under, and then crimp.Preheat oven to 350 degrees.Trim both ends off the lemon, and cut into quarters.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add lemon, butter, sugar, eggs, and vanilla extract to a blender, and blend until smooth and creamy.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Pour into unbaked pie shell, and bake at 350 degrees for 35-40 minutes. Cover edges of pie with tin foil if they brown before the pie is done.Allow to cool completely before slicing. Can be refrigerated and served chilled or at room temperature. Dust with powdered sugar just before serving.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Vineyards Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 301, u'instructions': u'Place butter, sugar, and flour into a food processor or blender, and pulse until you have coarse (pea sized) crumbs. Scrape down sides as needed. Slowly add chilled water and pulse, until the dough begins to come together. It should still be slightly crumbly. Pour the dough onto a piece of plastic wrap and knead a few times to bring together. If the dough is too crumbly, sprinkle a little water over it and knead again. Wrap the dough up in the plastic wrap and chill for at least 3 hours.To roll out the crust, allow the dough to sit at room temperature for about 15 minutes. Then unwrap and place the dough on a well-floured surface. Roll the dough out so you have a large circle that is a few inches wider than your pie tin. Be patient as you roll, turning the dough to check for sticking and adding more flour as needed. Roll the dough around the rolling pin to transfer it to the pie dish.Without stretching the dough, place it into the pie dish, and trim excess dough around the edges, leaving about a 1-inch overhang. Roll the edge under, and then crimp.Preheat oven to 350 degrees.Trim both ends off the lemon, and cut into quarters. Add lemon, butter, sugar, eggs, and vanilla extract to a blender, and blend until smooth and creamy. Pour into unbaked pie shell, and bake at 350 degrees for 35-40 minutes. Cover edges of pie with tin foil if they brown before the pie is done.Allow to cool completely before slicing. Can be refrigerated and served chilled or at room temperature. Dust with powdered sugar just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/whole-lemon-pie-794408', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}