{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/179649-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 179649, u'veryPopular': False, u'lowFodmap': False, u'title': u'Berry Orange Blaster', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 56.67, u'extendedIngredients': [{u'originalString': u'1 bag (7.6 oz) Yoplait\xae Frozen Smoothie strawberry banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen', u'yoplait\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.6, u'consistency': u'solid', u'id': 9040, u'unit': u'oz'}, {u'originalString': u'4 teaspoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'1 cup calcium-enriched orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/berry-orange-blaster/790db345-20c4-445a-8b2b-422a1083db79', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In blender, place orange juice, honey and contents of Yoplait Frozen Smoothie bag. Cover; blend on high speed 1 minute to 1 minute 30 seconds, stopping blender to scrape down sides as necessary, until smooth.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Pour into glasses.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 165, u'instructions': u'1                               In blender, place orange juice, honey and contents of Yoplait Frozen Smoothie bag. Cover; blend on high speed 1 minute to 1 minute 30 seconds, stopping blender to scrape down sides as necessary, until smooth. Pour into glasses.', u'spoonacularSourceUrl': u'https://spoonacular.com/berry-orange-blaster-179649', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}