{u'recipes': [{u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/616574-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 616574, u'veryPopular': True, u'lowFodmap': False, u'title': u'Greek Chickpea & Quinoa Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 212.1, u'extendedIngredients': [{u'originalString': u'1 can (15oz) garbanzo beans (chickpeas), drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned garbanzo beans', u'metaInformation': [u'drained and rinsed', u'canned', u'(chickpeas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16058, u'unit': u'oz'}, {u'originalString': u'1 cup English cucumber, diced', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'diced', u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111205, u'unit': u'cup'}, {u'originalString': u'1 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 cup grape tomatoes, sliced in half (diced red bell pepper would work here too)', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'diced', u'red', u'sliced in half (  bell pepper would work here too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'juice of 1 large lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 jar (7oz) kalamata olives, pitted and sliced in half (drained)', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'pitted', u'drained', u'sliced in half ()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 1009195, u'unit': u'oz'}, {u'originalString': u'1/4 cup loosely packed parsley, chopped (dill, mint or oregano would be great too)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'loosely packed', u'chopped', u'(dill, mint or oregano would be great too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'Greek pepperoncini, to serve', u'aisle': u'Canned and Jarred', u'name': u'pepperoncini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11976, u'unit': u'servings'}, {u'originalString': u'1 cup dried quinoa, rinsed', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'dried', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'2/3 cup red onion or shallots, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'mineral salt & fresh cracked pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 - 1 3/4 cups water (anywhere in between)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(anywhere in between)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 56.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://thesimpleveganista.blogspot.com/2013/06/greek-chickpea-quinoa-salad.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium size pot, add the water, quinoa and garlic powder and bring to a boil. Cover, reduce heat and simmer for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove cover and let stand for 15 minutes. Fluff with a fork.While quinoa is cooking, prepare the remaining ingredients.Once quinoa is ready, add in the chickpeas, tomatoes, cucumber, onion, olives and parsley.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Mix well. Season with salt, fresh cracked pepper and the juice of your 1 large lemon.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve on a bed of arugula or as is. Tastes great with some pepperoncini and a little extra lemon juice on top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoncini.jpg', u'id': 11976, u'name': u'peperoncini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Add extra virgin olive oil if you wish. This dish can be served warm, at room temperature or chilled.Optional dressing: You may like to use this Garlic Dressing from a previous recipe. I would suggest doubling it for use here.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Add/subtract any ingredients to suit your taste.I omitted the usual feta cheese in this recipe because I personally don't need it and haven't tried to replace it as of yet. But I know many of you will love your feta! Here is a recipe you can use to make your own from Happy Herbivore, Fat Free Vegan Feta Cheese. Or maybe you would like this", u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Baked Almond Feta from Vegan Version. In either case, be sure to read the comments before making this and enjoy! If you know of a great vegan feta recipe...please share...many would love to know.Simple, healthy and flavorful...Enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad can be paired with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Ghost Pines Sonoma County Napa County Monterey County Chardonnay. It has 5 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 1107, u'instructions': u"In a medium size pot, add the water, quinoa and garlic powder and bring to a boil. Cover, reduce heat and simmer for 15 minutes. Remove cover and let stand for 15 minutes. Fluff with a fork.While quinoa is cooking, prepare the remaining ingredients.Once quinoa is ready, add in the chickpeas, tomatoes, cucumber, onion, olives and parsley. Mix well. Season with salt, fresh cracked pepper and the juice of your 1 large lemon.Serve on a bed of arugula or as is. Tastes great with some pepperoncini and a little extra lemon juice on top. Add extra virgin olive oil if you wish. This dish can be served warm, at room temperature or chilled.Optional dressing: You may like to use this Garlic Dressing from a previous recipe. I would suggest doubling it for use here. Add/subtract any ingredients to suit your taste.I omitted the usual feta cheese in this recipe because I personally don't need it and haven't tried to replace it as of yet. But I know many of you will love your feta! Here is a recipe you can use to make your own from Happy Herbivore, Fat Free Vegan Feta Cheese. Or maybe you would like this Baked Almond Feta from Vegan Version. In either case, be sure to read the comments before making this and enjoy! If you know of a great vegan feta recipe...please share...many would love to know.Simple, healthy and flavorful...Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/greek-chickpea-quinoa-salad-616574', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}