{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/479011-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479011, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Best Burgers', u'diets': [], u'pricePerServing': 289.77, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'2 Avocados sliced', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 pounds of ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'Ketchup, Mustard, Mayo', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'8-12 Sesame seed buns', u'aisle': u'Bakery/Bread', u'name': u'sesame seed buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10018350, u'unit': u''}, {u'originalString': u'1 tablespoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}, {u'originalString': u"3 tablespoons Peter Luger's Steak Sauce", u'aisle': u'Condiments', u'name': u'steak sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 27048, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons Teriyaki sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6112, u'unit': u'tablespoons'}, {u'originalString': u'8-12 Slices White Cheddar', u'aisle': u'Cheese', u'name': u'white cheddar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'Slices', u'unitShort': u'Slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1011009, u'unit': u'Slices'}, {u'originalString': u'4 tablespoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoons'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://feedmephoebe.com/2012/02/the-best-burgers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the meat in a large mixing bowl or casserole dish. In a smaller bowl, combine the egg, salt, soy, Worcestershire, steak, and teriyaki sauces. Stir well and add to the meat bowl. With clean hands, incorporate the liquids into the meat.Form the meat into burger patties about the size of your palm, just under half a pound per person.Get the grill (or grill pan) nice and hot. If on an outdoor grill, cook the patties with the top on for about 5 minutes (until the bottom becomes seared and the top begins to gray) and then flip. Replace the top and cook for about 4 more minutes. When close to finished, add cheese and briefly toast the buns. Once cheese is melted, serve immediately.Recommended serving technique as follows: take a few avocado slices, mash them up with a fork (so that they don’t make the bun slippery) and then put them on top of the burger.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-slices.jpg', u'id': 1019037, u'name': u'avocado slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add mayo and mustard on the top half of the bun, and create a generous kiddie pool of ketchup on your plate for dipping.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Belasco de Baquedano Llama Malbec with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'As its namesake, this wine embodies the distinctive spirit of our vineyards, spanning the foothills of the Andes. Llama is a rich ruby-purple color, and boasts elegant flavors of black berries, ripe plum and robust spices with good balance and structure. View More', u'title': u'Belasco de Baquedano Llama Malbec', u'price': u'$16.99', u'id': 449922, u'link': u'https://www.wine.com/product/belasco-de-baquedano-llama-malbec-2013/132727', u'imageUrl': u'https://spoonacular.com/productImages/449922-312x231.jpg'}]}, u'aggregateLikes': 516, u'instructions': u'Place the meat in a large mixing bowl or casserole dish. In a smaller bowl, combine the egg, salt, soy, Worcestershire, steak, and teriyaki sauces. Stir well and add to the meat bowl. With clean hands, incorporate the liquids into the meat.Form the meat into burger patties about the size of your palm, just under half a pound per person.Get the grill (or grill pan) nice and hot. If on an outdoor grill, cook the patties with the top on for about 5 minutes (until the bottom becomes seared and the top begins to gray) and then flip. Replace the top and cook for about 4 more minutes. When close to finished, add cheese and briefly toast the buns. Once cheese is melted, serve immediately.Recommended serving technique as follows: take a few avocado slices, mash them up with a fork (so that they don’t make the bun slippery) and then put them on top of the burger. Add mayo and mustard on the top half of the bun, and create a generous kiddie pool of ketchup on your plate for dipping.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-burgers-479011', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}