{u'recipes': [{u'sourceName': u'Tidy Mom', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/185054-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 185054, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Salted Caramel Cupcakes', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 68.93, u'creditText': u'Tidy Mom', u'extendedIngredients': [{u'originalString': u'1 Duncan Hines Moist Deluxe Dark Chocolate Fudge Cake Mix', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99040, u'unit': u''}, {u'originalString': u"1/2 cup confectioners' sugar, sifted", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 tablespoon light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup plus 2 tablespoons Dutch-process cocoa powder', u'aisle': u'Baking', u'name': u'dutch process cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dutch-process-cocoa-powder.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019165, u'unit': u'cup'}, {u'originalString': u'3 Large Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 1/2 teaspoons sea salt, preferably fleur de sel (I used about 1tsp Kosher Salt)', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'(I used 1tsp Kosher Salt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoons'}, {u'originalString': u'1 pound semi-sweet chocolate, melted and cooled', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 19903, u'unit': u'pound'}, {u'originalString': u'2 1/2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups unsalted butter, room temp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cups'}, {u'originalString': u'1/4 cup plus 2 tablespoons boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://tidymom.net/2011/chocolate-salted-caramel-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix on low until blended, then mix on high for 2 mins.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into paper lined cupcake pans.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake for 20 min. Cool completely. For the filling(recipe below), use a paring knife to cut a cone-shaped piece (around 3/4 inch deep) from the center of each cupcake. Spoon 3-4 teaspoons warm filling into each hollowed out cupcake. Sprinkle a pinch of sea salt over the filling (I used Kosher salt). Fill a pastry bag fitted with a medium star tip (I used a 1M) with frosting. Pipe Dark Chocolate frosting (recipe below)on each cupcake and garnish with a pinch of sea salt (again, I used Kosher Salt). Store at room temperature in airtight container, do not refrigerate. (I put mine in the cool basement).', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat sugar with the water and corn syrup in a heavy saucepan over high, swirling occasionally until syrup is clear. Stop stirring and attach a candy thermometer to side of pan. Cook until syrup comes to a boil, washing down sides of pan with a wet pastry brush as needed. Boil, gently swirling pan occasionally until mixture is caramelized and just reaches 360F', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Remove from heat, and slowly and CAUTIOUSLY pour in cream. The mixture will spatter. Stir with a wooden spoon until smooth. Stir in sea salt. Use immediately. If the caramel begins to harden, reheat gently until it is pourable again.**NOTE: you will NEED a candy thermometer for this step', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Combine the cocoa and boiling water, stirring until the cocoa has dissolved. With an electric mixer on medium high speed, beat butter, confectioners’ sugar and salt until pale and fluffy. Reduce speed to low.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add melted and cooled chocolate, beating until combined and scraping down sides of bowl as needed. Beat in the cocoa mixture. If not using immediately, frosting can be refrigerated up to 5 days or frozen up to 1 month, in an airtight container. Before using, bring to room temperature, and beat on low speed until smooth again.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}], u'name': u''}], u'aggregateLikes': 366, u'instructions': u'Preheat oven to 350 Mix on low until blended, then mix on high for 2 mins. Pour into paper lined cupcake pans. Bake for 20 min. Cool completely. For the filling(recipe below), use a paring knife to cut a cone-shaped piece (around 3/4 inch deep) from the center of each cupcake. Spoon 3-4 teaspoons warm filling into each hollowed out cupcake. Sprinkle a pinch of sea salt over the filling (I used Kosher salt). Fill a pastry bag fitted with a medium star tip (I used a 1M) with frosting. Pipe Dark Chocolate frosting (recipe below)on each cupcake and garnish with a pinch of sea salt (again, I used Kosher Salt). Store at room temperature in airtight container, do not refrigerate. (I put mine in the cool basement).Heat sugar with the water and corn syrup in a heavy saucepan over high, swirling occasionally until syrup is clear. Stop stirring and attach a candy thermometer to side of pan. Cook until syrup comes to a boil, washing down sides of pan with a wet pastry brush as needed. Boil, gently swirling pan occasionally until mixture is caramelized and just reaches 360F Remove from heat, and slowly and CAUTIOUSLY pour in cream. The mixture will spatter. Stir with a wooden spoon until smooth. Stir in sea salt. Use immediately. If the caramel begins to harden, reheat gently until it is pourable again.**NOTE: you will NEED a candy thermometer for this stepCombine the cocoa and boiling water, stirring until the cocoa has dissolved. With an electric mixer on medium high speed, beat butter, confectioners’ sugar and salt until pale and fluffy. Reduce speed to low. Add melted and cooled chocolate, beating until combined and scraping down sides of bowl as needed. Beat in the cocoa mixture. If not using immediately, frosting can be refrigerated up to 5 days or frozen up to 1 month, in an airtight container. Before using, bring to room temperature, and beat on low speed until smooth again.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-salted-caramel-cupcakes-185054', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}