{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619836-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619836, u'veryPopular': True, u'lowFodmap': False, u'title': u'Buttermilk Potato Rolls {Fluffiest Most Delicious Rolls I’ve Ever Met}', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 19.25, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u'1 1/2 tablespoons instant or active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18375, u'unit': u'tablespoons'}, {u'originalString': u'3 - 4 cups bread flour (see note above)', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'(see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'1/2 cup (8 tablespoons) butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 cups buttermilk, room temperature or slightly warmed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'warmed', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups mashed or riced cooked potatoes (see note above)', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'cooked', u'mashed', u'(see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11362, u'unit': u'cups'}, {u'originalString': u'2 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'4 cups whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20080, u'unit': u'cups'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.melskitchencafe.com/buttermilk-potato-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of an electric stand mixer fitted with the dough hook (or in a large bowl if mixing by hand), combine the warm potatoes and butter and mix until the butter is completely melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the buttermilk, yeast, eggs, sugar, salt and 2 cups of flour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Mix well.Continue adding the flour (both wheat and bread flour) until the dough clears the sides of the bowl and is soft and smooth, it may leave a slight residue on your fingers which is ok but shouldn't be so sticky that you have crazy dough covered fingers.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}]}, {u'equipment': [], u'step': u'Add more flour if needed, taking care not to over flour the dough. It should give easily when pressed with your fingers. Knead the dough for 5-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the dough in a large, lightly greased bowl and cover with greased plastic wrap.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let the dough rise until doubled, about 1 - 1 1/2 hours. Lightly punch down the dough and roll it into 24 equal balls (about 3.25 ounces per ball; exact size will depend on how much flour was added).', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the dough balls evenly on a parchment- or silpat-lined large, rimmed baking sheet - 4 across, 6 down. Or use two 9X13-inch dishes with 12 rolls in each pan. Cover the rolls with greased plastic wrap and let them rise until doubled, about an hour.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 degrees F for 18 minutes until golden on top and baked through.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Brush the tops with butter after removing from the oven, if desired.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2058, u'instructions': u"In the bowl of an electric stand mixer fitted with the dough hook (or in a large bowl if mixing by hand), combine the warm potatoes and butter and mix until the butter is completely melted. Add the buttermilk, yeast, eggs, sugar, salt and 2 cups of flour. Mix well.Continue adding the flour (both wheat and bread flour) until the dough clears the sides of the bowl and is soft and smooth, it may leave a slight residue on your fingers which is ok but shouldn't be so sticky that you have crazy dough covered fingers. Add more flour if needed, taking care not to over flour the dough. It should give easily when pressed with your fingers. Knead the dough for 5-7 minutes. Place the dough in a large, lightly greased bowl and cover with greased plastic wrap. Let the dough rise until doubled, about 1 - 1 1/2 hours. Lightly punch down the dough and roll it into 24 equal balls (about 3.25 ounces per ball; exact size will depend on how much flour was added). Place the dough balls evenly on a parchment- or silpat-lined large, rimmed baking sheet - 4 across, 6 down. Or use two 9X13-inch dishes with 12 rolls in each pan. Cover the rolls with greased plastic wrap and let them rise until doubled, about an hour. Bake at 375 degrees F for 18 minutes until golden on top and baked through. Brush the tops with butter after removing from the oven, if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/buttermilk-potato-rolls-fluffiest-most-delicious-rolls-ive-ever-met-619836', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}