{u'recipes': [{u'sourceName': u'A Healthy Life for Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/602811-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 602811, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Watermelon Granita', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 250, u'pricePerServing': 53.59, u'creditText': u'A Healthy Life for Me', u'extendedIngredients': [{u'originalString': u'1 teaspoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'2 cups fresh strawberries, hulled', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'hulled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 cups cubed seedless watermelon', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [u'seedless', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9326, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://ahealthylifeforme.com/strawberry-watermelon-granita/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small heavy saucepan, bring the water and sugar to a boil. Cook and stir until sugar is dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from the heat; cool slightly.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the watermelon, strawberries and lemon in a blender; add sugar syrup.Cover and process for 2-3 minutes or until smooth.Strain through a mesh and discard seeds and pulp.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Transfer puree to a 9-in. x 4-in. loaf pan.Cover with plastic wrap.Freeze for 1 hour or until edges begin to firm. Stir the mixture very thoroughly with a fork and allow it to freeze for another 30 minutes.Repeat this process every 30 minutes for 3 to 4 hours until frozen through.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Granita. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 190, u'instructions': u'In a small heavy saucepan, bring the water and sugar to a boil. Cook and stir until sugar is dissolved. Remove from the heat; cool slightly.Place the watermelon, strawberries and lemon in a blender; add sugar syrup.Cover and process for 2-3 minutes or until smooth.Strain through a mesh and discard seeds and pulp.Transfer puree to a 9-in. x 4-in. loaf pan.Cover with plastic wrap.Freeze for 1 hour or until edges begin to firm. Stir the mixture very thoroughly with a fork and allow it to freeze for another 30 minutes.Repeat this process every 30 minutes for 3 to 4 hours until frozen through.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-watermelon-granita-602811', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day", u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}