{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/597641-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 597641, u'veryPopular': False, u'lowFodmap': False, u'title': u'Scrambled Egg Bruschetta', u'diets': [u'dairy free'], u'pricePerServing': 447.5, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'8 spears of asparagus, trimmed and steamed', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'steamed', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'4 eggs, scrambled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 slices french bread, cut at an angle about 1/4 inch thick', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18029, u'unit': u'slices'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'8 slices thin sliced prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.framedcooks.com/2014/01/scrambled-egg-bruschetta.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Brush bread slices with a little olive oil and sprinkle with salt and pepper.  Toast until golden brown.2. Assemble as follows: A spoonful of scrambled egg, topped with one asparagus spear and wrapped in one slice prosciutto.3.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve at once on a platter.  If you warm the platter first, they will stay warm longer!', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Ruffino Prosecco with a 4.2 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Ruffino Prosecco has been produced from grapes grown in the hilly area of Valdobbiadene, which is the most historically vocated region for the production of Prosecco.Bright straw yellow with fine bubbles.  The bouquet is fragrant and intensely fruity. It shows clean notes of apples, pears and citrus, accompanied by slight hints of hawthorn, wisteria and elder.  Crisp, clean and delicate with fine bubble caressing. Intense sensations of apples and peaches drive a pleasant aftertaste, that is reminiscent of fruity and floral aromas.Ideal as an aperitif; it is very versatile as a food companion. Ruffino Prosecco perfectly matches with pizza, fish and shellfish dishes as well as white meat dishes. View More', u'title': u'Ruffino Prosecco', u'price': u'$12.99', u'id': 447373, u'link': u'https://www.wine.com/product/ruffino-prosecco/111308', u'imageUrl': u'https://spoonacular.com/productImages/447373-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'1. Brush bread slices with a little olive oil and sprinkle with salt and pepper.  Toast until golden brown.2. Assemble as follows: A spoonful of scrambled egg, topped with one asparagus spear and wrapped in one slice prosciutto.3. Serve at once on a platter.  If you warm the platter first, they will stay warm longer!', u'spoonacularSourceUrl': u'https://spoonacular.com/scrambled-egg-bruschetta-597641', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}