{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479365-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479365, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oregano and Red Wine Beef Stew', u'diets': [u'gluten free'], u'pricePerServing': 453.32, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'1 bag of cut and peeled baby carrots (16 ounces)', u'aisle': u'Produce', u'name': u'baby cut carrots', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11960, u'unit': u'ounces'}, {u'originalString': u'4 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'32 ounces of beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'ounces'}, {u'originalString': u'1 \xbd pounds beef stew meat', u'aisle': u'Meat', u'name': u'beef stew meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10013411, u'unit': u'pounds'}, {u'originalString': u'1 can cut tomatoes (14.5 ounces)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounces'}, {u'originalString': u'7 stalks of celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 7.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'2 teaspoons dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoons'}, {u'originalString': u'2 large cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 pound fresh green beans (or one 14.5 ounce can of green beans)', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'fresh', u'green', u'canned', u'(or one 14.5 ounce can of beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11052, u'unit': u'pound'}, {u'originalString': u'2 teaspoons ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoons'}, {u'originalString': u'1 jalapeno', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 whole onion (medium size)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'whole', u'(medium size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 teaspoons dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'4 teaspoons grated parmesan (for garnish)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated', u'(for garnish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'teaspoons'}, {u'originalString': u'3 whole potatoes (red or russet)', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'whole', u'red', u'( or russet)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}, {u'originalString': u'1 cup of red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt (or salt to taste)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'(or salt )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 84.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.couponclippingcook.com/oregano-and-red-wine-beef-stew/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the tomatoes to a roaster pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the larger size carrots in half.  Otherwise, if the carrots are smaller you can just leave them whole.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the carrots to the roaster pan.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the celery, and onions in fairly large pieces (about 1 \xbd inch pieces).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to the pan.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut the potatoes into fairly large pieces (about 2 inch pieces) and add to the pan.  Next, cut each green bean into 3 or 4 pieces depending on the length of the green beans. Or, you can use a can of green beans instead.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to the pan (if using canned green beans, drain out the liquid before adding the green beans to the pan).  Dice the garlic.  Then cut the jalapeno in half lengthwise and cut it in thinly sliced pieces.  If you like more heat, leave the seeds in.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the garlic and jalapeno to the pan.Next, pour all of the beef stock, and wine into the roaster pan.  Then add the dried herbs and spices.  Stir the ingredients in the roaster pan together and set aside to marinate while you cook  the beef stew meat.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 10013411, u'name': u'beef stew meat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet on medium heat and add the olive oil.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the beef and a few dashes of pepper.  Cook the beef just long enough so that it browns a bit on each side.Next, add the beef into the roaster pan (including the olive oil and meat juices that may still be in the skillet).  Cover the roaster pan with a lid and bake in a preheated oven for about 2 hours or until the meat is so tender you could cut it with a spoon.  If you prefer more liquid in your stew just stir in a bit of water.  After adding the stew to your serving bowls, garnish with some grated parmesan cheese.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cabernet Sauvignon, Malbec, and Shiraz are great choices for Beef Stew. These full-bodied red wines are the perfect accompaniment for hearty beef stew. The Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'Cabernet Sauvignon 100%', u'title': u"Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc", u'price': u'$7.99', u'id': 454922, u'link': u'https://www.wine.com/product/vincent-bouquet-cabernet-sauvignon-vin-de-pays-doc-2006/101798', u'imageUrl': u'https://spoonacular.com/productImages/454922-312x231.jpg'}]}, u'aggregateLikes': 84, u'instructions': u'Preheat the oven to 375 degrees F.  Add the tomatoes to a roaster pan.  Cut the larger size carrots in half.  Otherwise, if the carrots are smaller you can just leave them whole.  Add the carrots to the roaster pan.  Cut the celery, and onions in fairly large pieces (about 1 \xbd inch pieces).  Add to the pan.Cut the potatoes into fairly large pieces (about 2 inch pieces) and add to the pan.  Next, cut each green bean into 3 or 4 pieces depending on the length of the green beans. Or, you can use a can of green beans instead.  Add to the pan (if using canned green beans, drain out the liquid before adding the green beans to the pan).  Dice the garlic.  Then cut the jalapeno in half lengthwise and cut it in thinly sliced pieces.  If you like more heat, leave the seeds in.  Add the garlic and jalapeno to the pan.Next, pour all of the beef stock, and wine into the roaster pan.  Then add the dried herbs and spices.  Stir the ingredients in the roaster pan together and set aside to marinate while you cook  the beef stew meat.  Heat a skillet on medium heat and add the olive oil.  Add the beef and a few dashes of pepper.  Cook the beef just long enough so that it browns a bit on each side.Next, add the beef into the roaster pan (including the olive oil and meat juices that may still be in the skillet).  Cover the roaster pan with a lid and bake in a preheated oven for about 2 hours or until the meat is so tender you could cut it with a spoon.  If you prefer more liquid in your stew just stir in a bit of water.  After adding the stew to your serving bowls, garnish with some grated parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/oregano-and-red-wine-beef-stew-479365', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}