{u'recipes': [{u'sourceName': u'Budget Gourmet Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/495956-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 495956, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Vegetable Sandwich', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 120.9, u'creditText': u'Budget Gourmet Mom', u'extendedIngredients': [{u'originalString': u'1 avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'5 oz crimini mushrooms, sliced', u'aisle': u'Produce', u'name': u'crimini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'1 large onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'marinated roasted red peppers, I like Roland Brand', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11916, u'unit': u'servings'}, {u'originalString': u'4 whole wheat hamburger buns or rolls', u'aisle': u'Bakery/Bread', u'name': u'whole wheat hamburger buns', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-hamburger-buns.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18351, u'unit': u''}, {u'originalString': u'8 - 1/2" thick zucchini slices', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 11477, u'unit': u'slices'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.budgetgourmetmom.com/roasted-vegetable-sandwich/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 425\xb0.Spray a baking sheet with nonstick cooking spray and toss mushrooms and zucchini onto it.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Drizzle the vegetables with a bit of olive oil and season with salt and pepper.  Roast for 10 minutes.Meanwhile, melt the butter over medium heat and saute the onion until translucent, stirring frequently.  Reduce heat to low and continue to cook until the onions begin to caramelize and slightly brown.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the vegetables from the oven and place the rolls, split open, on the oven rack.  Toast for a minute.Once the rolls are toasted begin to assemble the sandwiches.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place two thick slices of zucchini on the bottom half of each roll.  Top with a generous scoop of onions, mushrooms, a couple roasted red peppers, and a few slices of avocado.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11916, u'name': u'roasted red peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Place the top half of the bun on top and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 924, u'instructions': u'Preheat oven to 425\xb0.Spray a baking sheet with nonstick cooking spray and toss mushrooms and zucchini onto it.  Drizzle the vegetables with a bit of olive oil and season with salt and pepper.  Roast for 10 minutes.Meanwhile, melt the butter over medium heat and saute the onion until translucent, stirring frequently.  Reduce heat to low and continue to cook until the onions begin to caramelize and slightly brown.Remove the vegetables from the oven and place the rolls, split open, on the oven rack.  Toast for a minute.Once the rolls are toasted begin to assemble the sandwiches.  Place two thick slices of zucchini on the bottom half of each roll.  Top with a generous scoop of onions, mushrooms, a couple roasted red peppers, and a few slices of avocado.  Place the top half of the bun on top and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-vegetable-sandwich-495956', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}