{u'recipes': [{u'sourceName': u'Dizzy Busy and Hungry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556339-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 556339, u'veryPopular': False, u'lowFodmap': False, u'title': u'5 Ingredient Tangy Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 94.88, u'creditText': u'Dizzy Busy and Hungry', u'extendedIngredients': [{u'originalString': u'1 (15.5 ounce) can butter beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned butter beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 10016073, u'unit': u'ounce'}, {u'originalString': u'12 ounces cooked bite-sized pieces of chicken (can be frozen)', u'aisle': u'Meat', u'name': u'chicken pieces', u'metaInformation': [u'frozen', u'cooked', u'(can be )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 1005006, u'unit': u'ounces'}, {u'originalString': u'2 cups frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cups'}, {u'originalString': u'1 lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u"1 (16 ounce) jar mango salsa (I used Newman's Own)", u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u"(I used Newman's Own)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'ounce'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.dizzybusyandhungry.com/5-ingredient-tangy-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spray a skillet with non-stick cooking spray, add the chicken and heat for a minute or two over medium heat (heat 3-4 extra minutes if your chicken is frozen).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add the salsa, corn, and butter beans, and cook for 10 minutes or until hot, stirring occasionally.When serving, squeeze lime juice on top and sprinkle with chopped cilantro.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 344, u'instructions': u'Spray a skillet with non-stick cooking spray, add the chicken and heat for a minute or two over medium heat (heat 3-4 extra minutes if your chicken is frozen).Add the salsa, corn, and butter beans, and cook for 10 minutes or until hot, stirring occasionally.When serving, squeeze lime juice on top and sprinkle with chopped cilantro.', u'spoonacularSourceUrl': u'https://spoonacular.com/5-ingredient-tangy-chicken-556339', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}