{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/773951-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 773951, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tortellini in Parmesan Brodo', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 305.83, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 carrot, peeled and chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 celery stalk, chopped', u'aisle': u'Produce', u'name': u'celery stalk', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2 tablespoons chopped fresh flat-leaf parsley', u'aisle': u'Produce', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 sprigs fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'1 head garlic, halved across the equator', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'1 onion, halved', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 sprigs fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2027, u'unit': u'sprigs'}, {u'originalString': u'1 pound Parmesan rinds', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'pound'}, {u'originalString': u'1 teaspoon salt, plus for pasta water', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'for pasta water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound spinach pasta tortellini (spinach pasta filled with cheese)', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'spinach tortellini', u'metaInformation': [u'with cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93725, u'unit': u'pound'}], u'healthScore': 14.0, u'imageType': u'jpeg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/tortellini-in-parmesan-brodo.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'To a large saucepan, combine the Parmesan rinds, carrots, celery, garlic, onions, oregano, thyme, bay leaf and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add 8 cups water and bring to a simmer over medium heat. Simmer the broth for 1 hour 15 minutes, adjusting the heat to maintain a simmer and stirring occasionally to prevent sticking. Strain into a clean saucepan and keep warm over low heat.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Meanwhile, bring a large pot of well-salted water to a boil.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the tortellini and cook for 2 minutes less than the package instructions, about 4 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Drain well, then add the tortellini to the broth to finish cooking. Stir in the parsley and serve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 96, u'instructions': u'To a large saucepan, combine the Parmesan rinds, carrots, celery, garlic, onions, oregano, thyme, bay leaf and salt. Add 8 cups water and bring to a simmer over medium heat. Simmer the broth for 1 hour 15 minutes, adjusting the heat to maintain a simmer and stirring occasionally to prevent sticking. Strain into a clean saucepan and keep warm over low heat.                          Meanwhile, bring a large pot of well-salted water to a boil. Add the tortellini and cook for 2 minutes less than the package instructions, about 4 minutes. Drain well, then add the tortellini to the broth to finish cooking. Stir in the parsley and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/tortellini-in-parmesan-brodo-773951', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}