{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/607194-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 607194, u'veryPopular': False, u'lowFodmap': False, u'title': u'Orange- Ginger Pork Cutlets with Mango- Tomato Salsa', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 169.97, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'2/3 cup halved small pear or cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'small', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'2 green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1 lime, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 pound of pork tenderloins, trimmed', u'aisle': u'Meat', u'name': u'lean pork tenderloins', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10060, u'unit': u'pound'}, {u'originalString': u'1 cup chopped fresh mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u'1 to 2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon freshly squeezed orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon freshly grated orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'tablespoon'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.recipegirl.com/2014/07/28/orange-ginger-pork-cutlets-with-mango-tomato-salsa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the tenderloins into 4 to 6 even pieces.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Place plastic wrap over pork; pound to an even thickness using a meat mallet or rolling pin.  Rub each piece of pork with orange zest.  Then sprinkle both sides with ginger, salt and pepper.  Set aside.2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the salsa ingredients in a bowl.  Toss, add salt and pepper, to taste.  Set aside.3.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a large skillet over medium-high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add half of the pork; cook 3 to 4 minutes on each side (or until done).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pork from the pan; repeat with the rest of the pork.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve topped with the mango salsa!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Mexican on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Trombetta Gap's Crown Vineyard Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 59 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Rich garnet color. Aromas of vanilla, clove and cooking spiceswith hints of ripe berry, pomegranate and toast. Soft entry,balanced tannin and berry fruit mingled with pleasant acidityand lingering finish.', u'title': u"Trombetta Gap's Crown Vineyard Pinot Noir", u'price': u'$58.99', u'id': 439275, u'link': u'https://www.wine.com/product/trombetta-gaps-crown-vineyard-pinot-noir-2012/138834', u'imageUrl': u'https://spoonacular.com/productImages/439275-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'1.  Cut the tenderloins into 4 to 6 even pieces.  Place plastic wrap over pork; pound to an even thickness using a meat mallet or rolling pin.  Rub each piece of pork with orange zest.  Then sprinkle both sides with ginger, salt and pepper.  Set aside.2.  Combine the salsa ingredients in a bowl.  Toss, add salt and pepper, to taste.  Set aside.3.  Heat olive oil in a large skillet over medium-high heat.  Add half of the pork; cook 3 to 4 minutes on each side (or until done).  Remove the pork from the pan; repeat with the rest of the pork.  Serve topped with the mango salsa!', u'spoonacularSourceUrl': u'https://spoonacular.com/orange-ginger-pork-cutlets-with-mango-tomato-salsa-607194', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 38, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}