{u'recipes': [{u'sourceName': u'The Law Students Wife', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/487610-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 487610, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp and Artichoke Frittata', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'preparationMinutes': 8, u'pricePerServing': 234.59, u'creditText': u'The Law Students Wife', u'extendedIngredients': [{u'originalString': u"6 ounces (about 1 cup) frozen artichoke hearts, thawed and halved (I found mine at Trader Joe's)", u'aisle': u'Produce', u'name': u'artichoke hearts', u'metaInformation': [u'frozen', u'thawed', u'halved', u"(I found mine at Trader Joe's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93828, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'8 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/8 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup finely sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup non-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non-fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'6 tablespoons grated Parmesan cheese, divided', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'divided', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped Italian (flat-leaf) parsley', u'aisle': u'Produce', u'name': u'parsley', u'metaInformation': [u'italian', u'chopped', u'(flat-leaf)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/2 pound frozen shrimp, tails-off and deveined, thawed', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'frozen', u'thawed', u'deveined'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 15152, u'unit': u'pound'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.thelawstudentswife.com/2013/03/shrimp-and-artichoke-frittata/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Position oven rack just above the center. Turn oven broiler to high.Rinse shrimp. Pat dry, then halve and set aside.In a medium bowl, stir together the eggs, milk, green onions, salt, red pepper, black pepper, garlic powder, and 3 tablespoons Parmesan cheese until fully combined. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a large (10 or 12-inch), oven-proof skillet over medium.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add artichokes. Cook until artichokes begin to brown, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add shrimp and continue to cook until shrimp are pink and no longer translucent, 1 to 3 additional minutes.Reduce heat to medium-low.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour egg mixture into skillet. Do not stir. As the egg mixture cooks, run a spatula around the edge of the skillet, lifting edges to allow uncooked liquid to run underneath. Continue cooking and lifting edges until the mixture is almost set but still uncooked on the top, about 4 minutes total. Sprinkle with remaining Parmesan and chopped parsley', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer skillet to the oven. Broil, watching carefully, until frittata is lightly browned and fluffy, about 3 minutes. Loosen edges, slice, and serve.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 66, u'instructions': u'Position oven rack just above the center. Turn oven broiler to high.Rinse shrimp. Pat dry, then halve and set aside.In a medium bowl, stir together the eggs, milk, green onions, salt, red pepper, black pepper, garlic powder, and 3 tablespoons Parmesan cheese until fully combined. Set aside.Heat olive oil in a large (10 or 12-inch), oven-proof skillet over medium. Add artichokes. Cook until artichokes begin to brown, about 3 minutes. Add shrimp and continue to cook until shrimp are pink and no longer translucent, 1 to 3 additional minutes.Reduce heat to medium-low. Pour egg mixture into skillet. Do not stir. As the egg mixture cooks, run a spatula around the edge of the skillet, lifting edges to allow uncooked liquid to run underneath. Continue cooking and lifting edges until the mixture is almost set but still uncooked on the top, about 4 minutes total. Sprinkle with remaining Parmesan and chopped parsleyTransfer skillet to the oven. Broil, watching carefully, until frittata is lightly browned and fluffy, about 3 minutes. Loosen edges, slice, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-and-artichoke-frittata-487610', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}