{u'recipes': [{u'sourceName': u'Chocolate Moosey', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/554022-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 554022, u'veryPopular': True, u'lowFodmap': False, u'title': u'S’mores Caramel Popcorn', u'diets': [], u'pricePerServing': 511.6, u'creditText': u'Chocolate Moosey', u'extendedIngredients': [{u'originalString': u'8 cups caramel popcorn (homemade or store bought)', u'aisle': u'Sweet Snacks', u'name': u'caramel popcorn', u'metaInformation': [u'homemade', u'store bought', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caramel-popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 19039, u'unit': u'cups'}, {u'originalString': u'1/2 cup crushed graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10018617, u'unit': u'cup'}, {u'originalString': u'2 cups mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'1 cup semisweet chocolate chips, melted', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.chocolatemoosey.com/2013/10/31/smores-caramel-popcorn/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 92, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'On a large piece of parchment paper, drizzle the melted chocolate chips. Immediately sprinkle on graham cracker crumbs and popcorn, making an even, single layer. Allow the chocolate to harden. Break the popcorn into pieces then toss with the marshmallows.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Place in cellophane gift bags or store in an airtight container.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Caramel Popcorn can be paired with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 2319, u'instructions': u'On a large piece of parchment paper, drizzle the melted chocolate chips. Immediately sprinkle on graham cracker crumbs and popcorn, making an even, single layer. Allow the chocolate to harden. Break the popcorn into pieces then toss with the marshmallows. Place in cellophane gift bags or store in an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/smores-caramel-popcorn-554022', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}