{u'recipes': [{u'sourceName': u'Zesty South Indian Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/488110-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 488110, u'veryPopular': False, u'lowFodmap': False, u'title': u'Multigrain Pumpkin cranberry Bread for Baking Partners challenge: 16', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 58.42, u'creditText': u'Zesty South Indian Kitchen', u'extendedIngredients': [{u'originalString': u'1 cup/ 160g bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cup'}, {u'originalString': u'1 tablespoon/15g brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'1 cup Canned pumpkin puree', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2cup/77g sweetened cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'1/4teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'11/4 teaspoon/6g instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.75, u'consistency': u'solid', u'id': 10118375, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup butter milk ( you can make your own by adding \xbd tablespoon vinegar in \xbd cup milk and stand for 5 minutes)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'for 5 minutes)', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2tablespoon/17g olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup/79g rye flour', u'aisle': u'Health Foods;Baking', u'name': u'rye flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20064, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoon /10g salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'2 cup/300g white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93824, u'unit': u'cup'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://zestysouthindiankitchen.com/2013/10/multigrain-pumpkin-cranberry-bread-baking-partners-challenge.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of kitchen aid stand mixer attached with paddle attachment add yeast, rye, bread and white whole wheat flour mixture, buttermilk, pumpkin, sugar, salt and rest of ingredients and mix everything for 3 minutes. Then add cranberries and mix very well to incorporate into the dough. Then change to dough hook and knead the dough for about 8 minutes or until the dough starts leaves from the sides and form a ball. Then transfer the dough to well floured area and knead for another 5 minutes or until they become shiny, supple, non sticky dough. The dough should pass the window pane test and register 77 to 81 F. If you are kneading by hand it takes about 15 minutes of kneading.', u'length': {u'number': 31, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 93824, u'name': u'white whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the dough in a lightly greased bowl, cover the bowl, and allow it to rise till it’s expanded and looks somewhat puffy, about 90 minutes.   Lightly grease a 9? x 4? x 3?, 1.5 lb. commercial loaf pan', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the dough into a board and gently shape the dough into a smooth log, and settle it into the pan, smooth side up.Cover the pan with lightly greased plastic wrap, and allow the loaf to rise till it’s crowned over the rim of the pan by about 3/4?, about 90 minutes. Don’t let it rise too high; it’ll continue to rise as it bakes. Towards the end of the rising time, preheat the oven to 350\xb0F. When you are ready for baking the score the bread and lightly apply the egg wash on the loaf so that you get shiny color after baking.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake the bread for 60 minutes. Lightly tent it with aluminum foil, and bake for an additional15 minutes, or until the center registers 200F on an instant-read thermometer.', u'length': {u'number': 75, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove it from the oven, and turn it out of the pan onto a rack.Slice and serve when the bread cools down to room temperature. Enjoy with your favorite spread.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dessert Bread on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 69, u'instructions': u'In the bowl of kitchen aid stand mixer attached with paddle attachment add yeast, rye, bread and white whole wheat flour mixture, buttermilk, pumpkin, sugar, salt and rest of ingredients and mix everything for 3 minutes. Then add cranberries and mix very well to incorporate into the dough. Then change to dough hook and knead the dough for about 8 minutes or until the dough starts leaves from the sides and form a ball. Then transfer the dough to well floured area and knead for another 5 minutes or until they become shiny, supple, non sticky dough. The dough should pass the window pane test and register 77 to 81 F. If you are kneading by hand it takes about 15 minutes of kneading. Place the dough in a lightly greased bowl, cover the bowl, and allow it to rise till it’s expanded and looks somewhat puffy, about 90 minutes.   Lightly grease a 9? x 4? x 3?, 1.5 lb. commercial loaf pan   Transfer the dough into a board and gently shape the dough into a smooth log, and settle it into the pan, smooth side up.Cover the pan with lightly greased plastic wrap, and allow the loaf to rise till it’s crowned over the rim of the pan by about 3/4?, about 90 minutes. Don’t let it rise too high; it’ll continue to rise as it bakes. Towards the end of the rising time, preheat the oven to 350\xb0F. When you are ready for baking the score the bread and lightly apply the egg wash on the loaf so that you get shiny color after baking. Bake the bread for 60 minutes. Lightly tent it with aluminum foil, and bake for an additional15 minutes, or until the center registers 200F on an instant-read thermometer. Remove it from the oven, and turn it out of the pan onto a rack.Slice and serve when the bread cools down to room temperature. Enjoy with your favorite spread.', u'spoonacularSourceUrl': u'https://spoonacular.com/multigrain-pumpkin-cranberry-bread-for-baking-partners-challenge-16-488110', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}