{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/246119-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 246119, u'veryPopular': True, u'lowFodmap': False, u'title': u'Green Apple Curry', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 108.35, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 Tbsp, packed, brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tbsp'}, {u'originalString': u'1 teaspoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'2 Tbsp yellow curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2015, u'unit': u'Tbsp'}, {u'originalString': u'2 large garlic cloves, smashed and roughly chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'large', u'smashed', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 tart green Granny Smith apples, cored and roughly chopped (peel ON)', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'green', u'cored', u'roughly chopped', u'(peel ON)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'1 teaspoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup finely chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'3 Tbsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/green_apple_curry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large saut\xe9 pan on medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add the garlic and let cook until the garlic starts to get browned. Use a slotted spoon to remove the garlic from the oil. Discard (or eat as a snack) the garlic.2', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chopped onions to the pan and let cook until translucent (about 4 minutes).3 While the onions are cooking, in a small bowl, mix together the curry powder and 2 tablespoons of water. Stir with a spoon until you have a smooth, thin paste. Once the onions are translucent, stir in the curry paste.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let bubble and cook for 1 minute. Stir in the butter.4', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chopped apples and salt to the pan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add 1 1/2 cups of water, or enough water to just almost cover the apples. Stir in the brown sugar.5 Bring to a boil and reduce to a simmer.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let cook, uncovered, on a low simmer for 30 minutes, until thickened and cooked through.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add more water if needed if the mixture starts to stick to the pan.Traditionally served with soft roti bread. In place of roti you can serve it with a warmed flour tortilla, pita bread, or over rice.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Mulderbosch Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food. View More', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 583, u'instructions': u'1 Heat the oil in a large saut\xe9 pan on medium heat. Add the garlic and let cook until the garlic starts to get browned. Use a slotted spoon to remove the garlic from the oil. Discard (or eat as a snack) the garlic.2 Add the chopped onions to the pan and let cook until translucent (about 4 minutes).3 While the onions are cooking, in a small bowl, mix together the curry powder and 2 tablespoons of water. Stir with a spoon until you have a smooth, thin paste. Once the onions are translucent, stir in the curry paste. Let bubble and cook for 1 minute. Stir in the butter.4 Add the chopped apples and salt to the pan. Add 1 1/2 cups of water, or enough water to just almost cover the apples. Stir in the brown sugar.5 Bring to a boil and reduce to a simmer. Let cook, uncovered, on a low simmer for 30 minutes, until thickened and cooked through. Add more water if needed if the mixture starts to stick to the pan.Traditionally served with soft roti bread. In place of roti you can serve it with a warmed flour tortilla, pita bread, or over rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/green-apple-curry-246119', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}