{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/384066-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5870, u'id': 384066, u'veryPopular': False, u'lowFodmap': False, u'title': u'Butterflied, Dry Brined Roasted Turkey with Roasted Root Vegetable Panzanella', u'diets': [u'dairy free'], u'preparationMinutes': 75, u'pricePerServing': 223.29, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 cup apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 1/4 teaspoons whole black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'whole', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoons'}, {u'originalString': u'8 ounces medium Brussels sprouts, shredded on the thin slicing blade of a food processor', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'shredded', u'medium', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11098, u'unit': u'ounces'}, {u'originalString': u'1 1/2 teaspoons dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 1/2 tablespoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces hearty sourdough or multigrain bread, cut into 1/2-inch cubes and staled', u'aisle': u'Bakery/Bread', u'name': u'multigrain bread', u'metaInformation': [u'hearty', u'cut into 1/2-inch cubes and staled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 18075, u'unit': u'ounces'}, {u'originalString': u'1 1/2 pounds parsnips, peeled and cubed into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [u'cubed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11298, u'unit': u'pounds'}, {u'originalString': u'1/2 pound red onion, diced into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'pound'}, {u'originalString': u'1 1/2 teaspoons rubbed sage', u'aisle': u'Spices and Seasonings', u'name': u'rubbed sage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2038, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon whole allspice berries', u'aisle': u'Spices and Seasonings', u'name': u'whole allspice berries', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-berries.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002001, u'unit': u'teaspoon'}, {u'originalString': u'1 13 to 14 pound whole turkey, neck and giblets removed and reserved for Giblet Stock', u'aisle': u'Meat', u'name': u'whole turkey', u'metaInformation': [u'whole', u'for giblet stock'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 13.0, u'consistency': u'solid', u'id': 5165, u'unit': u'pound'}], u'healthScore': 46.0, u'imageType': u'jpeg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/alton-brown/butterflied-dry-brined-roasted-turkey-with-roasted-root-vegetable-panzanella-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'For the turkey: Four days before service, place the salt, sage, thyme, black peppercorns, and allspice into a spice grinder and pulse until the peppercorns and allspice are coarsely ground, 5 to 6 pulses. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'black peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Set the turkey, breast-side down, on a large cutting board with the tail closest to you. Use an electric knife or heavy-duty kitchen shears to cut up one side of the backbone. Turn the bird around and cut back down the other side of the spine. Reserve the backbone for Giblet Stock. Discard any fat pockets or excess skin found inside the turkey. Turn the turkey breast-side up and use the heel of your hands to press down on both breasts, until you hear a cracking sound and the bird has flattened slightly.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [], u'step': u'Rub the seasoned salt on both sides of the turkey.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the turkey on a parchment paper lined half sheet pan, breast-side up with legs running with the long side of the pan. Store, uncovered, in the refrigerator for 4 days.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [], u'step': u'Remove the turkey from the refrigerator and leave at room temperature for 1 hour.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Place the parsnips and rutabaga in a large nonstick roasting pan, toss with vegetable oil and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place one rack in the middle of the oven and a second one far enough below so the roasting pan will fit.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oven to 425 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the turkey directly on the middle rack of the oven with the legs perpendicular to the metal bars of the rack.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Place the roasting pan with the parsnips and rutabaga on the rack below the turkey and roast both for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [], u'step': u'Reduce the heat to 350 degrees F.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Add the red onion to the roasting vegetables and stir to combine. Continue to roast both the vegetables and the turkey until a probe thermometer inserted into the thickest part of the breast registers 155 degrees F, an additional 40 to 50 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the turkey from the oven onto a cooling rack set inside a half sheet pan and rest for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [], u'step': u'Add the Brussels sprouts, bread cubes and garlic to the roasting vegetables, stir to combine and roast for an additional 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the vegetables from the oven and immediately transfer to a serving bowl.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the apple cider vinegar in the warm roasting pan, stir and scrape off any browned bits from the pan.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'id': 2048, u'name': u'apple cider vinegar'}]}, {u'equipment': [], u'step': u'Pour the vinegar mixture over the salad, add the thyme and toss to combine. Season with salt and pepper as desired.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Serve warm or at room temperature.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Carve the turkey with an electric knife and serve with the panzanella.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}], u'name': u'For the panzanella'}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Fonterutoli Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Watch how to make this recipe.                    For the turkey: Four days before service, place the salt, sage, thyme, black peppercorns, and allspice into a spice grinder and pulse until the peppercorns and allspice are coarsely ground, 5 to 6 pulses. Set aside.                          Set the turkey, breast-side down, on a large cutting board with the tail closest to you. Use an electric knife or heavy-duty kitchen shears to cut up one side of the backbone. Turn the bird around and cut back down the other side of the spine. Reserve the backbone for Giblet Stock. Discard any fat pockets or excess skin found inside the turkey. Turn the turkey breast-side up and use the heel of your hands to press down on both breasts, until you hear a cracking sound and the bird has flattened slightly.                          Rub the seasoned salt on both sides of the turkey. Place the turkey on a parchment paper lined half sheet pan, breast-side up with legs running with the long side of the pan. Store, uncovered, in the refrigerator for 4 days.                          Remove the turkey from the refrigerator and leave at room temperature for 1 hour.                          For the panzanella: Place the parsnips and rutabaga in a large nonstick roasting pan, toss with vegetable oil and set aside.                          Place one rack in the middle of the oven and a second one far enough below so the roasting pan will fit. Heat the oven to 425 degrees F. Place the turkey directly on the middle rack of the oven with the legs perpendicular to the metal bars of the rack.                          Place the roasting pan with the parsnips and rutabaga on the rack below the turkey and roast both for 30 minutes.                          Reduce the heat to 350 degrees F. Add the red onion to the roasting vegetables and stir to combine. Continue to roast both the vegetables and the turkey until a probe thermometer inserted into the thickest part of the breast registers 155 degrees F, an additional 40 to 50 minutes.                          Remove the turkey from the oven onto a cooling rack set inside a half sheet pan and rest for 30 minutes.                          Add the Brussels sprouts, bread cubes and garlic to the roasting vegetables, stir to combine and roast for an additional 15 minutes. Remove the vegetables from the oven and immediately transfer to a serving bowl. Pour the apple cider vinegar in the warm roasting pan, stir and scrape off any browned bits from the pan. Pour the vinegar mixture over the salad, add the thyme and toss to combine. Season with salt and pepper as desired. Serve warm or at room temperature.                          Carve the turkey with an electric knife and serve with the panzanella.', u'spoonacularSourceUrl': u'https://spoonacular.com/butterflied-dry-brined-roasted-turkey-with-roasted-root-vegetable-panzanella-384066', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5945, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}