{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/218053-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 218053, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican soup with chicken', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 235.41, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 ancho or other large dried chilli, deseeded and softened in boiling water for about 10 mins', u'aisle': u'Produce;Ethnic Foods;Spices and Seasonings', u'name': u'ancho chile', u'metaInformation': [u'dried', u'boiling', u'large', u'softened', u'deseeded', u'for 10 mins'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-arbol-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211962, u'unit': u''}, {u'originalString': u'400g can plum tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'g'}, {u'originalString': u'2 chicken breasts, sliced', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1\xbd l chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liters', u'unitShort': u'l', u'amount': 1.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'l'}, {u'originalString': u'4 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'juice 2 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'tortilla chips or homemade tortilla strips (see below), chopped avocado, lime wedges, red onion and coriander, to serve', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'tortilla strips', u'metaInformation': [u'red', u'homemade', u'chopped', u'(see below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-strips.jpg', u'unitLong': u'strip', u'unitShort': u'strips', u'amount': 1.0, u'consistency': u'solid', u'id': 98977, u'unit': u'strips'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/8835/mexican-soup-with-chicken', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the oil in a large saucepan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add theonion and garlic, soften for 5 mins, then stirin the dried chilli, cumin, tomatoes and chickenstock. Blitz in a food processor in batches, oruse a hand blender to pur\xe9e until smooth.Return to the pan, then bring to the boil.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-arbol-chiles.jpg', u'id': 10111962, u'name': u'dried chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chicken, reduce the heat, then simmerfor 10 mins until cooked through. Stir in thelime juice and some seasoning, then ladleinto bowls.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Put the toppings in the middleof the table for everyone to help themselves.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Parducci Small Lot Pinot Noir New Label Wine with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'strawberry , raspberry , cedar', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 136, u'instructions': u'Heat the oil in a large saucepan. Add theonion and garlic, soften for 5 mins, then stirin the dried chilli, cumin, tomatoes and chickenstock. Blitz in a food processor in batches, oruse a hand blender to pur\xe9e until smooth.Return to the pan, then bring to the boil.Add the chicken, reduce the heat, then simmerfor 10 mins until cooked through. Stir in thelime juice and some seasoning, then ladleinto bowls. Put the toppings in the middleof the table for everyone to help themselves.', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-soup-with-chicken-218053', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}