{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/414993-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 414993, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Chicken Fettuccine', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 178.26, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (10-3/4 ounces) condensed cream of celery soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of celery soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-celery-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6010, u'unit': u'ounces'}, {u'originalString': u'1 can (10-3/4 ounces) condensed cream of chicken soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of chicken soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'ounces'}, {u'originalString': u'1 package (16 ounces) fettuccine or spaghetti', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'Thin breadsticks, optional', u'aisle': u'Savory Snacks', u'name': u'grissini breadsticks', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grissini.jpg', u'unitLong': u'stick', u'unitShort': u'sticks', u'amount': 1.0, u'consistency': u'liquid', u'id': 98914, u'unit': u'sticks'}, {u'originalString': u'1 can (2-1/4 ounces) sliced ripe olives, drained', u'aisle': u'Canned and Jarred', u'name': u'olives', u'metaInformation': [u'ripe', u'drained', u'sliced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 9195, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 jar (2 ounces) diced pimientos, drained, optional', u'aisle': u'Produce', u'name': u'pimientos', u'metaInformation': [u'diced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pimento.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 11943, u'unit': u'ounces'}, {u'originalString': u'4 ounces process cheese (Velveeta), cubed', u'aisle': u'Cheese', u'name': u'process american cheese', u'metaInformation': [u'cubed', u'(Velveeta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1253, u'unit': u'ounces'}, {u'originalString': u'1-1/2 pounds boneless skinless chicken breasts, cut into cubes', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/creamy-chicken-fettuccine', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the chicken in a 3-qt. slow cooker; sprinkle with garlic powder, onion powder and pepper. Top with soups. Cover and cook on high for 3-4 hours or until chicken is no longer pink.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Stir in the cheese, olives and pimientos if desired. Cover and cook until cheese is melted. Meanwhile, cook fettuccine according to package directions; drain.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 10020409, u'name': u'fettuccine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pimento.jpg', u'id': 11943, u'name': u'pimiento'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Serve with chicken and breadsticks if desired.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Unoaked Chardonnay and Pinot Grigio are my top picks for Chicken Alfredo. Creamy, cheesy, buttery alfredo dishes can pair beautifully with an unoaked chardonnay or a pinot grigio. One wine you could try is Santa Cristina by Antinori Pinot Grigio. It has 4.1 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'unoaked chardonnay', u'pinot grigio'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 134, u'instructions': u'Directions                                                                                Place the chicken in a 3-qt. slow cooker; sprinkle with garlic powder, onion powder and pepper. Top with soups. Cover and cook on high for 3-4 hours or until chicken is no longer pink.                                                                                             Stir in the cheese, olives and pimientos if desired. Cover and cook until cheese is melted. Meanwhile, cook fettuccine according to package directions; drain. Serve with chicken and breadsticks if desired.                                        Yield: 6 servings.                                                                                                                         Originally published as Creamy Chicken Fettuccine in  Quick CookingJanuary/February 2001, p42                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 540 calories, 15 g fat (6 g saturated fat), 81 mg cholesterol, 1,151 mg sodium, 62 g carbohydrate, 4 g fiber, 39 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-fettuccine-414993', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 195, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}