{u'recipes': [{u'sourceName': u'Happy Food Healthy Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/669303-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 669303, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan S’mores Dessert – Served Two Ways', u'diets': [u'dairy free'], u'pricePerServing': 132.53, u'creditText': u'Happy Food Healthy Life', u'extendedIngredients': [{u'originalString': u'1/2 cup agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'1/4 cup almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'1 Tablespoon arrowroot powder', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20003, u'unit': u'Tablespoon'}, {u'originalString': u'1 large ripe avocado, halved, peeled and seeded', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'ripe', u'large', u'peeled', u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/2 cup cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tablespoons'}, {u'originalString': u'8 Graham Cracker Squares', u'aisle': u'', u'name': u'graham cracker squares', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10218617, u'unit': u''}, {u'originalString': u'2 teaspoons stevia', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93628, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'water from 1 can white beans (garbanzo or great northern beans), chilled', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'white', u'chilled', u'(garbanzo or great northern beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'can'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://happyfoodhealthylife.com/2015/08/10/vegan-smores-dessert-recipe-served-two-ways/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F (if you are making the tarts - the dessert shooters are no-bake)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Combine graham crackers and melted coconut oil in a food processor and pulse until combined and the graham cracker crumbs begin to stick together. Stop to feel the crumbs. If they stay together after you press them together, they are ready.For tarts: Press into mini tart pans and bake for 10 minutes in preheated oven.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u'Remove and let cool. For shooters, set aside. For the pudding.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Cut avocado into pieces and put in food processor or blender.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Combine all ingredients in a mixing bowl, and using the whisk attachment, mix on high for about 14-16 minutes. For the first while, it will appear that nothing is happening, until about 10 minutes in. Then you will see that it's starting to thicken. You can taste it at this point to adjust vanilla and sweetener levels according to your taste. Make the cream right before serving.To assemble tarts. On top of cooled crust, place a couple large spoonfuls of chocolate pudding. Top with whipped cream and graham cracker crumbs. With a kitchen torch, brown edges lightly.To assemble shooters: Start with 2 small spoonfuls of chocolate pudding in a shot glass. Or you could pipe it with a piping bag. Top with 2 small spoonfuls of whipped cream. Then a large spoonful of unbaked graham cracker mixture. Top again with pudding, whipped cream, and then a sprinkling of graham crackers. Brown lightly with a kitchen torch.", u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u'Add the cocoa powder, stevia, milk and vanilla and blend until the pudding reaches the desired consistency. Chill for at least 1/2 hour before assembling dessert.For the whipped cream'}], u'winePairing': {}, u'aggregateLikes': 22, u'instructions': u"Preheat oven to 350 degrees F (if you are making the tarts - the dessert shooters are no-bake)Combine graham crackers and melted coconut oil in a food processor and pulse until combined and the graham cracker crumbs begin to stick together. Stop to feel the crumbs. If they stay together after you press them together, they are ready.For tarts: Press into mini tart pans and bake for 10 minutes in preheated oven. Remove and let cool. For shooters, set aside. For the pudding. Cut avocado into pieces and put in food processor or blender. Add the cocoa powder, stevia, milk and vanilla and blend until the pudding reaches the desired consistency. Chill for at least 1/2 hour before assembling dessert.For the whipped cream: Combine all ingredients in a mixing bowl, and using the whisk attachment, mix on high for about 14-16 minutes. For the first while, it will appear that nothing is happening, until about 10 minutes in. Then you will see that it's starting to thicken. You can taste it at this point to adjust vanilla and sweetener levels according to your taste. Make the cream right before serving.To assemble tarts. On top of cooled crust, place a couple large spoonfuls of chocolate pudding. Top with whipped cream and graham cracker crumbs. With a kitchen torch, brown edges lightly.To assemble shooters: Start with 2 small spoonfuls of chocolate pudding in a shot glass. Or you could pipe it with a piping bag. Top with 2 small spoonfuls of whipped cream. Then a large spoonful of unbaked graham cracker mixture. Top again with pudding, whipped cream, and then a sprinkling of graham crackers. Brown lightly with a kitchen torch.", u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-smores-dessert-served-two-ways-669303', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}