{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/430522-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 430522, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Tomato Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 177.48, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 bacon strips, cooked and crumbled', u'aisle': u'Meat', u'name': u'bacon strips', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'1/4 pound thinly sliced deli turkey, julienned', u'aisle': u'Meat', u'name': u'deli turkey', u'metaInformation': [u'julienned', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/deli-turkey.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 7259, u'unit': u'pound'}, {u'originalString': u'1 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons thinly sliced green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup reduced-fat mayonnaise', u'aisle': u'Condiments', u'name': u'low fat mayonnaise', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'1 cup (4 ounces) shredded reduced-fat Mexican cheese blend', u'aisle': u'Cheese', u'name': u'low fat shredded mexican cheese blend', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-mexican-cheese-blend.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1209, u'unit': u'ounces'}, {u'originalString': u'1 tube (13.8 ounces) refrigerated pizza crust', u'aisle': u'Refrigerated', u'name': u'refrigerated pizza crust', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.8, u'consistency': u'solid', u'id': 93610, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'teaspoons'}, {u'originalString': u'1 cup (4 ounces) shredded reduced-fat Swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1040, u'unit': u'ounces'}, {u'originalString': u'2 small tomatoes, thinly sliced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/turkey-tomato-pizza', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Unroll the pizza crust onto a 15-in. x 10-in. x 1-in. baking pan coated with cooking spray. Flatten dough and build up edges slightly. Prick dough several times with a fork; sprinkle with sesame seeds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [], u'step': u'Bake at 425\xb0 for 10-12 minutes or until lightly browned.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the mayonnaise and lemon peel; spread over crust. Sprinkle with Mexican cheese and basil. Top with turkey, bacon, tomatoes and Swiss cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Bake for 7-9 minutes or until the crust is golden brown and cheese is melted. Sprinkle with onion.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 26, u'instructions': u'Directions                                                                                Unroll the pizza crust onto a 15-in. x 10-in. x 1-in. baking pan coated with cooking spray. Flatten dough and build up edges slightly. Prick dough several times with a fork; sprinkle with sesame seeds. Bake at 425\xb0 for 10-12 minutes or until lightly browned.                                                                                            Combine the mayonnaise and lemon peel; spread over crust. Sprinkle with Mexican cheese and basil. Top with turkey, bacon, tomatoes and Swiss cheese. Bake for 7-9 minutes or until the crust is golden brown and cheese is melted. Sprinkle with onion.                                        Yield: 6 servings.                                                                                                                         Originally published as Turkey Tomato Pizza in  Light & TastyOctober/November 2001, p27                                                                                                                                                                                                        Nutritional Facts                                                                             One slice equals 284 calories, 11 g fat (4 g saturated fat), 27 mg cholesterol, 865 mg sodium, 27 g carbohydrate, 1 g fiber, 19 g protein. Diabetic Exchanges: 2 meat, 1-1/2 starch, 1 vegetable, 1 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-tomato-pizza-430522', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}