{u'recipes': [{u'sourceName': u'From Valeries Kitchen', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/512999-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 512999, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cheesy Baked Bean and Rice Burritos', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 45.56, u'creditText': u'From Valeries Kitchen', u'extendedIngredients': [{u'originalString': u'1 (10 count) package medium soft taco sized flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'medium', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'1 cup each shredded cheddar and Monterey jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1 (16 ounce) can refried beans', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'refried beans', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16202, u'unit': u'ounce'}, {u'originalString': u'1 cup prepared Mexican rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20444, u'unit': u'cup'}, {u'originalString': u'2 tablespoons of your favorite jarred salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'jarred', u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon homemade or packaged taco seasoning mix', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning mix', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'teaspoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.fromvalerieskitchen.com/2014/01/cheesy-baked-bean-and-rice-burritos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.  Generously coat a foil-lined, rimmed baking sheet with non-stick cooking spray.In a small mixing bowl, combine refried beans, taco seasoning, and salsa. Set aside.Warm the entire stack of 10 tortillas in the microwave for about 20 seconds just to soften them slightly. Lay a tortilla on a cutting board or other work surface and place a couple tablespoons of refried bean mixture down the center of the tortilla. Layer with a couple tablespoons of the rice and then top with some grated cheese. Fold in the both sides and then roll the tortilla up.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place seam side down on the prepared baking sheet. Repeat with remaining tortillas. Coat the tops of the burrito with additional non-stick cooking spray.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake at 400 degrees for about 10 minutes. Pull baking sheet out of the oven and using tongs, flip each burrito over to brown the other side. Return to the oven for an additional 5 or 10 minutes or till nicely browned on both sides.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with additional salsa and sour cream on the side.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Sparkling ros\xe9, and Riesling are great choices for Burrito. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The J Vineyards & Winery Pinot Noir with a 5 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.', u'pairedWines': [u'pinot noir', u'sparkling rose', u'riesling'], u'productMatches': [{u'description': u'red berries , licorice , spice', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 932, u'instructions': u'Preheat oven to 400 degrees.  Generously coat a foil-lined, rimmed baking sheet with non-stick cooking spray.In a small mixing bowl, combine refried beans, taco seasoning, and salsa. Set aside.Warm the entire stack of 10 tortillas in the microwave for about 20 seconds just to soften them slightly. Lay a tortilla on a cutting board or other work surface and place a couple tablespoons of refried bean mixture down the center of the tortilla. Layer with a couple tablespoons of the rice and then top with some grated cheese. Fold in the both sides and then roll the tortilla up. Place seam side down on the prepared baking sheet. Repeat with remaining tortillas. Coat the tops of the burrito with additional non-stick cooking spray.Bake at 400 degrees for about 10 minutes. Pull baking sheet out of the oven and using tongs, flip each burrito over to brown the other side. Return to the oven for an additional 5 or 10 minutes or till nicely browned on both sides.Serve with additional salsa and sour cream on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-baked-bean-and-rice-burritos-512999', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}