{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/431359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 431359, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp Scampi with Lemon Couscous', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 381.5, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup shredded Asiago cheese', u'aisle': u'Cheese', u'name': u'asiago cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001033, u'unit': u'cup'}, {u'originalString': u'5 tablespoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup white wine or additional chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 cup uncooked couscous', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'couscous', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20028, u'unit': u'cup'}, {u'originalString': u'3 tablespoons minced fresh parsley, divided', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'divided', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1-1/2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'2 pounds cooked jumbo shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'jumbo shrimp', u'metaInformation': [u'deveined', u'cooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}, {u'originalString': u'3 tablespoons lemon juice, divided', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/shrimp-scampi-with-lemon-couscous', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, bring broth and 1 tablespoon lemon juice to a boil. Stir in couscous, 1 tablespoon butter, 1 tablespoon parsley and lemon peel. Cover and remove from the heat; let stand for 5 minutes or until liquid is absorbed.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, in a large skillet, stir oil and remaining butter over medium-high heat until butter is melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add garlic; cook and stir until tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add shrimp; cook for 1 minute on each side or until shrimp turn pink.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Add the wine, salt, pepper and remaining lemon juice; cook 2-3 minutes longer or until heated through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with couscous. Sprinkle with cheese and remaining parsley.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Shrimp Scampi can be paired with Pinot Grigio, Sancerre, and Vermentino. With buttery shrimp scampi, a crisp acidic white wine will refresh the palate. Any of these wines will do the trick. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'pinot grigio', u'sancerre', u'vermentino'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 32, u'instructions': u'Directions                                                                                In a small saucepan, bring broth and 1 tablespoon lemon juice to a boil. Stir in couscous, 1 tablespoon butter, 1 tablespoon parsley and lemon peel. Cover and remove from the heat; let stand for 5 minutes or until liquid is absorbed.                                                                                            Meanwhile, in a large skillet, stir oil and remaining butter over medium-high heat until butter is melted. Add garlic; cook and stir until tender. Add shrimp; cook for 1 minute on each side or until shrimp turn pink.                                                                                            Add the wine, salt, pepper and remaining lemon juice; cook 2-3 minutes longer or until heated through. Serve with couscous. Sprinkle with cheese and remaining parsley.                                        Yield: 6 servings.                                                                                                                         Originally published as Shrimp Scampi with Lemon Couscous in  Simple & DeliciousMay/June 2007, p28                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 379 calories, 17 g fat (8 g saturated fat), 254 mg cholesterol, 624 mg sodium, 25 g carbohydrate, 1 g fiber, 30 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-scampi-with-lemon-couscous-431359', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}