{u'recipes': [{u'sourceName': u'Lemons and Anchovies', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/568717-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 568717, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asparagus-Salmon Fried Rice', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 448.98, u'creditText': u'Lemons and Anchovies', u'extendedIngredients': [{u'originalString': u'\xbd bunch asparagus, ends trimmed then chopped in small pieces', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'small', u'trimmed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'1 tablespoon chili sauce', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6972, u'unit': u'tablespoon'}, {u'originalString': u'3 cups cooked rice', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'2 eggs, whisked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'chopped fresh chives for garnish', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'lime wedges for garnish', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'2-3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'\xbd pound cooked salmon, flaked', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'flaked', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 15076, u'unit': u'pound'}, {u'originalString': u'1 shallot, chopped', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 tablespoon soy sauce, plus more for serving', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://lemonsandanchovies.com/2013/04/asparagus-salmon-fried-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the eggs: In the same skillet that you plan to stir-fry the rice, heat 1-2 teaspoons of oil over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the whisked egg and cook for a minute or two on each side.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the pan and cut into small, bite size pieces. Set aside.For the rice: In the same pan, add 1 tablespoon of oil and heat over medium-high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chopped shallot and cook for a minute before adding the asparagus. Cook for a few minutes until the shallots start to caramelize and the asparagus is crisp-tender.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for 30 seconds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chili sauce then the rice. If your pan is too dry, add a bit more olive oil. Stir fry for 3-4 minutes, add 1 tablespoon of soy sauce and the flaked salmon. Stir fry for another minute, just until the salmon is heated through then turn off the heat. Stir in the egg and plate in bowls.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 6972, u'name': u'chili sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Garnish with chives and black pepper and drizzle with lime juice and a touch more soy sauce.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'aggregateLikes': 32, u'instructions': u'For the eggs: In the same skillet that you plan to stir-fry the rice, heat 1-2 teaspoons of oil over medium heat. Add the whisked egg and cook for a minute or two on each side. Remove from the pan and cut into small, bite size pieces. Set aside.For the rice: In the same pan, add 1 tablespoon of oil and heat over medium-high heat. Add the chopped shallot and cook for a minute before adding the asparagus. Cook for a few minutes until the shallots start to caramelize and the asparagus is crisp-tender. Add the garlic and cook for 30 seconds. Add the chili sauce then the rice. If your pan is too dry, add a bit more olive oil. Stir fry for 3-4 minutes, add 1 tablespoon of soy sauce and the flaked salmon. Stir fry for another minute, just until the salmon is heated through then turn off the heat. Stir in the egg and plate in bowls. Garnish with chives and black pepper and drizzle with lime juice and a touch more soy sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/asparagus-salmon-fried-rice-568717', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}