{u'recipes': [{u'sourceName': u'Recipes Food and Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/624577-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 624577, u'veryPopular': False, u'lowFodmap': False, u'title': u'Candied Orange Pecan Rolls', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 86.77, u'creditText': u'Recipes Food and Cooking', u'extendedIngredients': [{u'originalString': u'1 package active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'package'}, {u'originalString': u'4 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 4 oz. container orange candied fruit', u'aisle': u'Produce;Baking', u'name': u'candied fruit', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-fruit-cake-mix.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 98925, u'unit': u'oz'}, {u'originalString': u'2 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 teaspoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'2/3 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'Oil, for coating bowl', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for coating bowl'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'2 - 3 tablespoons orange juice or milk', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9206, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u"1 cup confectioner's sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 cup warm water (about 110 degrees F)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'( 110 degrees F)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://recipesfoodandcooking.com/2014/12/22/candied-orange-pecan-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Mix together the sponge ingredients in a mixing bowl. Cover with saran wrap and let set for 30 minutes until it gets bubbly and light.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the sponge to a mixing bowl fitted with a dough hook.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the butter, eggs and honey.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix until combined with the sponge.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the salt and flour.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the candied fruit. Knead for about 5 minutes with a dough hook until the dough is smooth and satiny. You can also knead the dough on a floured surface by hand.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-fruit-cake-mix.jpg', u'id': 98925, u'name': u'candied fruit'}]}, {u'equipment': [], u'step': u'Add just enough flour to get a soft dough. If you add too much flour your dough will be dry.Cover and let raise until doubled.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Mix up the filling ingredients, all but the pecans. Set aside.When the dough has doubled in size, roll the dough out on a floured surface about 8 x 12 inches.Take the filling ingredients and spread over the dough. Sprinkle with the pecans.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Roll up the dough into a cylinder so that it is 12 inches long.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the dough into 12 equal pieces.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place each roll on a greased cookie sheet. Cover and let raise until doubled.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 degrees for about 20 - 25 minutes or until the internal temperature of the bread reaches 190 degrees F.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Mix up the topping ingredients while the rolls are baking. Lightly spoon the topping over the rolls.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Serve while warm.', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 54, u'instructions': u'Mix together the sponge ingredients in a mixing bowl. Cover with saran wrap and let set for 30 minutes until it gets bubbly and light.Add the sponge to a mixing bowl fitted with a dough hook. Add the butter, eggs and honey. Mix until combined with the sponge. Add the salt and flour. Add the candied fruit. Knead for about 5 minutes with a dough hook until the dough is smooth and satiny. You can also knead the dough on a floured surface by hand. Add just enough flour to get a soft dough. If you add too much flour your dough will be dry.Cover and let raise until doubled.Mix up the filling ingredients, all but the pecans. Set aside.When the dough has doubled in size, roll the dough out on a floured surface about 8 x 12 inches.Take the filling ingredients and spread over the dough. Sprinkle with the pecans. Roll up the dough into a cylinder so that it is 12 inches long. Cut the dough into 12 equal pieces. Place each roll on a greased cookie sheet. Cover and let raise until doubled.Bake at 375 degrees for about 20 - 25 minutes or until the internal temperature of the bread reaches 190 degrees F. Mix up the topping ingredients while the rolls are baking. Lightly spoon the topping over the rolls.  Serve while warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/candied-orange-pecan-rolls-624577', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}