{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/590160-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590160, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Italian Chicken & Pasta Skillet', u'diets': [], u'pricePerServing': 350.04, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'1 (14.5 oz.) can artichoke hearts, drained and roughly chopped', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'drained', u'roughly chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 93828, u'unit': u'oz'}, {u'originalString': u'2 (8 oz. each) cans tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'1 (14.5 oz.) can diced tomatoes, drained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'4 oz. (1/2 of 8-oz. pkg.) Philadelphia Cream Cheese, cubed, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cubed', u'softened', u'(1/2 of 8-oz. pkg.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1/4 cup chopped fresh parsley or basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1/4 cup Kraft Zesty Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian dressing', u'metaInformation': [u'italian', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'1 teaspoon Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 lb. boneless skinless chicken breasts, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'2 1/2 cups uncooked whole grain pasta (or 4 cups cooked)', u'aisle': u'Pasta and Rice', u'name': u'whole grain rice pasta', u'metaInformation': [u'whole', u'uncooked', u'cooked', u'(or 4 cups )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-rice-vermicelli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 99038, u'unit': u'cups'}, {u'originalString': u'1 yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2013/05/creamy-italian-chicken-pasta-skillet.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet set to medium-high heat, add dressing. Once hot, add chicken and onions. Cook 5 minutes, stirring occasionally, until onions are translucent and chicken is mostly cooked.Stir in tomato sauce, diced tomatoes, artichoke hearts, Italian seasoning and crushed red pepper flakes. Cover and bring to a boil, then reduce heat and simmer. Stir in cream cheese. Once blended through, stir in uncooked pasta and cover. Continue to simmer, cooking pasta according to package instructions (usually 10 minutes for rotini). The pasta will cook in the sauce.*Stir in parsley or basil, and serve.Enjoy!', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 33045, u'instructions': u'In a large skillet set to medium-high heat, add dressing. Once hot, add chicken and onions. Cook 5 minutes, stirring occasionally, until onions are translucent and chicken is mostly cooked.Stir in tomato sauce, diced tomatoes, artichoke hearts, Italian seasoning and crushed red pepper flakes. Cover and bring to a boil, then reduce heat and simmer. Stir in cream cheese. Once blended through, stir in uncooked pasta and cover. Continue to simmer, cooking pasta according to package instructions (usually 10 minutes for rotini). The pasta will cook in the sauce.*Stir in parsley or basil, and serve.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-italian-chicken-pasta-skillet-590160', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}