{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/820860-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 820860, u'veryPopular': True, u'lowFodmap': False, u'title': u'Simple lentil and bacon soup', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 79.71, u'extendedIngredients': [{u'originalString': u'4 rashers smoked back bacon, diced', u'aisle': u'Meat', u'name': u'bacon rashers', u'metaInformation': [u'smoked', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'3 carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 sticks celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u'sticks'}, {u'originalString': u'1/4 teaspoon dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 small potato, diced', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'110g (1/4 lb) split red lentils, rinsed well in cold water', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red lentils', u'metaInformation': [u'split', u'red', u'cold', u'rinsed', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 10016069, u'unit': u'lb'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 OXO\xae vegetable stock cube', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock cube', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 98845, u'unit': u''}, {u'originalString': u'1.2L (2 pints) water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(2 pints)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Ls', u'unitShort': u'L', u'amount': 1.2, u'consistency': u'liquid', u'id': 14412, u'unit': u'L'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://allrecipes.co.uk/recipe/29686/simple-lentil-and-bacon-soup.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan heat the oil and fry the chopped bacon until the fat runs.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add the onion and fry for a further 2 minutes on medium heat, stirring. Then add the remaining vegetables and lentils and stir around for a further minute.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour in the water, parsley, stock cube and seasoning and bring to the boil. Turn down the heat down low and simmer, covered, for 35 to 40 minutes, stirring occasionally to prevent sticking.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}], u'step': u'The soup can be served chunky as it is, or can be liquidised with a hand blender, or potato masher.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Enjoy!', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1666, u'instructions': u'In a large saucepan heat the oil and fry the chopped bacon until the fat runs.                    Add the onion and fry for a further 2 minutes on medium heat, stirring. Then add the remaining vegetables and lentils and stir around for a further minute.                    Pour in the water, parsley, stock cube and seasoning and bring to the boil. Turn down the heat down low and simmer, covered, for 35 to 40 minutes, stirring occasionally to prevent sticking.                    The soup can be served chunky as it is, or can be liquidised with a hand blender, or potato masher.                    Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/simple-lentil-and-bacon-soup-820860', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}