{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/587156-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 587156, u'veryPopular': True, u'lowFodmap': False, u'title': u'Snickers Stuffed Loaded Peanut Butter Oatmeal Cookies', u'diets': [u'dairy free'], u'pricePerServing': 110.23, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'1/2 cup + 1 tablespoons all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'6 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup coconut oil, or softened butter', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3/4 cup baking chips', u'aisle': u'Baking', u'name': u'peppermint baking chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 98858, u'unit': u'cup'}, {u'originalString': u'1 cup quick cooking oats', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8402, u'unit': u'cup'}, {u'originalString': u'1/3 cup rice krispies cereal', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 8065, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup smooth peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16150, u'unit': u'cup'}, {u'originalString': u'18 snack size snickers candy bars, unwrapped', u'aisle': u'Sweet Snacks', u'name': u'snickers candy bar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snickers.png', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'liquid', u'id': 19155, u'unit': u''}, {u'originalString': u'1/4 teaspoon vanilla bean paste or 1/2 teaspoon vanilla extract', u'aisle': u'Gourmet', u'name': u'vanilla bean paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 93813, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.laurenslatest.com/snickers-stuffed-loaded-peanut-butter-oatmeal-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Line cookie sheet with parchment paper and set aside.In a large bowl, cream butters and sugars together. Stir in egg and vanilla bean paste and whip until light in color and fluffy, about 2 minutes. Slowly stir in baking soda, salt, flour and oats until just combined. Stir in remaining ingredients, excluding the snickers, by hand. Using a cookie scoop, create 8 cookie dough balls on your prepared baking sheet. Press dough down flat. Top with a mini snickers bar and place another scoop of cookie dough over top. Press the dough around the snickers bar to cover completely.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 93813, u'name': u'vanilla paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snickers.png', u'id': 19155, u'name': u'snickers bar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake 9-11 minutes or until cookie starts to turn light golden brown on the bottom. Cool 3-5 minutes before removing to a cooling rack.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm with milk! YUM!', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 2081, u'instructions': u'Preheat oven to 350 degrees. Line cookie sheet with parchment paper and set aside.In a large bowl, cream butters and sugars together. Stir in egg and vanilla bean paste and whip until light in color and fluffy, about 2 minutes. Slowly stir in baking soda, salt, flour and oats until just combined. Stir in remaining ingredients, excluding the snickers, by hand. Using a cookie scoop, create 8 cookie dough balls on your prepared baking sheet. Press dough down flat. Top with a mini snickers bar and place another scoop of cookie dough over top. Press the dough around the snickers bar to cover completely. Bake 9-11 minutes or until cookie starts to turn light golden brown on the bottom. Cool 3-5 minutes before removing to a cooling rack. Serve warm with milk! YUM!', u'spoonacularSourceUrl': u'https://spoonacular.com/snickers-stuffed-loaded-peanut-butter-oatmeal-cookies-587156', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}