{u'recipes': [{u'sourceName': u'Citronlimette', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615434-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615434, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Soup with Toasted Pistachios', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'pricePerServing': 128.02, u'creditText': u'Citronlimette', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 (15-ounce) can salt-free pumpkin puree', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'salt-free', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11424, u'unit': u'ounce'}, {u'originalString': u'1\xbd cups chopped carrot (about 2 medium)', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'( 2 medium)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'5 cups fat-free, less-sodium chicken broth, divided', u'aisle': u'Canned and Jarred', u'name': u'fat-free less-sodium chicken broth', u'metaInformation': [u'fat-free', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 6984, u'unit': u'cups'}, {u'originalString': u'2 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup chopped onion (about 1 medium)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'( 1 medium)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted shelled pistachios , toasted', u'aisle': u'Nuts;Savory Snacks', u'name': u'unsalted pistachios', u'metaInformation': [u'unsalted', u'shelled', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12152, u'unit': u'tablespoons'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://citronlimette.com/recipe_archive/soups/pumpkin-soup-toasted-pistachios/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat oil in a Dutch oven over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add carrot, and onion; cook 10 minutes or until tender, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic; saut 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add 3 cups broth and black pepper; bring to a boil. Cover, reduce heat, and simmer 20 minutes or until the vegetables are tender.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place one-third of vegetable mixture in a blender.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Remove center piece of blender lid (to allow steam to escape); secure blender lid on blender.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place a clean towel over opening in blender lid (to avoid spills). Blend until smooth.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour into a large bowl. Repeat procedure with remaining vegetable mixture.Return pureed vegetable mixture to Dutch oven; stir in remaining 2 cups broth and pumpkin. Cook over low heat for 10 minutes or until thoroughly heated, stirring frequently.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Remove from heat; stir in juice. Ladle 1 cup soup into each of 6 bowls; top each serving with about 1 teaspoon toasted pistachios.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 89, u'instructions': u'Heat oil in a Dutch oven over medium-high heat. Add carrot, and onion; cook 10 minutes or until tender, stirring occasionally. Add garlic; saut 1 minute. Add 3 cups broth and black pepper; bring to a boil. Cover, reduce heat, and simmer 20 minutes or until the vegetables are tender.Place one-third of vegetable mixture in a blender. Remove center piece of blender lid (to allow steam to escape); secure blender lid on blender. Place a clean towel over opening in blender lid (to avoid spills). Blend until smooth. Pour into a large bowl. Repeat procedure with remaining vegetable mixture.Return pureed vegetable mixture to Dutch oven; stir in remaining 2 cups broth and pumpkin. Cook over low heat for 10 minutes or until thoroughly heated, stirring frequently. Remove from heat; stir in juice. Ladle 1 cup soup into each of 6 bowls; top each serving with about 1 teaspoon toasted pistachios. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-soup-with-toasted-pistachios-615434', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}