{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/600354-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 600354, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lauki chana dal | Dudhi chana dal subzi (Curry)', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 68.5, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Cilantro leaves - few, chopped finely for garnishing', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'chopped', u'for garnishing', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'leaves'}, {u'originalString': u'Coriander powder - \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'coriander powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'Cumin powder - \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'cumin powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'Cumin seeds - \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'Chana dal - \xbc cup', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16069, u'unit': u'cup'}, {u'originalString': u'Garam masala - \xbc teaspoon', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 93663, u'unit': u'teaspoon'}, {u'originalString': u'Green chilies - 2, chopped finely', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green', u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'Lemon juice - 1\xbd teaspoon or to taste', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'Oil - 1 tablespoon', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'Red chili powder - 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'red chili powder', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'Salt - to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Tomato - 1 medium (3/4 cup, chopped finely)', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'medium', u'chopped', u'finely', u'(3/4 cup, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'Water - \xbd cup', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'Lauki (ghia or bottle gourd) - 1\xbd cups, cut into \xbd inch cubes', u'aisle': u'?', u'name': u'lauki', u'metaInformation': [u'cut into \xbd inch cubes', u'(ghia or bottle gourd)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.spiceupthecurry.com/lauki-chana-dal-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Wash chana dal and soak for at least 30 minutes.Take soaked and drained chana dala, chopped lauki, salt, turmeric powder and water in a pressure cooker, stir to combine. Cook it for 7-8 whistles on medium heat.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Let the pressure go down by itself and then open the cover.Lightly mash it with the back of the spoon. If it has more liquid then let it simmer without lid.To make tadka,', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a pan on medium heat. Once hot add cumin seeds and let them sizzle then add green chilies and cook for a minute.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add chopped tomatoes and cook for 1-2 minutes or till it soften a bit', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Then add dry spice powders and salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix well and cook for a minute. Some tomatoes will get mushy and some will hold its shape.Now add this tomato masala to boiled dal-lauki mixture.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Mix well. If needed then bring it to a boil.Sprinkle chopped cilantro and mix well.Finally add freshly squeezed lemon juice. And it is ready to serve.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try Mulderbosch Chenin Blanc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 88, u'instructions': u'Wash chana dal and soak for at least 30 minutes.Take soaked and drained chana dala, chopped lauki, salt, turmeric powder and water in a pressure cooker, stir to combine. Cook it for 7-8 whistles on medium heat. Let the pressure go down by itself and then open the cover.Lightly mash it with the back of the spoon. If it has more liquid then let it simmer without lid.To make tadka, Heat the oil in a pan on medium heat. Once hot add cumin seeds and let them sizzle then add green chilies and cook for a minute.Add chopped tomatoes and cook for 1-2 minutes or till it soften a bitThen add dry spice powders and salt. Mix well and cook for a minute. Some tomatoes will get mushy and some will hold its shape.Now add this tomato masala to boiled dal-lauki mixture. Mix well. If needed then bring it to a boil.Sprinkle chopped cilantro and mix well.Finally add freshly squeezed lemon juice. And it is ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/lauki-chana-dal-dudhi-chana-dal-subzi-curry-600354', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}