{u'recipes': [{u'sourceName': u'Two Peas and Their Pod', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547986-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 547986, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon Orzo Salad with Asparagus, Spinach, and Feta', u'diets': [], u'pricePerServing': 82.31, u'creditText': u'Two Peas and Their Pod', u'extendedIngredients': [{u'originalString': u'8 asparagus spears, cut into 1 inch pieces', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'cut into 1 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'1/3 cup feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Juice of 1 large lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'1 cup orzo', u'aisle': u'Pasta and Rice', u'name': u'orzo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10920420, u'unit': u'cup'}, {u'originalString': u'Salt-about 1/2 tsp. for boiling water', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'boiling', u'for  water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup packed fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.twopeasandtheirpod.com/lemon-orzo-salad-with-asparagus-spinach-and-feta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium sauce pan, bring 4 cups of water to boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the salt. Stir in orzo. Cook until tender, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Drain orzo and set aside.2. In a small sauce pan, saute garlic in olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [], u'step': u'Add in asparagus pieces.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Saute for 3-4 minutes. Stir in spinach. Cook until asparagus is tender and the spinach shrinks down.3.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the orzo in a medium bowl and add in the vegetables. Squeeze fresh lemon juice over the orzo and vegetables. Stir. Season with salt and pepper. Taste-add more lemon juice if you wish. The lemon I used was huge, so I only needed to use one lemon. If you need more juice, go ahead.4. Sprinkle feta cheese over the top of the salad.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [], u'step': u'Serve warm. (I also liked the salad cold.)', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 8862, u'instructions': u'1. In a medium sauce pan, bring 4 cups of water to boil. Add the salt. Stir in orzo. Cook until tender, about 10 minutes. Drain orzo and set aside.2. In a small sauce pan, saute garlic in olive oil. Add in asparagus pieces. Saute for 3-4 minutes. Stir in spinach. Cook until asparagus is tender and the spinach shrinks down.3. Put the orzo in a medium bowl and add in the vegetables. Squeeze fresh lemon juice over the orzo and vegetables. Stir. Season with salt and pepper. Taste-add more lemon juice if you wish. The lemon I used was huge, so I only needed to use one lemon. If you need more juice, go ahead.4. Sprinkle feta cheese over the top of the salad. Serve warm. (I also liked the salad cold.)', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-orzo-salad-with-asparagus-spinach-and-feta-547986', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}