{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523303-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 523303, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pea and potato soup', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 448.71, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'about 6 c. of good broth, preferably homemade', u'aisle': u'Canned and Jarred', u'name': u'broth', u'metaInformation': [u'good', u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'c'}, {u'originalString': u'a knob of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1/4 c. of coconut cream (see the difference between coconut cream and milk)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'coconut cream', u'metaInformation': [u'(see the difference between coconut cream and milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12115, u'unit': u'c'}, {u'originalString': u'1 1/2 c. of coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'c'}, {u'originalString': u'2 tbsps. of cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsps'}, {u'originalString': u'3 to 4 finger chilis, thinly sliced', u'aisle': u'Produce', u'name': u'finger chilis', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10211819, u'unit': u''}, {u'originalString': u'4 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 small know of ginger, minced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u''}, {u'originalString': u'1 onion, roughly chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'crisp onion slices, to garnish', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'crisp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'slices'}, {u'originalString': u'patis (fish sauce), to taste', u'aisle': u'Ethnic Foods', u'name': u'patis', u'metaInformation': [u'to taste', u'(fish sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'servings'}, {u'originalString': u'1 c. of frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'c'}, {u'originalString': u'about 2 c. of pineapple tidbits (I used canned but fresh will be infinitely better)', u'aisle': u'Canned and Jarred', u'name': u'pineapple tidbits', u'metaInformation': [u'fresh', u'canned', u'(I used but will be infinitely better)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1039354, u'unit': u'c'}, {u'originalString': u'500 g. of pork belly, cut into one-inch cubes', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'cut into one-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 10005, u'unit': u'g'}, {u'originalString': u'500 g. of potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://casaveneracion.com/sunday-lunch/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 44, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Dice the potatoes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place in a pot with the peas.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Pour in the broth. Bring to the boil, lower the heat, cover and simmer for about half an hour or until the potatoes are very soft.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour all the contents of the pot into the blender pitcher. Process until smooth.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the puree back into the pot. Taste. If too thick, add more broth. Season with salt and pepper. Reheat to simmering point. Drop in the butter. Cook, stirring, just until the butter melts.Ladle into soup bowls and sprinkle with crisp onion slices.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 24, u'instructions': u'InstructionsDice the potatoes. Place in a pot with the peas. Pour in the broth. Bring to the boil, lower the heat, cover and simmer for about half an hour or until the potatoes are very soft.Pour all the contents of the pot into the blender pitcher. Process until smooth.Pour the puree back into the pot. Taste. If too thick, add more broth. Season with salt and pepper. Reheat to simmering point. Drop in the butter. Cook, stirring, just until the butter melts.Ladle into soup bowls and sprinkle with crisp onion slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/pea-and-potato-soup-523303', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}