{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532480-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532480, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mango Gazpacho with Pickled Shrimp', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 421.81, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'1 avocado, diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cup cantaloupe chunks', u'aisle': u'Health Foods', u'name': u'soy chunks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tvp.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98854, u'unit': u'cup'}, {u'originalString': u'1 rib celery, cut into chunks', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'\xbd cup champagne vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'champagne vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cup'}, {u'originalString': u'\xbc cup cilantro leaves for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1-inch knob of fresh ginger, smashed', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'fresh', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u''}, {u'originalString': u'1 large jalapeno, seeded', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'large', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'3 limes, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'3 ripe mangoes, peeled and cut into chunks', u'aisle': u'Produce', u'name': u'mangoes', u'metaInformation': [u'ripe', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'1 tablespoon mustard seed', u'aisle': u'Spices and Seasonings', u'name': u'mustard seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup fruity olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'fruity'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u"1 \xbd cups Simply Orange Juice with Mango (if you can't find this brand regular orange juice will work)", u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u"with mango (if you can't find this brand regular orange juice will work)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9206, u'unit': u'cups'}, {u'originalString': u'1 tablespoon peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'tablespoon'}, {u'originalString': u'\xbe cup red onion, cut into large chunks', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'large', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'pinch of red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'\xbc cup red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022068, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound medium shrimp', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 yellow bell pepper, seeded and cut into chunks', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'seeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.foodiecrush.com/2012/08/mango-gazpacho-pickled-shrimp-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For Gazpacho', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Set aside  cup each of red onion and mango.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Put the rest of the ingredients except cilantro in a blender. Pulse 5-8 times. If you like your gazpacho chunky, reserve 1 cup of mixture at this and add after blending the rest of the ingredients until smooth. If you a smoother gazpacho, go ahead and blend it all at once. Chill in the refrigerator for 30 minutes for flavor to meld.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Serve with cilantro and avocado and top with pickled shrimp.For Pickled Shrimp', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Rinse, shell and devein shrimp and set aside.Bring water, vinegar, mustard seed, sugar, ginger knob and red pepper flakes to a boil in a medium pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat and add shrimp.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Let rest for 10 minutes, turning shrimp so they cook evenly.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Place mixture in refrigerator and let marinate for 30 minutes to one hour. Use as garnish for gazpacho or eat on their own. Delicious.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Gazpacho on the menu? Try pairing with Albarino, Manzanilla Sherry, and Verdejo. Though gazpacho is said to be a tricky pairing, all these Spanish wines can work. The Martin Codax Albarino with a 4.1 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.', u'pairedWines': [u'albarino', u'manzanilla sherry', u'verdejo'], u'productMatches': [{u'description': u'The Martin Codax 2011 Rias Baixas Albarino is delicate and medium-bodied with a crisp, dry finish. Flavors of ripe apple, peach, pear and lemon zest are framed by bright minerality and hints of spice. This Albari\xf1o displays intense floral aromas and an attractive acidity, making it a versatile, food-friendly wine.', u'title': u'Martin Codax Albarino', u'price': u'$16.99', u'id': 436904, u'link': u'https://www.wine.com/product/martin-codax-albarino-2011/121023', u'imageUrl': u'https://spoonacular.com/productImages/436904-312x231.jpg'}]}, u'aggregateLikes': 1618, u'instructions': u'For GazpachoSet aside  cup each of red onion and mango. Put the rest of the ingredients except cilantro in a blender. Pulse 5-8 times. If you like your gazpacho chunky, reserve 1 cup of mixture at this and add after blending the rest of the ingredients until smooth. If you a smoother gazpacho, go ahead and blend it all at once. Chill in the refrigerator for 30 minutes for flavor to meld. Serve with cilantro and avocado and top with pickled shrimp.For Pickled ShrimpRinse, shell and devein shrimp and set aside.Bring water, vinegar, mustard seed, sugar, ginger knob and red pepper flakes to a boil in a medium pan. Remove pan from heat and add shrimp. Let rest for 10 minutes, turning shrimp so they cook evenly. Place mixture in refrigerator and let marinate for 30 minutes to one hour. Use as garnish for gazpacho or eat on their own. Delicious.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-gazpacho-with-pickled-shrimp-532480', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}