{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/409686-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 409686, u'veryPopular': False, u'lowFodmap': True, u'title': u'Game Day Brats', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 163.93, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'6 brat buns, split', u'aisle': u'Meat', u'name': u'brat', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 7013, u'unit': u''}, {u'originalString': u'6 Johnsonville\xae Original Bratwurst', u'aisle': u'Meat', u'name': u'bratwurst', u'metaInformation': [u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 7013, u'unit': u''}, {u'originalString': u'6 tablespoons shredded Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'tablespoons'}, {u'originalString': u'6 tablespoons French salad dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'salad dressing', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4114, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup sauerkraut, rinsed and well drained', u'aisle': u'Canned and Jarred', u'name': u'sauerkraut', u'metaInformation': [u'rinsed', u'drained', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauerkraut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11439, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/game-day-brats', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make a lengthwise slit three-fourths of the way through each bratwurst to within 1/2 in. of each end. Fill with sauerkraut; top with dressing and cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauerkraut.jpg', u'id': 11439, u'name': u'sauerkraut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'id': 7013, u'name': u'bratwurst'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place bratwurst in buns; wrap individually in a double thickness of heavy-duty foil (about 12 in. x 10 in.). Grill, covered, over medium-hot heat for 10-15 minutes or until heated through and cheese is melted.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'id': 7013, u'name': u'bratwurst'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 73, u'instructions': u'Directions                                                                                Make a lengthwise slit three-fourths of the way through each bratwurst to within 1/2 in. of each end. Fill with sauerkraut; top with dressing and cheese.                                                                                           Place bratwurst in buns; wrap individually in a double thickness of heavy-duty foil (about 12 in. x 10 in.). Grill, covered, over medium-hot heat for 10-15 minutes or until heated through and cheese is melted.                                        Yield: 6 servings.                                                                                                                         Originally published as Game Day Brats in  Simple & DeliciousSeptember/October 2009, p19                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 594 calories, 38 g fat (12 g saturated fat), 69 mg cholesterol, 1,395 mg sodium, 41 g carbohydrate, 1 g fiber, 22 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/game-day-brats-409686', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}