{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/537447-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 537447, u'veryPopular': False, u'lowFodmap': False, u'title': u'Buffalo Chili', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 662.65, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'2 avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cup dried black beans or 2 cups cooked', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'dried', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16015, u'unit': u'cup'}, {u'originalString': u'2 pounds buffalo (or beef) roast, trimmed of any large fat pieces and cut into 1/2 inch cubes', u'aisle': u'Meat', u'name': u'buffalo roast', u'metaInformation': [u'large', u'trimmed', u'cut into 1/2 inch cubes', u'(or beef)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 17156, u'unit': u'pounds'}, {u'originalString': u'1 (28 ounce) can stewed, crushed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'4 Tablespoons chili powder (I made a blend of ancho and New Mexico chilis.)', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'(I made a blend of ancho and New Mexico chilis.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tablespoons'}, {u'originalString': u'4 chipotle peppers, diced (optional)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle peppers', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'Chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u"Chips for dippin'", u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u"for dippin'"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19003, u'unit': u'servings'}, {u'originalString': u'1 cup sour cream or creme fraiche', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'creme fraiche', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001056, u'unit': u'cup'}, {u'originalString': u"1 Tablespoon toasted cumin seeds, crushed (you can use ground if that's all you have)", u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [u'crushed', u'toasted', u'canned', u"(you can use ground if that's all you have)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'Tablespoon'}, {u'originalString': u'1 bottle dark beer', u'aisle': u'Alcoholic Beverages', u'name': u'dark beer', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'bottle'}, {u'originalString': u'5 cloves garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 Tablespoon ground cumin (roasted whole seeds are awesome)', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [u'whole', u'(roasted seeds are awesome)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'Tablespoon'}, {u'originalString': u'1 Tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tablespoon'}, {u'originalString': u'1 jalapeno, finely diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 lime, juice only', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'servings'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 large red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Salt, pepper, and a pinch of all-purpose flour', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.macheesmo.com/2009/11/buffalo-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut roast into cubes and toss it lightly with 1 Tablespoon of flour and salt and pepper.2)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat up oil over high heat in a large pan with a lid. Once your oil is hot, brown the meat in batches and let it brown nicely on all sides for just a few minutes. The goal here isnt to cook the meat, its just to brown it a bit and get some flavors going in the pan. 3) After a few minutes, remove all meat and set it aside. Take your pan off the heat until youre ready to make your chili so all the bits of flavor in the pan dont actually burn. Dont wash your pan though!4) For chili powder, split each pepper in half (remove the seeds and stems) and roast in a 200 degree oven for about 30-40 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}]}, {u'equipment': [], u'step': u'Let them cool for a few minutes. Give the roasted peppers a whirl in your spice grinder.5)', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the pan back on the stove with about 4 Tablespoons of oil.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add red onions and start to cook them down. After a few minutes add garlic. After another minute or so add all chili powders and cumin! 6)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add your full bottle of beer. Open a beer for you. You deserve it.7) Stirring pretty steadily, let the beer cook down in your onions and chili for about 10 minutes. It should reduce by about half.8)', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [], u'step': u'Add your buffalo/beef back to the mix and then add all your other ingredients except the beans. Give it a good stir and bring it to a simmer.9)', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let this cook down on low heat, covered, for about 45 minutes. Give it a stir every 15 minutes or so.Note: If you look at Bobbys original recipe it says to add 5 Cups of liquid. If I would have done that, I wouldve made buffalo soup. Basically, Id recommend adding enough water to just barely cover your meat and veggies.10) For the Creme Fraiche (you could substitute sour cream) stir in a Tablespoon or so of cumin and stick it back in the fridge until you need it.11) For the Avocado relish also known as guacamole, mix everything up in a bowl!12) Once chili has cooked for about 45 minutes, uncover it and add beans and continue to cook it for another 15 minutes or so until it is nice and thick.13) Taste it! What does it need? More heat? More salt? Adjust it accordingly.', u'length': {u'number': 120, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1001056, u'name': u'creme fraiche'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve it with a big scoop of avocado and cumin cream with lots of chips for dipping!', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Juve Y Camps Brut Nature Reserva de la Familia Cava. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 16 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats.', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 80, u'instructions': u'Directions1) Cut roast into cubes and toss it lightly with 1 Tablespoon of flour and salt and pepper.2) Heat up oil over high heat in a large pan with a lid. Once your oil is hot, brown the meat in batches and let it brown nicely on all sides for just a few minutes. The goal here isnt to cook the meat, its just to brown it a bit and get some flavors going in the pan. 3) After a few minutes, remove all meat and set it aside. Take your pan off the heat until youre ready to make your chili so all the bits of flavor in the pan dont actually burn. Dont wash your pan though!4) For chili powder, split each pepper in half (remove the seeds and stems) and roast in a 200 degree oven for about 30-40 minutes. Let them cool for a few minutes. Give the roasted peppers a whirl in your spice grinder.5) Put the pan back on the stove with about 4 Tablespoons of oil. Add red onions and start to cook them down. After a few minutes add garlic. After another minute or so add all chili powders and cumin! 6) Add your full bottle of beer. Open a beer for you. You deserve it.7) Stirring pretty steadily, let the beer cook down in your onions and chili for about 10 minutes. It should reduce by about half.8) Add your buffalo/beef back to the mix and then add all your other ingredients except the beans. Give it a good stir and bring it to a simmer.9) Let this cook down on low heat, covered, for about 45 minutes. Give it a stir every 15 minutes or so.Note: If you look at Bobbys original recipe it says to add 5 Cups of liquid. If I would have done that, I wouldve made buffalo soup. Basically, Id recommend adding enough water to just barely cover your meat and veggies.10) For the Creme Fraiche (you could substitute sour cream) stir in a Tablespoon or so of cumin and stick it back in the fridge until you need it.11) For the Avocado relish also known as guacamole, mix everything up in a bowl!12) Once chili has cooked for about 45 minutes, uncover it and add beans and continue to cook it for another 15 minutes or so until it is nice and thick.13) Taste it! What does it need? More heat? More salt? Adjust it accordingly. Serve it with a big scoop of avocado and cumin cream with lots of chips for dipping!', u'spoonacularSourceUrl': u'https://spoonacular.com/buffalo-chili-537447', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}