{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/533714-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 95, u'id': 533714, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pecan Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 240.05, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'2 tablespoons bourbon (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'1 cup firmly packed dark brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u"\xbc cup Lyle's Golden Syrup", u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93829, u'unit': u'cup'}, {u'originalString': u'\xbd cups light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19350, u'unit': u'cups'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'Classic Pie Pastry for one 9 inch single-crust pie', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'for one 9 inch single-crust pie'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'6 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://thebakingpan.com/recipes/pies-and-tarts/pecan-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Prepare Classic Pie Pastry for a 9 inch single-crust pie. Line a 9 inch pie pan with the bottom pastry. Trim the pastry to one inch beyond the edge of the pie pan. Flute the edges. Cover with plastic wrap and refrigerate pie shell until firm, at least 30 minutes', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F.By hand, break the pecans into coarse, uneven pieces, leaving a few unbroken. Having a mixture of both large and small pecan pieces adds a nice visual texture to the pie. Dont chop with a knife as this creates small crumbs. Set aside.In a large mixing bowl, lightly whip the eggs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the brown sugar, salt, corn syrup, Lyles Golden Syrup, and melted butter, lightly stir together to completely blend. Do not over-mix, which will create air bubbles. Blend in the vanilla and bourbon (optional.) Stir in the pecans.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 93829, u'name': u'golden syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the mixture into the chilled pastry shell.', u'number': 4, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake 85 to 95 minutes or until the crust is golden and the filling is puffed, and the pie jiggles slightly if the pan is given a gentle shake. Tip: During baking, if crust is getting too brown, loosely place a piece of foil over the top to prevent the crust from over-browning.', u'length': {u'number': 85, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven. Cool on a wire cooling rack for at least 3 hours before cutting and serving. The filling will firm as it cools and the center will sink. Cover and refrigerate within 8 hours. Refrigerate Leftovers.', u'number': 2, u'ingredients': []}], u'name': u'Bake'}], u'winePairing': {u'pairingText': u'Madeira, Pedro Xim\xe9nez, and Tawny Port are my top picks for Pecan Pie. Sweet, nutty pecan pie deserves a wine to match - these dessert wines all have the right sweetness and the nutty notes. One wine you could try is Kenneth Volk El Pomar Junction Vineyard Verdelho. It has 1.7999999999999998 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'madeira', u'pedro ximenez', u'tawny port'], u'productMatches': [{u'description': u"Verdelho is a semi-aromatic white grape that was traditionally used in the production of the revered wines of the island of Madeira. Verdelho has found popularity with forward thinking vintners from around the world in the production of delicious table wines. This bottling is full bodied with tropical and citrus fruit aromas with grapefruit, melon and apple flavors. This refreshing wine can be enjoyed as an aperitif or served with seafoods or Pacific Rim cuisine. Verdelho's aroma and bouquet is unique and reminds me of citrus flowers and ripe Casaba melon.Its palate weight is more full-bodied than many other white wines.", u'title': u'Kenneth Volk El Pomar Junction Vineyard Verdelho', u'price': u'$11.99', u'id': 444264, u'link': u'https://www.wine.com/product/kenneth-volk-el-pomar-junction-vineyard-verdelho-2008/105981', u'imageUrl': u'https://spoonacular.com/productImages/444264-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u'Prepare Classic Pie Pastry for a 9 inch single-crust pie. Line a 9 inch pie pan with the bottom pastry. Trim the pastry to one inch beyond the edge of the pie pan. Flute the edges. Cover with plastic wrap and refrigerate pie shell until firm, at least 30 minutesPreheat oven to 325 degrees F.By hand, break the pecans into coarse, uneven pieces, leaving a few unbroken. Having a mixture of both large and small pecan pieces adds a nice visual texture to the pie. Dont chop with a knife as this creates small crumbs. Set aside.In a large mixing bowl, lightly whip the eggs. Add the brown sugar, salt, corn syrup, Lyles Golden Syrup, and melted butter, lightly stir together to completely blend. Do not over-mix, which will create air bubbles. Blend in the vanilla and bourbon (optional.) Stir in the pecans. Pour the mixture into the chilled pastry shell. Bake: Bake 85 to 95 minutes or until the crust is golden and the filling is puffed, and the pie jiggles slightly if the pan is given a gentle shake. Tip: During baking, if crust is getting too brown, loosely place a piece of foil over the top to prevent the crust from over-browning.Remove from oven. Cool on a wire cooling rack for at least 3 hours before cutting and serving. The filling will firm as it cools and the center will sink. Cover and refrigerate within 8 hours. Refrigerate Leftovers.', u'spoonacularSourceUrl': u'https://spoonacular.com/pecan-pie-533714', u'dishTypes': [u'dessert'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 155, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}