{u'recipes': [{u'sourceName': u'Blender Babes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/581109-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 581109, u'veryPopular': False, u'lowFodmap': True, u'title': u'Vegan Butter Maple Pecan Ice Cream', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'vegan'], u'preparationMinutes': 6, u'pricePerServing': 337.88, u'creditText': u'Blender Babes', u'extendedIngredients': [{u'originalString': u'1/2 cup raw almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 cup pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1/4 cup tahini', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12698, u'unit': u'cup'}, {u'originalString': u'2 teaspoons of vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 61.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.blenderbabes.com/lifestyle-diet/dairy-free/vegan-butter-maple-pecan-ice-cream-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Place all ingredients into the blender in the order listed and secure lid.For Blendtec: If using the Twister jar, cut the recipe in half. Run the ICE CREAM cycle and turn the lid counterclockwise. Using the Fourside/Wildside Jars, run the ICE CREAM cycle. If the blade spins freely stop the machine and use a spatula to push ingredients down into the blades and then run the ICE CREAM cycle again. Repeat if necessary until creamy and combined.For Vitamix: Start on VARIABLE, speed #1. Turn machine on and slowly increase to VARIABLE speed #10/HIGH. Use the tamper to press ingredients into the blades. You may have to stop the machine and scrape ingredients toward the center and continue blending for about 2 to 3 minutes, until creamy and combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into a container and stir in pecans.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Serve immediately for a soft serve ice cream, for a hard ice cream place in an air tight container and freeze for at least 6 hours.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 115, u'instructions': u'Place all ingredients into the blender in the order listed and secure lid.For Blendtec: If using the Twister jar, cut the recipe in half. Run the ICE CREAM cycle and turn the lid counterclockwise. Using the Fourside/Wildside Jars, run the ICE CREAM cycle. If the blade spins freely stop the machine and use a spatula to push ingredients down into the blades and then run the ICE CREAM cycle again. Repeat if necessary until creamy and combined.For Vitamix: Start on VARIABLE, speed #1. Turn machine on and slowly increase to VARIABLE speed #10/HIGH. Use the tamper to press ingredients into the blades. You may have to stop the machine and scrape ingredients toward the center and continue blending for about 2 to 3 minutes, until creamy and combined.Pour into a container and stir in pecans.Serve immediately for a soft serve ice cream, for a hard ice cream place in an air tight container and freeze for at least 6 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-butter-maple-pecan-ice-cream-581109', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 366, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}