{u'recipes': [{u'sourceName': u'Gal on a Mission', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/611573-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 611573, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Chili', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 81.62, u'creditText': u'Gal on a Mission', u'extendedIngredients': [{u'originalString': u'1 pumpkin ale or regular ale, can also use 1 cup of beef stock', u'aisle': u'Alcoholic Beverages', u'name': u'ale', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 10014006, u'unit': u''}, {u'originalString': u'2 cans diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned diced tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 11531, u'unit': u'cans'}, {u'originalString': u'2 cans (15 ounces each) red kidney beans, drained', u'aisle': u'Canned and Jarred', u'name': u'canned red kidney beans', u'metaInformation': [u'red', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 10016034, u'unit': u'ounces'}, {u'originalString': u'\xbd tablespoon dark chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'4 garlic cloves, miced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd to 1 pound of ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1 tablespoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd tablespoon pumpkin pie spice mix', u'aisle': u'Baking', u'name': u'pumpkin pie mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11426, u'unit': u'tablespoon'}, {u'originalString': u'1 cup pumpkin puree (not pumpkin pie filling)', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [u'(not pumpkin pie filling)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.galonamission.com/pumpkin-chili/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Saute the minced garlic, onion, and green pepper in a large pot with oil. Cook until the onions are done.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add in the ground beef and cook until the ground beef is cooked through, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [], u'step': u'Mix in the pumpkin ale or beef stock and allow it to simmer on low-to-medium heat for another 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10014006, u'name': u'ale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Mix in the pumpkin puree, red kidney beans, diced tomatoes, pumpkin pie spice mix, dark chili powder, and cumin. Allow the chili to look on low-heat for a couple of hours. Can also be done in the slow cooker on low for 8 hours or high for 4 hours.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Serve with cheese, sour cream, or any of your favorite toppings.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Campo Viejo Cava Brut ros\xe9 with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A bright sparkling pink color. Pleasant and powerful on the nose with a strong presence of ripe red berries.With has a rounded, pleasant feel in the mouth. View More', u'title': u'Campo Viejo Cava Brut Rose', u'price': u'$11.99', u'id': 468840, u'link': u'https://www.wine.com/product/campo-viejo-cava-brut-rose/132863', u'imageUrl': u'https://spoonacular.com/productImages/468840-312x231.jpg'}]}, u'aggregateLikes': 148, u'instructions': u'Saute the minced garlic, onion, and green pepper in a large pot with oil. Cook until the onions are done. Add in the ground beef and cook until the ground beef is cooked through, about 10 minutes.Mix in the pumpkin ale or beef stock and allow it to simmer on low-to-medium heat for another 10 minutes. Mix in the pumpkin puree, red kidney beans, diced tomatoes, pumpkin pie spice mix, dark chili powder, and cumin. Allow the chili to look on low-heat for a couple of hours. Can also be done in the slow cooker on low for 8 hours or high for 4 hours.Serve with cheese, sour cream, or any of your favorite toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-chili-611573', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 185, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}