{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/471860-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 471860, u'veryPopular': False, u'lowFodmap': True, u'title': u'Muffuletta-Style Grilled Stuffed Flank Steak (Stuffed With Salumi, Provolone, and Olive Salad)', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'pricePerServing': 301.51, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'3 ounces thinly sliced capicola', u'aisle': u'Meat', u'name': u'capicola', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 93679, u'unit': u'ounces'}, {u'originalString': u'1 whole flank steak, 2 to 2 1/2 pounds, trimmed of excess fat', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [u'whole', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 23657, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 ounces thinly sliced mortadella', u'aisle': u'Meat', u'name': u'mortadella', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mortadella.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 7050, u'unit': u'ounces'}, {u'originalString': u'1 cup New Orleans-Style Olive Salad', u'aisle': u'Canned and Jarred', u'name': u'olive', u'metaInformation': [u'orleans-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9195, u'unit': u'cup'}, {u'originalString': u'3 ounces thinly sliced prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'ounces'}, {u'originalString': u'4 ounces thinly sliced Provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'ounces'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/05/grilled-stuffed-flank-steak-muffuletta-salumi-provolone-olive-salad-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Lay steak on a cutting board with grain running parallel to the edge of the counter. Trim left and right edges to form a clean rectangle and reserve scraps for another use. Hold steak flat with your non-knife hand and, with a sharp boning knife, carefully butterfly the steak, leaving the back edge attached by 1/2- to 1/4-inch of meat. Open up steak and flatten the seam gently with your hand to form a large perfect rectangle.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Season steak on exposed side with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Spread olive salad evenly over steak, leaving a 1-inch border at the top and the bottom. Layer prosciutto, capicola, mortadella, and Provolone over steak, leaving the border at the top and bottom.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mortadella.jpg', u'id': 7050, u'name': u'mortadella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 93679, u'name': u'capicola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Carefully roll the steak away from you (the grain should run width-wise), tightening as you go until it is rolled into a cylinder.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Let it rest with its seam-side down.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}], u'step': u'Tie the beef tightly with twine, spacing the ties evenly every 1 1/2 inches. Insert a skewer through each piece of twine. Using a sharp knife, carefully cut between the ties to make the pinwheels. Season with salt and pepper.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'5', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the pinwheels on the hot side of the grill and cook without moving until well charred on first side, about 3 minutes. Flip steaks and char second side, about 3 minutes longer.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Transfer to cooler side of grill, cover, and cook until an instant read thermometer inserted into the center registers 120\xb0F for medium-rare or 130\xb0F for medium.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to a platter, let rest for five minutes, and serve.', u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Flank Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. The Rombauer Merlot with a 4.8 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Enticing and lively red color; beautifully aromatic with black cherry and ripe plum. On the palate a purity of blackcurrant, cedar and mint flavors blend together seamlessly. Soft and supple, this wine has a medium-bodied mouth-feel with plush tannins that integrate with the generous finish.Our favorite pairings for this wine include chicken parmesan, cedar-planked salmon over wild rice, and mushroom pizza.', u'title': u'Rombauer Merlot', u'price': u'$25.59', u'id': 447938, u'link': u'https://www.wine.com/product/rombauer-merlot-2008/116883', u'imageUrl': u'https://spoonacular.com/productImages/447938-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'Procedures                                                                              1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Lay steak on a cutting board with grain running parallel to the edge of the counter. Trim left and right edges to form a clean rectangle and reserve scraps for another use. Hold steak flat with your non-knife hand and, with a sharp boning knife, carefully butterfly the steak, leaving the back edge attached by 1/2- to 1/4-inch of meat. Open up steak and flatten the seam gently with your hand to form a large perfect rectangle.                                                                                                                            2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Season steak on exposed side with salt and pepper. Spread olive salad evenly over steak, leaving a 1-inch border at the top and the bottom. Layer prosciutto, capicola, mortadella, and Provolone over steak, leaving the border at the top and bottom.                                                                                                                            3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Carefully roll the steak away from you (the grain should run width-wise), tightening as you go until it is rolled into a cylinder. Let it rest with its seam-side down.                                                                                                                            4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Tie the beef tightly with twine, spacing the ties evenly every 1 1/2 inches. Insert a skewer through each piece of twine. Using a sharp knife, carefully cut between the ties to make the pinwheels. Season with salt and pepper.                                                                                                                            5                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Place the pinwheels on the hot side of the grill and cook without moving until well charred on first side, about 3 minutes. Flip steaks and char second side, about 3 minutes longer. Transfer to cooler side of grill, cover, and cook until an instant read thermometer inserted into the center registers 120\xb0F for medium-rare or 130\xb0F for medium. Transfer to a platter, let rest for five minutes, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/muffuletta-style-grilled-stuffed-flank-steak-stuffed-with-salumi-provolone-and-olive-salad-471860', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}