{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/291329-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 291329, u'veryPopular': False, u'lowFodmap': False, u'title': u'Minestrone With Parmigiano-Reggiano', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 267.81, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 bouquet garni (1 sprig rosemary, 4 sprigs thyme, 1 bay leaf and 1 bunch parsley, tied together with kitchen twine)', u'aisle': u'Produce', u'name': u'bouquet garni', u'metaInformation': [u'with kitchen twine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1012023, u'unit': u''}, {u'originalString': u'2 large carrots, diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 large stalks celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'3 cups cannellini beans (canned or cooked dried beans)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dried cannellini beans', u'metaInformation': [u'dried', u'canned', u'cooked', u'( or beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10016049, u'unit': u'cups'}, {u'originalString': u'4 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 cups low-sodium chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1006970, u'unit': u'cups'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 pound thinly sliced pancetta, cut into thin strips', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'thinly sliced', u'cut into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 10410123, u'unit': u'pound'}, {u'originalString': u'Grated Parmigiano-Reggiano cheese, for topping', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'grated', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 large red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/2 head Savoy cabbage, finely sliced, blanched and drained', u'aisle': u'Produce', u'name': u'savoy cabbage', u'metaInformation': [u'drained', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/savoy-cabbage.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11114, u'unit': u'head'}, {u'originalString': u'1 cup spinach, coarsely chopped', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'1/2 bunch Swiss chard, finely sliced', u'aisle': u'Produce', u'name': u'swiss chard', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11147, u'unit': u'bunch'}, {u'originalString': u'3 medium tomatoes, seeded and diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'medium', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 large waxy potato, cut into 1/2-inch cubes', u'aisle': u'Produce', u'name': u'waxy potato', u'metaInformation': [u'large', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11355, u'unit': u''}], u'healthScore': 69.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/bobby-flay/minestrone-with-parmigiano-reggiano-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat the olive oil in a 4-quart pot over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion, celery, garlic, carrots and pancetta and cook, stirring, until soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add 4 cups water, the cabbage, chard, potato, chicken stock, tomatoes and bouquet garni. Bring the soup to a gentle simmer and cook 25 to 30 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1012023, u'name': u'bouquet garni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place half of the beans (1 1/2 cups) in a food processor and process until smooth.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the bean puree and the whole beans to the soup and simmer 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add the spinach and cook 2 more minutes. Season generously with salt and pepper. Ladle the soup into bowls and garnish with cheese.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Photograph by Yunhee Kim', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 63, u'instructions': u'Heat the olive oil in a 4-quart pot over medium-high heat. Add the onion, celery, garlic, carrots and pancetta and cook, stirring, until soft, about 5 minutes. Add 4 cups water, the cabbage, chard, potato, chicken stock, tomatoes and bouquet garni. Bring the soup to a gentle simmer and cook 25 to 30 minutes.                          Place half of the beans (1 1/2 cups) in a food processor and process until smooth. Add the bean puree and the whole beans to the soup and simmer 10 minutes. Add the spinach and cook 2 more minutes. Season generously with salt and pepper. Ladle the soup into bowls and garnish with cheese.                          Photograph by Yunhee Kim', u'spoonacularSourceUrl': u'https://spoonacular.com/minestrone-with-parmigiano-reggiano-291329', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}