{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/731466-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 731466, u'veryPopular': True, u'lowFodmap': False, u'title': u'Banana Chocolate Chip Shortbread Icebox Cake', u'diets': [], u'pricePerServing': 59.29, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'1 medium banana, sliced (plus more for garnish, if desired)', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'medium', u'plus more for garnish, if desired)', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2 boxes (4.9 ounces each) Walkers Gluten Free Chocolate Chip Shortbread (or use any shortbread cookie flavor)', u'aisle': u'Sweet Snacks', u'name': u'chocolate chip cookie', u'metaInformation': [u'gluten free', u'(or use any shortbread cookie flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chip-cookie.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.8, u'consistency': u'solid', u'id': 28027, u'unit': u'ounces'}, {u'originalString': u'Mini Chocolate Chips, for garnish, optional', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'mini', u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'servings'}, {u'originalString': u'1 (8 ounce) container Cool Whip (light or fat-free is fine)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free cool whip', u'metaInformation': [u'light', u'fat-free', u'fine', u'( or is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'ounce'}, {u'originalString': u'1 box (3.4 ounces) instant banana pudding mix', u'aisle': u'Baking', u'name': u'instant lemon pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19332, u'unit': u'ounces'}, {u'originalString': u'1 1/2 cups nonfat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.crazyforcrust.com/2016/04/banana-chocolate-chip-shortbread-icebox-cake-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk pudding mix and milk in a medium bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Let sit to set up for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place cookies in a single layer (about 9) in the bottom of an 8x8 baking dish.Fold half the Cool Whip (about 1 cup) into the pudding.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread half the pudding mixture on top the cookies in the pan. Arrange banana slices on top of the pudding, then spread half of the remaining Cool Whip (about 1/2 cup) over the top of the bananas.Reserve 1 cookie, then place the remaining ones in a single layer on top the Cool Whip, cover it with the remaining pudding mixture and the rest of the Cool Whip. Crush the reserved cookie and sprinkle it over the top, along with some mini chocolate chips for garnish.Cover and refrigerate for at least 4 hours or overnight before serving. Store leftovers covered in the refrigerator for up to 3 days.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'mini chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 770, u'instructions': u'Whisk pudding mix and milk in a medium bowl. Let sit to set up for about 5 minutes.Place cookies in a single layer (about 9) in the bottom of an 8x8 baking dish.Fold half the Cool Whip (about 1 cup) into the pudding. Spread half the pudding mixture on top the cookies in the pan. Arrange banana slices on top of the pudding, then spread half of the remaining Cool Whip (about 1/2 cup) over the top of the bananas.Reserve 1 cookie, then place the remaining ones in a single layer on top the Cool Whip, cover it with the remaining pudding mixture and the rest of the Cool Whip. Crush the reserved cookie and sprinkle it over the top, along with some mini chocolate chips for garnish.Cover and refrigerate for at least 4 hours or overnight before serving. Store leftovers covered in the refrigerator for up to 3 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-chocolate-chip-shortbread-icebox-cake-731466', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}