{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479930-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 479930, u'veryPopular': False, u'lowFodmap': False, u'title': u'Wild Rice with Wilted Greens', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 73.92, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'2 tablespoons balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoons'}, {u'originalString': u'4 cups tightly packed chopped chard, kale, beet greens or spinach', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'packed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11147, u'unit': u'cups'}, {u'originalString': u'2 garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'8 cups cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 cup wild rice', u'aisle': u'Pasta and Rice', u'name': u'wild rice', u'metaInformation': [u'wild'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20088, u'unit': u'cup'}], u'healthScore': 63.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://feedmephoebe.com/2014/04/wild-rice-recipe-wilted-greens/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, cover the wild rice with the water, add 1 teaspoon of salt and bring to a boil. Cover and simmer over moderately low heat until the rice is tender but still chewy, about 1 hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'id': 20088, u'name': u'wild rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the rice well.Meanwhile, heat the oil in a large nonstick skillet. Cook the garlic over medium-high heat until golden brown, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the greens and cook, tossing occasionally, until wilted, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the balsamic, red pepper and season with salt. Cook one minute more, until the vinegar has reduced, and remove to a mixing bowl.Toss the wild rice with the wilted greens and serve warm.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'id': 20088, u'name': u'wild rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 10, u'instructions': u'In a large saucepan, cover the wild rice with the water, add 1 teaspoon of salt and bring to a boil. Cover and simmer over moderately low heat until the rice is tender but still chewy, about 1 hour. Drain the rice well.Meanwhile, heat the oil in a large nonstick skillet. Cook the garlic over medium-high heat until golden brown, about 2 minutes. Add the greens and cook, tossing occasionally, until wilted, about 4 minutes. Add the balsamic, red pepper and season with salt. Cook one minute more, until the vinegar has reduced, and remove to a mixing bowl.Toss the wild rice with the wilted greens and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/wild-rice-with-wilted-greens-479930', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}