{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/304247-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 304247, u'veryPopular': False, u'lowFodmap': False, u'title': u'Five-Minute Fudge Wreath', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 42.42, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'9 ounces (3/4 of a 12-ounce bag) butterscotch morsels', u'aisle': u'Frozen;Condiments', u'name': u'butterscotch', u'metaInformation': [u'(3/4 of a 12-ounce bag)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 19085, u'unit': u'ounces'}, {u'originalString': u'Candied cherries, red and green, for garnish, optional', u'aisle': u'Produce;Baking', u'name': u'candied cherries', u'metaInformation': [u'green', u'red', u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-cherries.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'consistency': u'solid', u'id': 93742, u'unit': u'servings'}, {u'originalString': u'1/2 cup (a couple of handfuls) currants', u'aisle': u'Produce', u'name': u'currants', u'metaInformation': [u'(a couple of handfuls)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/currants.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9085, u'unit': u'cup'}, {u'originalString': u'8-inch cake pan, lightly greased with softened butter', u'aisle': u'Bakery/Bread', u'name': u'lb cake', u'metaInformation': [u'with softened butter'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 8.0, u'consistency': u'liquid', u'id': 18133, u'unit': u'inch'}, {u'originalString': u'1 (12-ounce) bag semisweet chocolate morsels', u'aisle': u'Baking', u'name': u'semisweet chocolate morsels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounce'}, {u'originalString': u'1 (14-ounce) can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 (8-ounce) can walnut halves', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut halves', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 12155, u'unit': u'ounce'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/rachael-ray/five-minute-fudge-wreath-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a heavy pot on the stove and preheat it over low heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add chips and milk and stir until chips are melted and milk combined. Save the empty condensed milk can. Stir in vanilla and remove fudge from heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add nuts and currants and stir in immediately.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/currants.jpg', u'id': 9085, u'name': u'currants'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}], u'step': u'Cover empty condensed milk can with plastic food wrap and center it in the greased cake pan. Spoon fudge into pan around can, making sure to recenter can if it drifts.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}]}, {u'equipment': [], u'step': u'The fudge will set up almost immediately.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Garnish can only be added in the first minute or 2 the fudge is in the pan, so work quickly. Decorate your wreath with "holly" made from cut candied red and green cherries. A wreath left plain can be garnished with a pretty fabric bow when serving. Chill covered in the refrigerator and slice fudge very thin when ready to serve, a little goes a long way.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cajun can be paired with Albarino, ros\xe9 Wine, and Sauvignon Blanc. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. One wine you could try is Salneval Albarino. It has 4.2 out of 5 stars and a bottle costs about 9 dollars.', u'pairedWines': [u'albarino', u'rose wine', u'sauvignon blanc'], u'productMatches': [{u'description': u'Light straw in color, the nose of this Albari\xf1o is seductive with honey, pear and tropical fruit and a slight mineral component. It is racy andzesty with citrus and floral flavors in the mouth, yet is round and soft at the same time.It matches perfectly with fresh seafood and shellfish; is an ideal accompaniment to salty, spicy Asian cuisine; and is also great on its own as a cocktail wine. Truly adventurous food lovers will amaze and inspire their friends by serving it with the unlikely, but fantastic pairing of traditional barbequed ribs with a sweet, slightly spicy tomato based sauce.', u'title': u'Salneval Albarino', u'price': u'$9.39', u'id': 446012, u'link': u'https://www.wine.com/product/salneval-albarino-2008/98474', u'imageUrl': u'https://spoonacular.com/productImages/446012-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Watch how to make this recipe.                    Place a heavy pot on the stove and preheat it over low heat. Add chips and milk and stir until chips are melted and milk combined. Save the empty condensed milk can. Stir in vanilla and remove fudge from heat. Add nuts and currants and stir in immediately.                          Cover empty condensed milk can with plastic food wrap and center it in the greased cake pan. Spoon fudge into pan around can, making sure to recenter can if it drifts.                          The fudge will set up almost immediately. Garnish can only be added in the first minute or 2 the fudge is in the pan, so work quickly. Decorate your wreath with "holly" made from cut candied red and green cherries. A wreath left plain can be garnished with a pretty fabric bow when serving. Chill covered in the refrigerator and slice fudge very thin when ready to serve, a little goes a long way.', u'spoonacularSourceUrl': u'https://spoonacular.com/five-minute-fudge-wreath-304247', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}