{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/403503-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 403503, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesesteak Soup', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 568.82, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 carrot, chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/4 teaspoon celery seeds', u'aisle': u'Spices and Seasonings', u'name': u'celery seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-seed.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2007, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup plus 2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chopped fresh parsley, plus more for topping', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'plus more for topping', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon hot sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'6 cups low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'5 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 cup jarred sliced pepperoncini', u'aisle': u'Canned and Jarred', u'name': u'pepperoncini', u'metaInformation': [u'jarred', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11976, u'unit': u'cup'}, {u'originalString': u'8 ounces provolone cheese, shredded', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1035, u'unit': u'ounces'}, {u'originalString': u'1 pound shaved beef steak or roast beef', u'aisle': u'Meat', u'name': u'roast beef', u'metaInformation': [u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 93713, u'unit': u'pound'}, {u'originalString': u'8 ounces cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'2 soft hoagie rolls, cut into 1/2-inch cubes', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'soft', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'2 teaspoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoons'}], u'healthScore': 46.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/cheesesteak-soup.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat 2 tablespoons olive oil in a Dutch oven or heavy-bottomed pot over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion, carrot, celery seeds and garlic and cook, stirring occasionally, until the onion softens, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-seed.jpg', u'id': 2007, u'name': u'celery seed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add 1/3 cup flour, the Worcestershire sauce and hot sauce; cook, stirring occasionally, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the chicken broth and 2 cups water and bring to a boil. Reduce the heat to medium low and cook until the vegetables are tender, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Meanwhile, toss the bread cubes with 1 tablespoon olive oil on a baking sheet; season with salt and pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Bake until golden and crisp, about 7 minutes; set aside.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Puree the soup in a blender until smooth. Return to the pot and bring to a boil, then reduce the heat to medium low and simmer 5 minutes. Toss the cheddar, provolone and the remaining 2 tablespoons flour in a bowl; slowly whisk the cheese mixture into the soup until melted. Return to the blender and puree until smooth.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour back into the pot and bring to a low boil; remove from the heat.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 2 tablespoons olive oil in a large skillet over medium-high heat.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add the beef and cook, stirring occasionally, until browned, about 3 minutes. Stir in the pepperoncini and parsley and season with salt and pepper. Ladle the soup into bowls; top with the beef, croutons and more parsley.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoncini.jpg', u'id': 11976, u'name': u'peperoncini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Photograph by Johnny Miller', u'number': 12, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 69, u'instructions': u'Preheat the oven to 400 degrees F. Heat 2 tablespoons olive oil in a Dutch oven or heavy-bottomed pot over medium-high heat. Add the onion, carrot, celery seeds and garlic and cook, stirring occasionally, until the onion softens, about 3 minutes. Add 1/3 cup flour, the Worcestershire sauce and hot sauce; cook, stirring occasionally, about 2 minutes. Add the chicken broth and 2 cups water and bring to a boil. Reduce the heat to medium low and cook until the vegetables are tender, about 20 minutes.                          Meanwhile, toss the bread cubes with 1 tablespoon olive oil on a baking sheet; season with salt and pepper. Bake until golden and crisp, about 7 minutes; set aside.                          Puree the soup in a blender until smooth. Return to the pot and bring to a boil, then reduce the heat to medium low and simmer 5 minutes. Toss the cheddar, provolone and the remaining 2 tablespoons flour in a bowl; slowly whisk the cheese mixture into the soup until melted. Return to the blender and puree until smooth. Pour back into the pot and bring to a low boil; remove from the heat.                          Heat the remaining 2 tablespoons olive oil in a large skillet over medium-high heat. Add the beef and cook, stirring occasionally, until browned, about 3 minutes. Stir in the pepperoncini and parsley and season with salt and pepper. Ladle the soup into bowls; top with the beef, croutons and more parsley.                          Photograph by Johnny Miller', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesesteak-soup-403503', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}