{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/179716-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 179716, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beefy Enchilada Nachos', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 266.72, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'1 cup rinsed, drained, canned Progresso\xae black beans (from 15- or 19-oz can)', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'canned', u'rinsed', u'drained', u'progresso\xae', u'(from 15-)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16018, u'unit': u'cup'}, {u'originalString': u'1 can (4.5 oz) Old El Paso\xae chopped green chiles', u'aisle': u'Canned and Jarred', u'name': u'canned green chiles', u'metaInformation': [u'green', u'chopped', u'old el paso\xae', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.5, u'consistency': u'solid', u'id': 11980, u'unit': u'oz'}, {u'originalString': u'Additional shredded Cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1009, u'unit': u'servings'}, {u'originalString': u'1 can (10 oz) Old El Paso\xae mild enchilada sauce', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'enchilada sauce', u'metaInformation': [u'old el paso\xae', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 6599, u'unit': u'oz'}, {u'originalString': u'Fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'Sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'Pickled jalape\xf1o chiles', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11979, u'unit': u'servings'}, {u'originalString': u'1 lb lean (at least 80%) ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'80%', u'lean', u'(at least )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups shredded Cheddar cheese (6 oz)', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'oz'}, {u'originalString': u'Sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'8 cups tortilla chips', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 19056, u'unit': u'cups'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'https://www.bettycrocker.com/recipes/beefy-enchilada-nachos/762db8df-adba-482b-98de-474d7ab9e3bb', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In 12-inch skillet, cook ground beef over medium-high heat 5 to 7 minutes, stirring occasionally, until thoroughly cooked.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drain, if needed. Season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Stir in enchilada sauce, green chiles and black beans.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}]}, {u'equipment': [], u'step': u'Add 1 1/2 cups Cheddar cheese; cook until cheese is melted.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'To serve, place about 1 cup tortilla chips on each serving plate. Divide beef mixture evenly over chips. Top nachos with desired toppings.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Mionetto Cuvee Sergio Prosecco. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'A cuvee that successfully introduces emotions and the special unmistakable flavor of wine skillfully produced to enhance the characteristics of the native grape varieties of a unique area, at the foot of the Pre-alps of Veneto, where Mionetto has been based since 1887. These flavors and aromas have disappeared over the years but now Mionetto are reintroducing them in this excellent cuv\xe9e.A delicate pale yellow color, with a characteristic aroma that blends with hints of honey and crab apples. It is dry and pleasantly slightly bitter on the palate. Lean due to the right level of acidity, it is moderately full-bodied with a fine and intense perlage.A balanced, smooth and refreshing sparkling wine that is ideal for any occasion, thanks to its moderate alcohol content and versatility. It is best served with simple light fish or vegetable dishes. It is an excellent aperitif accompanied by savory tarts or more delicate finger food such as shrimp vol-au-vent.', u'title': u'Mionetto Cuvee Sergio Prosecco', u'price': u'$17.99', u'id': 454770, u'link': u'https://www.wine.com/product/mionetto-cuvee-sergio-prosecco/58520', u'imageUrl': u'https://spoonacular.com/productImages/454770-312x231.jpg'}]}, u'aggregateLikes': 56, u'instructions': u'1                               In 12-inch skillet, cook ground beef over medium-high heat 5 to 7 minutes, stirring occasionally, until thoroughly cooked. Drain, if needed. Season with salt and pepper.                                                          2                               Stir in enchilada sauce, green chiles and black beans. Add 1 1/2 cups Cheddar cheese; cook until cheese is melted.                                                          3                               To serve, place about 1 cup tortilla chips on each serving plate. Divide beef mixture evenly over chips. Top nachos with desired toppings. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/beefy-enchilada-nachos-179716', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}