{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/412515-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 412515, u'veryPopular': False, u'lowFodmap': False, u'title': u'Holiday Pasta Toss', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 68.64, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 package (10 ounces) frozen chopped spinach, thawed and drained', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'thawed', u'drained', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11463, u'unit': u'ounces'}, {u'originalString': u'1/4 to 1/3 cup Italian salad dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian salad dressing', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'1 teaspoon poppy seeds, optional', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'teaspoon'}, {u'originalString': u'2 cups uncooked spiral pasta', u'aisle': u'Pasta and Rice', u'name': u'spiral pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11320420, u'unit': u'cups'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/holiday-pasta-toss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large saucepan, cook the pasta according to package directions; drain. In the same pan, heat dressing and spinach over medium heat. Return pasta to pan and toss to coat. Sprinkle with poppy seeds if desired.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 29, u'instructions': u'Directions                                                                                In a large saucepan, cook the pasta according to package directions; drain. In the same pan, heat dressing and spinach over medium heat. Return pasta to pan and toss to coat. Sprinkle with poppy seeds if desired.                                        Yield: 4 servings.                                                                                                                         Originally published as Holiday Pasta Toss in  Taste of Home Meals in Minutes CalendarAnnual 1997, p11                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (3/4 cup) equals 227 calories, 6 g fat (1 g saturated fat), 0 cholesterol, 308 mg sodium, 35 g carbohydrate, 3 g fiber, 7 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/holiday-pasta-toss-412515', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}