{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/206650-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206650, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Shrimp and Grits with Arugula', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 428.22, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'\xbd pound arugula, hard stems removed, leaves chopped', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [u'hard', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11959, u'unit': u'pound'}, {u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 garlic clove, chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 cup grits, regular or quick (not instant)', u'aisle': u'Cereal;Baking', u'name': u'grits', u'metaInformation': [u'quick', u'(not instant)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8160, u'unit': u'cup'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 cup freshly grated Parmigiano-Reggiano cheese', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound shrimp, peeled', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'2 tablespoons unsalted butter, cut into \xbd-inch cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into \xbd-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/06/shrimp-and-grits-with-arugula-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour milk and water into a large non-stick saucepan. Bring to a simmer over medium heat, and add the grits and garlic. Reduce heat to medium-low, and simmer, whisking occasionally, until mixture is soft and creamy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 8160, u'name': u'grits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add a little bit of the heavy cream to keep it loose, but not runny. I only ended up using half of the recommended amount.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add the butter, half of the cheese, and the shrimp. Cook, stirring often, until the shrimp are pink, one to two minutes. Fold in the chopped arugula, and turn off the heat. Cover the saucepan and let sit for one minute.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Season with the salt, and add black pepper to taste. Stir again, and divide mixture among four large bowls.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with the remaining cheese.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 82, u'instructions': u'Procedures                                                                              1                                                                            Pour milk and water into a large non-stick saucepan. Bring to a simmer over medium heat, and add the grits and garlic. Reduce heat to medium-low, and simmer, whisking occasionally, until mixture is soft and creamy. Add a little bit of the heavy cream to keep it loose, but not runny. I only ended up using half of the recommended amount.                                                                                                                             2                                                                            Add the butter, half of the cheese, and the shrimp. Cook, stirring often, until the shrimp are pink, one to two minutes. Fold in the chopped arugula, and turn off the heat. Cover the saucepan and let sit for one minute.                                                                                                                            3                                                                            Season with the salt, and add black pepper to taste. Stir again, and divide mixture among four large bowls. Serve with the remaining cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-shrimp-and-grits-with-arugula-206650', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}