{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/743080-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 275, u'id': 743080, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grasshopper Pie', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 138.41, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'9 chocolate wafer cookies', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafer cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 10118157, u'unit': u''}, {u'originalString': u'24 chocolate wafer cookies', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafer cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 10118157, u'unit': u''}, {u'originalString': u"2 tablespoons confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon creme de menthe', u'aisle': u'Alcoholic Beverages', u'name': u'creme de menthe', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14034, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon plus 1/2 teaspoons creme de menthe', u'aisle': u'Alcoholic Beverages', u'name': u'creme de menthe', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14034, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons creme de menthe', u'aisle': u'Alcoholic Beverages', u'name': u'creme de menthe', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 14034, u'unit': u'tablespoons'}, {u'originalString': u'Fresh mint leaves, for garnish', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'leaves'}, {u'originalString': u'2 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'6 cups mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon pure peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022050, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'4 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/grasshopper-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Special equipment: a pastry bag fitted with a large star tip', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the crust: Preheat the oven to 350 degrees F. Process the cookies and granulated sugar in a food processor until finely ground.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}]}, {u'equipment': [], u'step': u'Add the melted butter and creme de menthe, and pulse until moist. Press the crumbs into a 9-inch pie plate, and bake until firm, 12 to 15 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 14034, u'name': u'creme de menthe'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Let the crust cool completely on a wire rack.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the filling: Microwave the marshmallows and butter in a microwave-proof bowl on high until the butter is melted and the marshmallows have broken down, about 1 minute 30 seconds. Stir with a wooden spoon to combine, and let cool for 5 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Beat the creme de menthe and heavy cream in a large bowl with an electric mixer on medium-high speed until fluffy peaks form, about 1 minute. Stop the mixer, add 1/3 of the cooled marshmallow mixture and beat on medium-high until combined, about 15 seconds; repeat with the remaining marshmallow mixture in 2 batches. (The whipped cream won't hold its peaks, and the cream-marshmallow mixture will appear quite loose, but it firms quickly as it cools in the pie crust.)", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 14034, u'name': u'creme de menthe'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Pour the filling into the prepared pie crust. Cover the pie with plastic, and refrigerate until firm, about 4 hours or overnight.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"For the chocolate mint whipped cream: Beat the confectioners' sugar, cocoa powder and peppermint extract in a large bowl with an electric mixer on medium high speed until combined.", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1022050, u'name': u'peppermint extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'chocolate mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [], u'step': u'Add the heavy cream, and beat on medium-high until fluffy peaks form.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'To assemble: Arrange the wafer cookies on top of the pie. Top each cookie with 1/2 teaspoon creme de menthe (it will soak in almost immediately).', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 14034, u'name': u'creme de menthe'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Transfer the whipped cream to a pastry bag fitted with a large star tip, and pipe it onto the soaked cookies.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with mint leaves. The pie can be refrigerated, loosely covered, up to overnight or served immediately.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Serve with any extra leftover whipped cream on the side.', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 77, u'instructions': u"Special equipment: a pastry bag fitted with a large star tip              For the crust: Preheat the oven to 350 degrees F. Process the cookies and granulated sugar in a food processor until finely ground. Add the melted butter and creme de menthe, and pulse until moist. Press the crumbs into a 9-inch pie plate, and bake until firm, 12 to 15 minutes. Let the crust cool completely on a wire rack.                          For the filling: Microwave the marshmallows and butter in a microwave-proof bowl on high until the butter is melted and the marshmallows have broken down, about 1 minute 30 seconds. Stir with a wooden spoon to combine, and let cool for 5 minutes.                          Beat the creme de menthe and heavy cream in a large bowl with an electric mixer on medium-high speed until fluffy peaks form, about 1 minute. Stop the mixer, add 1/3 of the cooled marshmallow mixture and beat on medium-high until combined, about 15 seconds; repeat with the remaining marshmallow mixture in 2 batches. (The whipped cream won't hold its peaks, and the cream-marshmallow mixture will appear quite loose, but it firms quickly as it cools in the pie crust.) Pour the filling into the prepared pie crust. Cover the pie with plastic, and refrigerate until firm, about 4 hours or overnight.                          For the chocolate mint whipped cream: Beat the confectioners' sugar, cocoa powder and peppermint extract in a large bowl with an electric mixer on medium high speed until combined. Add the heavy cream, and beat on medium-high until fluffy peaks form.                          To assemble: Arrange the wafer cookies on top of the pie. Top each cookie with 1/2 teaspoon creme de menthe (it will soak in almost immediately). Transfer the whipped cream to a pastry bag fitted with a large star tip, and pipe it onto the soaked cookies. Garnish with mint leaves. The pie can be refrigerated, loosely covered, up to overnight or served immediately. Serve with any extra leftover whipped cream on the side.", u'spoonacularSourceUrl': u'https://spoonacular.com/grasshopper-pie-743080', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 305, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}