{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551943-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 551943, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easter Cookies "S\'mores Cookies', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 148.12, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u'1 1/4 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 Tb. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'Tb'}, {u'originalString': u'24 lollipop sticks', u'aisle': u'Cheese', u'name': u'cheese sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/string-cheese.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 98970, u'unit': u''}, {u'originalString': u'1/4 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'2 Tb. honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tb'}, {u'originalString': u'24 marshmallow Peeps (+ colored sugar to match Peeps *optional)', u'aisle': u'Sweet Snacks', u'name': u'marshmallow peeps', u'metaInformation': [u'(+ colored sugar to match Peeps *optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peeps-bunnies.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 98850, u'unit': u''}, {u'originalString': u'2 Tb. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tb'}, {u'originalString': u'1/2 tsp. molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19304, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'12 oz. semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u'Easter sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1/2 stick unsalted butter, softened (1/4 cup)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 Tb. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'Tb'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.aspicyperspective.com/2013/03/easter-cookies-smores.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Using an electric mixer, cream the brown sugar and butter together until fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Add the remaining cookie ingredients and beat until well combined. Wrap the dough in plastic and refrigerate for at least one hour.\xa0Preheat the oven to 350 degree F and line several cookie sheets with parchment paper. On a floured work surface, roll out the dough until it's 1/8 inch thick. Use a round 2 1/2 - 3 inch cookie cutter to cut out the cookies.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place them on the prepared cookie sheets, 1 1/2 inches apart.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 13-16 minutes until golden around the edges, yet soft in the center.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Remove from the oven and cool completely on the cookie sheets.Melt the butter and chocolate together. Either do this over a double-boiler on low heat, or place in a microwave-safe bowl and nuke in 30 second increments, stirring in between, until it's just barely melted. Continue to stir until all the chunks melt away.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Cut the Peeps apart. If you have it, dip the exposed portion of the peeps in colored decorating sugar.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peeps.png', u'id': 98850, u'name': u'marshmallow peeps'}]}, {u'equipment': [], u'step': u'Spread the melted chocolate on top of each cookie.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Place a lollipop stick on each cookie and turn in the chocolate to coat the tip. Gently press a Peep over the top of the stick. Sprinkle the chocolate with Easter sprinkles. Set aside until the chocolate hardens. (If you're in a hurry, place the cookie sheets in the fridge for 5 minutes to harden the chocolate.)", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2964, u'instructions': u"Using an electric mixer, cream the brown sugar and butter together until fluffy. Add the remaining cookie ingredients and beat until well combined. Wrap the dough in plastic and refrigerate for at least one hour.\xa0Preheat the oven to 350 degree F and line several cookie sheets with parchment paper. On a floured work surface, roll out the dough until it's 1/8 inch thick. Use a round 2 1/2 - 3 inch cookie cutter to cut out the cookies. Place them on the prepared cookie sheets, 1 1/2 inches apart.Bake for 13-16 minutes until golden around the edges, yet soft in the center. Remove from the oven and cool completely on the cookie sheets.Melt the butter and chocolate together. Either do this over a double-boiler on low heat, or place in a microwave-safe bowl and nuke in 30 second increments, stirring in between, until it's just barely melted. Continue to stir until all the chunks melt away.Cut the Peeps apart. If you have it, dip the exposed portion of the peeps in colored decorating sugar.Spread the melted chocolate on top of each cookie. Place a lollipop stick on each cookie and turn in the chocolate to coat the tip. Gently press a Peep over the top of the stick. Sprinkle the chocolate with Easter sprinkles. Set aside until the chocolate hardens. (If you're in a hurry, place the cookie sheets in the fridge for 5 minutes to harden the chocolate.)", u'spoonacularSourceUrl': u'https://spoonacular.com/easter-cookies-smores-cookies-551943', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}