{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/809640-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 809640, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Salad with Pickles', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 103.19, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'1 pound boiled chicken, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'boiled', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'pound'}, {u'originalString': u'\xbd cup dill pickles, chopped', u'aisle': u'Canned and Jarred', u'name': u'dill pickles', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011937, u'unit': u'cup'}, {u'originalString': u'1 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'\xbc red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://addapinch.com/cooking/chicken-salad-pickles-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Stir together chicken, mayonnaise, pickles and onions. Store in an airtight container in the refrigerator or serve immediately.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'id': 11937, u'name': u'pickles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 620, u'instructions': u'Stir together chicken, mayonnaise, pickles and onions. Store in an airtight container in the refrigerator or serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-salad-with-pickles-809640', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}