{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/711353-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 711353, u'veryPopular': False, u'lowFodmap': False, u'title': u'Jalapeno Popper Dip', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 111.15, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2\xbc Cups Cheddar cheese, grated', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 1009, u'unit': u'Cups'}, {u'originalString': u'8 Ounces Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'Ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'Ounces'}, {u'originalString': u'3 Jalapenos', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'\xbd Cup Panko Bread Crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10018079, u'unit': u'Cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.ohsweetbasil.com/jalapeno-popper-dip-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat the oven to 450 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the peppers on a baking sheet and drizzle with olive oil. Toss to coat and then bake for 15 minutes or until the peppers are softened.Dice and seed the pepper and allow to cool slightly.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Mix the peppers, cream cheese and cheese and spread into a skillet.In a small nonstick skillet over medium heat, add the butter until melted and then stir in bread crumbs. Stir occasionally or until golden brown.Turn the oven to 375 and bake for 10 to 15 minutes or until bubbly.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Juve Y Camps Brut Nature Reserva de la Familia Cava with a 4.3 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats. View More', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 64, u'instructions': u'Heat the oven to 450 degrees. Place the peppers on a baking sheet and drizzle with olive oil. Toss to coat and then bake for 15 minutes or until the peppers are softened.Dice and seed the pepper and allow to cool slightly.Mix the peppers, cream cheese and cheese and spread into a skillet.In a small nonstick skillet over medium heat, add the butter until melted and then stir in bread crumbs. Stir occasionally or until golden brown.Turn the oven to 375 and bake for 10 to 15 minutes or until bubbly.', u'spoonacularSourceUrl': u'https://spoonacular.com/jalapeno-popper-dip-711353', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}