{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/474242-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 474242, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken In Garlic Chile Sauce Tacos – Diana Kennedy – 50 Women Game Changers In Food', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 123.6, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'3 pounds chicken parts', u'aisle': u'Meat', u'name': u'chicken parts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 1005006, u'unit': u'pounds'}, {u'originalString': u'4 ancho chilies or dried New Mexico chilies', u'aisle': u'Produce', u'name': u'chilies', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'fresh corn tortillas, for serving', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'fresh', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18363, u'unit': u'servings'}, {u'originalString': u'14 garlic cloves, roughly chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 14.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 jalape\xf1o peppers, seeds removed, chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'seeds removed, chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'fresh jalapeno peppers, for serving (remove seeds unless you like very spicy food), cut into thin slices', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'fresh', u'for serving (remove seeds unless you like very spicy food), cut into thin slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11979, u'unit': u'servings'}, {u'originalString': u'1/4 cup light or regular olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/2012/04/chicken-in-garlic-chile-sauce-tacos.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put chicken pieces in a large pan in one layer. Sprinkle with a little salt and cover with just enough water to all chicken pieces are submerged. Bring to a simmer and continue to cook, turning pieces over once, until almost done, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove chicken pieces to a plate. Strain water that chicken was cooked in and return to pot.Slit New Mexico chilies open and scrape out seeds and veins. Soak in hot water until soft, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Drain, discarding soaking water.Put chilies in a blender with 1 cup of water; blend until smooth. Set aside.Blend garlic with 1/3 cup water and set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a skillet and add jalape\xf1o peppers.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Saute a few seconds until crisp, but not burnt.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add pureed garlic and cook over high heat for 10 seconds until liquid has evaporated.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add New Mexico chili puree and cook, stirring and scraping bottom of pot until slightly reduced, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [], u'step': u'Add strained chicken cooking liquid and heat.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken pieces to pan and cook over medium heat for about 25 minutes, turning pieces from time to time.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}]}, {u'equipment': [], u'step': u'Remove bones and skin from chicken. Shred chicken.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Serve with warm corn tortillas (I warm them over my gas burner) and jalapeno pepper slices.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 356, u'instructions': u'Put chicken pieces in a large pan in one layer. Sprinkle with a little salt and cover with just enough water to all chicken pieces are submerged. Bring to a simmer and continue to cook, turning pieces over once, until almost done, about 20 minutes. Remove chicken pieces to a plate. Strain water that chicken was cooked in and return to pot.Slit New Mexico chilies open and scrape out seeds and veins. Soak in hot water until soft, about 15 minutes. Drain, discarding soaking water.Put chilies in a blender with 1 cup of water; blend until smooth. Set aside.Blend garlic with 1/3 cup water and set aside.Heat oil in a skillet and add jalape\xf1o peppers. Saute a few seconds until crisp, but not burnt. Add pureed garlic and cook over high heat for 10 seconds until liquid has evaporated. Add New Mexico chili puree and cook, stirring and scraping bottom of pot until slightly reduced, about 5 minutes.Add strained chicken cooking liquid and heat. Add chicken pieces to pan and cook over medium heat for about 25 minutes, turning pieces from time to time.Remove bones and skin from chicken. Shred chicken.Serve with warm corn tortillas (I warm them over my gas burner) and jalapeno pepper slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-in-garlic-chile-sauce-tacos-diana-kennedy-50-women-game-changers-in-food-474242', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}