{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/381905-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 780, u'id': 381905, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Cheesecake', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 142.49, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'3 ounces bittersweet chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 stick butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'stick', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'1/2 teaspoon cocoa, dissolved in 1 tablespoon hot water', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [u'dissolved in 1 tablespoon hot water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoon'}, {u'originalString': u'2 1/2 cups cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 1017, u'unit': u'cups'}, {u'originalString': u'1 tablespoon custard powder', u'aisle': u'Baking', u'name': u'custard powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/custard.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19169, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dark corn syrup', u'aisle': u'Baking', u'name': u'dark corn syrup', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19349, u'unit': u'teaspoon'}, {u'originalString': u'3 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/3 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'6 ounces bittersweet or semisweet chocolate, chopped small', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'2/3 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'3/4 cup superfine sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/nigella-lawson/chocolate-cheesecake-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make the base, process the graham crackers to make rough crumbs and then add the butter and cocoa. Process again until it makes damp, clumping crumbs and then tip them into the pan. Press the crumbs into the bottom of the pan to make an even base and put into the freezer while you make the filling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [], u'step': u'Put a kettle on to boil.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Melt the chocolate either in a microwave or double boiler, and set aside to cool slightly.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Beat the cream cheese to soften it, then add the sugar and custard power, beating again to combine. Beat in the whole eggs and then the yolks, and the sour cream. Finally add the cocoa dissolved in hot water and melted chocolate and mix to a smooth batter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Take the springform tin out of the freezer and line the outside of the tin with a good layer of cling wrap, and then another layer of strong foil over that. This will protect it from the water bath.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Sit the springform tin in a roasting pan and pour in the cheesecake filling. Fill the roasting pan with just boiled water to come about half way up the cake tin and bake in the oven for 45 minutes to 1 hour. The top of the cheesecake should be set, but the underneath should still have a wobble to it.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Peel away the foil and cling film wrapping and sit the cheesecake in its tin on a rack to cool. Put in the refrigerator once it is no longer hot, and leave to set, covered with plastic overnight.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Let it lose its chill before unspringing the cheesecake to serve.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'To make the chocolate sauce: very gently melt the chopped chocolate, cream and syrup. When the chocolate has nearly melted, take off the heat and whisk it to a smooth sauce.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Let it cool a little, and pour it over the chocolate cheesecake on its serving plate.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 92, u'instructions': u'Preheat the oven to 350 degrees F.                          To make the base, process the graham crackers to make rough crumbs and then add the butter and cocoa. Process again until it makes damp, clumping crumbs and then tip them into the pan. Press the crumbs into the bottom of the pan to make an even base and put into the freezer while you make the filling.                          Put a kettle on to boil.                          Melt the chocolate either in a microwave or double boiler, and set aside to cool slightly.                          Beat the cream cheese to soften it, then add the sugar and custard power, beating again to combine. Beat in the whole eggs and then the yolks, and the sour cream. Finally add the cocoa dissolved in hot water and melted chocolate and mix to a smooth batter.                          Take the springform tin out of the freezer and line the outside of the tin with a good layer of cling wrap, and then another layer of strong foil over that. This will protect it from the water bath.                          Sit the springform tin in a roasting pan and pour in the cheesecake filling. Fill the roasting pan with just boiled water to come about half way up the cake tin and bake in the oven for 45 minutes to 1 hour. The top of the cheesecake should be set, but the underneath should still have a wobble to it.                          Peel away the foil and cling film wrapping and sit the cheesecake in its tin on a rack to cool. Put in the refrigerator once it is no longer hot, and leave to set, covered with plastic overnight. Let it lose its chill before unspringing the cheesecake to serve.                          To make the chocolate sauce: very gently melt the chopped chocolate, cream and syrup. When the chocolate has nearly melted, take off the heat and whisk it to a smooth sauce. Let it cool a little, and pour it over the chocolate cheesecake on its serving plate.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-cheesecake-381905', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 805, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}