{u'recipes': [{u'sourceName': u'The Lemon Bowl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626238-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 626238, u'veryPopular': False, u'lowFodmap': False, u'title': u'M’Juddarah – Lentils and Rice with Caramelized Onions', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 37.52, u'creditText': u'The Lemon Bowl', u'extendedIngredients': [{u'originalString': u'1 cup lentils - rinsed and sorted', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16069, u'unit': u'cup'}, {u'originalString': u'2 tablespoons oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 large onion - thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup rice - white par-boiled', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20444, u'unit': u'cup'}, {u'originalString': u'1\xbd teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://thelemonbowl.com/2015/01/mjuddarah-lentils-and-rice-with-caramelized-onions.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil in a deep sauce pot over medium heat and saut onions until translucent and caramelized, 20-25 minutes, stirring frequently. Sprinkle with salt and pepper to taste.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove from pan and set aside.In the same pan, add lentils and increase heat to medium-high. Toast lentils for 60 seconds then add 6 cups water. Bring pot to a boil then reduce heat to low and simmer until lentils are halfway cooked, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add rice, salt and pepper to the pot and bring mixture to a boil. Stir once, cover with lid, then reduce heat to low. Cook until all liquid is absorbed, about 15 minutes.Fluff lentils and rice with a fork before serving with caramelized onions.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10211282, u'name': u'caramelized onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Serve with plain yogurt or Lebanese Cucumber Laban if you wish.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 30, u'instructions': u'Heat oil in a deep sauce pot over medium heat and saut onions until translucent and caramelized, 20-25 minutes, stirring frequently. Sprinkle with salt and pepper to taste. Remove from pan and set aside.In the same pan, add lentils and increase heat to medium-high. Toast lentils for 60 seconds then add 6 cups water. Bring pot to a boil then reduce heat to low and simmer until lentils are halfway cooked, about 15 minutes.Add rice, salt and pepper to the pot and bring mixture to a boil. Stir once, cover with lid, then reduce heat to low. Cook until all liquid is absorbed, about 15 minutes.Fluff lentils and rice with a fork before serving with caramelized onions. Serve with plain yogurt or Lebanese Cucumber Laban if you wish.', u'spoonacularSourceUrl': u'https://spoonacular.com/mjuddarah-lentils-and-rice-with-caramelized-onions-626238', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}