{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/830309-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 830309, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Pot Pie', u'diets': [], u'pricePerServing': 113.61, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'1/3 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 strips bacon, diced', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 2.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'1 small carrot, diced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stalk celery, diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup frozen corn, thawed', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'1 cup chopped cooked green beans (see note)', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'cooked', u'chopped', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11052, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground pepper, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground sage', u'aisle': u'Spices and Seasonings', u'name': u'ground sage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002038, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Kosher salt, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup nonfat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup frozen peas, thawed', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1 package (2 crusts) refrigerated pie crusts (or two from scratch pie crusts), thawed according to package directions', u'aisle': u'Refrigerated', u'name': u'refrigerated pie crusts', u'metaInformation': [u'refrigerated', u'thawed', u'(2 crusts)', u'(or two from scratch pie crusts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u'package'}, {u'originalString': u'2 cups shredded cooked turkey', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 5165, u'unit': u'cups'}, {u'originalString': u'1/3 cup chicken or turkey stock', u'aisle': u'Canned and Jarred', u'name': u'turkey stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1006172, u'unit': u'cup'}, {u'originalString': u'1/2 cup (about 1 small) diced yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.crazyforcrust.com/2016/11/leftover-turkey-pot-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 375F.Preheat sauce pan over medium heat. Cook bacon until browned, then remove from pan to a plate, leaving the bacon grease in the pan. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add olive oil to the pan, then add onion, celery, and carrot. Stir to coat with oil and cook, stirring occasionally, until tender, about 3-5 minutes. Sprinkle with thyme, sage, salt, pepper, and flour and stir to coat. Cook for 1 minute.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add stock and milk, and cook and stir until thickened, just a a few minutes.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat and stir in vegetables, bacon, and turkey.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Place one crust in the bottom and up the sides of a 9 pie plate. Spoon hot filling into crust.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place second crust over the top, press the edges together, and crimp as desired.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut slits in the top of the pie for air to escape.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place pie on a cookie sheet in case of spillage, and bake for 40-55 minutes, or until golden brown.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm. Store leftovers in an airtight container for up to 3 days or freeze for up to one month. Entire pie may be mad and frozen ahead of time, either before or after baking.', u'number': 9, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 264, u'instructions': u'Preheat oven to 375F.Preheat sauce pan over medium heat. Cook bacon until browned, then remove from pan to a plate, leaving the bacon grease in the pan. Set aside.Add olive oil to the pan, then add onion, celery, and carrot. Stir to coat with oil and cook, stirring occasionally, until tender, about 3-5 minutes. Sprinkle with thyme, sage, salt, pepper, and flour and stir to coat. Cook for 1 minute. Add stock and milk, and cook and stir until thickened, just a a few minutes.Remove pan from heat and stir in vegetables, bacon, and turkey.Place one crust in the bottom and up the sides of a 9 pie plate. Spoon hot filling into crust. Place second crust over the top, press the edges together, and crimp as desired. Cut slits in the top of the pie for air to escape.Place pie on a cookie sheet in case of spillage, and bake for 40-55 minutes, or until golden brown. Serve warm. Store leftovers in an airtight container for up to 3 days or freeze for up to one month. Entire pie may be mad and frozen ahead of time, either before or after baking.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-pot-pie-830309', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}