{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/525664-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 525664, u'veryPopular': True, u'lowFodmap': False, u'title': u'Blue Cheese Mac and Cheese', u'diets': [], u'pricePerServing': 192.01, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces fontina cheese, freshly grated', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1020, u'unit': u'ounces'}, {u'originalString': u'chopped fresh herbs for topping', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'chopped', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'servings'}, {u'originalString': u'8 ounces gorgonzola cheese, crumbled', u'aisle': u'Cheese', u'name': u'gorgonzola cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1011004, u'unit': u'ounces'}, {u'originalString': u'2 1/2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/3 cup panko bread crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'salt + pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/4 cup seasoned fine bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 pound whole wheat mini elbow noodles', u'aisle': u'Pasta and Rice', u'name': u'whole wheat elbow noodles', u'metaInformation': [u'whole wheat', u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10220124, u'unit': u'pound'}, {u'originalString': u'8 ounces buttermilk blue cheese, crumbled', u'aisle': u'?', u'name': u'buttermilk cheese', u'metaInformation': [u'blue', u'crumbled'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'unit': u'ounces'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.howsweeteats.com/2013/03/blue-cheese-mac-and-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F. Spray a baking dish with nonstick spray.Bring water to a boil and prepare pasta according to directions, shaving 1-2 minutes off of the cooking time.While pasta is boiling, heat butter in a medium saucepan over medium heat. Once sizzling, add flour and whisk constantly to create a roux, until golden and bubbly, about 2 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour in milk and whisk constantly, stirring until the mixture slightly thickens. Reduce heat to low and add in 6 ounces of the fontina, all of the gorgonzola and about 6 ounces of the other blue. Stir until cheese melts and sauce is thick. Taste and season with a bit of salt and pepper if desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'id': 1011004, u'name': u'gorgonzola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add noodles to the baking dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour cheese sauce over top, tossing to coat all the noodles. Sprinkle remaining fontina and blue over top evenly, then cover in breadcrumbs.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [], u'step': u'Bake for 30-35 minutes, or until top is golden and crunchy.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 4317, u'instructions': u'Preheat oven to 400 degrees F. Spray a baking dish with nonstick spray.Bring water to a boil and prepare pasta according to directions, shaving 1-2 minutes off of the cooking time.While pasta is boiling, heat butter in a medium saucepan over medium heat. Once sizzling, add flour and whisk constantly to create a roux, until golden and bubbly, about 2 minutes. Pour in milk and whisk constantly, stirring until the mixture slightly thickens. Reduce heat to low and add in 6 ounces of the fontina, all of the gorgonzola and about 6 ounces of the other blue. Stir until cheese melts and sauce is thick. Taste and season with a bit of salt and pepper if desired.Add noodles to the baking dish. Pour cheese sauce over top, tossing to coat all the noodles. Sprinkle remaining fontina and blue over top evenly, then cover in breadcrumbs. Bake for 30-35 minutes, or until top is golden and crunchy.', u'spoonacularSourceUrl': u'https://spoonacular.com/blue-cheese-mac-and-cheese-525664', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}