{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/424846-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 424846, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brown Bear Cake', u'diets': [], u'preparationMinutes': 90, u'pricePerServing': 141.84, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/3 cup baking cocoa', u'aisle': u'Baking', u'name': u'baking cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 tablespoon butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2 packages chocolate cake mix (regular size)', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [u'(regular size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'packages', u'unitShort': u'packages', u'amount': 2.0, u'consistency': u'solid', u'id': 99040, u'unit': u'packages'}, {u'originalString': u'2 dark chocolate kisses', u'aisle': u'Sweet Snacks', u'name': u'chocolate kisses', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hersheys-kisses-or-chocolate-kisses.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93743, u'unit': u''}, {u'originalString': u"16 brown milk chocolate M&M's", u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 19081, u'unit': u''}, {u'originalString': u'3 cups flaked coconut, divided', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'divided', u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cups'}, {u'originalString': u"4 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'4 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'Brown gel food coloring', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'5 pieces red shoestring licorice', u'aisle': u'Sweet Snacks', u'name': u'black licorice', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-licorice-candy.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 98851, u'unit': u'pieces'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'5 chocolate-covered peppermint patties', u'aisle': u'Sweet Snacks', u'name': u'peppermint patties', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peppermint-patty.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 19091, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/brown-bear-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare cake mixes according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour 3 cups batter into a greased and floured 2-qt. round baking dish.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour 1-1/2 cups batter into a greased and floured 1-qt. ovenproof bowl. Using remaining batter, fill six greased jumbo muffin cups and four greased regular muffin cups two-thirds full.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake cupcakes for 18-20 minutes and cakes for 40-45 minutes at 350\xb0 or until a toothpick inserted near the center comes out clean. Cool cupcakes for 5 minutes and cakes for 10 minutes before removing from pans to wire racks to cool completely.', u'length': {u'number': 80, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Level the top of the cakes, four jumbo cupcakes and two regular cupcakes. (Save the remaining cupcakes for another use.)', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Place large cake top side down on an 18-in. x 12-in. covered board. For teddy bear's head, place the small cake top side down above large cake. Position jumbo cupcake cut side up for arms and legs.", u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place regular cupcakes on top of head for ears.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat the cream cheese and butter until smooth.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u"Add the confectioners' sugar, cocoa and milk; beat until smooth. Frost tops and sides of cakes and cupcakes. Tint 2-1/4 cups coconut dark brown; tint remaining coconut light brown.", u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u"Sprinkle dark brown coconut over arms and legs. Leaving a 4-in. circle in center of bear's body, sprinkle dark brown coconut in a 1-in. circle around edge of cake. Sprinkle dark brown coconut in a 1/2-in. circle around edges of the head and ears. Press dark brown coconut into the sides of the body, head and ears. Sprinkle light brown coconut over the middle of the body, head and ears.", u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Position one peppermint patty on face for nose.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peppermint-patty.png', u'id': 19091, u'name': u'peppermint patties'}]}, {u'equipment': [], u'step': u"Place one peppermint patty and four M&M's on each paw. Insert chocolate kisses point side down for eyes.", u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hersheys-kisses-or-chocolate-kisses.jpg', u'id': 93743, u'name': u'hersheys kisses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peppermint-patty.png', u'id': 19091, u'name': u'peppermint patties'}]}, {u'equipment': [], u'step': u'Cut one licorice piece into two 2-in. strips; shape to form a mouth.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Cut two licorice pieces into a 7-in. strip; place around the neck. Shape the remaining licorice into a bow; place below neck. Store in the refrigerator.', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u"Directions                                                                                Prepare cake mixes according to package directions. Pour 3 cups batter into a greased and floured 2-qt. round baking dish. Pour 1-1/2 cups batter into a greased and floured 1-qt. ovenproof bowl. Using remaining batter, fill six greased jumbo muffin cups and four greased regular muffin cups two-thirds full.                                                                                           Bake cupcakes for 18-20 minutes and cakes for 40-45 minutes at 350\xb0 or until a toothpick inserted near the center comes out clean. Cool cupcakes for 5 minutes and cakes for 10 minutes before removing from pans to wire racks to cool completely.                                                                                           Level the top of the cakes, four jumbo cupcakes and two regular cupcakes. (Save the remaining cupcakes for another use.) Place large cake top side down on an 18-in. x 12-in. covered board. For teddy bear's head, place the small cake top side down above large cake. Position jumbo cupcake cut side up for arms and legs. Place regular cupcakes on top of head for ears.                                                                                           In a large bowl, beat the cream cheese and butter until smooth. Add the confectioners' sugar, cocoa and milk; beat until smooth. Frost tops and sides of cakes and cupcakes. Tint 2-1/4 cups coconut dark brown; tint remaining coconut light brown.                                                                                           Sprinkle dark brown coconut over arms and legs. Leaving a 4-in. circle in center of bear's body, sprinkle dark brown coconut in a 1-in. circle around edge of cake. Sprinkle dark brown coconut in a 1/2-in. circle around edges of the head and ears. Press dark brown coconut into the sides of the body, head and ears. Sprinkle light brown coconut over the middle of the body, head and ears.                                                                                           Position one peppermint patty on face for nose. Place one peppermint patty and four M&M's on each paw. Insert chocolate kisses point side down for eyes. Cut one licorice piece into two 2-in. strips; shape to form a mouth. Cut two licorice pieces into a 7-in. strip; place around the neck. Shape the remaining licorice into a bow; place below neck. Store in the refrigerator.                                        Yield: 18-20 servings.                                                                                                                         Originally published as Brown Bear Cake in  Taste of Home's Holiday & Celebrations CookbookAnnual 2004, p196                                                                                                                           Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/brown-bear-cake-424846', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}