{u'recipes': [{u'sourceName': u"So How's it Taste", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/495891-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 495891, u'veryPopular': True, u'lowFodmap': False, u'title': u'No-Bake Strawberry Icebox Cake', u'diets': [], u'pricePerServing': 173.99, u'creditText': u"So How's it Taste", u'extendedIngredients': [{u'originalString': u'2 (8 oz.) tubs fat-free whipped topping (or use regular or light)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free whipped topping', u'metaInformation': [u'light', u'fat-free', u'(or use regular or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'1 (14.4 oz.) box graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.4, u'consistency': u'solid', u'id': 18617, u'unit': u'oz'}, {u'originalString': u'1/4 cup milk chocolate chip morsels', u'aisle': u'Baking', u'name': u'milk chocolate morsels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'3 lbs. fresh strawberries, sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 9316, u'unit': u'lbs'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.sohowsittaste.com/2012/05/no-bake-strawberry-icebox-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread a small amount of whipped topping on the bottom of a 9x13-inch baking pan.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"Place 5 graham cracker sheets down the middle and break 2 more sheets into crackers to fit down the sides. Lightly cover the top of the graham crackers with more whipped topping and then a layer of sliced strawberries. Repeat three times, until you have four layers of graham crackers (you may be a few crackers short on the top layer, but that's ok). You'll end with a layer of strawberries on top.2.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Place milk chocolate chip morsels in a plastic bag. Microwave in 10 second intervals until melted. Snip the end of the plastic bag and drizzle chocolate over top of cake.3. Refrigerate covered for at least four hours, or until the crackers have softened completely. Cake will last well for two days. It will still be good on the third day, but the strawberries will start to get juicy and leak into the whipped topping. It will still taste good, but it won't be as pretty.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 611897, u'instructions': u"1. Spread a small amount of whipped topping on the bottom of a 9x13-inch baking pan. Place 5 graham cracker sheets down the middle and break 2 more sheets into crackers to fit down the sides. Lightly cover the top of the graham crackers with more whipped topping and then a layer of sliced strawberries. Repeat three times, until you have four layers of graham crackers (you may be a few crackers short on the top layer, but that's ok). You'll end with a layer of strawberries on top.2. Place milk chocolate chip morsels in a plastic bag. Microwave in 10 second intervals until melted. Snip the end of the plastic bag and drizzle chocolate over top of cake.3. Refrigerate covered for at least four hours, or until the crackers have softened completely. Cake will last well for two days. It will still be good on the third day, but the strawberries will start to get juicy and leak into the whipped topping. It will still taste good, but it won't be as pretty.", u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-strawberry-icebox-cake-495891', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}