{u'recipes': [{u'sourceName': u'Well Plated', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/716891-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 716891, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spinach Artichoke Mac and Cheese', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 330.59, u'creditText': u'Well Plated', u'extendedIngredients': [{u'originalString': u'2 cans artichoke quarters, drained', u'aisle': u'Canned and Jarred', u'name': u'artichoke heart quarters', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 93828, u'unit': u'cans'}, {u'originalString': u'1/4 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup freshly grated Fontina, Gouda, mozzarella, or other similar, melty cheese', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1020, u'unit': u'cup'}, {u'originalString': u'2 cloves minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 1/2 cups non-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non-fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}, {u'originalString': u'1/3 cup freshly grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 ounces whole wheat pasta noodles, such as shells, penne, rigatoni, or elbow', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'whole wheat', u' such as shells, penne, rigatoni, or elbow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'ounces'}, {u'originalString': u'1/3 cup plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'8 ounces fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93824, u'unit': u'cup'}, {u'originalString': u'1/2 cup diced yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.wellplated.com/spinach-artichoke-mac-and-cheese/?utm_campaign=shareaholic', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Find the full recipe on the Kitchen', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Aid blog, where I am sharing it. Thanks!', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese can be paired with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. The Mulderbosch Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 378, u'instructions': u'Find the full recipe on the KitchenAid blog, where I am sharing it. Thanks!', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-artichoke-mac-and-cheese-716891', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}