{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552245-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 552245, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peppermint Fudge', u'diets': [u'gluten free'], u'preparationMinutes': 3, u'pricePerServing': 10.41, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u'1 Tb. butter + extra for buttering the dish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for buttering the dish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tb'}, {u'originalString': u'1 lb. dark chocolate chips/chunks', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'lb'}, {u'originalString': u'1/4 tsp. peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022050, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 cup Andes Peppermint Chunks', u'aisle': u'Health Foods', u'name': u'soy chunks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tvp.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98854, u'unit': u'cup'}, {u'originalString': u'1 - 14 oz. can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.aspicyperspective.com/2011/11/peppermint-fudge.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Grease a 8 X 8 or 8 X 11 baking dish. Sprinkle half the peppermint chunks in the bottom of the dish and set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a medium sauce pot over medium heat with 2 inches of water.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place a glass bowl over the top--making sure the glass doesn't touch the water.", u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the condensed milk and butter in the bowl and heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chocolate chips and salt in the bowl. Stir the chocolate and watch as it melts and thickens--about 5 minutes. The mixture should thicken to a THICK cake batter consistency--almost too thick to pour.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add both extracts and mix well.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour the mixture into the dish. Gently tap the dish on the counter for at least a minute to allow air bubbles to rise to the surface and to smooth the surface.Sprinkle the remaining peppermint chips over the top and refrigerate for at least 3 hours, maybe longer, to set.To cut, dip a sharp knife in hot tap water, wipe and cut quickly. Dip and wipe the knife between cuts.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into 1 inch squares.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7135, u'instructions': u"Grease a 8 X 8 or 8 X 11 baking dish. Sprinkle half the peppermint chunks in the bottom of the dish and set aside.Place a medium sauce pot over medium heat with 2 inches of water. Place a glass bowl over the top--making sure the glass doesn't touch the water.Pour the condensed milk and butter in the bowl and heat.Add the chocolate chips and salt in the bowl. Stir the chocolate and watch as it melts and thickens--about 5 minutes. The mixture should thicken to a THICK cake batter consistency--almost too thick to pour. Add both extracts and mix well. Pour the mixture into the dish. Gently tap the dish on the counter for at least a minute to allow air bubbles to rise to the surface and to smooth the surface.Sprinkle the remaining peppermint chips over the top and refrigerate for at least 3 hours, maybe longer, to set.To cut, dip a sharp knife in hot tap water, wipe and cut quickly. Dip and wipe the knife between cuts. Cut into 1 inch squares.", u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-fudge-552245', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 64, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}