{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/749767-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 749767, u'veryPopular': False, u'lowFodmap': False, u'title': u'Linguini Puttanesca', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 209.49, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Anchovy fillets, medium chop', u'aisle': u'Seafood', u'name': u'anchovy fillets', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 15001, u'unit': u'servings'}, {u'originalString': u'1/2 cup large capers, rinsed of brine', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'large', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2054, u'unit': u'cup'}, {u'originalString': u'1/4 cup fresh clam juice', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'clam juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clam-juice.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 14187, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'1 cup pitted gaeta or kalamata olives', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds linguini', u'aisle': u'Pasta and Rice', u'name': u'linguini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10720420, u'unit': u'pounds'}, {u'originalString': u'2 cups marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'cups'}, {u'originalString': u'4 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'Chopped parsley leaves, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaves'}, {u'originalString': u'2 cups plum tomato, medium diced', u'aisle': u'Produce', u'name': u'plum tomato', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u'cups'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon minced shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u'teaspoon'}], u'healthScore': 24.0, u'imageType': u'jpeg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/linguini-puttanesca-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a saute pan over medium heat, add olive oil, shallots, garlic, oregano, basil and anchovy fillets. Sweat about 30 seconds, until anchovies begin to break down.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovy fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add capers and olives and saute 1 minute. Deglaze with white wine, add clam juice, let reduce by 1/3.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clam-juice.png', u'id': 14187, u'name': u'clam juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Add plum tomatoes and thoroughly incorporate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'id': 10411529, u'name': u'plum tomato'}]}, {u'equipment': [], u'step': u'Add marinara sauce. Season, to taste.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10111549, u'name': u'marinara sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In separate pot, bring 1 1/2 gallons of water to boil. Season water generously with salt. When water is at a rapid boil, add linguini, stir so there is no clumping. Cook until al dente, about 4 to 5 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 10720420, u'name': u'linguine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cooked pasta to puttanesca sauce and toss.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with freshly chopped parsley.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian on the menu? Try pairing with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Felsina Chianti Colli Senesi with a 4.1 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and  mellow on the palate, with a delightful finish of red fruit and vanilla. View More', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'In a saute pan over medium heat, add olive oil, shallots, garlic, oregano, basil and anchovy fillets. Sweat about 30 seconds, until anchovies begin to break down. Add capers and olives and saute 1 minute. Deglaze with white wine, add clam juice, let reduce by 1/3. Add plum tomatoes and thoroughly incorporate. Add marinara sauce. Season, to taste.                          In separate pot, bring 1 1/2 gallons of water to boil. Season water generously with salt. When water is at a rapid boil, add linguini, stir so there is no clumping. Cook until al dente, about 4 to 5 minutes.                          Add cooked pasta to puttanesca sauce and toss. Garnish with freshly chopped parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/linguini-puttanesca-749767', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}