{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/497198-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 497198, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Tostada with Guacamole, Black Beans, and Poached Egg', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 52.12, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'2 tbsp black beans, warmed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16015, u'unit': u'tbsp'}, {u'originalString': u'2 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1 tbsp cotija cheese', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001019, u'unit': u'tbsp'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Guacamole, to taste (see link above)', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [u'to taste', u'(see link above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'link', u'unitShort': u'link', u'amount': 1.0, u'consistency': u'liquid', u'id': 1009037, u'unit': u'link'}, {u'originalString': u'Salsa, to taste (see link above)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'to taste', u'(see link above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'link', u'unitShort': u'link', u'amount': 1.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'link'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 tbsp Tomato, diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2012/10/breakfast-tostada-with-guacamole-black-beans-and-poached-egg.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet that has been coated with cooking spray over medium heat then place the corn tortillas in it.  Cook the tortillas for 3-4 minutes on each side until golden brown and crispy.While the tortillas are cooking, prepare the poached eggs.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add water to a pan, filling it two thirds full; bring to a boil. Reduce heat to simmer. Coat two poaching cups (or custard cups) with cooking spray then place in the water. Break the eggs into each cup then cover the pan with a lid and cook for 4-6 minutes or until the whites are firm but the yolk is soft.Layer the crisp tortilla with guacamole, warmed black beans, diced tomato, and cotija cheese.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1001019, u'name': u'cotija cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Place the poached egg on top then sprinkle with green onions and season with salt and freshly cracked pepper, to taste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve immediately with a side of fresh salsa.  Enjoy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Tostadas. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bernardus Rosella's Vineyard Pinot Noir with a 4.7 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come. View More", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 276, u'instructions': u'Heat a skillet that has been coated with cooking spray over medium heat then place the corn tortillas in it.  Cook the tortillas for 3-4 minutes on each side until golden brown and crispy.While the tortillas are cooking, prepare the poached eggs.  Add water to a pan, filling it two thirds full; bring to a boil. Reduce heat to simmer. Coat two poaching cups (or custard cups) with cooking spray then place in the water. Break the eggs into each cup then cover the pan with a lid and cook for 4-6 minutes or until the whites are firm but the yolk is soft.Layer the crisp tortilla with guacamole, warmed black beans, diced tomato, and cotija cheese.   Place the poached egg on top then sprinkle with green onions and season with salt and freshly cracked pepper, to taste.  Serve immediately with a side of fresh salsa.  Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-tostada-with-guacamole-black-beans-and-poached-egg-497198', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}