{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/570534-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 570534, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Parmigiana', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 641.81, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'1 cup of bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'butter for frying', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 large can of crushed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'large', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'can'}, {u'originalString': u'2-4 chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-2 cloves of minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1-2 cups of mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'cups'}, {u'originalString': u'1 tsp onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'2 tsp oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'3-4 cups of chopped vegetables to roast, such as zucchini,onions, mushrooms,carrots', u'aisle': u'Meat', u'name': u'rib roast', u'metaInformation': [u' such as zucchini,onions, mushrooms,carrots', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 13833, u'unit': u'cups'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'1-2 tsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/chicken-parmigiana', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Kick the tires and light the fires to 400 for roasting the veggies, and back to 350 to cook the chicken.Pound the chicken breasts until they are about \xbd inch thick.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Combine the crumb coating ingredients. Pat dry your chicken breasts, then dip into the egg, then dredge through the flour mix.Fry them up in the butter until both sides are golden brown. You aren’t cooking them completely at this time, just giving them a nice crispy coating.Start combining everything for the sauce. When the vegetables are done, add them in.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place your chicken in a baking dish that has a cover.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour, or in my case, glop on the sauce. My sauce tends to be mainly vegetables.For some reason, vegetables don’t pour well. Go figure.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the oven until almost done.I used a meat thermometer, stick it right into one of the pieces of chicken and test it.Then about 15 degrees away from done-ness, add on the mozzarella cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [], u'step': u'Bake it until it’s a gorgeous golden brown on top, and of course, the chicken is done.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Parmesan on the menu? Try pairing with Barbera Wine, Chianti, and Montepulciano. When chicken is paired with tomato sauce and cheese, it can handle a light or medium bodied red wine. Since this is an Italian-American dish, we went for Italian wines. One wine you could try is Montoliva Vineyard, Late Harvest, Viani Vineyard, Barbera. It has 4.5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'barbera wine', u'chianti', u'montepulciano'], u'productMatches': [{u'description': u'Sweet...but not too sweet. Rich without being "thick". A dense blackberry/cherry sorbet.', u'title': u'Montoliva Vineyard, Late Harvest, Viani Vineyard, Barbera', u'price': u'$20.0', u'id': 432139, u'link': u'https://www.amazon.com/Montoliva-Vineyard-Harvest-Foothills-Barbera/dp/B00GDQ3ONA', u'imageUrl': u'https://spoonacular.com/productImages/432139-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'Kick the tires and light the fires to 400 for roasting the veggies, and back to 350 to cook the chicken.Pound the chicken breasts until they are about \xbd inch thick.Combine the crumb coating ingredients. Pat dry your chicken breasts, then dip into the egg, then dredge through the flour mix.Fry them up in the butter until both sides are golden brown. You aren’t cooking them completely at this time, just giving them a nice crispy coating.Start combining everything for the sauce. When the vegetables are done, add them in.Place your chicken in a baking dish that has a cover.Pour, or in my case, glop on the sauce. My sauce tends to be mainly vegetables.For some reason, vegetables don’t pour well. Go figure.Bake in the oven until almost done.I used a meat thermometer, stick it right into one of the pieces of chicken and test it.Then about 15 degrees away from done-ness, add on the mozzarella cheese. Bake it until it’s a gorgeous golden brown on top, and of course, the chicken is done.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-parmigiana-570534', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}