{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/479301-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479301, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Cheese and Chili Sandwich', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 193.48, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'3 tablespoons Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 cup of Chili', u'aisle': u'Produce', u'name': u'chili', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u'cup'}, {u'originalString': u'6 ounces of sliced Sharp Cheddar Cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'ounces'}, {u'originalString': u'4 slices of your favorite Sandwich Bread', u'aisle': u'Bakery/Bread', u'name': u'white sandwich bread', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.couponclippingcook.com/grilled-cheese-and-chili-sandwich/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Warm the chili in a pan or in the microwave and set aside for just a moment.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet on medium heat.  If your skillet is large enough to lay out 4 slices of bread, add half of the butter to the skillet.  If your skillet is just large enough for 2 slices of bread at a time, use about a quarter of the butter (a little less than a tablespoon).As soon as the butter melts, lay the pieces of bread over it and move them around a little so they soak up the butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cook until the bottom sides of the bread have a toasty look to them (about 3 or 4 minutes).  Once the bottom sides of the bread are toasted, turn them over, slide one of the pieces over to the far side of the pan and stack the remaining piece on top of it for just a moment while you add more butter.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add half of the remaining butter to the pan.  Put one of the slices of bread over the butter toasted side up.  Then stack the other slice of bread on top of the one lying over the melted butter.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining butter to the pan and as soon as it melts lay the remaining piece of bread over it toasted side up.  Next, add the slices of cheese to the top of each piece of bread.Then add about \xbd cup of warm chili on top of the cheese on one slice of bread (add 1 cup of chili on two slices if you’re cooking all four pieces of bread at the same time).  If you have extra, add a couple more pieces of the cheese on top of the warm chili.  Lift up the bread slightly with a spatula and see if it’s completely toasted.  If so, turn the piece of bread with just cheese on it over on top of the piece of bread with the chili on it to make a sandwich.When both sides are toasted, remove sandwich from the heat on to a plate.  If the cheese isn’t fully melted yet, put the sandwich in the microwave for about 5 seconds or just enough so that the cheese is melted.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [], u'step': u'Cut the sandwich in half and serve warm.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 119, u'instructions': u'Warm the chili in a pan or in the microwave and set aside for just a moment.  Heat a large skillet on medium heat.  If your skillet is large enough to lay out 4 slices of bread, add half of the butter to the skillet.  If your skillet is just large enough for 2 slices of bread at a time, use about a quarter of the butter (a little less than a tablespoon).As soon as the butter melts, lay the pieces of bread over it and move them around a little so they soak up the butter.  Let cook until the bottom sides of the bread have a toasty look to them (about 3 or 4 minutes).  Once the bottom sides of the bread are toasted, turn them over, slide one of the pieces over to the far side of the pan and stack the remaining piece on top of it for just a moment while you add more butter.Add half of the remaining butter to the pan.  Put one of the slices of bread over the butter toasted side up.  Then stack the other slice of bread on top of the one lying over the melted butter.  Add the remaining butter to the pan and as soon as it melts lay the remaining piece of bread over it toasted side up.  Next, add the slices of cheese to the top of each piece of bread.Then add about \xbd cup of warm chili on top of the cheese on one slice of bread (add 1 cup of chili on two slices if you’re cooking all four pieces of bread at the same time).  If you have extra, add a couple more pieces of the cheese on top of the warm chili.  Lift up the bread slightly with a spatula and see if it’s completely toasted.  If so, turn the piece of bread with just cheese on it over on top of the piece of bread with the chili on it to make a sandwich.When both sides are toasted, remove sandwich from the heat on to a plate.  If the cheese isn’t fully melted yet, put the sandwich in the microwave for about 5 seconds or just enough so that the cheese is melted.  Cut the sandwich in half and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-cheese-and-chili-sandwich-479301', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl', u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}