{u'recipes': [{u'sourceName': u'My Baking Heart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508437-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 508437, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate-Chocolate Chip Pudding Cookies', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 15.51, u'creditText': u'My Baking Heart', u'extendedIngredients': [{u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'2 c dark chocolate chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'c'}, {u'originalString': u'2 lg eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 c all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'1 c granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'2 (1.4 oz) boxes instant sugar-free, fat-free chocolate pudding mix', u'aisle': u'Cereal;Baking', u'name': u'instant grits', u'metaInformation': [u'fat-free', u'sugar-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.8, u'consistency': u'solid', u'id': 8092, u'unit': u'oz'}, {u'originalString': u'1/2 tsp Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'16 tbsp unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 16.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://mybakingheart.com/2013/05/17/chocolate-chocolate-chip-pudding-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350 degrees F. Cream butter and sugar together.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add eggs, one at a time, and mix well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add chocolate pudding mix and vanilla extract.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}, {u'equipment': [], u'step': u'Mix well.Sift flour, baking soda and salt together.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add to cookie dough and mix until just combined. Scrape down sides of mixing bowl and mix again.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add chocolate chips and mix until combined.Chill cookie dough in the refrigerator about 1 hour, or until dough is pretty firm. Scoop by tablespoon onto a parchment paper-lined baking sheet.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake for 10 to 12 minutes, or until cookies look set. Cool on baking sheet for 2 minutes before transferring to a wire cooling rack.Adapted from: Eclectic Recipes', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 134, u'instructions': u'Heat oven to 350 degrees F. Cream butter and sugar together. Add eggs, one at a time, and mix well. Add chocolate pudding mix and vanilla extract. Mix well.Sift flour, baking soda and salt together. Add to cookie dough and mix until just combined. Scrape down sides of mixing bowl and mix again. Add chocolate chips and mix until combined.Chill cookie dough in the refrigerator about 1 hour, or until dough is pretty firm. Scoop by tablespoon onto a parchment paper-lined baking sheet. Bake for 10 to 12 minutes, or until cookies look set. Cool on baking sheet for 2 minutes before transferring to a wire cooling rack.Adapted from: Eclectic Recipes', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chocolate-chip-pudding-cookies-508437', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}