{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/678565-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 678565, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chipotle Shells and Cheese Potato Skins', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 24.88, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'\xbd cup cooked, crumbled bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10123, u'unit': u'cup'}, {u'originalString': u'1 cup finely diced cooked chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'diced', u'cooked', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'cup'}, {u'originalString': u'green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'7 medium potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1 box VELVEETA Shells and Cheese, Bold Chipotle flavor', u'aisle': u'Cheese', u'name': u'velveeta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 1192, u'unit': u'box'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://insidebrucrewlife.com/2015/09/chipotle-shells-and-cheese-potato-skins/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Bake the potatoes at 425 degrees for about an hour, or until soft.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Cut in half and scoop out the middle of the potato.Prepare the VELVEETA Shells and Cheese according to the package directions.Stir in the chicken and bacon. Spoon the mixture evenly into the potato skins.Broil for 2 minutes. Top with green onions and serve warm. Makes 14 potato skins.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1192, u'name': u'velveeta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellafina Prosecco with a 4.6 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"Intensely aromatic and crisp on the palate, with aromas and flavorsof yellow apple, white peach, pear and notes of white flowers.Excellent as an aperitif, it is a perfect accompaniment to hors-d'oeuvres and delicate first courses. Also wonderful with fish and shellfish.", u'title': u'Bellafina Prosecco', u'price': u'$11.99', u'id': 461572, u'link': u'https://www.wine.com/product/bellafina-prosecco/136821', u'imageUrl': u'https://spoonacular.com/productImages/461572-312x231.jpg'}]}, u'aggregateLikes': 416, u'instructions': u'Bake the potatoes at 425 degrees for about an hour, or until soft. Cut in half and scoop out the middle of the potato.Prepare the VELVEETA Shells and Cheese according to the package directions.Stir in the chicken and bacon. Spoon the mixture evenly into the potato skins.Broil for 2 minutes. Top with green onions and serve warm. Makes 14 potato skins.', u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-shells-and-cheese-potato-skins-678565', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 14, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}