{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/797601-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 797601, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Chicken Nachos', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 213.95, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 oz monterey jack cheese, shredded', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'oz'}, {u'originalString': u'favorite nacho toppings, such as diced tomatoes, diced avocado, cilantro, sour cream, jalape\xf1os, etc.', u'aisle': u'Savory Snacks', u'name': u'nacho chips', u'metaInformation': [u'diced', u'sour', u' such as  tomatoes,  avocado, cilantro,  cream, jalape\xf1os, etc.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}, {u'originalString': u'1 can (16 oz) Old El Paso Traditional Refried Beans', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'refried beans', u'metaInformation': [u'traditional', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16202, u'unit': u'oz'}, {u'originalString': u'2 oz medium cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'oz'}, {u'originalString': u'2 oz mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'oz'}, {u'originalString': u'1 lb boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'1 (1 oz) package Old El Paso Chicken Taco Seasoning Mix, divided', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning mix', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'oz'}, {u'originalString': u'1 bag (11-12 oz) tortilla chips', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 19056, u'unit': u'oz'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.tasteandtellblog.com/grilled-chicken-nachos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'If your chicken breasts are thick or larger, cut them in half lengthwise, forming thinner chicken breasts. (This helps them to cook more evenly.) Reserve 1 tablespoon of the Old El Paso Chicken Taco Seasoning', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}]}, {u'equipment': [], u'step': u'Mix and set aside. Sprinkle the rest of the seasoning evenly on both sides of the chicken.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a grill to medium heat (about 350F). Oil the grill, and grill the chicken until the internal temperature registers 160F, about 8-10 minutes on each side.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer to a plate and cover with foil and let sit for 5 minutes.Meanwhile, make the cheese sauce. In a medium saucepan, melt the butter.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the flour and allow it to cook for a minute. Slowly whisk in the milk. Cook, stirring, until the mixture is thick enough to coat a spoon. Once the mixture is thick, turn off the heat and stir in the cheddar cheese, mozzarella cheese, monterey jack cheese and the reserved 1 tablespoon of Chicken Taco Seasoning', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix. Keep the cheese sauce warm.In another saucepan, heat the refried beans with about a tablespoon of water, just until warmed through.Dice the chicken into bite-sized pieces.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place half of the tortilla chips on a baking sheet. Top with half of the warmed refried beans, and half of the diced chicken.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}]}, {u'equipment': [], u'step': u'Spread the remaining tortilla chips over the top, then the remaining refried beans and remaining chicken.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}]}, {u'equipment': [], u'step': u'Pour the warm cheese sauce over the top, then top with your desired toppings.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Villa Sandi Fresco Prosecco with a 4.3 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'This wine is featured at Starbucks\xae locations where their Evenings menu is offered.Very pale straw yellow and fine, persistent perlage. The aromais fruity and flowery with hints of ripe golden apple and smallmountain flowers. The dry, fresh and flavoursome sensation onthe palate is followed by a fruity and harmonious aftertaste. View More', u'title': u'Villa Sandi Fresco Prosecco', u'price': u'$12.99', u'id': 450027, u'link': u'https://www.wine.com/product/villa-sandi-fresco-prosecco/105669', u'imageUrl': u'https://spoonacular.com/productImages/450027-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'If your chicken breasts are thick or larger, cut them in half lengthwise, forming thinner chicken breasts. (This helps them to cook more evenly.) Reserve 1 tablespoon of the Old El Paso Chicken Taco Seasoning Mix and set aside. Sprinkle the rest of the seasoning evenly on both sides of the chicken.Heat a grill to medium heat (about 350F). Oil the grill, and grill the chicken until the internal temperature registers 160F, about 8-10 minutes on each side. Transfer to a plate and cover with foil and let sit for 5 minutes.Meanwhile, make the cheese sauce. In a medium saucepan, melt the butter. Whisk in the flour and allow it to cook for a minute. Slowly whisk in the milk. Cook, stirring, until the mixture is thick enough to coat a spoon. Once the mixture is thick, turn off the heat and stir in the cheddar cheese, mozzarella cheese, monterey jack cheese and the reserved 1 tablespoon of Chicken Taco Seasoning Mix. Keep the cheese sauce warm.In another saucepan, heat the refried beans with about a tablespoon of water, just until warmed through.Dice the chicken into bite-sized pieces.Place half of the tortilla chips on a baking sheet. Top with half of the warmed refried beans, and half of the diced chicken. Spread the remaining tortilla chips over the top, then the remaining refried beans and remaining chicken. Pour the warm cheese sauce over the top, then top with your desired toppings.Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-chicken-nachos-797601', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}