{u'recipes': [{u'sourceName': u'Jans Sushi Bar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/477068-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 477068, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sprout Kraut', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 24.76, u'creditText': u'Jans Sushi Bar', u'extendedIngredients': [{u'originalString': u'1 tablespoon black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'tablespoon'}, {u'originalString': u'4 cups shredded Brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11098, u'unit': u'cups'}, {u'originalString': u'2 teaspoons celery seeds', u'aisle': u'Spices and Seasonings', u'name': u'celery seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-seed.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2007, u'unit': u'teaspoons'}, {u'originalString': u'4 cloves garlic, peeled and slightly crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon red pepper flakes, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon kosher sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tablespoon'}, {u'originalString': u'filtered water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'filtered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.janssushibar.com/sprout-kraut/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Have ready a clean, dry 1 quart glass jar.Layer the shredded Brussels sprouts into the jar until it is about 1/4 full. Sprinkle some of the salt on top of the cabbage and pound it down with a wooden spoon or pestle until the sprouts begin to give off liquid. Sprinkle in a bit of the celery seed, a few peppercorns, a pinch of the red pepper flakes and a clove of garlic.Repeat the previous step, pounding the mixture between each layer, until all of the ingredients are in the jar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-seed.jpg', u'id': 2007, u'name': u'celery seed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add enough filtered water to cover the kraut. There should be about 1 inch between the top of the cabbage and the top of the jar.Top off the kraut with about 1/4 cup of olive or coconut oil to keep the cabbage submerged, or use a glass weight. Cap loosely and store at room temperature (on a counter out of direct sunlight is fine) for 3 days, or until the kraut begins to bubble.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to the refrigerator and continue to cure for 3 to 4 weeks before eating.Nutrition (per serving): 13 calories, <1g total fat, 0mg cholesterol, 358.6mg sodium, 99.3mg potassium, 2.7g carbohydrates, 1g fiber, <1g sugar, <1g protein', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 142, u'instructions': u'Have ready a clean, dry 1 quart glass jar.Layer the shredded Brussels sprouts into the jar until it is about 1/4 full. Sprinkle some of the salt on top of the cabbage and pound it down with a wooden spoon or pestle until the sprouts begin to give off liquid. Sprinkle in a bit of the celery seed, a few peppercorns, a pinch of the red pepper flakes and a clove of garlic.Repeat the previous step, pounding the mixture between each layer, until all of the ingredients are in the jar. Add enough filtered water to cover the kraut. There should be about 1 inch between the top of the cabbage and the top of the jar.Top off the kraut with about 1/4 cup of olive or coconut oil to keep the cabbage submerged, or use a glass weight. Cap loosely and store at room temperature (on a counter out of direct sunlight is fine) for 3 days, or until the kraut begins to bubble.Transfer to the refrigerator and continue to cure for 3 to 4 weeks before eating.Nutrition (per serving): 13 calories, <1g total fat, 0mg cholesterol, 358.6mg sodium, 99.3mg potassium, 2.7g carbohydrates, 1g fiber, <1g sugar, <1g protein', u'spoonacularSourceUrl': u'https://spoonacular.com/sprout-kraut-477068', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}