{u'recipes': [{u'sourceName': u'Simply Quinoa', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/709631-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 709631, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spiralized Butternut Squash Bowls with Harissa Chickpeas + Quinoa', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 223.48, u'creditText': u'Simply Quinoa', u'extendedIngredients': [{u'originalString': u'1 lb brussels sprouts, halved', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'lb'}, {u'originalString': u'1 batch of spiralized butternut squash noodles (I used this method from my girl Ali)', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'(I used this method from my girl Ali)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'1 can chickpeas', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 16058, u'unit': u'can'}, {u'originalString': u'2 cups cooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'cooked quinoa', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cooked-quinoa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20137, u'unit': u'cups'}, {u'originalString': u'1 small garlic clove, pressed or grated', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'grated', u'small', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoons harissa paste', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons miso paste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16112, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup pomegranate seeds', u'aisle': u'Produce', u'name': u'pomegranate seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9286, u'unit': u'cup'}, {u'originalString': u'1 teaspoon rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons tahini', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12698, u'unit': u'tablespoons'}, {u'originalString': u'Pinch of turmeric + ginger', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'pinch'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'Water to thin', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.simplyquinoa.com/spiralized-butternut-squash-bowls-with-harissa-chickpeas-quinoa/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat the oven to 400 degrees. Toss the brussels sprouts in some oil, salt + pepper (optional) and transfer to a baking sheet. Roast in the oven for 20 - 25 minutes until browned and soft.Once the brussels are in the oven, prepare the butternut squash. I used this method for peeling and spirazling (I had a medium butternut squash for these 4 bowls). When the brussels have about 5 minutes left, add the squash noodles to the pan and roast until tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chickpeas, harissa and water to a skillet. Cook until chickpeas are warm and starting to get a little crispy, about 5 - 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'id': 1006972, u'name': u'harissa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Remove and assemble the bowls.Evenly divide ingredients among four bowls, arranging quinoa, chickpeas, squash noodles, brussels sprouts and pomegranate however you'd like (I do mine in a circle).", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'id': 1009286, u'name': u'pomegranate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together dressing ingredients and pour over bowls. Then dig in!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 66, u'instructions': u"Preheat the oven to 400 degrees. Toss the brussels sprouts in some oil, salt + pepper (optional) and transfer to a baking sheet. Roast in the oven for 20 - 25 minutes until browned and soft.Once the brussels are in the oven, prepare the butternut squash. I used this method for peeling and spirazling (I had a medium butternut squash for these 4 bowls). When the brussels have about 5 minutes left, add the squash noodles to the pan and roast until tender. Remove from the oven and set aside.Add chickpeas, harissa and water to a skillet. Cook until chickpeas are warm and starting to get a little crispy, about 5 - 7 minutes. Remove and assemble the bowls.Evenly divide ingredients among four bowls, arranging quinoa, chickpeas, squash noodles, brussels sprouts and pomegranate however you'd like (I do mine in a circle). Whisk together dressing ingredients and pour over bowls. Then dig in!", u'spoonacularSourceUrl': u'https://spoonacular.com/spiralized-butternut-squash-bowls-with-harissa-chickpeas-+-quinoa-709631', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}