{u'recipes': [{u'sourceName': u'Feast Asia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478549-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 478549, u'veryPopular': False, u'lowFodmap': False, u'title': u'How to cook: Crispy fried adobo', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 148.75, u'creditText': u'Feast Asia', u'extendedIngredients': [{u'originalString': u'1 tbsp. of crisp garlic bits', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crisp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tbsp'}, {u'originalString': u'grated garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'servings'}, {u'originalString': u'1 tbsp. of sliced onion leaves', u'aisle': u'Produce', u'name': u'onion leaves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tbsp'}, {u'originalString': u'chopped shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u'servings'}, {u'originalString': u'about 3 c. of vegetable cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'c'}, {u'originalString': u'2 c. cooked chicken or pork adobo (get the recipe here), or a combination of both, cooled', u'aisle': u'?', u'name': u'a combination of both', u'metaInformation': [u'cooled', u'cooked', u'(get the recipe here)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'unit': u'c'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://feastasia.casaveneracion.com/crispy-adobo/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 158, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the cooking oil in a wok or deep drying frying pan.Using two forks, shred the cooked adobo. The finer the shreds, the crispier the result.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place just enough shredded meat to line the bottom of the kitchen spider.Plunge the spider into the very hot cooking oil and leave for about a minute or until the meat is browned and crisp.Lift the spider from the oil and let the excess oil drip off.Arrange the crispy fried adobo on top of rice. Sprinkle with crisp garlic bits and sliced onion leaves.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Serve with the dipping sauce on the side.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 18, u'instructions': u'InstructionsHeat the cooking oil in a wok or deep drying frying pan.Using two forks, shred the cooked adobo. The finer the shreds, the crispier the result.Place just enough shredded meat to line the bottom of the kitchen spider.Plunge the spider into the very hot cooking oil and leave for about a minute or until the meat is browned and crisp.Lift the spider from the oil and let the excess oil drip off.Arrange the crispy fried adobo on top of rice. Sprinkle with crisp garlic bits and sliced onion leaves. Serve with the dipping sauce on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/how-to-cook-crispy-fried-adobo-478549', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}