{u'recipes': [{u'sourceName': u'Gimme Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719200-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 719200, u'veryPopular': False, u'lowFodmap': False, u'title': u'One Pan Lemon Garlic Salmon and Asparagus', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 486.11, u'creditText': u'Gimme Delicious', u'extendedIngredients': [{u'originalString': u'1 bunch asparagus, trimmed', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'zest and juice of \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1-pound salmon fillet (cut into 2-3 fillets)', u'aisle': u'Seafood', u'name': u'salmon fillet', u'metaInformation': [u'cut into 2-3 fillets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15076, u'unit': u'pound'}, {u'originalString': u'Salt and cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoon'}], u'healthScore': 48.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://gimmedelicious.com/2016/03/06/one-pan-lemon-garlic-salmon-and-asparagus/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a tablespoon of butter and a tablespoon of olive oil in a large pan. Wait until the pan is hot and the butter has fully melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the salmon and asparagus, season with salt and pepper , and cook for about 3-4 minutes on one side.Flip and cook for about 3-4 minutes on the other side.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Add the garlic and lemon zest. Cook the garlic for just 1-2 minutes or until it begins to brown. Turn off the heat and squeeze half a lemon into the dish.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Maso Canali Pinot Grigio. Reviewers quite like it with a 4.6 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Heat a tablespoon of butter and a tablespoon of olive oil in a large pan. Wait until the pan is hot and the butter has fully melted. Add the salmon and asparagus, season with salt and pepper , and cook for about 3-4 minutes on one side.Flip and cook for about 3-4 minutes on the other side. Add the garlic and lemon zest. Cook the garlic for just 1-2 minutes or until it begins to brown. Turn off the heat and squeeze half a lemon into the dish.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-pan-lemon-garlic-salmon-and-asparagus-719200', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}