{u'recipes': [{u'sourceName': u'Full Belly Sisters', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/716409-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 716409, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cannoli Cream-Filled Strawberries', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 135.93, u'creditText': u'Full Belly Sisters', u'extendedIngredients': [{u'originalString': u'2 ounces cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'24 strawberries, cleaned and dried', u'aisle': u'Dried Fruits;Produce', u'name': u'dried strawberries', u'metaInformation': [u'dried', u'cleaned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freeze-dried-strawberries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 98897, u'unit': u''}, {u'originalString': u'1-2 tsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'2 T powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'T'}, {u'originalString': u'1 1/4 cup good quality ricotta', u'aisle': u'Cheese', u'name': u'ricotta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'1/2 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://fullbellysisters.blogspot.com/2013/02/cannoli-cream-filled-strawberries.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'dishTypes': [], u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cannoli. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1072, u'instructions': u'', u'spoonacularSourceUrl': u'https://spoonacular.com/cannoli-cream-filled-strawberries-716409', u'license': u'CC BY-SA 3.0', u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}