{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/376610-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 376610, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fresh Peach Mango Salsa', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 37.22, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon minced fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'teaspoon'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons chopped seeded jalapeno pepper', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u'tablespoons'}, {u'originalString': u'1-1/2 teaspoons lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup chopped peeled mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u'3/4 cup chopped peeled fresh peaches', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9236, u'unit': u'cup'}, {u'originalString': u'1/2 cup chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups chopped fresh tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cups'}, {u'originalString': u'Tortilla chips', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}, {u'originalString': u'1/2 cup chopped sweet yellow pepper', u'aisle': u'Produce', u'name': u'yellow sweet pepper', u'metaInformation': [u'sweet', u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11951, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/fresh-peach-mango-salsa', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the first nine ingredients. Cover and refrigerate until serving.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with tortilla chips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}]}], u'name': u''}], u'aggregateLikes': 1574, u'instructions': u"Directions                                                                                In a large bowl, combine the first nine ingredients. Cover and refrigerate until serving. Serve with tortilla chips.                                        Yield: 4 cups.                                                                                                     Editor's Note: Wear disposable gloves when cutting hot peppers; the oils can burn skin. Avoid touching your face.                                                                                                Originally published as Fresh Peach Mango Salsa in  Taste of HomeJune/July 2006, p57                                                                                                                                                                                                        Nutritional Facts                                                                             1/4 cup (calculated without chips) equals 14 calories, trace fat (trace saturated fat), 0 cholesterol, 2 mg sodium, 3 g carbohydrate, 1 g fiber, trace protein. Diabetic Exchange: Free food.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-peach-mango-salsa-376610', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}