{u'recipes': [{u'sourceName': u'Live Laugh Rowe', u'cuisines': [u'european', u'eastern european'], u'image': u'https://spoonacular.com/recipeImages/584992-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 584992, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Beef Stroganoff', u'diets': [u'gluten free'], u'pricePerServing': 293.72, u'creditText': u'Live Laugh Rowe', u'extendedIngredients': [{u'originalString': u'1 pound 95% lean ground beef', u'aisle': u'Meat', u'name': u'95% lean ground beef', u'metaInformation': [u'95%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'12 oz jar beef gravy', u'aisle': u'Canned and Jarred', u'name': u'beef gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 6997, u'unit': u'oz'}, {u'originalString': u'1/4 tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'8 ounces no-yolk egg noodles, uncooked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1125, u'unit': u'ounces'}, {u'originalString': u'8 oz. fresh mushrooms, sliced', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'1/4 tsp garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1062047, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'8 oz. fat free sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'fat free', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'oz'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://livelaughrowe.com/skinny-beef-stroganoff/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare noodles according to package directions, omitting salt and oil.While noodles cook, place beef, onions and mushrooms in a large nonstick skillet, cooking until meat is browned.  Stirring until beef crumbles.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain meat.Return meat to skillet.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add gravy, sour cream, garlic salt and pepper.  Stir well.Cook over medium heat 5 minutes or until thoroughly heated.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'id': 6997, u'name': u'gravy'}]}, {u'equipment': [], u'step': u'Serve over drained noodles, top with fresh ground pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Nero D Avola, Primitivo, and Shiraz are great choices for Beef Stroganoff. For a creamy, mushroomy beef stroganoff, you'll want a bold red to match. The Regaleali Nero d'Avola with a 4.3 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'nero d avola', u'primitivo', u'shiraz'], u'productMatches': [{u'description': u'Ruby red in color with a delicate bouquet.  Dry with a lingering finish, and balanced acidity and tannins.  Recommended with grilled meats.  Particularly excellent with roast game and hard spicy cheeses. View More', u'title': u"Regaleali Nero d'Avola", u'price': u'$10.99', u'id': 432968, u'link': u'https://www.wine.com/product/regaleali-nero-davola-1998/25350', u'imageUrl': u'https://spoonacular.com/productImages/432968-312x231.jpg'}]}, u'aggregateLikes': 785, u'instructions': u'Prepare noodles according to package directions, omitting salt and oil.While noodles cook, place beef, onions and mushrooms in a large nonstick skillet, cooking until meat is browned.  Stirring until beef crumbles.  Drain meat.Return meat to skillet.  Add gravy, sour cream, garlic salt and pepper.  Stir well.Cook over medium heat 5 minutes or until thoroughly heated.Serve over drained noodles, top with fresh ground pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-beef-stroganoff-584992', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}