{u'recipes': [{u'sourceName': u'Blender Babes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608993-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 608993, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dairy-Free Frozen Peanut Butter Pie', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 71.9, u'creditText': u'Blender Babes', u'extendedIngredients': [{u'originalString': u'1/4 cup expeller pressed canola oil or coconut oil*', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'1/2 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'3/4 cups peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16098, u'unit': u'cups'}, {u'originalString': u'1 9-inch pie shell, baked', u'aisle': u'Refrigerated', u'name': u'pie shell', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'1/8 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 pkg of Nasoya Silken Tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'silken tofu', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 16161, u'unit': u'pkg'}, {u'originalString': u'1 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.blenderbabes.com/lifestyle-diet/dairy-free/dairyfree-frozen-peanut-butter-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all of the ingredients into your blender jar.For Blendtec: Run the BATTERS cycle until smooth and creamy.For Vitamix: Starting on Variable Speed 1/LOW, turn the machine on and slowly increase to Variable Speed 10/HIGH until the mixture is smooth and creamy, about 30 seconds.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour mixture into your pie shell. Decorate with chocolate shavings, curls or nibs if you wish.Freeze for at least two hours. Before serving, let thaw for about 10 minutes.Makes 6-10 servings.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Peanut Butter Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is McFadden Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 107, u'instructions': u'Place all of the ingredients into your blender jar.For Blendtec: Run the BATTERS cycle until smooth and creamy.For Vitamix: Starting on Variable Speed 1/LOW, turn the machine on and slowly increase to Variable Speed 10/HIGH until the mixture is smooth and creamy, about 30 seconds.Pour mixture into your pie shell. Decorate with chocolate shavings, curls or nibs if you wish.Freeze for at least two hours. Before serving, let thaw for about 10 minutes.Makes 6-10 servings.', u'spoonacularSourceUrl': u'https://spoonacular.com/dairy-free-frozen-peanut-butter-pie-608993', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}