{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497288-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 497288, u'veryPopular': False, u'lowFodmap': False, u'title': u'Orzo with Garlicky Roasted Tomatoes and Parmesan', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 155.06, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 tbsp fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'2 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 cups of grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10111529, u'unit': u'cups'}, {u'originalString': u'2-3 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'3/4 cup of dried orzo, cooked per instructions', u'aisle': u'Pasta and Rice', u'name': u'orzo', u'metaInformation': [u'dried', u'cooked', u'per instructions'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10920420, u'unit': u'cup'}, {u'originalString': u'Parmesan cheese, shredded, to taste', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2013/12/orzo-with-garlicky-roasted-tomatoes-and-parmesan.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the grape tomatoes, minced garlic, olive oil, sea salt and fresh cracked pepper, to taste, in a baking dish. Toss to coat evenly.Roast in the oven for 10 minutes, stirring them occasionally,  until plump and ready to about to burst.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10111529, u'name': u'grape tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven.While the tomatoes are roasting, prepare the orzo in boiling water, per instructions.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Drain the orzo then pour the pasta directly into the baking dish.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [], u'step': u'Add the fresh parsley then season with sea salt and freshly cracked pepper, to taste. Toss to coat the orzo evenly with the tomatoes, their juices, and the minced garlic. Taste and re-season if needed.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour into a serving bowl and sprinkle with Parmesan cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Serve immediately. Enjoy.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 254, u'instructions': u'Preheat the oven to 400 degrees. Add the grape tomatoes, minced garlic, olive oil, sea salt and fresh cracked pepper, to taste, in a baking dish. Toss to coat evenly.Roast in the oven for 10 minutes, stirring them occasionally,  until plump and ready to about to burst. Remove from the oven.While the tomatoes are roasting, prepare the orzo in boiling water, per instructions. Drain the orzo then pour the pasta directly into the baking dish.  Add the fresh parsley then season with sea salt and freshly cracked pepper, to taste. Toss to coat the orzo evenly with the tomatoes, their juices, and the minced garlic. Taste and re-season if needed. Pour into a serving bowl and sprinkle with Parmesan cheese. Serve immediately. Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/orzo-with-garlicky-roasted-tomatoes-and-parmesan-497288', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}