{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/272717-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 3, u'id': 272717, u'veryPopular': False, u'lowFodmap': True, u'title': u'Quick Chicken Tacos', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 85.11, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 pkg. (6 oz.) OSCAR MAYER CARVING BOARD Southwestern Seasoned Chicken Breast Strips', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 5062, u'unit': u'oz'}, {u'originalString': u'1 cup shredded lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u'cup'}, {u'originalString': u'1/2 cup TACO BELL\xc2\xae Thick & Chunky Salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'1/2 cup KRAFT Finely Shredded Cheddar Cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'kraft', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'4 TACO BELL\xc2\xae Crunchy Taco Shells, heated', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'taco shells', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taco-shells.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18360, u'unit': u''}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/quick-chicken-tacos-50931.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat chicken and salsa in saucepan on medium heat 3 min. or until heated through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Fill taco shells with chicken mixture; top with cheese and lettuce.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taco-shells.jpg', u'id': 18360, u'name': u'taco shells'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Heat chicken and salsa in saucepan on medium heat 3 min. or until heated through.                                            Fill taco shells with chicken mixture; top with cheese and lettuce.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-chicken-tacos-272717', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}