{u'recipes': [{u'sourceName': u'Sugar Free Mom', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/557177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 557177, u'veryPopular': True, u'lowFodmap': False, u'title': u'Low Fat Crock Pot Chicken Taco Chili', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 168.57, u'creditText': u'Sugar Free Mom', u'extendedIngredients': [{u'originalString': u'1 (15.5 ounce) can black beans, rinsed, drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 16018, u'unit': u'ounce'}, {u'originalString': u'1 (15.5 ounce) can kidney beans, rinsed, drained', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 16034, u'unit': u'ounce'}, {u'originalString': u'1 (14.5 ounce) can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'24 ounces boneless chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 5062, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons dried minced onion', u'aisle': u'Spices and Seasonings', u'name': u'dried onion', u'metaInformation': [u'dried', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11284, u'unit': u'tablespoons'}, {u'originalString': u'10 ounce package frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11913, u'unit': u'ounce'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 cups salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'cups'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2073, u'unit': u'tablespoons'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.sugarfreemom.com/recipes/low-fat-crock-pot-chicken-taco-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add all ingredients except chicken to your crock pot.Stir together well.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place your chicken breasts on top of all the ingredients in the crock and cook on high 6 hours or low 10 hours.minutes to an hour before serving, take your chicken out of the crock pot onto a cutting board.Using two forks shred chicken and place back into crock pot and stir together well.Sprinkle fresh cilantro on top to serve as well as any other additional toppings.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili on the menu? Try pairing with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Codorniu Anna de Codorniu Cava Brut ros\xe9 with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u"This Cava combines glamour, innovation and modernity with the experience and history of what is probably Codorniu's most iconic offering, Anna de Codorniu. Elegance and subtlety, which to a large extent come from a blend with approximately 70% of the most prestigious varietal for making rose cavas: Pinot Noir. Delicate cherry color with strawberry tones. Fine and persistent bubbles. Aromas of red fruit, strawberries, cherries and woodland fruits with hints of green apple. Elegant and light on the palate. Well balanced between acid and sweetness with a refreshing finish.", u'title': u'Codorniu Anna de Codorniu Cava Brut Rose', u'price': u'$12.99', u'id': 451641, u'link': u'https://www.wine.com/product/codorniu-anna-de-codorniu-cava-brut-rose/109416', u'imageUrl': u'https://spoonacular.com/productImages/451641-312x231.jpg'}]}, u'aggregateLikes': 1266, u'instructions': u'Add all ingredients except chicken to your crock pot.Stir together well.Place your chicken breasts on top of all the ingredients in the crock and cook on high 6 hours or low 10 hours.minutes to an hour before serving, take your chicken out of the crock pot onto a cutting board.Using two forks shred chicken and place back into crock pot and stir together well.Sprinkle fresh cilantro on top to serve as well as any other additional toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/low-fat-crock-pot-chicken-taco-chili-557177', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}