{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'cheap': False, u'gaps': u'no', u'id': 617529, u'veryPopular': False, u'lowFodmap': False, u'title': u'Berliner Kranzer', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 14.39, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'3/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'24 red candied cherries', u'aisle': u'Produce;Baking', u'name': u'candied cherries', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-cherries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 93742, u'unit': u''}, {u'originalString': u'3/4 cup candied citron peel', u'aisle': u'Produce;Baking', u'name': u'candied citron', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9426, u'unit': u'cup'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 cups sifted all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 teaspoons orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 0.0, u'spoonacularScore': 7.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Berliner-Kranzer/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cream together 1 cup sugar with butter or margarine, and shortening. Beat in 2 eggs and add orange peel.Sift flour and gradually blend into sugar mixture. Dough should hold together and not be crumbly.Take a walnut sized piece of dough, and roll in palms of hand to create a 4 to 6 inch rope. Bring ends together to form a circle, and fold ends over each other.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Brush with a mixture made from beaten egg white and 2 teaspoons sugar; this makes a glossy finish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add green citron slices for "leaves" and 1/2 red citron cherry for" berry" - use to decorate at the knot.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake at 400 degrees F (205 degrees C) on ungreased cookie sheets for 10 to 12 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 12, u'instructions': u'Cream together 1 cup sugar with butter or margarine, and shortening. Beat in 2 eggs and add orange peel.Sift flour and gradually blend into sugar mixture. Dough should hold together and not be crumbly.Take a walnut sized piece of dough, and roll in palms of hand to create a 4 to 6 inch rope. Bring ends together to form a circle, and fold ends over each other. Brush with a mixture made from beaten egg white and 2 teaspoons sugar; this makes a glossy finish. Add green citron slices for "leaves" and 1/2 red citron cherry for" berry" - use to decorate at the knot.Bake at 400 degrees F (205 degrees C) on ungreased cookie sheets for 10 to 12 minutes. Bake only until cookies are light brown on bottom - just barely baked.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/berliner-kranzer-617529', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}