{u'recipes': [{u'sourceName': u'The Little Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/530649-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 530649, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vanilla Chocolate Chip Bundt Cake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 58.1, u'creditText': u'The Little Kitchen', u'extendedIngredients': [{u'originalString': u'1 cup miniature chocolate, chips', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19081, u'unit': u'cup'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Powdered sugar for serving', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons McCormick\xae Pure Vanilla Extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure', u'tablespoons mccormick\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u''}, {u'originalString': u'1 package (4-serving size) vanilla instant pudding mix (I used a 3.4 ounce package)', u'aisle': u'Baking', u'name': u'vanilla instant pudding mix', u'metaInformation': [u'(4-serving size)', u'(I used a 3.4 ounce package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 19206, u'unit': u'package'}, {u'originalString': u'1/2 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 package (15.25 ounces) yellow cake mix', u'aisle': u'Baking', u'name': u'yellow cake mix', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-cake.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.25, u'consistency': u'solid', u'id': 18144, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.thelittlekitchen.net/vanilla-chocolate-chip-bundt-cake-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350 degrees F. Spray a 12 cup bundt pan thoroughly with non-stick baking spray or if using a mini bundt pan, spray the individual cavities.In a medium sized mixing bowl, add chocolate chips and 3 Tablespoons of the dry cake mix.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix thoroughly and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add remaining cake mix, pudding mix, sour cream, oil, water, eggs and vanilla extract to a large mixing bowl. Using an electric mixer on low speed, mix all ingredients together until combined. Increase speed to medium and mix for one more minute.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour in chocolate chips and stir in using a wooden spoon or rubber spatula.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Pour into greased and floured 12-cup Bundt pan. Or if using mini bundt pan, using a medium cookie scoop (1 1/2 Tablespoons), scoop into individual cavities.For large bundt pan, bake 50 minutes or until toothpick inserted in center comes out clean. Cool in pan 10 minutes.For mini bundt cakes, bake for 12 to 15 minutes or until toothpick inserted in center comes out clean. Cool in pan for 2 to 5 minutes.Flip onto wire cooling rack and allow to cool completely. Sprinkle powdered sugar on top before serving.', u'length': {u'number': 74, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bundt Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 2234, u'instructions': u'Heat oven to 350 degrees F. Spray a 12 cup bundt pan thoroughly with non-stick baking spray or if using a mini bundt pan, spray the individual cavities.In a medium sized mixing bowl, add chocolate chips and 3 Tablespoons of the dry cake mix. Mix thoroughly and set aside.Add remaining cake mix, pudding mix, sour cream, oil, water, eggs and vanilla extract to a large mixing bowl. Using an electric mixer on low speed, mix all ingredients together until combined. Increase speed to medium and mix for one more minute.Pour in chocolate chips and stir in using a wooden spoon or rubber spatula. Pour into greased and floured 12-cup Bundt pan. Or if using mini bundt pan, using a medium cookie scoop (1 1/2 Tablespoons), scoop into individual cavities.For large bundt pan, bake 50 minutes or until toothpick inserted in center comes out clean. Cool in pan 10 minutes.For mini bundt cakes, bake for 12 to 15 minutes or until toothpick inserted in center comes out clean. Cool in pan for 2 to 5 minutes.Flip onto wire cooling rack and allow to cool completely. Sprinkle powdered sugar on top before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/vanilla-chocolate-chip-bundt-cake-530649', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}