{u'recipes': [{u'sourceName': u'Cravings of a Lunatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/538869-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 538869, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eskimo Pie with Pistachios | Burning Down the Kitchen with Buttercream Blondie', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 210.93, u'creditText': u'Cravings of a Lunatic', u'extendedIngredients': [{u'originalString': u'4 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1\xbd cups cherries, stems removed and pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9070, u'unit': u'cups'}, {u'originalString': u'1 teaspoon cherry extract', u'aisle': u'Produce', u'name': u'cherry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'teaspoon'}, {u'originalString': u'1 cup chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1 tablespoon corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoon'}, {u'originalString': u'\xbc to \xbd cup crushed pistachios', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'liquid', u'id': 18139, u'unit': u''}, {u'originalString': u'2 cups graham crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'4 heaping tablespoons of nutella', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19125, u'unit': u'tablespoons'}, {u'originalString': u'Magic Shell to taste', u'aisle': u'Refrigerated', u'name': u'pie shell', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'Pinch of vanilla sugar', u'aisle': u'Baking', u'name': u'vanilla sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-sugar.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 10319335, u'unit': u'pinch'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.cravingsofalunatic.com/2012/07/burning-down-the-kitchen-with-buttercream-blondie-while-making-her-eskimo-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 40, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl combine your graham crumbs and melted butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix well. Press into 4 individual size spring form pans you’ve sprayed with non stick spray. Tamp them down with the bottom of a glass or a honey dripper works really well too. You can pop them in a 350 degree oven for 3 to 5 minutes if you like. I find when setting ice cream pies up in the freezer it’s not necessary so I don’t risk heating my house up and forgo baking the crust.It also helps to line the bottom of you spring form pan with plastic wrap prior to making these. The next step uses loose ice cream that can leak. I always forget so just making sure you don’t.Spoon 1 tablespoon of Nutella over the crust. It helps to heat it up a touch so it spreads nicely. Otherwise it will pull back your crumbs and annoy you.In a stand mixer combine your whole milk, sugar and salt.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'whole milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Mix well.Now add heavy cream and cherry extract.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [], u'step': u'Add your cherries.Cover with tinfoil and place in the fridge for 1 to 2 hours.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove and transfer liquid to an ice cream machine bowl you’ve kept frozen. Turn on and let it spin for about 15 to 20 minutes.Now pour the ice cream over the crust and pop in the freezer for a couple of hours to set before adding ganache.Over medium heat warm up your heavy cream in a saucepan. You want to scald it.Then in a glass heat proof bowl pour the scalded cream over your chocolate.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix well with a whisk. It will look weird and you will think you’ve done something wrong but have faith. It will come together.Now add nutella and corn syrup.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk some more.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool a bit.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Pour cooled ganache over the ice cream.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Place back in the freezer for 1 to 2 hours.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove ice cream from freezer.Put each pie on a small plate and remove the pie from the spring form pan.Now pour magic shell over top (heat it up for a few seconds in the microwave to activate the stuff) and watch the magic happen.Top with crushed pistachios.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a big old Eskimo Pie smile!', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Red Apple, Honeyed, Sweet', u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 102, u'instructions': u'In a bowl combine your graham crumbs and melted butter. Mix well. Press into 4 individual size spring form pans you’ve sprayed with non stick spray. Tamp them down with the bottom of a glass or a honey dripper works really well too. You can pop them in a 350 degree oven for 3 to 5 minutes if you like. I find when setting ice cream pies up in the freezer it’s not necessary so I don’t risk heating my house up and forgo baking the crust.It also helps to line the bottom of you spring form pan with plastic wrap prior to making these. The next step uses loose ice cream that can leak. I always forget so just making sure you don’t.Spoon 1 tablespoon of Nutella over the crust. It helps to heat it up a touch so it spreads nicely. Otherwise it will pull back your crumbs and annoy you.In a stand mixer combine your whole milk, sugar and salt. Mix well.Now add heavy cream and cherry extract.Add your cherries.Cover with tinfoil and place in the fridge for 1 to 2 hours.Remove and transfer liquid to an ice cream machine bowl you’ve kept frozen. Turn on and let it spin for about 15 to 20 minutes.Now pour the ice cream over the crust and pop in the freezer for a couple of hours to set before adding ganache.Over medium heat warm up your heavy cream in a saucepan. You want to scald it.Then in a glass heat proof bowl pour the scalded cream over your chocolate. Mix well with a whisk. It will look weird and you will think you’ve done something wrong but have faith. It will come together.Now add nutella and corn syrup. Whisk some more.Let cool a bit.Pour cooled ganache over the ice cream.Place back in the freezer for 1 to 2 hours.Remove ice cream from freezer.Put each pie on a small plate and remove the pie from the spring form pan.Now pour magic shell over top (heat it up for a few seconds in the microwave to activate the stuff) and watch the magic happen.Top with crushed pistachios.Serve with a big old Eskimo Pie smile!', u'spoonacularSourceUrl': u'https://spoonacular.com/eskimo-pie-with-pistachios-burning-down-the-kitchen-with-buttercream-blondie-538869', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}