{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/285227-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 285227, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot Dog Wrap Ol\xc3\xa9', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 92.93, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 pkg. (16 oz.) OSCAR MAYER Selects Uncured Angus Beef Franks', u'aisle': u'Meat', u'name': u'beef franks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 7241, u'unit': u'oz'}, {u'originalString': u'1 cup shredded lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u'cup'}, {u'originalString': u'8 KRAFT 2% Milk Pepperjack Singles', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 1077, u'unit': u''}, {u'originalString': u'1 cup TACO BELL\xc2\xae Thick & Chunky Salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'8 whole wheat tortillas (6 inch), warmed', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'whole wheat tortillas', u'metaInformation': [u'whole wheat', u'warmed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortillas-whole-wheat.jpg', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 8.0, u'consistency': u'solid', u'id': 93675, u'unit': u'6-inch'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/hot-dog-wrap-ole-52742.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill franks 7 to 9 min. or until heated through, turning occasionally.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Top tortillas with 2% Milk Singles, lettuce, franks and salsa; roll up.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Hot Dogs works really well with Riesling, Gewurztraminer, and ros\xe9 Wine. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. The Pacific Rim Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'Portraying bright crispness, subtle sweetness and aromas of jasmine, pear and apple, Pacific Rim Riesling exemplifies the harmony of Riesling. The sweetness plays wonderfully with fiery fare (from Thai to Mexican), while the natural acidity stands up to richer foods (from French to German). View More', u'title': u'Pacific Rim Riesling', u'price': u'$11.99', u'id': 446903, u'link': u'https://www.wine.com/product/pacific-rim-riesling-2011/119629', u'imageUrl': u'https://spoonacular.com/productImages/446903-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'Heat grill to medium heat.                                            Grill franks 7 to 9 min. or until heated through, turning occasionally.                                            Top tortillas with 2% Milk Singles, lettuce, franks and salsa; roll up.', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-dog-wrap-ol-285227', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}