{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/430314-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 150, u'id': 430314, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roast Beef with Onion au Jus', u'diets': [u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 136.75, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 envelope au jus gravy mix', u'aisle': u'Canned and Jarred', u'name': u'au jus gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 6996, u'unit': u'envelope'}, {u'originalString': u'Additional water or beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'servings'}, {u'originalString': u'2 beef eye round roasts (about 3 pounds each)', u'aisle': u'Meat', u'name': u'beef round roast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 6.0, u'consistency': u'liquid', u'id': 13411, u'unit': u'pounds'}, {u'originalString': u'8 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 envelope onion soup mix', u'aisle': u'Canned and Jarred', u'name': u'onion soup mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 6094, u'unit': u'envelope'}, {u'originalString': u'1/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/roast-beef-with-onion-au-jus', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'With a sharp knife, make four slits in the top of each roast and insert garlic cloves into slits.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven over medium-high heat, brown roast on all sides in oil; drain. Rub soup mix over meat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add water; cover and bake at 325\xb0 for 2-1/2 to 3 hours or until tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove meat from cooking liquid; cool meat. Cover and refrigerate overnight. Skim fat from cooking liquid; refrigerate in a covered container.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Slice beef 1/4 in. thick, set aside.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'Pour cooking liquid into a large measuring cup. If needed, add enough water or beef broth to measure 3 cups.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven, combine au jus mix and reserved cooking liquid until smooth. Cook and stir over medium until mixture comes to a boil. Reduce heat; add sliced beef and reheat on low for 15-20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'id': 6996, u'name': u'au jus'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Roast Beef on the menu? Try pairing with Merlot, Cabernet Sauvignon, and Pinot Noir. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. The Clos Du Val Merlot with a 4.1 out of 5 star rating seems like a good match. It costs about 30 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"A dense, inky color and rich aromas of intense black currant and blackberry pervade our 2002 Merlot. Hints of herbs, black olives and toast are also present in the nose, leading to a well-structured wine with an abundance of dark red and black fruit flavors, balanced with sweet toast and some spice. The wine's soft tannins, lingering finish, and rich, complex taste make this a delightful accompaniment to roast chicken, pork, or beef.", u'title': u'Clos Du Val Merlot', u'price': u'$29.99', u'id': 433037, u'link': u'https://www.wine.com/product/clos-du-val-merlot-2002/83430', u'imageUrl': u'https://spoonacular.com/productImages/433037-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                With a sharp knife, make four slits in the top of each roast and insert garlic cloves into slits.                                                                                            In a Dutch oven over medium-high heat, brown roast on all sides in oil; drain. Rub soup mix over meat. Add water; cover and bake at 325\xb0 for 2-1/2 to 3 hours or until tender.                                                                                            Remove meat from cooking liquid; cool meat. Cover and refrigerate overnight. Skim fat from cooking liquid; refrigerate in a covered container.                                                                                            Slice beef 1/4 in. thick, set aside. Pour cooking liquid into a large measuring cup. If needed, add enough water or beef broth to measure 3 cups.                                                                                            In a Dutch oven, combine au jus mix and reserved cooking liquid until smooth. Cook and stir over medium until mixture comes to a boil. Reduce heat; add sliced beef and reheat on low for 15-20 minutes.                                        Yield: 18-20 servings.                                                                                                     Tip: Reheat in an electric roaster or slow cooker.                                                                                                Originally published as Roast Beef with Onion Au Jus in  Down the Aisle Country-Style2000, p32                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/roast-beef-with-onion-au-jus-430314', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 195, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}