{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/413678-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 413678, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana Cream Parfait', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 78.88, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 medium ripe bananas, sliced', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'ripe', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1/2 cup graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10018617, u'unit': u'cup'}, {u'originalString': u'1 package (3-1/2 ounces) instant banana pudding mix', u'aisle': u'Baking', u'name': u'instant lemon pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 19332, u'unit': u'ounces'}, {u'originalString': u'4 maraschino cherries, optional', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9328, u'unit': u''}, {u'originalString': u'2 cups cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'Whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/banana-cream-parfait', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare pudding according to package directions, using the 2 cups cold milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Sprinkle 1 tablespoon graham cracker crumbs into each of four parfait or dessert glasses. Top crumbs with 1/4 cup prepared pudding and half of the banana slices. Repeat layers of crumbs, pudding and banana slices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Garnish each dessert with whipped cream and a cherry if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Parfait. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Directions                                                                                Prepare pudding according to package directions, using the 2 cups cold milk.                                                                                            Sprinkle 1 tablespoon graham cracker crumbs into each of four parfait or dessert glasses. Top crumbs with 1/4 cup prepared pudding and half of the banana slices. Repeat layers of crumbs, pudding and banana slices.                                                                                            Garnish each dessert with whipped cream and a cherry if desired.                                        Yield: 4 servings.                                                                                                                         Originally published as Banana Cream Parfait in  Country WomanJanuary/February 1991, p37                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 263 calories, 5 g fat (3 g saturated fat), 17 mg cholesterol, 471 mg sodium, 50 g carbohydrate, 2 g fiber, 5 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-cream-parfait-413678', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}