{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/712775-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 712775, u'veryPopular': False, u'lowFodmap': False, u'title': u'Walnut and chocolate cake to celebrate', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 117.71, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'Breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 18079, u'unit': u'servings'}, {u'originalString': u'Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'20 g of candied citrus', u'aisle': u'Nuts', u'name': u'candied nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'liquid', u'id': 10093785, u'unit': u'g'}, {u'originalString': u'140 g of dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'140 g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'140 g of shelled walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 12155, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://en.julskitchen.com/dessert/cakes/walnut-and-chocolate-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pellegrino Artusi suggests to paste walnuts and sugar in a mortar until fine. I took the short cut and added walnuts and sugar in a blender to obtain finely chopped walnuts, resembling a coarse flour. You don't want to have a smooth paste.Scoop walnut and sugar in a bowl and add the finely grated chocolate.Crack the eggs open and add the yolks to the bowl, stirring to combine.Whip the egg whites until stiff peaks form, then gently fold them into the walnuts.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the finely chopped citrus.Butter a 26 cm round baking tin and sprinkle with breadcrumbs, then scrape the batter into the tin.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake at 180C for about 30 minutes, until golden brown and set.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let it cool down completely before slicing. If you are strong enough to wait to the next day, it will be even better.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 300, u'instructions': u"Pellegrino Artusi suggests to paste walnuts and sugar in a mortar until fine. I took the short cut and added walnuts and sugar in a blender to obtain finely chopped walnuts, resembling a coarse flour. You don't want to have a smooth paste.Scoop walnut and sugar in a bowl and add the finely grated chocolate.Crack the eggs open and add the yolks to the bowl, stirring to combine.Whip the egg whites until stiff peaks form, then gently fold them into the walnuts. Add the finely chopped citrus.Butter a 26 cm round baking tin and sprinkle with breadcrumbs, then scrape the batter into the tin.Bake at 180C for about 30 minutes, until golden brown and set.Let it cool down completely before slicing. If you are strong enough to wait to the next day, it will be even better.", u'spoonacularSourceUrl': u'https://spoonacular.com/walnut-and-chocolate-cake-to-celebrate-712775', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}