{u'recipes': [{u'sourceName': u'This Gal Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542716-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 542716, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blackberry Mojito', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 159.72, u'creditText': u'This Gal Cooks', u'extendedIngredients': [{u'originalString': u'2 tbsp fresh blackberry juice (I pressed the blackberries through a strainer to get the juice)', u'aisle': u'Beverages', u'name': u'blackberry juice', u'metaInformation': [u'fresh', u'pressed', u'(I the blackberries through a strainer to get the juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberry-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014623, u'unit': u'tbsp'}, {u'originalString': u'Club soda', u'aisle': u'Beverages', u'name': u'club soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'servings'}, {u'originalString': u'2 tbsp fresh mint leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'\xbd lime, quartered', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'4 oz rum', u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'oz'}, {u'originalString': u'2 mojito glasses or 2 tall glasses', u'aisle': u'?', u'name': u'tall glasses', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.thisgalcooks.com/2013/07/12/blackberry-mojito/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place 1 tbsp mint leaves into each mojito glass.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Pour 1 tbsp of the blackberry juice into each glass.Squeeze a little of 2 lime quarters into each glass. Then drop the lime quarters into the glasses.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberry-juice.jpg', u'id': 10014623, u'name': u'blackberry juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Pour 1 tbsp sugar into each glass. Press with a muddler.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add 2 oz of rum to each glass.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u"Add ice to each glass until it is \xbe full.Top off with club soda, shake (I used the glass and a cup since I don't have a fancy mixer) and then add the mixture back to the glasses.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 83, u'instructions': u"Place 1 tbsp mint leaves into each mojito glass.Pour 1 tbsp of the blackberry juice into each glass.Squeeze a little of 2 lime quarters into each glass. Then drop the lime quarters into the glasses.Pour 1 tbsp sugar into each glass. Press with a muddler.Add 2 oz of rum to each glass.Add ice to each glass until it is \xbe full.Top off with club soda, shake (I used the glass and a cup since I don't have a fancy mixer) and then add the mixture back to the glasses.", u'spoonacularSourceUrl': u'https://spoonacular.com/blackberry-mojito-542716', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}