{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/463493-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 463493, u'veryPopular': False, u'lowFodmap': False, u'title': u'Orange-Glazed Cornish Hens', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 426.66, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/2 cup Madeira wine,sherry or chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'4 Cornish game hens (20 to 24 ounces each)', u'aisle': u'Meat', u'name': u'cornish game hens', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/quail.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 80.0, u'consistency': u'solid', u'id': 5307, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground mustard', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/orange-glazed-cornish-hens-2', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 43, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Tie legs of each hen together; turn wing tips under backs.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Place on a greased rack in a roasting pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Brush with butter; sprinkle with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a saucepan, combine the remaining ingredients; bring to a boil. Reduce heat; simmer, uncovered, for 15 minutes. Spoon over hens.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake 15 minutes longer or until a meat thermometer reads 180\xb0.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 36, u'instructions': u'Directions                                                                                Tie legs of each hen together; turn wing tips under backs. Place on a greased rack in a roasting pan. Brush with butter; sprinkle with salt and pepper. Bake, uncovered, at 350\xb0 for 1 hour.                                                                                           In a saucepan, combine the remaining ingredients; bring to a boil. Reduce heat; simmer, uncovered, for 15 minutes. Spoon over hens. Bake 15 minutes longer or until a meat thermometer reads 180\xb0.                                        Yield: 4 servings.                                                                                                                         Originally published as Orange-Glazed Cornish Hens in  Quick CookingNovember/December 2001, p27                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1/2 each) equals 682 calories, 40 g fat (15 g saturated fat), 235 mg cholesterol, 819 mg sodium, 36 g carbohydrate, trace fiber, 35 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/orange-glazed-cornish-hens-463493', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}