{u'recipes': [{u'sourceName': u'SippitySup', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/254899-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 254899, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spiced Chickpea Stew with Feta Toasts', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 169.59, u'creditText': u'SippitySup', u'extendedIngredients': [{u'originalString': u'2 can (15 oz each) chickpeas, dreained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 16058, u'unit': u'oz'}, {u'originalString': u'2 cup diced canned tomatoes, with juice', u'aisle': u'Canned and Jarred', u'name': u'canned diced tomatoes', u'metaInformation': [u'diced', u'with juice', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11531, u'unit': u'cup'}, {u'originalString': u'0.125 teaspoon caraway seeds', u'aisle': u'Spices and Seasonings', u'name': u'caraway seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2005, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon coriander seeds', u'aisle': u'Spices and Seasonings', u'name': u'coriander seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2013, u'unit': u'teaspoon'}, {u'originalString': u'4 ounce feta cheese, crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1019, u'unit': u'ounce'}, {u'originalString': u'3 clove garlic cloves, peeled and minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 cup low sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'\xbd tablespoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon crushed red-pepper flakes, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'crushed', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 cup jarred roasted red peppers, drained and roughly chopped', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'red', u'jarred', u'drained', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11916, u'unit': u'cup'}, {u'originalString': u'6 slice rustic bread or baguette', u'aisle': u'Bakery/Bread', u'name': u'rustic bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slice', u'amount': 6.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slice'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.sippitysup.com/recipe/spiced-chickpea-stew-with-feta-toasts/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Using a mortar and pestle , crush garlic, chiles, coriander, salt, and caraway to form a rough paste full of cracked seeds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'id': 2005, u'name': u'caraway seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in a saucepan over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add garlic mixture, and cook until just softened, about 3 minutes.Stir in half of the chickpeas, tomatoes, roasted red peppers, and stock. Cover the pot and simmer over very low heat, stirring often, for 45 minutes.', u'length': {u'number': 48, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11916, u'name': u'roasted red peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Let cool slightly.Meanwhile lightly toast the bread slices in a 350 degree oven for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the toast from the oven and turn the broiler on to get hot. In a small bowl mix together the chopped tomatoes, oregano and feta.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add a drizzle of very good olive oil. Heap about 1 \xbd tablespoons on top of each toast and place them on a baking sheet.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Put the toasts under the broiler for a few moments until they begin to bubble and get brown.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Remove the toasts from broiler. Set aside.Using an immersion blender process the cooled tomato and chickpea mixture to a slightly chunky puree.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the rest of the chick peas. Return the pan to the stove and reheat. Divide the stew among bowls, and serve with the tomato and feta toasts on the side.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are my top picks for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. The Anderra Cabernet Sauvignon with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'Aromatic bouquet of spices and ripe red berries, such as black and red currants. On the palate, ripe, vibrant fruit, full body and smooth tannins.', u'title': u'Anderra Cabernet Sauvignon', u'price': u'$12.99', u'id': 466210, u'link': u'https://www.wine.com/product/anderra-cabernet-sauvignon-2012/124362', u'imageUrl': u'https://spoonacular.com/productImages/466210-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Using a mortar and pestle , crush garlic, chiles, coriander, salt, and caraway to form a rough paste full of cracked seeds.Heat oil in a saucepan over medium-high heat. Add garlic mixture, and cook until just softened, about 3 minutes.Stir in half of the chickpeas, tomatoes, roasted red peppers, and stock. Cover the pot and simmer over very low heat, stirring often, for 45 minutes. Let cool slightly.Meanwhile lightly toast the bread slices in a 350 degree oven for about 5 minutes. Remove the toast from the oven and turn the broiler on to get hot. In a small bowl mix together the chopped tomatoes, oregano and feta. Add a drizzle of very good olive oil. Heap about 1 \xbd tablespoons on top of each toast and place them on a baking sheet. Put the toasts under the broiler for a few moments until they begin to bubble and get brown. Remove the toasts from broiler. Set aside.Using an immersion blender process the cooled tomato and chickpea mixture to a slightly chunky puree. Add the rest of the chick peas. Return the pan to the stove and reheat. Divide the stew among bowls, and serve with the tomato and feta toasts on the side.Share this:ShareGoogleTwitterPinterestFacebookLike this:Like Loading...', u'spoonacularSourceUrl': u'https://spoonacular.com/spiced-chickpea-stew-with-feta-toasts-254899', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}