{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/211609-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 211609, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey, Brie & cranberry Wellington', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 364.91, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'85g fresh breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'200g brie, sliced', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1006, u'unit': u'g'}, {u'originalString': u'2 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 sausages, skins removed', u'aisle': u'Meat', u'name': u'sausages', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1017063, u'unit': u''}, {u'originalString': u'100g gammon, chopped', u'aisle': u'Meat', u'name': u'gammon steak', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-steak.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 10149, u'unit': u'g'}, {u'originalString': u'1 leek, finely sliced', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'2 x 500g blocks all-butter puff pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18337, u'unit': u''}, {u'originalString': u'5 sage leaves, chopped', u'aisle': u'Spices and Seasonings', u'name': u'sage leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'2 turkey breasts', u'aisle': u'Meat', u'name': u'turkey breasts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5696, u'unit': u''}, {u'originalString': u'4-5 tbsp cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 9081, u'unit': u'tbsp'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2830673/turkey-brie-and-cranberry-wellington', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the filling, trim your turkey breasts:you want to create a long tube of meat inthe middle of your Wellington, similar inshape to a fillet of beef – you can use thetrimmings in the stuffing, so don’t worryabout wastage. Once you have the correctshape, slice a pocket into the breasts deepenough so that the Brie and cranberrysauce will stay inside, but don’t cut all theway through. Divide the cranberry sauceand Brie between the 2 turkey breasts,then chill while you make the stuffing.For the stuffing, heat the butter in a fryingpan and gently cook the leek for about5 mins. Meanwhile, finely chop the turkeytrimmings and add to the pan with thegammon. Cook for about 5 mins, thenremove and allow to cool slightly.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'id': 5696, u'name': u'turkey breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Mixwith the sausagemeat, sage andbreadcrumbs, then season.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [], u'step': u'Roll out the first block of pastry on afloured surface to about \xa31 thickness:you want a long thin shape that is about5cm wider than turkey breast width and5cm longer than length of turkey breastsplaced end to end. Gently lift this onto abaking sheet and put the turkey breasts ontop, followed by the stuffing.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'id': 5696, u'name': u'turkey breast'}]}, {u'equipment': [], u'step': u'Roll out thesecond block of pastry, brush the edge ofthe bottom sheet with egg and lay the topone over. Trim edges to neaten, thencrimp together. Can be made up to 1 dayin advance and chilled.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Brushthe Wellington with more beaten egg and,with a sharp knife, score a criss-crosspattern, but don’t cut all the way through.Cook for 30 mins, then cover with foil andcook for 30-45 mins more. After 1 hr, checkthat the middle is hot by inserting a skewerfor 5 secs – it should feel hot to the touch.Leave to rest for 15 mins, then slice to serve.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 124, u'instructions': u'For the filling, trim your turkey breasts:you want to create a long tube of meat inthe middle of your Wellington, similar inshape to a fillet of beef – you can use thetrimmings in the stuffing, so don’t worryabout wastage. Once you have the correctshape, slice a pocket into the breasts deepenough so that the Brie and cranberrysauce will stay inside, but don’t cut all theway through. Divide the cranberry sauceand Brie between the 2 turkey breasts,then chill while you make the stuffing.For the stuffing, heat the butter in a fryingpan and gently cook the leek for about5 mins. Meanwhile, finely chop the turkeytrimmings and add to the pan with thegammon. Cook for about 5 mins, thenremove and allow to cool slightly. Mixwith the sausagemeat, sage andbreadcrumbs, then season.Roll out the first block of pastry on afloured surface to about \xa31 thickness:you want a long thin shape that is about5cm wider than turkey breast width and5cm longer than length of turkey breastsplaced end to end. Gently lift this onto abaking sheet and put the turkey breasts ontop, followed by the stuffing. Roll out thesecond block of pastry, brush the edge ofthe bottom sheet with egg and lay the topone over. Trim edges to neaten, thencrimp together. Can be made up to 1 dayin advance and chilled.Heat oven to 200C/180C fan/gas 6. Brushthe Wellington with more beaten egg and,with a sharp knife, score a criss-crosspattern, but don’t cut all the way through.Cook for 30 mins, then cover with foil andcook for 30-45 mins more. After 1 hr, checkthat the middle is hot by inserting a skewerfor 5 secs – it should feel hot to the touch.Leave to rest for 15 mins, then slice to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-brie-cranberry-wellington-211609', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}