{u'recipes': [{u'sourceName': u'Well Plated', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/720584-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 720584, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Chicken Bacon Pasta with Peas', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 303.45, u'creditText': u'Well Plated', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons chopped fresh parsley, plus additional for serving', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups fresh or frozen and thawed peas', u'aisle': u'Produce', u'name': u'fresh peas', u'metaInformation': [u'fresh', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cups'}, {u'originalString': u'3 cloves minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/4 cups half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Italian seasoning (or heaping 1/4 teaspoon each dried basil, dried oregano, and dried rosemary or thyme)', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'dried', u'italian', u'(or 1/4 teaspoon each basil, oregano, and rosemary or thyme)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon kosher salt, plus additional for cooking the pasta', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'for cooking the pasta'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces DeLallo Organic Whole Wheat Orecchiette', u'aisle': u'Pasta and Rice', u'name': u'orecchiette', u'metaInformation': [u'whole wheat', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orecchiette.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10820420, u'unit': u'ounces'}, {u'originalString': u'1/2 cup freshly grated Parmesan cheese, plus additional for serving', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 cup freshly grated part skim Mozzarella cheese', u'aisle': u'Cheese', u'name': u'part skim mozzarella cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1 pound boneless, skinless chicken breasts, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'4 strips thick cut bacon, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick cut', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.wellplated.com/chicken-bacon-pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Cook the pasta in a large pot of salted boiling water until al dente, according to package instructions. Reserve 1 cup of the pasta cooking liquid, then drain and set aside.Meanwhile, in a large panwith high sides or a Dutch oven,cook the bacon over medium low heat, stirring occasionally, until browned and crispy, about 8minutes.With a slotted spoon, carefully remove the bacon to a plateand with a paper towel and lightly pat dry. Discard all but 1 tablespoon bacon grease from the panand return to heat.Increase the heat to medium high, add the chicken pieces, thensprinkle with the Italian seasoning, salt, and pepper.Saut the chicken until cooked through, about 6 minutes, then add the minced garlic and cook until fragrant, about 30 seconds.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove the chicken to the plate with the bacon, then return the panto the heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the half and half to the panand bring it to a gentle boil over medium high, stirring often. Watch the pan carefully. As soon as the half and half barely begins to boil, reduce the heat to low and add the Mozzarella and 1/2 cup Parmesancheese. Cook and stir the sauce until it thickens and the cheese melts, about 1-2 minutes. Stir in the pasta, bacon, chicken, peas, and parsley.Cook 30 additional seconds to warmthrough. If thesauce seems too thick, add a bit of the reserved pasta water to loosen it. Enjoy warm, topped withadditional Parmesan cheese and parsley.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 89, u'instructions': u'Cook the pasta in a large pot of salted boiling water until al dente, according to package instructions. Reserve 1 cup of the pasta cooking liquid, then drain and set aside.Meanwhile, in a large panwith high sides or a Dutch oven,cook the bacon over medium low heat, stirring occasionally, until browned and crispy, about 8minutes.With a slotted spoon, carefully remove the bacon to a plateand with a paper towel and lightly pat dry. Discard all but 1 tablespoon bacon grease from the panand return to heat.Increase the heat to medium high, add the chicken pieces, thensprinkle with the Italian seasoning, salt, and pepper.Saut the chicken until cooked through, about 6 minutes, then add the minced garlic and cook until fragrant, about 30 seconds. Remove the chicken to the plate with the bacon, then return the panto the heat.Add the half and half to the panand bring it to a gentle boil over medium high, stirring often. Watch the pan carefully. As soon as the half and half barely begins to boil, reduce the heat to low and add the Mozzarella and 1/2 cup Parmesancheese. Cook and stir the sauce until it thickens and the cheese melts, about 1-2 minutes. Stir in the pasta, bacon, chicken, peas, and parsley.Cook 30 additional seconds to warmthrough. If thesauce seems too thick, add a bit of the reserved pasta water to loosen it. Enjoy warm, topped withadditional Parmesan cheese and parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-bacon-pasta-with-peas-720584', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}