{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/564981-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 564981, u'veryPopular': False, u'lowFodmap': False, u'title': u'Seafood Spaghetti', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 202.04, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'40 grams butter cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'chilli flakes to taste', u'aisle': u'Spices and Seasonings', u'name': u'chilli flakes', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'servings'}, {u'originalString': u'250 grams clams (such as lala, asari, manila)', u'aisle': u'Seafood', u'name': u'clams', u'metaInformation': [u'(such as lala, asari, manila)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 15157, u'unit': u'grams'}, {u'originalString': u'1 tsp dried chopped parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'tsp'}, {u'originalString': u'1-2 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'5 cloves garlic sliced thinly', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 tbsp garlic powder optional', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tbsp'}, {u'originalString': u'6 large prawns shells (leaving tail end) & veins removed', u'aisle': u'Seafood', u'name': u'prawns', u'metaInformation': [u'large', u'(leaving tail end)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'salt & freshly cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'6 large scallops', u'aisle': u'Seafood', u'name': u'scallops', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10015172, u'unit': u''}, {u'originalString': u'120 grams spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 120.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'grams'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.noobcook.com/seafood-spaghetti/2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Scrub the clams thoroughly with a hard bristles brush. Soak the clams in salted water for at least an hour for the clams to purge out sand and impurities.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Drain the water, rinse the clams and set aside.Arrange washed clams, prawns and scallops to occupy one layer of a wide oven-safe baking dish. Season with salt, black pepper and garlic powder. Scatter butter and sliced garlic over the seafood.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bake in pre-heated oven of 200\xb0C (392\xb0F) for 15 minutes. Discard any clams that remain closed after cooking.While baking, cook spaghetti in a pot of salted boiling water.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [], u'step': u'Drain cooked pasta and reserve a cup of pasta water.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add cooked spaghetti to the seafood casserole.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Mix well and season to taste with salt, pepper, parsley and chilli. If the pasta is too dry, add some pasta water to help bind the ingredients together.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drizzle some extra virgin olive oil as a finishing touch before serving.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 55, u'instructions': u'Scrub the clams thoroughly with a hard bristles brush. Soak the clams in salted water for at least an hour for the clams to purge out sand and impurities. Drain the water, rinse the clams and set aside.Arrange washed clams, prawns and scallops to occupy one layer of a wide oven-safe baking dish. Season with salt, black pepper and garlic powder. Scatter butter and sliced garlic over the seafood.Bake in pre-heated oven of 200\xb0C (392\xb0F) for 15 minutes. Discard any clams that remain closed after cooking.While baking, cook spaghetti in a pot of salted boiling water. Drain cooked pasta and reserve a cup of pasta water.Add cooked spaghetti to the seafood casserole. Mix well and season to taste with salt, pepper, parsley and chilli. If the pasta is too dry, add some pasta water to help bind the ingredients together. Drizzle some extra virgin olive oil as a finishing touch before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/seafood-spaghetti-564981', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}