{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/524913-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 524913, u'veryPopular': True, u'lowFodmap': False, u'title': u'White Chicken Quinoa Chili', u'diets': [u'gluten free'], u'pricePerServing': 359.57, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'3 cups (or 2 cans, drained + rinsed) cannellini beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cannellini beans', u'metaInformation': [u'rinsed', u'drained', u'(or 2 cans, + )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10716050, u'unit': u'cups'}, {u'originalString': u'blue corn chips for crushing on top', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u'blue', u'for crushing on top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19003, u'unit': u'servings'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 1/4 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'lime wedges for serving', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1 quart low-sodium chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'solid', u'id': 1006970, u'unit': u'quart'}, {u'originalString': u'4 ounces monterey jack cheese, freshly grated + mroe for topping', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'freshly grated', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup cooked quinoa (I used red quinoa to add a little color)', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'red', u'cooked', u'(I used quinoa to add a little color)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'1 red pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound boneless, skinless chicken thighs, cooked and shredded', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'shredded', u'boneless', u'skinless', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5096, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'1 sweet onion, diced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.howsweeteats.com/2013/10/white-chicken-quinoa-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large pot over medium-low heat and add olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add in the onion, peppers and garlic and cook until softened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add in the cumin, paprika, salt and pepper and stir.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add the in shredded chicken, beans and chicken stock. Increase the heat and bring the mixture to a boil. Reduce to a simmer and cook for 15 minutes. Stir in the quinoa, half and half and grated cheese, stirring well until the cheese is melted. Reduce the heat to low and cook for another 5 to 10 minutes. Taste and season additionally if desired.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [], u'step': u'Serve with extra cheese, chips and lime wedges.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Codorniu Anna de Codorniu Cava Brut ros\xe9. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u"This Cava combines glamour, innovation and modernity with the experience and history of what is probably Codorniu's most iconic offering, Anna de Codorniu. Elegance and subtlety, which to a large extent come from a blend with approximately 70% of the most prestigious varietal for making rose cavas: Pinot Noir. Delicate cherry color with strawberry tones. Fine and persistent bubbles. Aromas of red fruit, strawberries, cherries and woodland fruits with hints of green apple. Elegant and light on the palate. Well balanced between acid and sweetness with a refreshing finish.", u'title': u'Codorniu Anna de Codorniu Cava Brut Rose', u'price': u'$12.99', u'id': 451641, u'link': u'https://www.wine.com/product/codorniu-anna-de-codorniu-cava-brut-rose/109416', u'imageUrl': u'https://spoonacular.com/productImages/451641-312x231.jpg'}]}, u'aggregateLikes': 2176, u'instructions': u'Heat a large pot over medium-low heat and add olive oil. Add in the onion, peppers and garlic and cook until softened, about 5 minutes. Add in the cumin, paprika, salt and pepper and stir. Add the in shredded chicken, beans and chicken stock. Increase the heat and bring the mixture to a boil. Reduce to a simmer and cook for 15 minutes. Stir in the quinoa, half and half and grated cheese, stirring well until the cheese is melted. Reduce the heat to low and cook for another 5 to 10 minutes. Taste and season additionally if desired. Serve with extra cheese, chips and lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chicken-quinoa-chili-524913', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}