{u'recipes': [{u'sourceName': u'Minimalist Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619385-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 619385, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bourbon Pumpkin Milkshakes', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 58.37, u'creditText': u'Minimalist Baker', u'extendedIngredients': [{u'originalString': u'3\xad-4 Tbsp unsweetened almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 Tbsp bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 10014037, u'unit': u'Tbsp'}, {u'originalString': u'4 \xad-5 scoops Vegan Pumpkin Ice Cream', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 19095, u'unit': u''}, {u'originalString': u'1/2 tsp each pumpkin pie spice + ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp pure vanilla extract (optional)', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'Coconut whipped cream (for topping | optional)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'coconut cream', u'metaInformation': [u'(for topping | optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12115, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://minimalistbaker.com/bourbon-pumpkin-milkshakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add all ingredients except the coconut whipped cream to a blender and blend until creamy and smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add more almond milk to thin, and more ice cream to thicken. Taste and adjust flavors as needed.Divide between 2 small glasses and top with coconut whipped cream and additional pumpkin pie spice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Add all ingredients except the coconut whipped cream to a blender and blend until creamy and smooth. Add more almond milk to thin, and more ice cream to thicken. Taste and adjust flavors as needed.Divide between 2 small glasses and top with coconut whipped cream and additional pumpkin pie spice.', u'spoonacularSourceUrl': u'https://spoonacular.com/bourbon-pumpkin-milkshakes-619385', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}