{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532832-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532832, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blackberry & Tequila Glazed Chicken Sandwiches', u'diets': [], u'pricePerServing': 363.04, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'1/2 cup fresh blackberries (frozen works just as well)', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'fresh', u'frozen', u'well', u'( works just as )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9042, u'unit': u'cup'}, {u'originalString': u'1/2 cup blackberry jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'blackberry jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberry-jam.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10419297, u'unit': u'cup'}, {u'originalString': u'2 Tbsp. extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tbsp'}, {u'originalString': u'4-8 slices of fontina or havarti cheese', u'aisle': u'Cheese', u'name': u'havarti cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taleggio-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 93838, u'unit': u'slices'}, {u'originalString': u'1 tsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'4 tsp. mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tsp'}, {u'originalString': u'4 pretzel rolls (or whatever sandwich/burger buns you have on hand!)', u'aisle': u'Bakery/Bread', u'name': u'pretzel rolls', u'metaInformation': [u'(or whatever sandwich/burger buns you have on hand!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 99156, u'unit': u''}, {u'originalString': u'4-8 pieces of romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'pieces'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u"2/3 cup tequila (I've been using Familia Camarena all week, and YUM)", u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [u"(I've been using Familia Camarena all week, and YUM)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 10814037, u'unit': u'cup'}, {u'originalString': u'1 large tomato, sliced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/blackberry-tequila-glazed-chicken-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 375 degrees. (You could also do this on a grill)Pound out your chicken breasts so that they have a larger surface area and are uniform in thickness. I like to put the chicken breasts in a plastic bag and hit them repeatedly with a heavy skillet (you can also use plastic wrap or wax paper and a mallet, but I like to think of pounding out chicken with a skillet as “anger management.” Hah). Pound the chicken out until it is about 1/2? thick.Slice each chicken breast in half so you have four equally-sized (ish) pieces.In a large, ovenproof skillet, heat olive oil over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add blackberries, salt, and pepper and cook until berries have begun to break down, about a minute.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add blackberry jam to skillet and stir until the jam has heated up and formed a thick, syrup-y liquid.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberry-jam.jpg', u'id': 10419297, u'name': u'blackberry jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add tequila to the skillet to deglaze and stir to combine. Stir in lemon juice and bring sauce to a simmer. Simmer for 5-7 minutes, until sauce has begun to reduce.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 10814037, u'name': u'tequila'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add chicken breast pieces to the pan. Press each piece down into the sauce and spoon some sauce over the top of the chicken as well. Cook for 5-6 minutes, then flip chicken to cook the other side.Spoon a good amount of the glaze over each piece of chicken, then remove skillet from the stovetop heat and place it in the 375 degree oven to finish cooking the chicken.Cook chicken for an additional 8-12 minutes, until it’s cooked through.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven-mitt.jpg', u'id': 404735, u'name': u'oven mitt'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove skillet from the oven WITH AN OVEN MITT and set aside. DO NOT TOUCH THE SKILLET WITH YOUR BARE HANDS RIGHT AFTER YOU TAKE IT OUT OF THE OVEN. Because that HURTS. (Mostly it hurts your hand, but also your ego).Scrape any blackberry seeds off of the surface of the chicken, then place a slice or two of the cheese on top of each piece of chicken while it’s still hot. This will help the cheese melt and get all gooey and yummy.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}, {u'equipment': [], u'step': u'Let the chicken cool for a few moments while you assemble the sandwiches.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 1/2 of each pretzel roll with 1 tsp. of mayonnaise. Top with a piece of cheese-covered chicken, followed by a few tomato and lettuce slices.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-roll.jpg', u'id': 99156, u'name': u'pretzel roll'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Serve immediately and enjoy!', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 346, u'instructions': u'Preheat your oven to 375 degrees. (You could also do this on a grill)Pound out your chicken breasts so that they have a larger surface area and are uniform in thickness. I like to put the chicken breasts in a plastic bag and hit them repeatedly with a heavy skillet (you can also use plastic wrap or wax paper and a mallet, but I like to think of pounding out chicken with a skillet as “anger management.” Hah). Pound the chicken out until it is about 1/2? thick.Slice each chicken breast in half so you have four equally-sized (ish) pieces.In a large, ovenproof skillet, heat olive oil over medium heat. Add blackberries, salt, and pepper and cook until berries have begun to break down, about a minute.Add blackberry jam to skillet and stir until the jam has heated up and formed a thick, syrup-y liquid.Add tequila to the skillet to deglaze and stir to combine. Stir in lemon juice and bring sauce to a simmer. Simmer for 5-7 minutes, until sauce has begun to reduce.Add chicken breast pieces to the pan. Press each piece down into the sauce and spoon some sauce over the top of the chicken as well. Cook for 5-6 minutes, then flip chicken to cook the other side.Spoon a good amount of the glaze over each piece of chicken, then remove skillet from the stovetop heat and place it in the 375 degree oven to finish cooking the chicken.Cook chicken for an additional 8-12 minutes, until it’s cooked through. Remove skillet from the oven WITH AN OVEN MITT and set aside. DO NOT TOUCH THE SKILLET WITH YOUR BARE HANDS RIGHT AFTER YOU TAKE IT OUT OF THE OVEN. Because that HURTS. (Mostly it hurts your hand, but also your ego).Scrape any blackberry seeds off of the surface of the chicken, then place a slice or two of the cheese on top of each piece of chicken while it’s still hot. This will help the cheese melt and get all gooey and yummy.Let the chicken cool for a few moments while you assemble the sandwiches. Spread 1/2 of each pretzel roll with 1 tsp. of mayonnaise. Top with a piece of cheese-covered chicken, followed by a few tomato and lettuce slices. Serve immediately and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/blackberry-tequila-glazed-chicken-sandwiches-532832', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}