{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217898-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 217898, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade chocolate drops', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 60, u'pricePerServing': 326.22, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'a pinch of hot chilli powder', u'aisle': u'Spices and Seasonings', u'name': u'chilli powder', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'pinch'}, {u'originalString': u'200g dark chocolate (we used 70% cocoa content)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'70%', u'(we used cocoa content)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'red edible glitter (we used splatcooking.com)', u'aisle': u'Gourmet', u'name': u'edible gold', u'metaInformation': [u'red', u'(we used splatcooking.com)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 12611111, u'unit': u'servings'}, {u'originalString': u"200g milk chocolate (we used Green & Black's cook's chocolate with extra cocoa butter)", u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [u'green', u'with extra cocoa butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19081, u'unit': u'g'}, {u'originalString': u'25g pistachios, finely chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 12151, u'unit': u'g'}, {u'originalString': u'crystallised rose petals (we used squires-shop.com)', u'aisle': u'Health Foods;Gourmet', u'name': u'rose hips', u'metaInformation': [u'(we used squires-shop.com)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rose-hip.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 35203, u'unit': u'servings'}, {u'originalString': u'an eighth of tsp flaky sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'200g white chocolate', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 19087, u'unit': u'g'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/502631/homemade-chocolate-drops', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the dark chilli drops: break thechocolate into chunks and melt in aheatproof bowl over a pan of barelysimmering water. Meanwhile, line a fewflat baking trays with baking parchment.Once the chocolate has melted, stir inthe chilli powder. Use a teaspoon to drop‘drops’ of the chocolate onto the bakingparchment. Every 10 or 20 drops, scatterover a small amount of red glitter beforethe chocolate sets. Leave to set in a coolplace, but do not put in the fridge.For the salted pistachio drops: melt thechocolate and prepare baking parchmentas before. Once the chocolate has melted,stir in the salt, then make drops as above,topping with chopped pistachios.For the white chocolate drops: carefullymelt the chocolate as above. Make drops,as above. Once they are partially set, topeach with a crystallised rose petal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 126, u'instructions': u'For the dark chilli drops: break thechocolate into chunks and melt in aheatproof bowl over a pan of barelysimmering water. Meanwhile, line a fewflat baking trays with baking parchment.Once the chocolate has melted, stir inthe chilli powder. Use a teaspoon to drop‘drops’ of the chocolate onto the bakingparchment. Every 10 or 20 drops, scatterover a small amount of red glitter beforethe chocolate sets. Leave to set in a coolplace, but do not put in the fridge.For the salted pistachio drops: melt thechocolate and prepare baking parchmentas before. Once the chocolate has melted,stir in the salt, then make drops as above,topping with chopped pistachios.For the white chocolate drops: carefullymelt the chocolate as above. Make drops,as above. Once they are partially set, topeach with a crystallised rose petal.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-chocolate-drops-217898', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}