{u'recipes': [{u'sourceName': u'Low Carb Yum', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/799645-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 799645, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggplant Parmesan Casserole – Gluten Free', u'diets': [u'gluten free'], u'pricePerServing': 353.19, u'creditText': u'Low Carb Yum', u'extendedIngredients': [{u'originalString': u'1/2 cup olive oil or avocado oil', u'aisle': u'Oil, Vinegar, Salad Dressing;Health Foods', u'name': u'avocado oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4581, u'unit': u'cup'}, {u'originalString': u'1/4 cup coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93747, u'unit': u'cup'}, {u'originalString': u'1 tablespoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'tablespoon'}, {u'originalString': u'1 large egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 small eggplant (about 1 pound each)', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11209, u'unit': u'pound'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 (25 ounce jar) marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 25.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'ounce'}, {u'originalString': u'2/3 cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 1/4 cup crushed pork rinds', u'aisle': u'Savory Snacks', u'name': u'pork rinds', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-rinds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 98873, u'unit': u'cup'}, {u'originalString': u'15 ounces ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'ounces'}, {u'originalString': u'16 ounces mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon Italian spice mix', u'aisle': u'Spices and Seasonings', u'name': u'spice mix', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'teaspoon'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://lowcarbyum.com/eggplant-parmesan-casserole-gluten-free/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Peel eggplant and thinly slice lengthwise. Salt pieces and allow to sit in colander for about 30 minutes, then rinse and pat dry.In wide shallow bowl, combine pork rinds, coconut flour, garlic powder, and spice mix.Beat eggs in another shallow bowl.Dip eggplant slices into egg, then into pork rind mixture. Fry in hot oil until browned then drain on paper towels.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93747, u'name': u'coconut flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-rinds.jpg', u'id': 98873, u'name': u'pork rinds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1032027, u'name': u'seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Mix together all of the cheese mix ingredients until well combined.In 9x13-inch casserole dish, layer half the marinara sauce, half the eggplant slices, half the cheese mix, and half the mozzarella. Repeat the layers. Sprinkle additional Parmesan cheese on top, if desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10111549, u'name': u'marinara sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake in preheated 350F oven for 35-45 minutes or until cheese has browned.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Ruffino Riserva Ducale Oro Chianti Classico. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 35 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with garnet hues. The wine expresses a distinctive Tuscan bouquet of violet, cherry, and plum, with aromas of chocolate and spice. Intense aromas of violet, blackberry, cherry, and ripe plum with intriguing notes of cinnamon and clove. Classic elegance and structure in which the fruit, tannins, and spices form a tightly woven balance, with a lingering fi nish of chocolate and coffee.Pairs exquisitely with traditional Italian dishes such as a classic bisteca Fiorentina, pasta Bolognese, wild boar ragu, and eggplant Parmesan. It’s also wonderful with dishes such as grilled ribeye and roasted vegetables.', u'title': u'Ruffino Riserva Ducale Oro Chianti Classico', u'price': u'$34.99', u'id': 442701, u'link': u'https://www.wine.com/product/ruffino-riserva-ducale-oro-chianti-classico-2011/166890', u'imageUrl': u'https://spoonacular.com/productImages/442701-312x231.jpg'}]}, u'aggregateLikes': 97, u'instructions': u'Peel eggplant and thinly slice lengthwise. Salt pieces and allow to sit in colander for about 30 minutes, then rinse and pat dry.In wide shallow bowl, combine pork rinds, coconut flour, garlic powder, and spice mix.Beat eggs in another shallow bowl.Dip eggplant slices into egg, then into pork rind mixture. Fry in hot oil until browned then drain on paper towels.Mix together all of the cheese mix ingredients until well combined.In 9x13-inch casserole dish, layer half the marinara sauce, half the eggplant slices, half the cheese mix, and half the mozzarella. Repeat the layers. Sprinkle additional Parmesan cheese on top, if desired.Bake in preheated 350F oven for 35-45 minutes or until cheese has browned.', u'spoonacularSourceUrl': u'https://spoonacular.com/eggplant-parmesan-casserole-gluten-free-799645', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}