{u'recipes': [{u'sourceName': u'Give Recipe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582304-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 582304, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey Sesame Chicken Wings', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 52.27, u'creditText': u'Give Recipe', u'extendedIngredients': [{u'originalString': u'1 kilo chicken wing pieces', u'aisle': u'Meat', u'name': u'chicken wing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'unitLong': u'kilo', u'unitShort': u'kilo', u'amount': 1.0, u'consistency': u'solid', u'id': 5100, u'unit': u'kilo'}, {u'originalString': u'6 chili peppers, optional', u'aisle': u'Produce;Ethnic Foods;Spices and Seasonings', u'name': u'chili peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-arbol-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11962, u'unit': u''}, {u'originalString': u'1/4 tsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'Fresh rosemary leaves, optional', u'aisle': u'Produce', u'name': u'fresh rosemary leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'leaves'}, {u'originalString': u'1 tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp pomegranate molasses', u'aisle': u'Alcoholic Beverages', u'name': u'pomegranate molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grenadine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10042040, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tbsp sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.giverecipe.com/honey-sesame-chicken-wings.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Wash chicken wings very well and place them in a large skillet. Do not dry the wings.Sprinkle salt on them.Cover the skillet with its lid and cook the wings over medium low heat for 5-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let them release their juice.Turn them over and let the other sides partly cooked when there is still juice inside. Make sure you put the lid back after turning over.Cook until a little juice left.Bring it to the lowest heat and toss in chili peppers and chili powder.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add olive oil over them, cover it and cook turning them over as needed until they are done.Take the lid and drizzle pomegranate molasses and honey over the wings.Toss in sesame seeds and turn them over every now and then until all wings are coated with the sticky pomegranate&honey sauce and sesame seeds.As a final touch, throw some fresh rosemary leaves into the skillet and take it from heat.You can serve it with a little extra honey.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2063, u'name': u'fresh rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 10042040, u'name': u'pomegranate molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken Wings. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Wash chicken wings very well and place them in a large skillet. Do not dry the wings.Sprinkle salt on them.Cover the skillet with its lid and cook the wings over medium low heat for 5-7 minutes. Let them release their juice.Turn them over and let the other sides partly cooked when there is still juice inside. Make sure you put the lid back after turning over.Cook until a little juice left.Bring it to the lowest heat and toss in chili peppers and chili powder.Add olive oil over them, cover it and cook turning them over as needed until they are done.Take the lid and drizzle pomegranate molasses and honey over the wings.Toss in sesame seeds and turn them over every now and then until all wings are coated with the sticky pomegranate&honey sauce and sesame seeds.As a final touch, throw some fresh rosemary leaves into the skillet and take it from heat.You can serve it with a little extra honey.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-sesame-chicken-wings-582304', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}