{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/377513-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 377513, u'veryPopular': True, u'lowFodmap': False, u'title': u'Snowmen Cookies', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 56.58, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 package (16 ounces) Nutter Butter cookies', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1001, u'unit': u'ounces'}, {u'originalString': u'1-1/4 pounds white candy coating, melted', u'aisle': u'Baking', u'name': u'candy coating', u'metaInformation': [u'white', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 98857, u'unit': u'pounds'}, {u'originalString': u'Miniature chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'servings'}, {u'originalString': u"M&M's minis", u'aisle': u'Sweet Snacks', u'name': u'mnm minis', u'metaInformation': [], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'consistency': u'solid', u'id': 19157, u'unit': u'servings'}, {u'originalString': u'Pretzel sticks, halved', u'aisle': u'Savory Snacks', u'name': u'pretzel sticks', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-sticks.jpg', u'unitLong': u'stick', u'unitShort': u'sticks', u'amount': 1.0, u'consistency': u'solid', u'id': 10119047, u'unit': u'sticks'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/snowmen-cookies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Using tongs, dip cookies in candy coating; allow excess to drip off.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}]}, {u'equipment': [], u'step': u'Place on waxed paper.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place two chocolate chips on one end of cookies for eyes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}]}, {u'equipment': [], u'step': u"Place M&M's down middle for buttons.", u'number': 4, u'ingredients': [{u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'id': 19157, u'name': u'm&ms'}]}, {u'equipment': [], u'step': u'For arms, dip ends of two pretzel stick halves into coating; attach one to each side.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}, {u'equipment': [], u'step': u'Let stand until set. Pipe nose and scarf with gel or frosting.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1022, u'instructions': u"Directions                                                                                Using tongs, dip cookies in candy coating; allow excess to drip off. Place on waxed paper. Place two chocolate chips on one end of cookies for eyes. Place M&M's down middle for buttons.                                                                                            For arms, dip ends of two pretzel stick halves into coating; attach one to each side. Let stand until set. Pipe nose and scarf with gel or frosting.                                        Yield: 32 cookies.                                                                                                                         Originally published as Snowmen Cookies in  Taste of Home's Holiday & Celebrations CookbookAnnual 2001, p121                                                                                                                                                                                                       Nutritional Facts                                                                             1 serving (1 each) equals 180 calories, 9 g fat (6 g saturated fat), trace cholesterol, 67 mg sodium, 23 g carbohydrate, 1 g fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/snowmen-cookies-377513', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}