{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219986-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 219986, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom, shallot & squash pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 50, u'pricePerServing': 334.5, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 butternut squash, peeled, deseeded and diced', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'diced', u'peeled', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'25g dried porcini mushrooms', u'aisle': u'Produce;Ethnic Foods', u'name': u'dried porcini mushrooms', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/porcini-mushrooms-dried.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 10011268, u'unit': u'g'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'250g fresh mushrooms (such as Portobello or chestnut), sliced', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced', u'(such as Portobello or chestnut)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11260, u'unit': u'g'}, {u'originalString': u'2 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'500g pack puff pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 18337, u'unit': u'g'}, {u'originalString': u'2 tsp finely chopped rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'2 tsp finely chopped sage', u'aisle': u'Produce', u'name': u'sage', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2038, u'unit': u'tsp'}, {u'originalString': u'600g shallots, halved', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'solid', u'id': 11677, u'unit': u'g'}, {u'originalString': u'500ml vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/853636/mushroom-shallot-and-squash-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Soak the dried mushrooms in 250mlboiling water. Meanwhile, soften theshallots in the olive oil and a third ofthe butter for 10 mins.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the squashand cook for a further 10 mins untilsoftening, then add the garlic and herbsand cook for 2 mins more. Set aside.In another pan, fry the freshmushrooms in another third of butteruntil softened. Strain the porcini,reserving the soaking liquid, thenroughly chop and add to the cookedmushrooms. Fry for 2 mins, then removefrom the pan and set aside.Melt the remaining butter in the samepan, stir in the flour for 2 mins, thengradually stir in the stock and mushroomsoaking liquid. Bring to the boil, stirring,and cook for 2-3 mins until thickened.', u'length': {u'number': 19, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Combine the sauce with all the veg,then transfer the mixture to a 2-litrerectangular pie dish and cool.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Roll out the pastry on a floured surfaceuntil big enough to cover the pie dish.Cover the pie, trimming the excesspastry, then wrap well in cling film.Will freeze for up to 2 months.To cook, defrost the pie thoroughly inthe fridge overnight if frozen.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Heat ovento 200C/180C fan/gas 6, glaze the pastrywith a little egg and bake for 30-40 minsor until golden and hot through.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 82, u'instructions': u'Soak the dried mushrooms in 250mlboiling water. Meanwhile, soften theshallots in the olive oil and a third ofthe butter for 10 mins. Add the squashand cook for a further 10 mins untilsoftening, then add the garlic and herbsand cook for 2 mins more. Set aside.In another pan, fry the freshmushrooms in another third of butteruntil softened. Strain the porcini,reserving the soaking liquid, thenroughly chop and add to the cookedmushrooms. Fry for 2 mins, then removefrom the pan and set aside.Melt the remaining butter in the samepan, stir in the flour for 2 mins, thengradually stir in the stock and mushroomsoaking liquid. Bring to the boil, stirring,and cook for 2-3 mins until thickened.Combine the sauce with all the veg,then transfer the mixture to a 2-litrerectangular pie dish and cool.Roll out the pastry on a floured surfaceuntil big enough to cover the pie dish.Cover the pie, trimming the excesspastry, then wrap well in cling film.Will freeze for up to 2 months.To cook, defrost the pie thoroughly inthe fridge overnight if frozen. Heat ovento 200C/180C fan/gas 6, glaze the pastrywith a little egg and bake for 30-40 minsor until golden and hot through.', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-shallot-squash-pie-219986', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}