{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 626177, u'veryPopular': False, u'lowFodmap': False, u'title': u'Loaded Twice Baked Potatoes', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 166.16, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'3 Slices of bacon, cooked and crumbled', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'Slices', u'unitShort': u'Slices', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'Slices'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'Shredded Colby Jack Cheese', u'aisle': u'Cheese', u'name': u'colby jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1011, u'unit': u'lb'}, {u'originalString': u'2 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'garlic seasoning with parsley', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'with parsley'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'servings'}, {u'originalString': u'Sea Salt or Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'3 Russet Potatoes', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2015/01/loaded-twice-baked-potatoes-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Roll each potato in a drizzle of olive oil and then in the salt to coat entirely.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the potatoes in the oven on tin foil and bake for 40-50 minutes', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Allow to cool then slice open lengthwise and remove most of the white flesh into a bowl. See note if you do this on separate days.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Add the butter and cream cheese and using a potato masher begin mashing the insides.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add seasoning and mash until smooth, adding more butter if necessary. Spoon back into each potato skin and top with cheese and bacon.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place into a baking dish and bake until the cheese is melted, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 31, u'instructions': u'Preheat the oven to 400 degrees.Roll each potato in a drizzle of olive oil and then in the salt to coat entirely.Place the potatoes in the oven on tin foil and bake for 40-50 minutesAllow to cool then slice open lengthwise and remove most of the white flesh into a bowl. See note if you do this on separate days. Add the butter and cream cheese and using a potato masher begin mashing the insides. Add seasoning and mash until smooth, adding more butter if necessary. Spoon back into each potato skin and top with cheese and bacon. Place into a baking dish and bake until the cheese is melted, about 10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/loaded-twice-baked-potatoes-626177', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}