{u'recipes': [{u'sourceName': u'101 Cooking for Two', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/574062-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 574062, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey Paprika Grill Skinless Boneless Chicken Breast', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 122.69, u'creditText': u'101 Cooking for Two', u'extendedIngredients': [{u'originalString': u'1/4 t black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u't'}, {u'originalString': u'1/8 t cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002014, u'unit': u't'}, {u'originalString': u'1 t garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u't'}, {u'originalString': u'1 t honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u't'}, {u'originalString': u'1 t paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u't'}, {u'originalString': u'Wet Rub', u'aisle': u'Spices and Seasonings', u'name': u'rub', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012034, u'unit': u'servings'}, {u'originalString': u'1/2 t salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u't'}, {u'originalString': u'2 Trimmed skinless boneless chicken breast', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 t vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u't'}, {u'originalString': u'1 t ReaLemon', u'aisle': u'?', u'name': u'realemon', u'metaInformation': [], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u't'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.101cookingfortwo.com/honey-paprika-grill-skinless-boneless/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Put a large hand full of hickory chips in an open container on the grill (optional). Then preheat on high for 10 minutes. Clean and oil grates.2) Trim chicken breasts, pat dry.3)', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Mix ingredients for wet rub and brush on all sides of breast.4) Decrease heat to medium.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'id': 1012034, u'name': u'dry seasoning rub'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place smooth side down. Flip every 5-6 minutes and if any wet rub is left, bush on after the first two flips. Grill for 25-30 minutes until internal temp of 165.5)', u'length': {u'number': 36, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'id': 1012034, u'name': u'dry seasoning rub'}]}, {u'equipment': [], u'step': u'Let rest for 5 minutes before serving.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Boneless Skinless Chicken Breast. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try District 7 Estate Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'1) Put a large hand full of hickory chips in an open container on the grill (optional). Then preheat on high for 10 minutes. Clean and oil grates.2) Trim chicken breasts, pat dry.3) Mix ingredients for wet rub and brush on all sides of breast.4) Decrease heat to medium. Place smooth side down. Flip every 5-6 minutes and if any wet rub is left, bush on after the first two flips. Grill for 25-30 minutes until internal temp of 165.5) Let rest for 5 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-paprika-grill-skinless-boneless-chicken-breast-574062', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}