{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/247932-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 247932, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peppermint Candy Cane Popcorn', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 3, u'pricePerServing': 132.92, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'1/3 cup peppermint candy cane, crushed', u'aisle': u'Sweet Snacks', u'name': u'candy cane', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93759, u'unit': u'cup'}, {u'originalString': u'1/4 cup popcorn kernels or 1 bag popcorn, popped', u'aisle': u'Savory Snacks', u'name': u'popcorn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 25002, u'unit': u'cup'}, {u'originalString': u'6 ounces white chocolate, melted', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19087, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.closetcooking.com/2012/12/peppermint-candy-cane-popcorn.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Mix the popcorn, crushed candy cane and melted chocolate until well combined, spread the mixture out on a baking sheet and let sit until the chocolate has set. (Tip: Chill in the fridge if you want the chocolate to set faster.)Break any large clumps up and enjoy!', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 93759, u'name': u'candy cane'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Korbel Organic Brut with a 4.3 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'#73 Wine Spectator Top 100 of 2016Korbel Brut – Made with Organically Grown Grapes is created in the classic Korbel style, crisp, delicate and bright. We always strive to present the pure flavors of the grape in all of our champagnes. The organically grown grapes in this cuvee deliver well-integrated aromas and flavors of apple, pear and white peaches. The finish is medium dry, with a slight savory note at the end.', u'title': u'Korbel Organic Brut', u'price': u'$12.98', u'id': 443895, u'link': u'https://www.wine.com/product/korbel-organic-brut/105310', u'imageUrl': u'https://spoonacular.com/productImages/443895-312x231.jpg'}]}, u'aggregateLikes': 3812, u'instructions': u'Mix the popcorn, crushed candy cane and melted chocolate until well combined, spread the mixture out on a baking sheet and let sit until the chocolate has set. (Tip: Chill in the fridge if you want the chocolate to set faster.)Break any large clumps up and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-candy-cane-popcorn-247932', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}