{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/249561-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 249561, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dairy-Free Carrot Cake With Lemon Glaze', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 993.68, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1/8 tsp. allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'3/4 tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'3/4 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 tsp. cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'4-5 cups confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'3/4 cups dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019334, u'unit': u'cups'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 lb. carrots, peeled and grated by hand or in a food processor', u'aisle': u'Baking', u'name': u'food dye', u'metaInformation': [u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'lb'}, {u'originalString': u'1/2 tsp. ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'3/4 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/4 cup freshly squeezed lemon juice (or more or less to taste)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed', u'to taste', u'( or less )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1/4 tsp. nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 cup raisins (can be half dark and half golden)', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'dark', u'(can be half and half golden)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1 tsp. pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped walnuts (optional)', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups neutral salad oil, such as Crisco [read label for soy-free]', u'aisle': u'?', u'name': u'salad oil', u'metaInformation': [u' such as crisco [read label for soy-free]', u'neutral'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/dairy-free-desserts/carrot-cake-with-lemon-glaze-soy-free', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Coat two, 8-inch round cake pans with nonstick spray. Line them with parchment paper and coat paper with nonstick spray.Preheat oven to 350\xb0.Sift the flour, baking powder, baking soda and spices; set aside.In the bowl of an electric mixer, beat the eggs, both sugars and vanilla using the whisk attachment. Beat at medium speed for 3 minutes.Lower the speed and slowly add the oil, beating continuously. The egg mixture will become thicker as the oil is added. Continue to beat for another 5 minutes.On the lowest speed, add the flour mixture in fourths.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix well, then by hand, fold in the carrots, raisins and walnuts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Place in the prepared pans and bake 15 minutes. Rotate the pans and bake for 5 more minutes, or until cakes have risen and are golden-brown, firm to the touch, and a cake tester comes out clean from the center.Cool the cakes on a wire rack. Turn them out onto a plate or cake circle; coat the center of one cake with lemon glaze.Top with the second cake layer, and allow the remaining glaze to coat the top and run down the sides.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the juice with the sugar and stir well to combine smoothly. If the glaze seems too runny, add a bit more sugar.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Carrot Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Coat two, 8-inch round cake pans with nonstick spray. Line them with parchment paper and coat paper with nonstick spray.Preheat oven to 350\xb0.Sift the flour, baking powder, baking soda and spices; set aside.In the bowl of an electric mixer, beat the eggs, both sugars and vanilla using the whisk attachment. Beat at medium speed for 3 minutes.Lower the speed and slowly add the oil, beating continuously. The egg mixture will become thicker as the oil is added. Continue to beat for another 5 minutes.On the lowest speed, add the flour mixture in fourths. Mix well, then by hand, fold in the carrots, raisins and walnuts.Place in the prepared pans and bake 15 minutes. Rotate the pans and bake for 5 more minutes, or until cakes have risen and are golden-brown, firm to the touch, and a cake tester comes out clean from the center.Cool the cakes on a wire rack. Turn them out onto a plate or cake circle; coat the center of one cake with lemon glaze.Top with the second cake layer, and allow the remaining glaze to coat the top and run down the sides.Mix the juice with the sugar and stir well to combine smoothly. If the glaze seems too runny, add a bit more sugar.', u'spoonacularSourceUrl': u'https://spoonacular.com/dairy-free-carrot-cake-with-lemon-glaze-249561', u'dishTypes': [u'dessert'], u'occasions': [u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}