{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/559244-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 559244, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lighter Chicken Parmigiana', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 284.38, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'1 tsp dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'tsp'}, {u'originalString': u'1 egg, whisked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'fresh basil for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'1 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 cup Panko breadcrumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup light mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'light', u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'4 small chicken breasts, boneless, skinless', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'2 cups tomato basil sauce, or your favorite tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11549, u'unit': u'cups'}, {u'originalString': u'\xbd lb whole grain whole wheat pasta, cooked according to package instructions', u'aisle': u'Pasta and Rice', u'name': u'whole grain rice pasta', u'metaInformation': [u'whole wheat', u'whole', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-rice-vermicelli.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 99038, u'unit': u'lb'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.jocooks.com/healthy-eating/lighter-chicken-parmigiana/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 F degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the Panko breadcrumbs to a bowl and mix it with the dried basil, oregano and salt and pepper. Dip the chicken in the egg wash then into the breadcrumbs mixture. Lightly brush some oil onto a baking dish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2003, u'name': u'dried basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the chicken in the baking dish and bake in the oven for 30 minutes.In another baking dish spoon half the sauce over the bottom of the dish.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place baked chicken pieces over the sauce and spoon remainder of sauce over the chicken. Sprinkle with mozzarella cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake covered with aluminum foil for another 15 minutes or until cheese melts, then remove foil and bake for another 5 minutes until the cheese is lightly golden.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve chicken over the cooked penne and garnish with fresh basil.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Barbera Wine, Chianti, and Montepulciano are great choices for Chicken Parmesan. When chicken is paired with tomato sauce and cheese, it can handle a light or medium bodied red wine. Since this is an Italian-American dish, we went for Italian wines. The Olof Cellars Barbera with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'barbera wine', u'chianti', u'montepulciano'], u'productMatches': [{u'description': u'Big berry and cherry aromas with notes of Cardamom. The bright acidity makes this a perfect food wine.', u'title': u'Olof Cellars Barbera', u'price': u'$20.0', u'id': 430085, u'link': u'https://www.amazon.com/2009-Olof-Cellars-Barbera-750/dp/B00BQKAGCU', u'imageUrl': u'https://spoonacular.com/productImages/430085-312x231.jpg'}]}, u'aggregateLikes': 528, u'instructions': u'Preheat oven to 400 F degrees.Add the Panko breadcrumbs to a bowl and mix it with the dried basil, oregano and salt and pepper. Dip the chicken in the egg wash then into the breadcrumbs mixture. Lightly brush some oil onto a baking dish. Place the chicken in the baking dish and bake in the oven for 30 minutes.In another baking dish spoon half the sauce over the bottom of the dish. Place baked chicken pieces over the sauce and spoon remainder of sauce over the chicken. Sprinkle with mozzarella cheese.Bake covered with aluminum foil for another 15 minutes or until cheese melts, then remove foil and bake for another 5 minutes until the cheese is lightly golden.Serve chicken over the cooked penne and garnish with fresh basil.', u'spoonacularSourceUrl': u'https://spoonacular.com/lighter-chicken-parmigiana-559244', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}