{u'recipes': [{u'sourceName': u'Love & Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446554-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 446554, u'veryPopular': True, u'lowFodmap': False, u'title': u'Soup au Pistou', u'diets': [u'gluten free'], u'pricePerServing': 802.81, u'creditText': u'Love & Lemons', u'extendedIngredients': [{u'originalString': u'4 cups veggie broth', u'aisle': u'Canned and Jarred', u'name': u'broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cups'}, {u'originalString': u'1 can diced tomatoes, liquid drained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'can'}, {u'originalString': u'1 can white beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned white beans', u'metaInformation': [u'white', u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 16051, u'unit': u'can'}, {u'originalString': u'\xbd cup chopped carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'4 or so large chard leaves, chopped, stems included', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11147, u'unit': u''}, {u'originalString': u'3 pinches coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinches'}, {u'originalString': u'\xbc cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'3 tablespoons torn fennel fronds', u'aisle': u'Produce', u'name': u'fennel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11957, u'unit': u'tablespoons'}, {u'originalString': u'\xbd fennel bulb', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'about 2 cups fresh herbs (I used basil and tarragon)', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'(I used basil and tarragon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'cups'}, {u'originalString': u'\xbd clove of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2-3 cloves of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'4 teaspoons dried herbs de provence*', u'aisle': u'Produce;Spices and Seasonings', u'name': u'herbs', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1002044, u'unit': u'teaspoons'}, {u'originalString': u'generous squeezes of lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'lemon zest from \xbd a lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbd onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'generous grating of parmesan (3 spoonfuls of nutritional yeast, if vegan)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u''}, {u'originalString': u'parmesan cheese, if you wish', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'\xbd cup chopped parsnips', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11298, u'unit': u'cup'}, {u'originalString': u'salt, pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.loveandlemons.com/2013/04/18/soup-au-pistou/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat olive oil in a large pot over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion, salt and pepper. Sweat the onion until translucent.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the fennel and garlic, a pinch more salt, and continue cooking, stirring occasionally, for another few minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the parsnips, carrots and herbs de provence and another pinch of salt. Continue cooking for 8 or so more minutes. Deglaze the pan with the white wine, stirring to get any bits off the bottom of the pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1002044, u'name': u'herbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Let the wine reduce for another few minutes.Stir in tomatoes, broth and beans. Reduce heat and let it simmer until the root vegetables are tender. 20-30 or so minutes.While you wait, make the pistou. Coarsely chop the herbs, then grind all ingredients in a mortar and pestle. (or pulse everything in a food processor). Taste and adjust. (hint - wait and taste it with a spoonful of the soup before adjusting).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1002044, u'name': u'herbs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chopped chard leaves, macaroni noodles and fennel fronds, and continue to simmer until the noodles are cooked. About 10 more minutes.Taste and adjust seasonings. Finish with generous squeezes of lemon, grated parmesan cheese, and a spoonful of pistou, per bowl.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Serve with crusty bread.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2315, u'instructions': u'Heat olive oil in a large pot over medium heat. Add onion, salt and pepper. Sweat the onion until translucent. Add the fennel and garlic, a pinch more salt, and continue cooking, stirring occasionally, for another few minutes.Add the parsnips, carrots and herbs de provence and another pinch of salt. Continue cooking for 8 or so more minutes. Deglaze the pan with the white wine, stirring to get any bits off the bottom of the pan. Let the wine reduce for another few minutes.Stir in tomatoes, broth and beans. Reduce heat and let it simmer until the root vegetables are tender. 20-30 or so minutes.While you wait, make the pistou. Coarsely chop the herbs, then grind all ingredients in a mortar and pestle. (or pulse everything in a food processor). Taste and adjust. (hint - wait and taste it with a spoonful of the soup before adjusting).Add the chopped chard leaves, macaroni noodles and fennel fronds, and continue to simmer until the noodles are cooked. About 10 more minutes.Taste and adjust seasonings. Finish with generous squeezes of lemon, grated parmesan cheese, and a spoonful of pistou, per bowl. Serve with crusty bread.', u'spoonacularSourceUrl': u'https://spoonacular.com/soup-au-pistou-446554', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}