{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/762340-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 762340, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sicilian Pasta Salad', u'diets': [u'pescatarian'], u'pricePerServing': 136.8, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'2 cups fresh green beans, trimmed and cut into 1-inch lengths', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'fresh', u'green', u'trimmed', u'cut into 1-inch lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11052, u'unit': u'cups'}, {u'originalString': u'12-oz. jar marinated artichoke hearts with liquid', u'aisle': u'Canned and Jarred', u'name': u'marinated artichoke hearts', u'metaInformation': [u'with liquid'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 93828, u'unit': u'oz'}, {u'originalString': u'\xbc cup oil-packed, sun-dried tomatoes, drained and thinly sliced', u'aisle': u'Canned and Jarred', u'name': u'oil packed tuna', u'metaInformation': [u'drained', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 15119, u'unit': u'cup'}, {u'originalString': u'1 Tbs. chopped fresh oregano or 1 tsp. dried', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried', u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'Tbs'}, {u'originalString': u'6 oz. part-skim mozzarella cheese,preferably fresh, diced', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'fresh', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1028, u'unit': u'oz'}, {u'originalString': u'8 oz. pasta shells or rotini (pasta twists)', u'aisle': u'Pasta and Rice', u'name': u'pasta shells', u'metaInformation': [u'(pasta twists)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shell-pasta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11020420, u'unit': u'oz'}, {u'originalString': u'1 to 2 Tbs. red wine vinegar to taste', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'Tbs'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Salt and black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 medium yellow summer squash, halved lengthwise and sliced \xbc inch thick', u'aisle': u'Produce', u'name': u'yellow summer squash', u'metaInformation': [u'yellow', u'thick', u'medium', u'halved lengthwise', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/sicilian-pasta-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring large pot of water to a boil. When water boils add 1 teaspoon salt and pasta, stirring to prevent sticking. Cook, stirring occasionally, until al dente, about 10 to 15 minutes.Meanwhile, steam green beans and squash separately until each is just tender. Rinse under cold running water and drain well.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain pasta, rinse under cold running water and drain well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to large serving bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add green beans, squash, artichokes with liquid, tomatoes, vinegar, oregano, cheese, salt and pepper. Toss to mix and coat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [], u'step': u'Serve at room temperature.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 68, u'instructions': u'Bring large pot of water to a boil. When water boils add 1 teaspoon salt and pasta, stirring to prevent sticking. Cook, stirring occasionally, until al dente, about 10 to 15 minutes.Meanwhile, steam green beans and squash separately until each is just tender. Rinse under cold running water and drain well.Drain pasta, rinse under cold running water and drain well. Transfer to large serving bowl. Add green beans, squash, artichokes with liquid, tomatoes, vinegar, oregano, cheese, salt and pepper. Toss to mix and coat. Serve at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/sicilian-pasta-salad-762340', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}