{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/440453-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 440453, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Shredded Beef', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 92.4, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 pound lean beef chuck, trimmed and cut into 1 inch cubes', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'lean', u'trimmed', u'cut into 1 inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pound'}, {u'originalString': u'1 (16 ounce) can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Spicy-Shredded-Beef/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large skillet. Brown beef cubes for 10 to 12 minutes. Reduce the heat, add the garlic, salt and cumin. Cook another 15 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the can of tomatoes and heat to a boil. Reduce heat to simmer, cover and cook for 1 1/2 to 2 hours.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add water to the skillet as needed to keep the mixture from boiling dry.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'When cooked very tender, cool, then shred the meat using 2 forks.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place back on heat and stir until most of the liquid has evaporated.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'If planning to freeze, cool  before packing in freezer bags and placing in freezer.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'For soft burritos, top a warm flour tortilla with the meat mixture, salsa, and grated cheese.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 192, u'instructions': u'Heat the oil in a large skillet. Brown beef cubes for 10 to 12 minutes. Reduce the heat, add the garlic, salt and cumin. Cook another 15 minutes.                            Add the can of tomatoes and heat to a boil. Reduce heat to simmer, cover and cook for 1 1/2 to 2 hours. Add water to the skillet as needed to keep the mixture from boiling dry.                            When cooked very tender, cool, then shred the meat using 2 forks. Place back on heat and stir until most of the liquid has evaporated.                            If planning to freeze, cool  before packing in freezer bags and placing in freezer.                            For soft burritos, top a warm flour tortilla with the meat mixture, salsa, and grated cheese.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-shredded-beef-440453', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}