{u'recipes': [{u'sourceName': u'Eat Live Travel Write', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/569307-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 569307, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican white bean mash', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 720, u'pricePerServing': 98.58, u'creditText': u'Eat Live Travel Write', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'crumbled feta and cilantro, to serve', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1019, u'unit': u'servings'}, {u'originalString': u'1 tablespoon fresh cilantro, roughly chopped', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons oregano powder', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon fresh oregano leaves, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 shallots, minced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'water (or chicken stock) as needed', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'as needed', u'(or chicken stock)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}, {u'originalString': u'1lb (454g) dried white (navy) beans', u'aisle': u'Pasta and Rice;Canned and Jarred;Produce', u'name': u'white beans', u'metaInformation': [u'dried', u'white', u'(navy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 454.0, u'consistency': u'solid', u'id': 10516050, u'unit': u'g'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.eatlivetravelwrite.com/2011/04/kitchen-bootcamp-white-bean-mash/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse the beans well in cold water.Soak the beans overnight.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain and rinse the beans.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the beans in the stock or water combined with the oregano powder and bay leaf (there should be a couple of inches more water than beans)and simmer, uncovered, for about 60-90 minutes or until the beans are tender enough to mash against the side of the pot with a wooden spoon.  Most of the water should have evaporated.  If you have more than about \xbc cup, drain the excess.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove the bay leaf and remove beans from heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}], u'step': u'Add the minced shallots, garlic, cumin, cilantro and oregano and, using an immersion blender, mash until the mixture is as smooth or as lumpy as you like it.  I like to keep it a bit lumpy - prefer the rustic look.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u"Mix the olive oil into the beans. This is not a creamy mixture - it's more dry - so if you are serving it a few days later a drop of olive oil should be mixed in to moisten it a little.Sprinkle with a little crumbled feta and cilantro and serve as you wish - with breakfast scrambled eggs, with tortilla chips as a dip, in a quesadilla…. The possibilities are endless!", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}], u'name': u''}], u'aggregateLikes': 25, u'instructions': u"Rinse the beans well in cold water.Soak the beans overnight.Drain and rinse the beans.Place the beans in the stock or water combined with the oregano powder and bay leaf (there should be a couple of inches more water than beans)and simmer, uncovered, for about 60-90 minutes or until the beans are tender enough to mash against the side of the pot with a wooden spoon.  Most of the water should have evaporated.  If you have more than about \xbc cup, drain the excess.  Remove the bay leaf and remove beans from heat.Add the minced shallots, garlic, cumin, cilantro and oregano and, using an immersion blender, mash until the mixture is as smooth or as lumpy as you like it.  I like to keep it a bit lumpy - prefer the rustic look.Mix the olive oil into the beans. This is not a creamy mixture - it's more dry - so if you are serving it a few days later a drop of olive oil should be mixed in to moisten it a little.Sprinkle with a little crumbled feta and cilantro and serve as you wish - with breakfast scrambled eggs, with tortilla chips as a dip, in a quesadilla…. The possibilities are endless!", u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-white-bean-mash-569307', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 720, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}