{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615537-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 390, u'id': 615537, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crock Pot Cheesy Meatball Tortellini', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 800.8, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'2 (14.5 oz) cans diced Basil, Garlic & Oregano tomatoes, undrained', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'diced', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 2044, u'unit': u'oz'}, {u'originalString': u'1 (12 oz) package frozen cheese tortellini', u'aisle': u'Refrigerated', u'name': u'cheese tortellini', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10093727, u'unit': u'oz'}, {u'originalString': u'1 c. chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'c'}, {u'originalString': u'4 oz cream cheese, cubed', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 (24 oz) jar marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'oz'}, {u'originalString': u'1 lb Casa meatballs, frozen', u'aisle': u'Meat', u'name': u'meatballs', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10110219, u'unit': u'lb'}, {u'originalString': u'2 c. shredded pizza cheese', u'aisle': u'Cheese', u'name': u'pizza cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93651, u'unit': u'c'}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/2014/10/crock-pot-cheesy-meatball-tortellini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In slow cooker combine marinara, diced tomatoes, chicken broth and cream cheese. Stir in meatballs.Cook on low for 6-8 hours. Stirring a few times throughout cooking time if able too. Stir in tortellini and pizza cheese. Cover and cook on high for 1/2 hour or until tortellini is warmed through.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 93651, u'name': u'italian cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 255, u'instructions': u'In slow cooker combine marinara, diced tomatoes, chicken broth and cream cheese. Stir in meatballs.Cook on low for 6-8 hours. Stirring a few times throughout cooking time if able too. Stir in tortellini and pizza cheese. Cover and cook on high for 1/2 hour or until tortellini is warmed through.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-cheesy-meatball-tortellini-615537', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 400, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}