{u'recipes': [{u'sourceName': u'A Dash of Compassion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551785-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 551785, u'veryPopular': True, u'lowFodmap': False, u'title': u'Raw blueberry cheesecake with crumb topping', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 414.87, u'creditText': u'A Dash of Compassion', u'extendedIngredients': [{u'originalString': u'1/4 cup raw agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'2 cups raw almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cups'}, {u'originalString': u'3 cups blueberries, picked over and rinsed', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'picked over', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cups'}, {u'originalString': u'3 cups cashews, soaked overnight', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cups'}, {u'originalString': u'1/4 cup shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'1 tbsp coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'15 dates, soaked for 1 hour', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'for 1 hour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 9087, u'unit': u''}, {u'originalString': u'juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 tsp dried lavender (optional)', u'aisle': u'Gourmet', u'name': u'lavender', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93811, u'unit': u'tsp'}, {u'originalString': u'1/4 cup oat groats', u'aisle': u'Cereal;Baking', u'name': u'oat bran', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bran.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20033, u'unit': u'cup'}, {u'originalString': u'pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 tbsp lecithin granules', u'aisle': u'Health Foods', u'name': u'soy lecithin granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-lecithin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 98965, u'unit': u'tbsp'}, {u'originalString': u'seeds of 1 vanilla bean (or 1 tsp vanilla extract)', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'1/8 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/2 cup walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.adashofcompassion.com/2010/09/real-raw-food/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Process the almonds in a food processor until they become a course meal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}], u'step': u'Add the rest of the ingredients and process to combine. The mixture should stick together when pressed between your fingers. Press the crust into the bottom of an 8-inch springform pan and place in the freezer to firm up.Rinse cashews and dates and blend them in a food processor.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [], u'step': u'Add the rest of the ingredients, except the coconut oil and lecithin granules, and blend until smooth. Finally, add the coconut oil and lecithin granules and blend to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Pour onto prepared crust and place in the freezer.Chop the walnuts and dates briefly in a food processor.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [], u'step': u'Add the rest of the ingredients and pulse lightly to combine. Crumble the topping evenly onto the cheesecake filling, pressing gently. Keep the cheesecake in the freezer until ready to serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 6174, u'instructions': u'Process the almonds in a food processor until they become a course meal. Add the rest of the ingredients and process to combine. The mixture should stick together when pressed between your fingers. Press the crust into the bottom of an 8-inch springform pan and place in the freezer to firm up.Rinse cashews and dates and blend them in a food processor. Add the rest of the ingredients, except the coconut oil and lecithin granules, and blend until smooth. Finally, add the coconut oil and lecithin granules and blend to combine. Pour onto prepared crust and place in the freezer.Chop the walnuts and dates briefly in a food processor. Add the rest of the ingredients and pulse lightly to combine. Crumble the topping evenly onto the cheesecake filling, pressing gently. Keep the cheesecake in the freezer until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/raw-blueberry-cheesecake-with-crumb-topping-551785', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}