{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/513902-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 513902, u'veryPopular': True, u'lowFodmap': True, u'title': u'Spicy Spinach Quesadillas', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 285.16, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'6 oz. baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'pinch of kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'8 oz. pepper jack cheese, grated', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1025, u'unit': u'oz'}, {u'originalString': u'fresh spicy salsa or pico de gallo', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pico de gallo', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pico-de-gallo.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 27027, u'unit': u'servings'}, {u'originalString': u'diced or shredded cooked chicken, optional', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'diced', u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'servings'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://wearychef.com/spicy-spinach-quesadillas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat \xbc c. water in a large skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add spinach, sprinkle with salt, and cover. Cook for approximately 5 minutes, stirring occasionally, until spinach is wilted.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain spinach in a colander, rinse with cold water, and squeeze out excess water. Set aside.Rinse and dry the same skillet. Spray the skillet with cooking spray, and heat over medium-high heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place 1-2 tortillas (as many as will fit in an even layer) in the hot skillet, and evenly spread a thin layer of cheese over the surface. Separate cooked spinach leaves and spread over the cheese.When cheese is mostly melted, scoop up about a tablespoon of salsa, draining as much liquid off as possible, and drop it onto half the open tortilla. Optionally add chicken to half the tortilla too. Carefully fold the side of the tortilla that does not have salsa on it over the top, creating a half-circle shape. Cook about one minute longer before removing to a plate. Repeat with remaining tortillas.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Quesadilla works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Argyle Reserve Pinot Noir with a 4.3 out of 5 star rating seems like a good match. It costs about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 10381, u'instructions': u'Heat \xbc c. water in a large skillet over medium heat. Add spinach, sprinkle with salt, and cover. Cook for approximately 5 minutes, stirring occasionally, until spinach is wilted.Drain spinach in a colander, rinse with cold water, and squeeze out excess water. Set aside.Rinse and dry the same skillet. Spray the skillet with cooking spray, and heat over medium-high heat. Place 1-2 tortillas (as many as will fit in an even layer) in the hot skillet, and evenly spread a thin layer of cheese over the surface. Separate cooked spinach leaves and spread over the cheese.When cheese is mostly melted, scoop up about a tablespoon of salsa, draining as much liquid off as possible, and drop it onto half the open tortilla. Optionally add chicken to half the tortilla too. Carefully fold the side of the tortilla that does not have salsa on it over the top, creating a half-circle shape. Cook about one minute longer before removing to a plate. Repeat with remaining tortillas.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-spinach-quesadillas-513902', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}