{u'recipes': [{u'sourceName': u'Cinnamon Spice and Everything Nice', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/492455-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 492455, u'veryPopular': False, u'lowFodmap': False, u'title': u'Poppy Seed Pasta Salad', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 25, u'pricePerServing': 229.4, u'creditText': u'Cinnamon Spice and Everything Nice', u'extendedIngredients': [{u'originalString': u'1/3 cup sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'12 ounces canned salmon, drained and flaked', u'aisle': u'Canned and Jarred;Seafood', u'name': u'canned salmon', u'metaInformation': [u'canned', u'flaked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 15260, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'1 cup grape tomatoes, if large cut in half', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'large', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'1 cup purple grapes, cut in half', u'aisle': u'Produce', u'name': u'grapes', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-grapes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cup'}, {u'originalString': u'1/3 cup green bell pepper, diced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon sea or Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'zest of 1 orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'8 ounces rotini or gemelli pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'ounces'}, {u'originalString': u'2 peaches or apples, peeled, diced', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'fresh cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 tablespoon poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'tablespoon'}, {u'originalString': u'5 scallions, diced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.cinnamonspiceandeverythingnice.com/poppy-seed-pasta-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Cook pasta to al dente according to package directions. Meanwhile, add the rest of the salad ingredients to a large mixing bowl. In a small bowl whisk together all the dressing ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Drain pasta and rinse with cold water until cooled.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add to bowl along with dressing and toss well. Taste and season with additional salt and pepper if needed. Chill for an hour or longer. Toss again before serving.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'aggregateLikes': 132, u'instructions': u'Cook pasta to al dente according to package directions. Meanwhile, add the rest of the salad ingredients to a large mixing bowl. In a small bowl whisk together all the dressing ingredients.Drain pasta and rinse with cold water until cooled. Add to bowl along with dressing and toss well. Taste and season with additional salt and pepper if needed. Chill for an hour or longer. Toss again before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/poppy-seed-pasta-salad-492455', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}