{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604481-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 604481, u'veryPopular': False, u'lowFodmap': True, u'title': u'Ice Cream Bon Bons', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 117.16, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'8 Tbsp coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tbsp'}, {u'originalString': u'ice cream, any flavor you like', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}, {u'originalString': u'8 oz semi sweet chocolate (chips or squares)', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'sweet', u'(chips or squares)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2014/07/ice-cream-bon-bons.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put a baking sheet in the freezer to get it cold.  Then use a small 1 1/2 inch ice cream scoop to scoop out 12 scoops of ice cream and place them on the cold tray.  Work quickly and then put the tray back in the freezer.To make the chocolate coating, put the chocolate in a smallish, deep bowl or measuring cup.  If you are using bar chocolate, cut it up in small pieces first.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add the coconut oil and microwave it for one minute.  Stir well.  If the chocolate is not completely melted, put it back in the microwave for 15 seconds.  Stir again until the chocolate is completely smooth.  Set aside to allow it to cool to room temperature.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u"Remove the ice cream from the freezer.  Dip each scoop into the chocolate using a fork to hold the ice cream, and a spoon to help cover it completely.  Tap off any excess and lay the bon bon back on the tray.  Immediately add the sprinkles, before the chocolate hardens.  Continue with the rest of the scoops.  You may have to work in shifts so that the ice cream doesn't melt.  You can freeze a another plate and transfer a few scoops at a time to the plate if you like.Store the bon bons in the freezer in a plastic or glass food storage container, or in freezer baggies, until ready to  eat.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Vanillan Ice Cream. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 102, u'instructions': u"Put a baking sheet in the freezer to get it cold.  Then use a small 1 1/2 inch ice cream scoop to scoop out 12 scoops of ice cream and place them on the cold tray.  Work quickly and then put the tray back in the freezer.To make the chocolate coating, put the chocolate in a smallish, deep bowl or measuring cup.  If you are using bar chocolate, cut it up in small pieces first.  Add the coconut oil and microwave it for one minute.  Stir well.  If the chocolate is not completely melted, put it back in the microwave for 15 seconds.  Stir again until the chocolate is completely smooth.  Set aside to allow it to cool to room temperature.Remove the ice cream from the freezer.  Dip each scoop into the chocolate using a fork to hold the ice cream, and a spoon to help cover it completely.  Tap off any excess and lay the bon bon back on the tray.  Immediately add the sprinkles, before the chocolate hardens.  Continue with the rest of the scoops.  You may have to work in shifts so that the ice cream doesn't melt.  You can freeze a another plate and transfer a few scoops at a time to the plate if you like.Store the bon bons in the freezer in a plastic or glass food storage container, or in freezer baggies, until ready to  eat.", u'spoonacularSourceUrl': u'https://spoonacular.com/ice-cream-bon-bons-604481', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}