{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201158-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201158, u'veryPopular': True, u'lowFodmap': False, u'title': u'A Better Big Mac', u'diets': [u'dairy free'], u'pricePerServing': 286.48, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 slice American cheese', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slice'}, {u'originalString': u'3.2 ounces boneless beef short rib, well-chilled', u'aisle': u'Meat', u'name': u'beef short ribs', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-short-ribs.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.2, u'consistency': u'liquid', u'id': 10013147, u'unit': u'ounces'}, {u'originalString': u'4 dill pickle slices', u'aisle': u'Canned and Jarred', u'name': u'dill pickle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10011937, u'unit': u'slices'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'1 whole Wonderbread brand hamburger bun, plus 1 bottom bun', u'aisle': u'Bakery/Bread', u'name': u'hamburger bun', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1/4 cup shredded iceberg lettuce', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11252, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'serving'}, {u'originalString': u'1 1/2 tablespoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup finely minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 teaspoon onion grated on a microplane grater', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon marmite, vegemite, or Maggi seasoning', u'name': u'seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1042027, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons sesame seeds (about 600)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'( 600)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons sweet pickle relish', u'aisle': u'Condiments', u'name': u'sweet pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11945, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon yellow mustard', u'aisle': u'Condiments', u'name': u'yellow mustard', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'teaspoon'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/05/a-better-big-mac-mcdonalds-burger-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-grinder.jpg', u'id': 404700, u'name': u'meat grinder'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pass beef through meat grinder fitted with 1/4-inch plate twice. Form into two even balls and flatten into 4-inch patties using wet hands against a cutting board. Scrape patties up with thin spatula and place on a sheet of parchment paper. Refrigerate until ready to use.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place minced onion on a double layer of paper towels on a microwave-safe plate and microwave for 10 minutes on low power until mostly dehydrated but not browned. Set aside.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'While onion is dehydrating, combine grated onion, mayonnaise, relish, mustard, sugar, Marmite, and turmeric. Stir to combine and refrigerate until ready to use.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'4', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat toaster oven or broiler to high. Use one finger to spread a very thin layer of egg white over the top of the top bun. Sprinkle with sesame seeds and place under broiler for 30 seconds until set. Set aside. Use a sharp, thin knife to cut off the very bottom of the bottom bun half, creating a single circular piece of bread with cut surfaces on both sides.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'5', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Toast cut side of top bun and bottom bun, and one side of center bun piece under broiler until light golden brown.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Place bottom bun and center bun on cutting board toasted-side up.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Spread half of sauce on each. Divide dehydrated onions evenly between bottom and center buns and top with lettuce.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Place 2 pickle slices on each.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'id': 11937, u'name': u'pickles'}]}, {u'equipment': [], u'step': u'6', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Season burger patties with salt and pepper.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a heavy-bottomed 10-inch stainless steel or cast iron skillet over high heat until lightly smoking.', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add patties and cook without moving until first side is crusty and browned, about 1 minute. Scrape up patties with a stiff spatula and flip. Top one patty with 1 slice cheese. Continue cooking until cooked through, about 1 minute longer.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer cheese-topped patty to bottom bun and cheeseless patty to middle bun.', u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'Place top bun on top of center, then stack center bun on top of bottom.', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 20, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 615, u'instructions': u'Procedures                                                                              1                                                                            Pass beef through meat grinder fitted with 1/4-inch plate twice. Form into two even balls and flatten into 4-inch patties using wet hands against a cutting board. Scrape patties up with thin spatula and place on a sheet of parchment paper. Refrigerate until ready to use.                                                                                                                            2                                                                            Place minced onion on a double layer of paper towels on a microwave-safe plate and microwave for 10 minutes on low power until mostly dehydrated but not browned. Set aside.                                                                                                                            3                                                                            While onion is dehydrating, combine grated onion, mayonnaise, relish, mustard, sugar, Marmite, and turmeric. Stir to combine and refrigerate until ready to use.                                                                                                                            4                                                                            Preheat toaster oven or broiler to high. Use one finger to spread a very thin layer of egg white over the top of the top bun. Sprinkle with sesame seeds and place under broiler for 30 seconds until set. Set aside. Use a sharp, thin knife to cut off the very bottom of the bottom bun half, creating a single circular piece of bread with cut surfaces on both sides.                                                                                                                            5                                                                            Toast cut side of top bun and bottom bun, and one side of center bun piece under broiler until light golden brown. Place bottom bun and center bun on cutting board toasted-side up. Spread half of sauce on each. Divide dehydrated onions evenly between bottom and center buns and top with lettuce. Place 2 pickle slices on each.                                                                                                                            6                                                                            Season burger patties with salt and pepper. Heat a heavy-bottomed 10-inch stainless steel or cast iron skillet over high heat until lightly smoking. Add patties and cook without moving until first side is crusty and browned, about 1 minute. Scrape up patties with a stiff spatula and flip. Top one patty with 1 slice cheese. Continue cooking until cooked through, about 1 minute longer. Transfer cheese-topped patty to bottom bun and cheeseless patty to middle bun. Place top bun on top of center, then stack center bun on top of bottom. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/a-better-big-mac-201158', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}