{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/215625-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 215625, u'veryPopular': False, u'lowFodmap': True, u'title': u'Caraway-roasted carrot & feta salad', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 191.03, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tsp caraway seeds', u'aisle': u'Spices and Seasonings', u'name': u'caraway seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2005, u'unit': u'tsp'}, {u'originalString': u'300g carrots, peeled and halved or quartered lengthways', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled', u'halved', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 11124, u'unit': u'g'}, {u'originalString': u'50g feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'2 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1 orange, zested', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'2 tsp red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tsp'}, {u'originalString': u'1 tbsp mixed seeds, such as pumpkin seed, sunflower and linseed', u'aisle': u'Savory Snacks', u'name': u'seeds', u'metaInformation': [u'mixed', u' such as pumpkin seed, sunflower and linseed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93818, u'unit': u'tbsp'}, {u'originalString': u'2 large handfuls spinach leaves', u'aisle': u'Produce', u'name': u'spinach leaves', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'handfuls'}], u'healthScore': 48.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/9047/carawayroasted-carrot-and-feta-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6. Boilcarrots for 4 mins.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drain, tip onto a bakingsheet, then toss with the caraway seeds, 1 tspoil, the orange zest and seasoning. Roast for20 mins until golden and tender.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'id': 2005, u'name': u'caraway seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut away the pith from the orange. Holdthe orange over a bowl, then cut free eachsegment, catching the juice and segments inthe bowl. Squeeze out any remaining juice,then add the remaining oil, vinegar, seedsand seasoning. Stir, then combine with theroasted carrots and spinach. Divide betweentwo plates and crumble over the feta.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 49, u'instructions': u'Heat oven to 200C/fan 180C/gas 6. Boilcarrots for 4 mins. Drain, tip onto a bakingsheet, then toss with the caraway seeds, 1 tspoil, the orange zest and seasoning. Roast for20 mins until golden and tender.Cut away the pith from the orange. Holdthe orange over a bowl, then cut free eachsegment, catching the juice and segments inthe bowl. Squeeze out any remaining juice,then add the remaining oil, vinegar, seedsand seasoning. Stir, then combine with theroasted carrots and spinach. Divide betweentwo plates and crumble over the feta.', u'spoonacularSourceUrl': u'https://spoonacular.com/caraway-roasted-carrot-feta-salad-215625', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}