{u'recipes': [{u'sourceName': u'Panning The Globe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/669483-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 669483, u'veryPopular': True, u'lowFodmap': False, u'title': u'GRILLED ZUCCHINI CAPRESE SALAD', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 213.67, u'creditText': u'Panning The Globe', u'extendedIngredients': [{u'originalString': u'2 tablespoons good quality balsamic vinegar or balsamic glaze', u'aisle': u'Condiments', u'name': u'balsamic glaze', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 98998, u'unit': u'tablespoons'}, {u'originalString': u'10 basil leaves, stacked and thinly sliced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'25-30 whole fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'fresh', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 25.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'8 ounces fresh mozzarella cheese, cut into 10 slices', u'aisle': u'Cheese', u'name': u'fresh mozzarella cheese', u'metaInformation': [u'fresh', u'cut into 10 slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon finely minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'4 ripe heirloom tomatoes, each cut into 4 or 5 (1/4-inch-thick) slices', u'aisle': u'Produce', u'name': u'heirloom tomatoes', u'metaInformation': [u'ripe', u'cut into 4 or 5 (1/4-inch-thick) slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'Grilled zucchini slices (from above)', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'(from above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'slices'}, {u'originalString': u'2 large zucchini, each cut diagonally into 8 slices', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u'slices'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.panningtheglobe.com/2015/07/10/grilled-zucchini-caprese-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Drizzle a bit of olive oil and a sprinkle of salt and pepper on a platter or on individual plates. Arrange the 5 largest tomato slices on top. Top each tomato with 2 zucchini slices, then another (slightly smaller) tomato slice, then 1 cheese slice. top with another tomato slice, one final cheese slice and a zucchini slice at the top. Gently tuck basil leaves in all around the stacks, between layers.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-tomato.jpg', u'id': 10511529, u'name': u'tomato slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Drizzle balsamic dressing evenly over stacks; sprinkle with the slivered basil. Season with salt and pepper, to taste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u'Grill the Zucchini Preheat grill to medium-high heat. Coat both sides of zucchini with cooking spray or brush lightly with oil. Sprinkle with  teaspoon salt and several grinds of pepper. Arrange on grill; grill 4 minutes on each side. Set aside.Make Dressing In a small bowl, whisk oil, balsamic, garlic,  teaspoon salt,  teaspoon pepper. Set aside.Assemble the Stacks'}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 422, u'instructions': u'Grill the Zucchini: Preheat grill to medium-high heat. Coat both sides of zucchini with cooking spray or brush lightly with oil. Sprinkle with  teaspoon salt and several grinds of pepper. Arrange on grill; grill 4 minutes on each side. Set aside.Make Dressing: In a small bowl, whisk oil, balsamic, garlic,  teaspoon salt,  teaspoon pepper. Set aside.Assemble the Stacks: Drizzle a bit of olive oil and a sprinkle of salt and pepper on a platter or on individual plates. Arrange the 5 largest tomato slices on top. Top each tomato with 2 zucchini slices, then another (slightly smaller) tomato slice, then 1 cheese slice. top with another tomato slice, one final cheese slice and a zucchini slice at the top. Gently tuck basil leaves in all around the stacks, between layers. Drizzle balsamic dressing evenly over stacks; sprinkle with the slivered basil. Season with salt and pepper, to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-zucchini-caprese-salad-669483', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}