{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201030-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201030, u'veryPopular': False, u'lowFodmap': False, u'title': u"Lorraine Wallace's Stovetop Summer Chicken", u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 277.98, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 3-pound chicken, backbone removed, butterflied', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pound'}, {u'originalString': u'Coarse salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon chopped fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'6 tablespoons extra-virgin olive oil, plus additional to rub chicken', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/05/lorraine-wallaces-stovetop-summer-chicken-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove the chicken from the refrigerator, rinse with cold water, and pat dry with paper towels. Rub olive oil on the chicken to coat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Let stand for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a cast-iron skillet over medium heat, warm the 6 tablespoons of oil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Place the chicken in the skillet, breast side down, reduce the heat to medium-low, and cook for 15 to 18 minutes. Using tongs, turn the chicken over, breast side up, and cover with the garlic and herbs.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook for 20 minutes more, basting occasionally with the oil and juices in the pan.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer the chicken to a cutting board and sprinkle with salt and pepper to taste. Cover with aluminum foil, let rest for 10 minutes, then carve and serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 111, u'instructions': u'Procedures                                                                              1                                                                            Remove the chicken from the refrigerator, rinse with cold water, and pat dry with paper towels. Rub olive oil on the chicken to coat. Let stand for 15 minutes.                                                                                                                            2                                                                            In a cast-iron skillet over medium heat, warm the 6 tablespoons of oil. Place the chicken in the skillet, breast side down, reduce the heat to medium-low, and cook for 15 to 18 minutes. Using tongs, turn the chicken over, breast side up, and cover with the garlic and herbs.                                                                                                                            3                                                                            Cook for 20 minutes more, basting occasionally with the oil and juices in the pan.                                                                                                                            4                                                                            Transfer the chicken to a cutting board and sprinkle with salt and pepper to taste. Cover with aluminum foil, let rest for 10 minutes, then carve and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/lorraine-wallaces-stovetop-summer-chicken-201030', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}