{u'recipes': [{u'sourceName': u'The Gracious Pantry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/794439-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 794439, u'veryPopular': False, u'lowFodmap': False, u'title': u'Clean Eating Shrimp Campechana', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'pricePerServing': 201.02, u'creditText': u'The Gracious Pantry', u'extendedIngredients': [{u'originalString': u'2 avocados, seeded, peeled and chopped', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'peeled', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 bunch cilantro (about 1/2 cup chopped, but use to your liking)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped', u'( 1/2 cup , but use to your liking)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 Jalape\xf1o pepper, chopped fine', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Juice of 4 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1/2 medium onion, chopped fine', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 lbs. large, frozen shrimp, thawed and/or cooked completely', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'frozen', u'thawed', u'large', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'lbs'}, {u'originalString': u'1/2 cup tomato sauce, no sugar added', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'5-6 small-medium tomatoes, chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.thegraciouspantry.com/clean-eating-shrimp-campechana-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Prep all ingredients by washing and chopping as directed.In a large mixing bowl, combine all ingredients and stir well.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve topped with a little extra fresh cilantro.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Kris Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Brilliant lemon-green in color, KRIS offers enticing aromas of acacia flowers, citrus, tangerine, and hints of almonds.Try pairing with risotto, tossed salads, homemade pasta and grilled white meats or salmon.Blend: 100% Pinot Grigio View More', u'title': u'Kris Pinot Grigio', u'price': u'$14.99', u'id': 433207, u'link': u'https://www.wine.com/product/kris-pinot-grigio-2016/206138', u'imageUrl': u'https://spoonacular.com/productImages/433207-312x231.jpg'}]}, u'aggregateLikes': 50, u'instructions': u'Prep all ingredients by washing and chopping as directed.In a large mixing bowl, combine all ingredients and stir well.Serve topped with a little extra fresh cilantro.', u'spoonacularSourceUrl': u'https://spoonacular.com/clean-eating-shrimp-campechana-794439', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}