{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/675491-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 675491, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Potato Spice Frozen Latte', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 82.69, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'\xbc cup (63 ml) coffee concentrate*', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 63.0, u'consistency': u'solid', u'id': 14209, u'unit': u'ml'}, {u'originalString': u'1\xbc cups (312 ml) dairy-free milk beverage (your choice of type)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [u'(your choice of type)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 312.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'⅛ teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon ground cardamom', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2006, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'Pinch ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2011, u'unit': u'pinch'}, {u'originalString': u'⅛ teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (43 g) ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 43.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'g'}, {u'originalString': u'\xbc cup (64 g) sweet potato pur\xe9e', u'aisle': u'Canned and Jarred', u'name': u'sweet potato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 64.0, u'consistency': u'solid', u'id': 10011508, u'unit': u'g'}, {u'originalString': u'Sweetener, to taste', u'aisle': u'Baking', u'name': u'swerve sweetener', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-substitute.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 99084, u'unit': u'servings'}, {u'originalString': u'⅛ teaspoon xanthan gum or 1 teaspoon pectin or 1\xbd teaspoons (7 g) ground chia seeds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'xanthan gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 93626, u'unit': u'g'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/sweet-potato-spice-frozen-latte', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the milk beverage, sweet potato, coffee and spices to your blender. Blend until theyre combined well and there are no lumps of potato.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the xanthan gum (or pectin or chia seeds) and blend. This ingredient will keep the others from separating. Now taste and add sweetener, adjusting as needed. Remember, this is a concentrated flavor, so it needs to be a little sweeter now to be just right with ice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93626, u'name': u'xanthan gum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the ice. Depending on how powerful your blender is, you may have to add it  cup (120 g) at a time.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Add more milk beverage if its too thick or more ice if its too thin.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 81, u'instructions': u'Add the milk beverage, sweet potato, coffee and spices to your blender. Blend until theyre combined well and there are no lumps of potato.Add the xanthan gum (or pectin or chia seeds) and blend. This ingredient will keep the others from separating. Now taste and add sweetener, adjusting as needed. Remember, this is a concentrated flavor, so it needs to be a little sweeter now to be just right with ice.Add the ice. Depending on how powerful your blender is, you may have to add it  cup (120 g) at a time.Add more milk beverage if its too thick or more ice if its too thin.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-spice-frozen-latte-675491', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}