{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/388399-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 100, u'id': 388399, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Noodle Soup', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 95.09, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'3 carrots, cut into 1/2-inch dice', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'cut into 1/2-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'4 ribs celery, cut into 1/2-inch dice', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into 1/2-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'ribs', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'1 (15-ounce) can white beans or chick peas', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chick peas', u'metaInformation': [u'white', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16057, u'unit': u'ounce'}, {u'originalString': u'3 pounds bone-in chicken legs and thighs, skin and excess fat removed', u'aisle': u'Meat', u'name': u'chicken legs', u'metaInformation': [u'bone-in', u'fat removed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 5075, u'unit': u'pounds'}, {u'originalString': u'1 bunch cilantro, leaves coarsely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'2 cloves garlic, smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 grates fresh nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2025, u'unit': u''}, {u'originalString': u'Extra-virgin olive oil, as needed', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 large onion, cut into 1/2-inch slices', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'cut into 1/2-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 cups small pasta, preferably small shells such as orecchiette, or orzo', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20420, u'unit': u'cups'}, {u'originalString': u'2 teaspoons crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoons'}, {u'originalString': u'1 bunch thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'bunch'}, {u'originalString': u'Water, as needed', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 20.0, u'imageType': u'jpeg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/anne-burrell/chicken-noodle-soup-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Coat a large stock pot with olive oil and add the onions, celery and carrots. Season with salt, to taste, and bring the pot to medium-high heat. Cook the vegetables until they start to soften and are very aromatic, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add in the garlic, crushed red pepper and thyme and cook for another 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the chicken and fill the pot with enough water to cover the chicken.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the bay leaves, bring the ingredients to a boil, then reduce the heat to a simmer. Cook for 30 minutes and skim off any particles that accumulate on the surface. Squeeze the juice of the 2 lemon halves into the soup and drop in the lemon halves.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Add the cinnamon and nutmeg and taste for seasoning. Adjust the flavors with salt and pepper, if needed. Simmer the soup for an additional hour.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'While the soup is simmering, bring another pot of well-salted water to a boil over high heat.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the pasta and cook until "al dente," firm but not crunchy.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the pasta and transfer to a medium bowl.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add 1 teaspoon of olive oil and toss. Reserve.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'After the soup has finished, switch the heat off and remove the chicken to a cutting board. Discard the lemon halves, thyme and bay leaves.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let the chicken cool, then remove the bones and discard. Pull the meat into bite-sized pieces and return them to the pot. Taste the soup for seasoning, which should be spicy with a bright lemon flavor and a warm cinnamon chicken feel. It should be very full-flavored and warm your soul. Rinse the beans and add them to the pot. Adjust the seasoning, if needed.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spoon some of the reserved pasta into the bottom of each serving bowl and ladle the hot soup over the pasta.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Garnish with the chopped cilantro and serve. This soup is perfect for a cold day! YAY!', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Raymond Reserve Selection Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Watch how to make this recipe.                    Coat a large stock pot with olive oil and add the onions, celery and carrots. Season with salt, to taste, and bring the pot to medium-high heat. Cook the vegetables until they start to soften and are very aromatic, about 10 minutes. Add in the garlic, crushed red pepper and thyme and cook for another 2 to 3 minutes. Add the chicken and fill the pot with enough water to cover the chicken. Add the bay leaves, bring the ingredients to a boil, then reduce the heat to a simmer. Cook for 30 minutes and skim off any particles that accumulate on the surface. Squeeze the juice of the 2 lemon halves into the soup and drop in the lemon halves. Add the cinnamon and nutmeg and taste for seasoning. Adjust the flavors with salt and pepper, if needed. Simmer the soup for an additional hour.                          While the soup is simmering, bring another pot of well-salted water to a boil over high heat. Add the pasta and cook until "al dente," firm but not crunchy. Drain the pasta and transfer to a medium bowl. Add 1 teaspoon of olive oil and toss. Reserve.                          After the soup has finished, switch the heat off and remove the chicken to a cutting board. Discard the lemon halves, thyme and bay leaves. Let the chicken cool, then remove the bones and discard. Pull the meat into bite-sized pieces and return them to the pot. Taste the soup for seasoning, which should be spicy with a bright lemon flavor and a warm cinnamon chicken feel. It should be very full-flavored and warm your soul. Rinse the beans and add them to the pot. Adjust the seasoning, if needed.                          Spoon some of the reserved pasta into the bottom of each serving bowl and ladle the hot soup over the pasta. Garnish with the chopped cilantro and serve. This soup is perfect for a cold day! YAY!', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-noodle-soup-388399', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}