{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577228-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 577228, u'veryPopular': True, u'lowFodmap': False, u'title': u'Garlic & Herb Breadsticks', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 16.25, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'1 envelope of Highly Active Dry Yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'envelope'}, {u'originalString': u'4 cups Bread Flour, plus more for kneading', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'plus more for kneading'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'1 tablespoon Fresh Rosemary, minced', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon Fresh Thyme, minced', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'2 large Garlic Cloves, pressed through a garlic press or minced finely', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'large', u'pressed', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 teaspoons Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons Olive Oil, plus more for oiling bowl', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'plus more for oiling bowl'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup Fresh Parmesan, grated', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 stick Unsalted Butter, softened at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}, {u'originalString': u'1-3/4 cup warm Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.simplyscratch.com/2012/02/garlic-herb-breadsticks.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'To make the dough: Start by measuring honey into a liquid measuring cup.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Add the warm water {make sure you use a thermometer to get an accurate reading} and stir in the yeast.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Let sit so it can do its thing, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add two tablespoons of good olive oil and stir.In the bowl of you mixer {fitted with the paddle attachment}; measure 4 cups of bread flour and two teaspoons of kosher salt. Stir to combine. With the mixer on low, gradually stream in the liquids. Use a spatula to get it all out of the cup.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix just until combined and then switch to your bread hook. You could knead this by hand but it would take 6-8 minutes. Turn the mixer back on to medium-low and let it go for 3-4 minutes or until the dough pulls away from the sides.Turn out the dough onto a well floured surface and continue to knead for 3-4 more minutes. Plop it into a well oiled bowl and toss it to coat. Cover with a tea towel and stick it in a warm, dry place for 40 minutes. While the dough is rising, make the herb butter.', u'length': {u'number': 56, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add softened butter, minced herbs, garlic, 1/2 cup of the grated Parmesan and salt into a small bowl.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix well.After the time is up, punch it down and stretch it into a rectangle.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 3/4 of the butter over top of the rectangle.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the remaining butter in a small saucepan and heat over low to melt. Fold the dough in half lengthwise and then cut in half.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into twelve even strips. Open each strip and cut in half at the middle. Tie in a knot, tucking the ends under OR twist into breadsticks.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in a preheated 375 degree oven for 15 to twenty minutes.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Remove brush with melted herb butter and sprinkle with a little remaining Parmesan.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Viva Diva Moscato Colada. It has 4.9 out of 5 stars and a bottle costs about 11 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Sweet Moscato wine infused with natural coconut & pineapple flavor. Light orange in color. Fruity, typical of coconut & pineapple with light hints of Moscato. Excellent as an aperitif or mixing with cocktails.', u'title': u'Viva Diva Moscato Colada', u'price': u'$10.99', u'id': 465263, u'link': u'https://www.wine.com/product/viva-diva-moscato-colada/138557', u'imageUrl': u'https://spoonacular.com/productImages/465263-312x231.jpg'}]}, u'aggregateLikes': 687, u'instructions': u'To make the dough: Start by measuring honey into a liquid measuring cup. Add the warm water {make sure you use a thermometer to get an accurate reading} and stir in the yeast. Let sit so it can do its thing, about 5 minutes. Add two tablespoons of good olive oil and stir.In the bowl of you mixer {fitted with the paddle attachment}; measure 4 cups of bread flour and two teaspoons of kosher salt. Stir to combine. With the mixer on low, gradually stream in the liquids. Use a spatula to get it all out of the cup. Mix just until combined and then switch to your bread hook. You could knead this by hand but it would take 6-8 minutes. Turn the mixer back on to medium-low and let it go for 3-4 minutes or until the dough pulls away from the sides.Turn out the dough onto a well floured surface and continue to knead for 3-4 more minutes. Plop it into a well oiled bowl and toss it to coat. Cover with a tea towel and stick it in a warm, dry place for 40 minutes. While the dough is rising, make the herb butter. Add softened butter, minced herbs, garlic, 1/2 cup of the grated Parmesan and salt into a small bowl. Mix well.After the time is up, punch it down and stretch it into a rectangle. Spread 3/4 of the butter over top of the rectangle. Place the remaining butter in a small saucepan and heat over low to melt. Fold the dough in half lengthwise and then cut in half. Cut into twelve even strips. Open each strip and cut in half at the middle. Tie in a knot, tucking the ends under OR twist into breadsticks. Bake in a preheated 375 degree oven for 15 to twenty minutes. Remove brush with melted herb butter and sprinkle with a little remaining Parmesan. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-herb-breadsticks-577228', u'dishTypes': [u'fingerfood', u'side dish', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}