{u'recipes': [{u'sourceName': u'Lemons for Lulu', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621853-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 621853, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Brie & Caramelized Onion Cups', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 29.42, u'creditText': u'Lemons for Lulu', u'extendedIngredients': [{u'originalString': u'1 tablespoon Pompeian Balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoon'}, {u'originalString': u'4 oz brie cheese, cut into 1 in cubes', u'aisle': u'Cheese', u'name': u'brie cheese', u'metaInformation': [u'cut into 1 in cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1006, u'unit': u'oz'}, {u'originalString': u'2 teaspoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon Pompeian Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon honey (optional)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'1 large onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'2 boxes phyllo shells (1.9 oz boxes with 15 shells)', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo shells', u'metaInformation': [u'with 15 shells)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'unitLong': u'boxes', u'unitShort': u'boxes', u'amount': 2.0, u'consistency': u'solid', u'id': 93817, u'unit': u'boxes'}, {u'originalString': u'\xbd teaspoon red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'teaspoon'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.lemonsforlulu.com/baked-brie-caramelized-onion-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the onions: heat oil in a large skillet. Slice your onion into rings and add to skillet. Turn down heat to low and cook onions for about 20 minutes stirring frequently. Onions will become very soft and turn brown in color. When onions have caramelized, add vinegar and a pinch of salt; stir until liquid evaportes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from heat and set aside.Preheat oven to 350. Arrange cups on a baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a cube of cheese in each cup. Top cups evenly with onions and bake for 10-12 minutes or until cheese has melted.While cups are baking, heat butter and nuts in a small skillet.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add pepper and stir. Toast pecans for 3-5 mintues or until fragrant.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Remove.When cheese has melted, top cups with chopped nuts and drizzle with honey right befor serving.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 16, u'instructions': u'For the onions: heat oil in a large skillet. Slice your onion into rings and add to skillet. Turn down heat to low and cook onions for about 20 minutes stirring frequently. Onions will become very soft and turn brown in color. When onions have caramelized, add vinegar and a pinch of salt; stir until liquid evaportes. Remove from heat and set aside.Preheat oven to 350. Arrange cups on a baking sheet. Place a cube of cheese in each cup. Top cups evenly with onions and bake for 10-12 minutes or until cheese has melted.While cups are baking, heat butter and nuts in a small skillet. Add pepper and stir. Toast pecans for 3-5 mintues or until fragrant. Remove.When cheese has melted, top cups with chopped nuts and drizzle with honey right befor serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-brie-caramelized-onion-cups-621853', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 37, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}