{u'recipes': [{u'sourceName': u'Delicious Everyday', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556033-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 556033, u'veryPopular': False, u'lowFodmap': True, u'title': u'Blueberry Meringue Tarts', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 30, u'pricePerServing': 70.27, u'creditText': u'Delicious Everyday', u'extendedIngredients': [{u'originalString': u'125g (5 ounces) of blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 9050, u'unit': u'ounces'}, {u'originalString': u'1 egg, plus 1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'30g (1/4 cup) of icing (powdered) sugar, sifted', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [u'sifted', u'(powdered)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'90g (3 oz) of caster (superfine) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(superfine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'oz'}, {u'originalString': u'75g (5\xbc Tbs) of chilled unsalted butter, chopped into cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'chilled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 5.25, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tbs'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.deliciouseveryday.com/blueberry-meringue-tarts/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Begin by making the blueberry curd.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Place the blueberries in a small saucepan with the water over a medium low heat and cook until the berries burst and start to break down. Strain them through a fine mesh sieve, pushing down on the berries with a spoon to release all their juice. Discard the skins.Return the blueberry juice to the saucepan and add the sugar, egg and egg yolk and butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to combine and place over a medium low heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Whisk until thickened, this will take around 10 minutes. Don't be tempted to turn the heat up to cook it quicker as you are likely to curdle the eggs. The mixture will be ready when you can see a slight trail from the whisk in the mixture. It will thicken further when refrigerated. Refrigerate overnight.In the bowl of a food processor add the flour and icing sugar and process to combine.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the butter and pulse until the mixture resembles fine breadcrumbs.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the egg yolk and water and process until the mixture starts to come together in a ball.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Remove from the food processor and wrap in plastic wrap and refrigerate for 30 minutes.Preheat the oven to 180 celsius (355 Fahrenheit) and lightly grease 8 10cm loose bottom mini tart tins.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Roll out the pastry until roughly 3mm thick and then cut circles from the pastry that are 2 cm larger in diameter than the tart tin. Line the each tart tin and trim excess (an easy way to do this is to run your rolling pin over the top of the tart tin). Chill for 15 minutes or until firm. Prick the base lightly with a fork in several places and line with baking paper and fill with pastry weights.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bake for 10 minutes before removing the weights and baking for a further 3 to 5 minutes or until dry and lightly golden. Set aside to cool.To make the Italian Meringue combine the sugar and water in a small saucepan and stir to dissolve the sugar. If any sugar crystals stick to the side of the saucepan take a wet pastry brush and brush the sugar crystals down into the sugar and water mixture. Turn on the heat and bring the sugar mixture to a boil.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}], u'step': u'Add a candy thermometer and cook until it reaches soft ball stage 115 Celsius (240 Fahrenheit).', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the heat.While the sugar mixture is heating place the egg whites in the bowl of an electric mixer and when you remove the sugar syrup from the heat begin whisking the egg whites.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk until soft peaks form. Slowly pour the sugar syrup into the egg whites in a thin steady stream, ensuring the syrup doesn't hit the whisk and splatter everywhere and risking burning yourself.", u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until the mixture begins to cool and is thick and glossy. Around 5 minutes.To assemble the tarts divide the blueberry curd between the tart bases and spread to cover the tart base evenly. Fill a piping bag fitted with a star tip and pipe over the top of the blueberry curd in whatever pattern you prefer.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Tart on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u"Begin by making the blueberry curd. Place the blueberries in a small saucepan with the water over a medium low heat and cook until the berries burst and start to break down. Strain them through a fine mesh sieve, pushing down on the berries with a spoon to release all their juice. Discard the skins.Return the blueberry juice to the saucepan and add the sugar, egg and egg yolk and butter. Whisk to combine and place over a medium low heat. Whisk until thickened, this will take around 10 minutes. Don't be tempted to turn the heat up to cook it quicker as you are likely to curdle the eggs. The mixture will be ready when you can see a slight trail from the whisk in the mixture. It will thicken further when refrigerated. Refrigerate overnight.In the bowl of a food processor add the flour and icing sugar and process to combine. Add the butter and pulse until the mixture resembles fine breadcrumbs. Add the egg yolk and water and process until the mixture starts to come together in a ball. Remove from the food processor and wrap in plastic wrap and refrigerate for 30 minutes.Preheat the oven to 180 celsius (355 Fahrenheit) and lightly grease 8 10cm loose bottom mini tart tins. Roll out the pastry until roughly 3mm thick and then cut circles from the pastry that are 2 cm larger in diameter than the tart tin. Line the each tart tin and trim excess (an easy way to do this is to run your rolling pin over the top of the tart tin). Chill for 15 minutes or until firm. Prick the base lightly with a fork in several places and line with baking paper and fill with pastry weights. Bake for 10 minutes before removing the weights and baking for a further 3 to 5 minutes or until dry and lightly golden. Set aside to cool.To make the Italian Meringue combine the sugar and water in a small saucepan and stir to dissolve the sugar. If any sugar crystals stick to the side of the saucepan take a wet pastry brush and brush the sugar crystals down into the sugar and water mixture. Turn on the heat and bring the sugar mixture to a boil. Add a candy thermometer and cook until it reaches soft ball stage 115 Celsius (240 Fahrenheit). Remove from the heat.While the sugar mixture is heating place the egg whites in the bowl of an electric mixer and when you remove the sugar syrup from the heat begin whisking the egg whites. Whisk until soft peaks form. Slowly pour the sugar syrup into the egg whites in a thin steady stream, ensuring the syrup doesn't hit the whisk and splatter everywhere and risking burning yourself. Whisk until the mixture begins to cool and is thick and glossy. Around 5 minutes.To assemble the tarts divide the blueberry curd between the tart bases and spread to cover the tart base evenly. Fill a piping bag fitted with a star tip and pipe over the top of the blueberry curd in whatever pattern you prefer.", u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-meringue-tarts-556033', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}