{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/758988-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758988, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ultimate Vegan Chili', u'diets': [u'dairy free'], u'pricePerServing': 209.55, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'8 oz. baby bella mushrooms, finely chopped (1 \xbd cups)', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11266, u'unit': u'cups'}, {u'originalString': u'1 cup chopped carrots (2 to 3 large carrots)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'chopped', u'(2 to 3 carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'\xbe tsp. celery salt', u'aisle': u'Spices and Seasonings', u'name': u'celery salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1052047, u'unit': u'tsp'}, {u'originalString': u'3 15-oz. cans chili beans, partially drained', u'aisle': u'Canned and Jarred', u'name': u'chili beans', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 43112, u'unit': u'oz'}, {u'originalString': u'1 \xbd tsp. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'1 chipotle chile in adobo sauce, drained and minced', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chile in adobo', u'metaInformation': [u'minced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'3 cloves garlic, minced (1 Tbs.)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs. low-sodium tamari or soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 large onion, chopped (2 cups)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'2 tsp. dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'2 8-oz. pkgs. seitan, chopped (3 cups)', u'aisle': u'Refrigerated;Health Foods;Baking', u'name': u'seitan', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seitan.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 93654, u'unit': u'cups'}, {u'originalString': u'2 tsp. smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'tsp'}, {u'originalString': u'3 Tbs. tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. vegan Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'Tbs'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/ultimate-vegan-chili/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat oil in Dutch oven over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, and saut\xe9 7 to 10 minutes, or until beginning to brown, stirring often.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic and chipotle chile, and saut\xe9 1 minute more. Stir in mushrooms; cook 3 to 4 minutes, or until softened.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add seitan, tomato paste, paprika, oregano,\xa0chili powder, celery salt, and 1 cup water; cook 3 to 4 minutes, stirring occasionally.2.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1052047, u'name': u'celery salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seitan.jpg', u'id': 93654, u'name': u'seitan'}]}, {u'equipment': [], u'step': u'Add beans, carrots, tamari, and Worcestershire sauce. Cover, and reduce heat to medium-low. Simmer 1 hour, or until carrots are tender.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili on the menu? Try pairing with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Poema Brut Cava. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 11 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Vibrant aromas of ripe peaches, pears and toasted bread with a hint of spice fill the nose. The palate is dry with a rich, creamy texture. Layers of flavor include orange rind and spice that persists through an elegant finish.', u'title': u'Poema Brut Cava', u'price': u'$10.99', u'id': 449764, u'link': u'https://www.wine.com/product/poema-brut-cava/104054', u'imageUrl': u'https://spoonacular.com/productImages/449764-312x231.jpg'}]}, u'aggregateLikes': 13483, u'instructions': u'1. Heat oil in Dutch oven over medium-high heat. Add onion, and saut\xe9 7 to 10 minutes, or until beginning to brown, stirring often. Add garlic and chipotle chile, and saut\xe9 1 minute more. Stir in mushrooms; cook 3 to 4 minutes, or until softened. Add seitan, tomato paste, paprika, oregano,\xa0chili powder, celery salt, and 1 cup water; cook 3 to 4 minutes, stirring occasionally.2. Add beans, carrots, tamari, and Worcestershire sauce. Cover, and reduce heat to medium-low. Simmer 1 hour, or until carrots are tender.', u'spoonacularSourceUrl': u'https://spoonacular.com/ultimate-vegan-chili-758988', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}