{u'recipes': [{u'sourceName': u'The Novice Chef Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/583742-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 583742, u'veryPopular': True, u'lowFodmap': False, u'title': u'A Twist On The Croque Madame', u'diets': [], u'pricePerServing': 284.96, u'creditText': u'The Novice Chef Blog', u'extendedIngredients': [{u'originalString': u'1 teaspoonful brown mustard', u'aisle': u'Spices and Seasonings', u'name': u'brown mustard seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoon'}, {u'originalString': u'Chives, minced, for garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'minced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'serving'}, {u'originalString': u'1 square croissant dough', u'aisle': u'Bakery/Bread', u'name': u'croissant', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'unitLong': u'square', u'unitShort': u'square', u'amount': 1.0, u'consistency': u'solid', u'id': 18239, u'unit': u'square'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 slices Gruyere cheese', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1023, u'unit': u'slices'}, {u'originalString': u'3 slices thin ham', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'solid', u'id': 10151, u'unit': u'slices'}, {u'originalString': u'Olive Oil or Pam', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'serving'}, {u'originalString': u'Salt and Pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'serving'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.thenovicechefblog.com/2010/11/a-twist-on-the-croque-madame/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Heat up waffle iron. In one square place croissant dough and close waffle iron to allow to cook croissant until golden brown, which should take around 2 minutes, watch closely.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'id': 18239, u'name': u'croissant'}]}, {u'equipment': [], u'step': u'Remove croissant and place on a plate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'id': 18239, u'name': u'croissant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Spread mustard evenly along croissant and place slices of gruyere on top, allowing to melt.Next, place slices of ham inside the waffle maker until warm and starting to brown just a little, then place on top of croissant as well.Spray waffle iron with olive oil or Pam and crack an egg in the center. Using a fork, break the white (but be sure to leave the yolk intact) so it runs in all of the open space. Allow egg to cook, with the lid of the waffle maker open, until desired doneness.Once egg is cooked, using a large fork and a spatula, gently slide the egg onto the spatula, and then place on top of the croissant. Sprinkle with salt, pepper, and chives and serve immediately.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'id': 18239, u'name': u'croissant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'id': 1023, u'name': u'gruyere'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2354, u'instructions': u'Heat up waffle iron. In one square place croissant dough and close waffle iron to allow to cook croissant until golden brown, which should take around 2 minutes, watch closely.Remove croissant and place on a plate. Spread mustard evenly along croissant and place slices of gruyere on top, allowing to melt.Next, place slices of ham inside the waffle maker until warm and starting to brown just a little, then place on top of croissant as well.Spray waffle iron with olive oil or Pam and crack an egg in the center. Using a fork, break the white (but be sure to leave the yolk intact) so it runs in all of the open space. Allow egg to cook, with the lid of the waffle maker open, until desired doneness.Once egg is cooked, using a large fork and a spatula, gently slide the egg onto the spatula, and then place on top of the croissant. Sprinkle with salt, pepper, and chives and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/a-twist-on-the-croque-madame-583742', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}