{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/695460-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 695460, u'veryPopular': True, u'lowFodmap': False, u'title': u'Southwestern Vegetable & Chicken Soup', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 60, u'pricePerServing': 215.66, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 14-ounce can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'4 cups chopped chard or spinach', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11147, u'unit': u'cups'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups corn kernels, fresh or frozen', u'aisle': u'Produce', u'name': u'fresh corn kernels', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10011167, u'unit': u'cups'}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup fresh lime juice, plus lime wedges for serving', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'6 cups reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups chopped onion (1 large)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'(1 large)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1 15-ounce can black beans or pinto beans, rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'pinto beans', u'metaInformation': [u'black', u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16043, u'unit': u'ounce'}, {u'originalString': u'2 medium poblano peppers', u'aisle': u'Produce', u'name': u'poblano peppers', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'1 1/2 cups chopped red or green bell pepper (1 large)', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'green', u'red', u'(1 large)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cups'}, {u'originalString': u'12 ounces boneless, skinless chicken thighs, trimmed, cut into bite-size pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'boneless', u'skinless', u'trimmed', u'cut into bite-size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 5096, u'unit': u'ounces'}, {u'originalString': u'1 1/2 cups green beans, cut into 1/4-inch pieces, or frozen, thawed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'green', u'frozen', u'thawed', u'cut into 1/4-inch pieces, or , '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16033, u'unit': u'cups'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/southwestern_chicken_soup.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/broiler-pan.jpg', u'id': 404698, u'name': u'broiler pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'To roast poblanos: Position oven rack about 5 inches from the heat source; preheat broiler. Line the broiler pan with foil. Broil whole poblanos, turning once, until starting to blacken, 8 to 12 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Transfer to a paper bag and let steam to loosen skins, about 10 minutes. When the poblanos are cool enough to handle, peel, seed, stem and coarsely chop; set aside.Meanwhile, heat oil in a large soup pot or Dutch oven over medium-high heat.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add chicken and cook, turning occasionally, until lightly browned, 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to a plate and set aside.Reduce the heat to medium and add onion, bell pepper, green beans and garlic. Cook, stirring, until beginning to soften, 5 to 7 minutes. Stir in chili powder and cumin and cook, stirring, until fragrant, about 30 seconds. Stir in broth, beans, tomatoes and the chopped poblanos; bring to a boil. Reduce heat to maintain a simmer and cook, stirring occasionally, until the vegetables are tender, about 15 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the reserved chicken and juices, chard (or spinach) and corn; return to a simmer and cook for 15 minutes more to heat through and blend flavors.Top each portion with 1 tablespoon each cilantro and lime juice; serve with lime wedges.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Waterbrook Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 6183, u'instructions': u'To roast poblanos: Position oven rack about 5 inches from the heat source; preheat broiler. Line the broiler pan with foil. Broil whole poblanos, turning once, until starting to blacken, 8 to 12 minutes. Transfer to a paper bag and let steam to loosen skins, about 10 minutes. When the poblanos are cool enough to handle, peel, seed, stem and coarsely chop; set aside.Meanwhile, heat oil in a large soup pot or Dutch oven over medium-high heat. Add chicken and cook, turning occasionally, until lightly browned, 3 to 5 minutes. Transfer to a plate and set aside.Reduce the heat to medium and add onion, bell pepper, green beans and garlic. Cook, stirring, until beginning to soften, 5 to 7 minutes. Stir in chili powder and cumin and cook, stirring, until fragrant, about 30 seconds. Stir in broth, beans, tomatoes and the chopped poblanos; bring to a boil. Reduce heat to maintain a simmer and cook, stirring occasionally, until the vegetables are tender, about 15 minutes.Add the reserved chicken and juices, chard (or spinach) and corn; return to a simmer and cook for 15 minutes more to heat through and blend flavors.Top each portion with 1 tablespoon each cilantro and lime juice; serve with lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/southwestern-vegetable-chicken-soup-695460', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}