{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/465439-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 465439, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pasties II', u'diets': [u'dairy free'], u'preparationMinutes': 60, u'pricePerServing': 132.82, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 pound boneless round or chuck steak, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'boneless chuck steak', u'metaInformation': [u'boneless', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/boneless-chuck-or-top-blade-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23078, u'unit': u'pound'}, {u'originalString': u'3 1/2 cups all-purpose flour, sifted', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'6 tablespoons margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 4073, u'unit': u'tablespoons'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 potatoes, peeled and cubed', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'cubed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1/4 rutabaga, cubed', u'aisle': u'Produce', u'name': u'rutabaga', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rutabaga.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11435, u'unit': u''}, {u'originalString': u'1 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Pasties-II/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine flour and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut in shortening until mixture resembles coarse crumbs. Stir in water until mixture forms a ball. Shape into a ball. Wrap in plastic and refrigerate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine meat, potatoes, onion, rutabaga and chopped carrots. Season with salt and pepper. Divide dough into six pieces, and shape into balls. On a lightly floured surface, roll each ball into a 6 inch round.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rutabaga.jpg', u'id': 11435, u'name': u'rutabaga'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place approximately 1 cup filling on one half of each. Dot each with 1 tablespoon margarine. Draw the other half of the pastry over the filling. Crimp edges to seal in filling. Prick with a fork and place on prepared baking sheet.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 1 hour.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1057, u'instructions': u'In a large bowl, combine flour and salt. Cut in shortening until mixture resembles coarse crumbs. Stir in water until mixture forms a ball. Shape into a ball. Wrap in plastic and refrigerate.                            Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.                            In a large bowl, combine meat, potatoes, onion, rutabaga and chopped carrots. Season with salt and pepper. Divide dough into six pieces, and shape into balls. On a lightly floured surface, roll each ball into a 6 inch round. Place approximately 1 cup filling on one half of each. Dot each with 1 tablespoon margarine. Draw the other half of the pastry over the filling. Crimp edges to seal in filling. Prick with a fork and place on prepared baking sheet.                            Bake in preheated oven for 1 hour.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/pasties-ii-465439', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}