{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/195959-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 195959, u'veryPopular': False, u'lowFodmap': False, u'title': u'Green Chorizo', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 255.79, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup cider vinegar, chilled', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'Type of fire: Direct', u'aisle': u'Canned and Jarred', u'name': u'fire-roasted tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 98849, u'unit': u'servings'}, {u'originalString': u'1 cup finely chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 teaspoon minced cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'Grill heat: medium-high', u'aisle': u'Cheese', u'name': u'grill cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 10093624, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tablespoons Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoons'}, {u'originalString': u'Natural hog casings, soaked in lukewarm water for at least 30 minutes and rinsed', u'aisle': u'Spices and Seasonings', u'name': u'natural spices', u'metaInformation': [u'lukewarm', u'rinsed', u'for at least 30 minutes and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 2035, u'unit': u'servings'}, {u'originalString': u'1 teaspoon dried Mexican oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'2 large fresh poblano peppers', u'aisle': u'Produce', u'name': u'poblano peppers', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'1/2 lb pork fatback, cubed', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10010219, u'unit': u'lb'}, {u'originalString': u'2 1/2 lbs pork shoulder, cubed', u'aisle': u'Meat', u'name': u'pork shoulder', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 10072, u'unit': u'lbs'}, {u'originalString': u'2 fresh serrano chiles, finely chopped', u'aisle': u'Produce', u'name': u'serrano chiles', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/serrano-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11977, u'unit': u''}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/03/green-chorizo-sausage-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Roast poblanos over an open flame on a gas stove or grill until skins are completely charred.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a bowl, cover with plastic wrap, and let sit for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove charred outer skins, cut in half, and remove the seeds and cores; finely chop poblanos.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place pork and fat in a large bowl.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}, {u'equipment': [], u'step': u'Add in poblanos, cilantro, serrano chiles, salt, garlic, oregano, cumin, and black pepper. Toss to coat meat with seasonings.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/serrano-pepper.jpg', u'id': 11977, u'name': u'serrano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place in refrigerator until ready to grind.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-grinder.jpg', u'id': 404700, u'name': u'meat grinder'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Grind the mixture through the small die of a meat grinder into a bowl set in ice.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Using paddle attachment of a standing mixer, mix on low speed for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in vinegar, increase speed to medium, and mix until liquid is incorporated and sausage has a uniform consistancy, about 1 minute more. Chill until ready to stuff.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Form a small patty of sausage and saut\xe9 in a skillet over medium-high heat until cooked through. Taste and adjust seasonings if necessary.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}]}, {u'equipment': [], u'step': u'6', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Stuff sausage into hog casings and twist into 6-inch links. Refrigerate until ready to cook, or freeze for future use.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'7', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Grill links over medium-high direct heat until sausage registers 160 degrees when an instant read thermometer is inserted in middle of link.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 19, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from grill, let rest for 5 minutes, and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 20, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 145, u'instructions': u'Procedures                                                                              1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Roast poblanos over an open flame on a gas stove or grill until skins are completely charred. Place in a bowl, cover with plastic wrap, and let sit for 30 minutes. Remove charred outer skins, cut in half, and remove the seeds and cores; finely chop poblanos.                                                                                                                            2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Place pork and fat in a large bowl. Add in poblanos, cilantro, serrano chiles, salt, garlic, oregano, cumin, and black pepper. Toss to coat meat with seasonings. Place in refrigerator until ready to grind.                                                                                                                            3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Grind the mixture through the small die of a meat grinder into a bowl set in ice.                                                                                                                             4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Using paddle attachment of a standing mixer, mix on low speed for 1 minute. Pour in vinegar, increase speed to medium, and mix until liquid is incorporated and sausage has a uniform consistancy, about 1 minute more. Chill until ready to stuff.                                                                                                                            5                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Form a small patty of sausage and saut\xe9 in a skillet over medium-high heat until cooked through. Taste and adjust seasonings if necessary.                                                                                                                            6                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Stuff sausage into hog casings and twist into 6-inch links. Refrigerate until ready to cook, or freeze for future use.                                                                                                                            7                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Grill links over medium-high direct heat until sausage registers 160 degrees when an instant read thermometer is inserted in middle of link. Remove from grill, let rest for 5 minutes, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/green-chorizo-195959', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}