{u'recipes': [{u'sourceName': u'Running with Spoons', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/800384-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 800384, u'veryPopular': False, u'lowFodmap': False, u'title': u'one bowl greek yogurt pumpkin bread', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 42.46, u'creditText': u'Running with Spoons', u'extendedIngredients': [{u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1/2 cup (60 g) canned pumpkin puree', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 11424, u'unit': u'g'}, {u'originalString': u'1/3 cup (60 g) chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'g'}, {u'originalString': u'6 Tbsp (75 g) coconut palm sugar*', u'aisle': u'Baking', u'name': u'coconut palm sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 93831, u'unit': u'g'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1/4 cup (55 g) plain 2% Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain', u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 55.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'g'}, {u'originalString': u'1/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 1/4 cup (150 g) whole wheat pastry flour**', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'g'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.runningwithspoons.com/2016/08/30/one-bowl-greek-yogurt-pumpkin-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 350F (176C), and lightly grease a 9 x 5 (23cm x 13cm) loaf pan.In a large mixing bowl, lightly beat the eggs until the yolks break apart.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the pumpkin, yogurt, sugar, vanilla, spices, baking soda, and salt, mixing until smooth.Slowly spoon in the flour and gently stir it in until just combined. Fold in the chocolate chips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Pour the batter into the prepared loaf pan, spreading it out even, and top with a few extra chocolate chips.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 40-45 minutes, or until a toothpick inserted into the center comes out clean.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the bread from the oven and let it cool in the pan for about 10 minutes before transferring it to a cooling rack to cool completely.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Greek Yogurt on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 228, u'instructions': u'Preheat your oven to 350F (176C), and lightly grease a 9 x 5 (23cm x 13cm) loaf pan.In a large mixing bowl, lightly beat the eggs until the yolks break apart. Whisk in the pumpkin, yogurt, sugar, vanilla, spices, baking soda, and salt, mixing until smooth.Slowly spoon in the flour and gently stir it in until just combined. Fold in the chocolate chips.Pour the batter into the prepared loaf pan, spreading it out even, and top with a few extra chocolate chips. Bake for 40-45 minutes, or until a toothpick inserted into the center comes out clean.Remove the bread from the oven and let it cool in the pan for about 10 minutes before transferring it to a cooling rack to cool completely.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-bowl-greek-yogurt-pumpkin-bread-800384', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}