{u'recipes': [{u'sourceName': u'Slender Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/611457-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 611457, u'veryPopular': False, u'lowFodmap': False, u'title': u'Green Chile Turkey Burgers', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 278.88, u'creditText': u'Slender Kitchen', u'extendedIngredients': [{u'originalString': u'1/2 tsp. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1/4 cup cilantro', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 lb. 95% lean ground turkey', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'95%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'Lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'servings'}, {u'originalString': u'2 4oz. can greens chiles, drained (or use your own fresh roasted Hatch or Poblano chiles for a better flavor)', u'aisle': u'Produce', u'name': u'poblano chiles', u'metaInformation': [u'fresh', u'drained', u'for a better flavor)', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10011333, u'unit': u'oz'}, {u'originalString': u'1 red onion, sliced thin', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.slenderkitchen.com/green-chile-turkey-burgers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the pickled onions, cover the onion slices with lime juice in a bowl. Cover and refrigerate for at least 4 hours, ideally overnight. Using your hands, gently combined the turkey, 4 oz. green chiles (drained), cumin, salt, pepper, and garlic powder.Divide into 4 patties.Grill for around 5 minutes per side or until completely cooked. You can also cook them in a skillet.Meanwhile, mix the remaining chiles with cilantro.Top with green chile an cilantro mixture, pickled onions, and your other favorite toppings.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 226, u'instructions': u'To make the pickled onions, cover the onion slices with lime juice in a bowl. Cover and refrigerate for at least 4 hours, ideally overnight. Using your hands, gently combined the turkey, 4 oz. green chiles (drained), cumin, salt, pepper, and garlic powder.Divide into 4 patties.Grill for around 5 minutes per side or until completely cooked. You can also cook them in a skillet.Meanwhile, mix the remaining chiles with cilantro.Top with green chile an cilantro mixture, pickled onions, and your other favorite toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/green-chile-turkey-burgers-611457', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}