{u'recipes': [{u'sourceName': u'Kitchen Nostalgia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619833-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619833, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grape Salad', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 186.15, u'creditText': u'Kitchen Nostalgia', u'extendedIngredients': [{u'originalString': u'\xbc cup dry cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'1 Tbsp maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'Tbsp'}, {u'originalString': u'2 cups red grapes', u'aisle': u'Produce', u'name': u'red grapes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cups'}, {u'originalString': u'2 Tbsp creamy ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'Tbsp'}, {u'originalString': u'\xbd tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1054, u'unit': u'Tbsp'}, {u'originalString': u'2 cups white grapes', u'aisle': u'Produce', u'name': u'white grapes', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.kitchennostalgia.com/desserts/grape-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Wash and stem white and red grapes.In a bowl, mix whipped cream, ricotta cheese, vanilla extract and maple syrup.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'red grapes'}]}, {u'equipment': [], u'step': u'Add grapes and cranberries and toss to coat. Cover and refrigerate until serving.Just before serving, sprinkle with brown sugar and pecans and drizzle with some maple syrup.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [], u'step': u'Garnish with candied fruit (optional).', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 214, u'instructions': u'Wash and stem white and red grapes.In a bowl, mix whipped cream, ricotta cheese, vanilla extract and maple syrup. Add grapes and cranberries and toss to coat. Cover and refrigerate until serving.Just before serving, sprinkle with brown sugar and pecans and drizzle with some maple syrup. Garnish with candied fruit (optional).', u'spoonacularSourceUrl': u'https://spoonacular.com/grape-salad-619833', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}