{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598219-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 598219, u'veryPopular': False, u'lowFodmap': False, u'title': u'Seafood Soup Amalfi-Style', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'pescatarian'], u'preparationMinutes': 95, u'pricePerServing': 841.44, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 teaspoon whole black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'whole', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'1 stalk celery, coarsely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 fennel bulb, coarsely chopped', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 pounds fish bones, cleaned', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [u'cleaned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'pounds'}, {u'originalString': u'1 pound assorted fresh fish fillets (cod, bass, flounder, salmon, grouper, cut into 2-inch pieces)', u'aisle': u'Seafood', u'name': u'fish fillets', u'metaInformation': [u'fresh', u'assorted', u'cut into 2-inch pieces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'pound'}, {u'originalString': u'5 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 small leek, washed well and coarsely chopped', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'washed', u'small', u'coarsely chopped', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1/4 cup extra-virgin olive oil, plus high-quality extra-virgin olive oil, for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Chopped parsley, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'Sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 sprigs thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'4 fresh Roma or canned San Marzano tomatoes, halved', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'canned', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'3 cups canned San Marzano tomatoes and their juice', u'name': u'tomatoes in juice', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/null', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10211693, u'unit': u'cups'}, {u'originalString': u'1 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 cup Ricard (or other anise liqueur)', u'aisle': u'?', u'name': u'ricard', u'metaInformation': [u'(or other anise liqueur)'], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://leitesculinaria.com/6320/recipes-fish-soup-amalfi-style.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat the 1/4 cup olive oil in a large stockpot or Dutch oven.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the garlic, fennel, leek, and celery. Cook, stirring occasionally, until the vegetables are translucent, 7 to 10 minutes. Season with 1 teaspoon salt and 1/4 teaspoon black pepper.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the fresh tomatoes and continue cooking until they begin to break down, about 10 minutes.2.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add the canned tomatoes and their juice, wine, Ricard, parsley, thyme, bay leaf, and peppercorns. Bring to a boil over a high flame, then reduce the heat to a simmer. Cook until the tomatoes have broken down substantially, 15 to 20 minutes, stirring frequently throughout.3.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Add the fish bones and enough water so that the bones are covered. Stir while the stock simmers for 20 minutes. Strain the liquid through a fine-mesh sieve.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let cool, then refrigerate for up to 2 days.4. Before using, skim the surface of any impurities that rise to the top.5. Reheat the zuppa in a stockpot over a medium flame until gently simmering. Season with salt and pepper to taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add the fish pieces and cook for about 6 minutes; the fish should be well cooked and flaky. Ladle the soup into serving bowls.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Add the chopped parsley just before serving, and drizzle with a high-quality extra-virgin olive oil.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 37, u'instructions': u'1. Heat the 1/4 cup olive oil in a large stockpot or Dutch oven. Add the garlic, fennel, leek, and celery. Cook, stirring occasionally, until the vegetables are translucent, 7 to 10 minutes. Season with 1 teaspoon salt and 1/4 teaspoon black pepper. Add the fresh tomatoes and continue cooking until they begin to break down, about 10 minutes.2. Add the canned tomatoes and their juice, wine, Ricard, parsley, thyme, bay leaf, and peppercorns. Bring to a boil over a high flame, then reduce the heat to a simmer. Cook until the tomatoes have broken down substantially, 15 to 20 minutes, stirring frequently throughout.3. Add the fish bones and enough water so that the bones are covered. Stir while the stock simmers for 20 minutes. Strain the liquid through a fine-mesh sieve. Let cool, then refrigerate for up to 2 days.4. Before using, skim the surface of any impurities that rise to the top.5. Reheat the zuppa in a stockpot over a medium flame until gently simmering. Season with salt and pepper to taste. Add the fish pieces and cook for about 6 minutes; the fish should be well cooked and flaky. Ladle the soup into serving bowls. Add the chopped parsley just before serving, and drizzle with a high-quality extra-virgin olive oil.', u'spoonacularSourceUrl': u'https://spoonacular.com/seafood-soup-amalfi-style-598219', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}