{u'recipes': [{u'sourceName': u'Your Homebased Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485872-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 485872, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cashew Sesame Chicken', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 324.42, u'creditText': u'Your Homebased Mom', u'extendedIngredients': [{u'originalString': u'1 12 oz. jar apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 19719, u'unit': u'oz'}, {u'originalString': u'2 Tbsp chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'Tbsp'}, {u'originalString': u'1/4 C cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20027, u'unit': u'C'}, {u'originalString': u'1 tsp dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 gloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tsp minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp lemon rind', u'aisle': u'Produce', u'name': u'lemon rind', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'1 tsp orange rind', u'aisle': u'Produce', u'name': u'orange rind', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'tsp'}, {u'originalString': u'1 C chopped, unsalted dry roasted cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted cashews', u'metaInformation': [u'unsalted', u'dry', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12085, u'unit': u'C'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/2 C sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12023, u'unit': u'C'}, {u'originalString': u'2 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 tsp soy sauce or tamari sauce', u'aisle': u'Ethnic Foods', u'name': u'tamari soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'tsp'}, {u'originalString': u'Vegetable oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.yourhomebasedmom.com/cashew-sesame-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all the marinade ingredients and add chicken. Marinade at least 3 hours or overnight in the refrigerator.Chop cashews finely and mix with sesame seeds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [], u'step': u'Add in cornstarch.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Heat oil until about 375 degrees.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll chicken in nut mixture and fry in batches until golden brown on both sides.For dipping sauce combine all the ingredients.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over rice with dipping sauce.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 416, u'instructions': u'Combine all the marinade ingredients and add chicken. Marinade at least 3 hours or overnight in the refrigerator.Chop cashews finely and mix with sesame seeds. Add in cornstarch. Heat oil until about 375 degrees. Roll chicken in nut mixture and fry in batches until golden brown on both sides.For dipping sauce combine all the ingredients.Serve over rice with dipping sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/cashew-sesame-chicken-485872', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}