{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/617783-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 617783, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Cream Cheese Crescent Braid', u'diets': [], u'pricePerServing': 170.57, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'1/2 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 (8 oz) package cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 tube crescent rolls', u'aisle': u'Refrigerated', u'name': u'crescent rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'tube', u'unitShort': u'tube', u'amount': 1.0, u'consistency': u'solid', u'id': 93618, u'unit': u'tube'}, {u'originalString': u'3 Tbsp all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'1/2 c. granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'1-2 tsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tsp'}, {u'originalString': u'1/2 c. powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'c'}, {u'originalString': u'1 c. pumpkin', u'aisle': u'Produce', u'name': u'pumpkin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11422, u'unit': u'c'}, {u'originalString': u'1/2 tsp pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/2014/10/pumpkin-cream-cheese-crescent-braid/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees. In a mixing bowl cream mix together cream cheese, sugar, flour and vanilla until combined. Set aside. In a different mixing bowl mix together pumpkin and pumpkin pie spice.Unroll crescent roll dough leaving it in one big rectangle and press together seams. Lay the crescent roll dough on an ungreased half sheet baking pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'crescent roll dough'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Cut 1/2 inch strips on each side of crescent roll dough rectangle leaving a 3-4 inch center piece that is not cut. Carefully spread the cream cheese mixture down the center of dough. Top with pumpkin mixture. Fold cut pieces of crescent dough forming a braid. Some of the filling will be visible. Tuck the end over and into the braid.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'crescent roll dough'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}]}, {u'equipment': [], u'step': u'Bake for 15-20 minutes or until crescent dough is golden brown. Cool 5 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Remove to serving platter. In a small mixing bowl combine cinnamon, powdered sugar and milk.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Drizzle over crescent braid.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Preheat oven to 375 degrees. In a mixing bowl cream mix together cream cheese, sugar, flour and vanilla until combined. Set aside. In a different mixing bowl mix together pumpkin and pumpkin pie spice.Unroll crescent roll dough leaving it in one big rectangle and press together seams. Lay the crescent roll dough on an ungreased half sheet baking pan. Cut 1/2 inch strips on each side of crescent roll dough rectangle leaving a 3-4 inch center piece that is not cut. Carefully spread the cream cheese mixture down the center of dough. Top with pumpkin mixture. Fold cut pieces of crescent dough forming a braid. Some of the filling will be visible. Tuck the end over and into the braid. Bake for 15-20 minutes or until crescent dough is golden brown. Cool 5 minutes. Remove to serving platter. In a small mixing bowl combine cinnamon, powdered sugar and milk. Drizzle over crescent braid.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-cream-cheese-crescent-braid-617783', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}