{u'recipes': [{u'sourceName': u'Blogging Over Thyme', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/602695-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 602695, u'veryPopular': False, u'lowFodmap': False, u'title': u'Butter Basted Flank Steak', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 303.61, u'creditText': u'Blogging Over Thyme', u'extendedIngredients': [{u'originalString': u'10 ounces flank steak, trimmed (roughly 3/4" to 1" inch thick)', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [u'thick', u'trimmed', u'(roughly 3/4" to 1" inch )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'ounces'}, {u'originalString': u'6-7 sprigs of fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 6.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'4 garlic cloves, peeled and smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.bloggingoverthyme.com/2014/06/27/butter-basted-flank-steak/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pat the trimmed steak completely dry and allow it to rest at room temperature for at least 20 minutes (this will prevent your pan from losing heat quickly and from "shocking" the meat).Season the steak on both sides with salt and pepper--be generous.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a cast-iron or heavy skillet over medium high heat. When the oil is hot, carefully place the flank steak in the pan and sear it for 4-5 minutes on one side, until the bottom is browned--do not move the steak at all.Flip the steak carefully, reduce the heat to medium, and add the butter, smashed garlic cloves, and fresh thyme to the pan immediately. Hold the pan handle with one hand (use a towel, as it will be hot)\xa0and tilt the pan slightly, use your other hand to spoon the melted, bubbling butter mixture over the steak repeatedly until it is cooked to medium-rare (note: cooking time will depend on the thickness of your steak--if your steak is 1" stick, a medium-rare cook time will be approximately 10 minutes).', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the steak from the pan and allow it to rest on a cutting board for at least 5 minutes. Slice thinly against the grain and serve immediately. Top with the crispy smashed garlic cloves.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are my top picks for Flank Steak. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. One wine you could try is Black River Winery Merlot. It has 4.3 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': None, u'title': u'Black River Winery Merlot', u'price': u'$10.0', u'id': 430352, u'link': u'https://www.amazon.com/2009-Black-River-Winery-Merlot/dp/B00ED59310', u'imageUrl': u'https://spoonacular.com/productImages/430352-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u'Pat the trimmed steak completely dry and allow it to rest at room temperature for at least 20 minutes (this will prevent your pan from losing heat quickly and from "shocking" the meat).Season the steak on both sides with salt and pepper--be generous.Heat the olive oil in a cast-iron or heavy skillet over medium high heat. When the oil is hot, carefully place the flank steak in the pan and sear it for 4-5 minutes on one side, until the bottom is browned--do not move the steak at all.Flip the steak carefully, reduce the heat to medium, and add the butter, smashed garlic cloves, and fresh thyme to the pan immediately. Hold the pan handle with one hand (use a towel, as it will be hot)\xa0and tilt the pan slightly, use your other hand to spoon the melted, bubbling butter mixture over the steak repeatedly until it is cooked to medium-rare (note: cooking time will depend on the thickness of your steak--if your steak is 1" stick, a medium-rare cook time will be approximately 10 minutes).Remove the steak from the pan and allow it to rest on a cutting board for at least 5 minutes. Slice thinly against the grain and serve immediately. Top with the crispy smashed garlic cloves.', u'spoonacularSourceUrl': u'https://spoonacular.com/butter-basted-flank-steak-602695', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}