{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'cheap': False, u'gaps': u'no', u'id': 731653, u'veryPopular': False, u'lowFodmap': False, u'title': u'Golden Pan-Fried Fish', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 820.81, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u"1/4 cup dark ale or non-alcoholic (such as O'Doul's)", u'aisle': u'Alcoholic Beverages', u'name': u'ale', u'metaInformation': [u'dark', u"(such as O'Doul's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10014006, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons coarse kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'3 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 tablespoons (or more) extra-olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds 1 1/2-inch-thick halibut', u'aisle': u'Seafood', u'name': u'halibut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halibut-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 15036, u'unit': u'pounds'}, {u'originalString': u'2 teaspoons finely grated lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u'teaspoons'}, {u'originalString': u'1 3 1/2-ounce package panko (Japanese breadcrumbs; 1 1/2 cups)*', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [u'(Japanese breadcrumbs; 1 1/2 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 10018079, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon finely chopped fresh Italian parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh', u'italian', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'Quick Tartar Sauce', u'aisle': u'Condiments', u'name': u'tartar sauce', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 27049, u'unit': u'servings'}], u'healthScore': 53.0, u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Golden-Pan-Fried-Fish-350404', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut fish into 4x1 1/4-inch rectangular Sprinkle with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine next 5 ingredients in large bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk egg whites and ale in medium bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10014006, u'name': u'ale'}]}, {u'equipment': [], u'step': u'Add fish to ale mixture and turn to coat; shake off excess, then turn fish in panko mixture to coat all sides.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10014006, u'name': u'ale'}]}, {u'equipment': [], u'step': u'Place on plate.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 3 tablespoons oil in large nonstick skillet over medium-high heat.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add half of fish sticks. Cook until golden and just opaque in center, about 2 minutes per side. Repeat with remaining fish sticks, adding more oil to skillet as necessary.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer fish to paper towels; sprinkle with salt and pepper.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve immediately with tartar sauce.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 27049, u'name': u'tartar sauce'}]}, {u'equipment': [], u'step': u'Available in the Asian foods section of some supermarkets and at Asian markets.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Luna Nuda Pinot Grigio. It has 4.4 out of 5 stars and a bottle costs about 14 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste. View More', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 49, u'instructions': u'Preparation                                        Cut fish into 4x1 1/4-inch rectangular Sprinkle with salt and pepper. Combine next 5 ingredients in large bowl.                                                                            Whisk egg whites and ale in medium bowl. Add fish to ale mixture and turn to coat; shake off excess, then turn fish in panko mixture to coat all sides. Place on plate.                                                                            Heat 3 tablespoons oil in large nonstick skillet over medium-high heat. Add half of fish sticks. Cook until golden and just opaque in center, about 2 minutes per side. Repeat with remaining fish sticks, adding more oil to skillet as necessary. Transfer fish to paper towels; sprinkle with salt and pepper. Serve immediately with tartar sauce.                                                                            Available in the Asian foods section of some supermarkets and at Asian markets.', u'spoonacularSourceUrl': u'https://spoonacular.com/golden-pan-fried-fish-731653', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}