{u'recipes': [{u'sourceName': u'Beantown Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/509778-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 509778, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spinach and Strawberry Salad', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 263.01, u'creditText': u'Beantown Baker', u'extendedIngredients': [{u'originalString': u'1 bundle asparagus', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'6 oz baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'2 Tbsp balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'Tbsp'}, {u'originalString': u'1 oz crumbled goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1/4 cup chopped nuts', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12135, u'unit': u'cup'}, {u'originalString': u'1 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup strawberries, hulled and quartered', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'hulled', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}], u'healthScore': 99.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.beantownbaker.com/2010/06/spinach-and-strawberry-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400. Line a baking sheet with aluminum foil to avoid a mess.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle 1 Tbsp olive oil over asparagus. Use your hand to stir it up so all the asparagus gets coated. Sprinkle with salt and pepper. Roast in oven for 15 minutes, stirring once in the middle.Allow asparagus to cool to room temperature and slice into ~2" pieces.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Mix the vinegar and 1 Tbsp of olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the nuts, strawberries, and asparagus. Toss to coat and add the spinach. Sprinkle cheese on salad just before serving.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Preheat oven to 400. Line a baking sheet with aluminum foil to avoid a mess. Drizzle 1 Tbsp olive oil over asparagus. Use your hand to stir it up so all the asparagus gets coated. Sprinkle with salt and pepper. Roast in oven for 15 minutes, stirring once in the middle.Allow asparagus to cool to room temperature and slice into ~2" pieces.Mix the vinegar and 1 Tbsp of olive oil. Add the nuts, strawberries, and asparagus. Toss to coat and add the spinach. Sprinkle cheese on salad just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-and-strawberry-salad-509778', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}