{u'recipes': [{u'sourceName': u'The Vintage Mixer', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/615439-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 615439, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salmon with Apple, Cucumber, Avocado Salsa', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'pescatarian'], u'preparationMinutes': 8, u'pricePerServing': 514.88, u'creditText': u'The Vintage Mixer', u'extendedIngredients': [{u'originalString': u'1/2 avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/4 cup, plus 2 tablespoons Girards Champagne Vinegar Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'champagne vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cup'}, {u'originalString': u'1/2 cucumber', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 small endive (optional)', u'aisle': u'Produce', u'name': u'endive', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/escarole.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11213, u'unit': u''}, {u'originalString': u'1 honey crisp apple', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'crisp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u''}, {u'originalString': u'1 tablespoon lime juice (juice from 1/2 lime)', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'(juice from 1/2 lime)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 tablespoon mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 head of romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'head'}, {u'originalString': u'1 1/2 lb salmon', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 15076, u'unit': u'lb'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.thevintagemixer.com/2014/09/salmon-with-apple-cucumber-avocado-salsa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Start by chopping the apple, cucumber, and avocado.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place them all in a bowl and add in chopped mint and the 1/4 cup of salad dressing. Stir to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tablespoon of olive oil over medium high heat. Slice the fresh salmon into 4 equal parts, then pat dry and sprinkle sea salt over each. Cook the salmon over medium high heat skin side down first.  Cook for 4-5 minutes or until the skin starts to release from the surface of the skillet (be careful not to overcook as you still want some pink in the middle). Then flip and and cook skin side up for an additional 1-2 minutes (just to brown the top). *see note on cooking time', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Mix the chopped lettuces with the extra two tablespoons of dressing.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add in 3/4 of the apple mixture and toss.  Taste and add more dressing as needed.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve salmon on top of greens then add more of the apple salsa to the top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Garnish with extra mint.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Vampire Pinot Grigio Wine. It has 4.5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This dry, zestful combination is reminiscent of ripe pears and roses', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Start by chopping the apple, cucumber, and avocado.  Place them all in a bowl and add in chopped mint and the 1/4 cup of salad dressing. Stir to combine.Heat 1 tablespoon of olive oil over medium high heat. Slice the fresh salmon into 4 equal parts, then pat dry and sprinkle sea salt over each. Cook the salmon over medium high heat skin side down first.  Cook for 4-5 minutes or until the skin starts to release from the surface of the skillet (be careful not to overcook as you still want some pink in the middle). Then flip and and cook skin side up for an additional 1-2 minutes (just to brown the top). *see note on cooking timeMix the chopped lettuces with the extra two tablespoons of dressing.  Add in 3/4 of the apple mixture and toss.  Taste and add more dressing as needed. Serve salmon on top of greens then add more of the apple salsa to the top. Garnish with extra mint.', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-with-apple-cucumber-avocado-salsa-615439', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}