{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507465-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 507465, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coconut Shrimp with Mango Dipping Sauce', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 40, u'pricePerServing': 304.74, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'\xbc cup fresh cilantro leaves', u'aisle': u'Produce', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon ground white pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1 cup frozen mango chunks, thawed', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u'1 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 cup panko bread crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1 pound extra-large shrimp (21 to 25 count), peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'extra-large', u'deveined', u'peeled', u'(21 to 25 count)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'6 to 8 drops Sriracha sauce (add more if you like it a bit more spicy)', u'aisle': u'Condiments', u'name': u'sriracha sauce', u'metaInformation': [u'(add more if you like it a bit more spicy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 6.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'drops'}, {u'originalString': u'\xbc teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon table salt', u'aisle': u'Spices and Seasonings', u'name': u'table salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup unsweetened shredded coconut', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}, {u'originalString': u'1 to 2 quarts vegetable oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'quart', u'unitShort': u'quarts', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'quarts'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.browneyedbaker.com/2013/05/29/coconut-shrimp-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all of the dipping sauce ingredients into a food processor or blender and process until completely smooth.', u'number': 1, u'ingredients': []}], u'name': u'Make the Mango Dipping Sauce'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the flour, spices, salt and sugar in a shallow dish or pie plate. Lightly beat the eggs with the water in another shallow dish.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Combine the coconut and panko in a third shallow dish. 3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Heat the vegetable oil in a Dutch oven or other large pot over medium-high heat until it reaches 350 degrees.4. Meanwhile, coat and bread the shrimp. Working with several shrimp at a time, drop them into the flour mixture and turn to coat. Shake the excess flour from the shrimp, then dip the shrimp into the eggs, turning to coat well, and allow the excess to drip off. Drop the shrimp into the coconut-panko mixture, and press the coconut lightly to adhere. Shake off any excess coconut and place the shrimp on a wire rack set over a rimmed baking sheet. Repeat with the remaining shrimp.5. When the oil reaches 350 degrees F, gently place half of the shrimp in the oil and fry, stirring frequently to prevent sticking, until golden, about 2 1/2 minutes. Using a slotted spoon, spider, or tongs, transfer the shrimp to a wire cooling rack placed over a baking sheet and repeat with the remaining shrimp.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve immediately, accompanied by the mango dipping sauce.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}], u'name': u'Place in an airtight container in the refrigerator until ready to serve (will keep for 1 week).2. Make the Shrimp'}], u'aggregateLikes': 3461, u'instructions': u'1. Make the Mango Dipping Sauce: Place all of the dipping sauce ingredients into a food processor or blender and process until completely smooth. Place in an airtight container in the refrigerator until ready to serve (will keep for 1 week).2. Make the Shrimp: Whisk together the flour, spices, salt and sugar in a shallow dish or pie plate. Lightly beat the eggs with the water in another shallow dish. Combine the coconut and panko in a third shallow dish. 3. Heat the vegetable oil in a Dutch oven or other large pot over medium-high heat until it reaches 350 degrees.4. Meanwhile, coat and bread the shrimp. Working with several shrimp at a time, drop them into the flour mixture and turn to coat. Shake the excess flour from the shrimp, then dip the shrimp into the eggs, turning to coat well, and allow the excess to drip off. Drop the shrimp into the coconut-panko mixture, and press the coconut lightly to adhere. Shake off any excess coconut and place the shrimp on a wire rack set over a rimmed baking sheet. Repeat with the remaining shrimp.5. When the oil reaches 350 degrees F, gently place half of the shrimp in the oil and fry, stirring frequently to prevent sticking, until golden, about 2 1/2 minutes. Using a slotted spoon, spider, or tongs, transfer the shrimp to a wire cooling rack placed over a baking sheet and repeat with the remaining shrimp. Serve immediately, accompanied by the mango dipping sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-shrimp-with-mango-dipping-sauce-507465', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}