{u'recipes': [{u'sourceName': u'Food and Wine', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/775516-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 775516, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pappardelle with Summer Squash and Arugula-Walnut Pesto', u'diets': [], u'pricePerServing': 256.51, u'creditText': u'Food and Wine', u'extendedIngredients': [{u'originalString': u'4 cups packed arugula leaves (4 ounces)', u'aisle': u'Produce', u'name': u'arugula leaves', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11959, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon finely grated garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup extra-virgin olive oil, plus more for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'12 ounces pappardelle', u'aisle': u'Pasta and Rice', u'name': u'pappardelle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Pappardelle.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10120409, u'unit': u'ounces'}, {u'originalString': u'1/2 cup freshly grated Parmigiano-Reggiano cheese, plus shavings for garnish', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'freshly grated', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'3/4 cup walnut halves', u'aisle': u'Nuts;Baking', u'name': u'walnut halves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'3 firm, fresh medium zucchini and/or yellow squash (1 1/4 pounds), very thinly sliced lengthwise on a mandoline', u'aisle': u'Produce', u'name': u'zucchini squash', u'metaInformation': [u'fresh', u'yellow', u'firm', u'medium', u'very thinly sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 11477, u'unit': u'pounds'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.foodandwine.com/recipes/pappardelle-summer-squash-and-arugula-walnut-pesto', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a small skillet, toast the walnuts over moderately low heat until golden, about 5 minutes. Finely chop 1/2 cup of the walnuts; coarsely chop the rest for garnish.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a food processor, pulse 2 cups of the arugula until finely chopped; scrape into a large bowl and stir in the 3/4 cup of olive oil, the garlic, grated cheese and finely chopped walnuts. Season the pesto with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot of salted boiling water, cook the pappardelle until al dente.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Pappardelle.jpg', u'id': 10120409, u'name': u'pappardelle'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the pasta and add to the pesto in the bowl.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the zucchini and toss to evenly coat. Stir in the lemon juice and the remaining 2 cups of arugula and season with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}, {u'equipment': [], u'step': u'Transfer the pasta to a platter, drizzle with olive oil and garnish with the coarsely chopped walnuts and cheese shavings.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'aggregateLikes': 2091, u'instructions': u'In a small skillet, toast the walnuts over moderately low heat until golden, about 5 minutes. Finely chop 1/2 cup of the walnuts; coarsely chop the rest for garnish.                                              In a food processor, pulse 2 cups of the arugula until finely chopped; scrape into a large bowl and stir in the 3/4 cup of olive oil, the garlic, grated cheese and finely chopped walnuts. Season the pesto with salt and pepper.                                              In a large pot of salted boiling water, cook the pappardelle until al dente. Drain the pasta and add to the pesto in the bowl. Add the zucchini and toss to evenly coat. Stir in the lemon juice and the remaining 2 cups of arugula and season with salt and pepper. Transfer the pasta to a platter, drizzle with olive oil and garnish with the coarsely chopped walnuts and cheese shavings.', u'spoonacularSourceUrl': u'https://spoonacular.com/pappardelle-with-summer-squash-and-arugula-walnut-pesto-775516', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}