{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/222152-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 222152, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti omelette', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 102.6, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g cooked spaghetti or other pasta', u'aisle': u'Pasta and Rice', u'name': u'cooked spaghetti', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11420421, u'unit': u'g'}, {u'originalString': u'2 courgettes, grated', u'aisle': u'Produce', u'name': u'courgettes', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tbsp chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'300g pot fresh cheese sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'nacho cheese sauce', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nacho-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'liquid', u'id': 98901, u'unit': u'g'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/586650/spaghetti-omelette-', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat half the oil in a medium non-stickfrying pan and add the garlic and onion.Cook for 2-3 mins, until softened. Usingyour hands, squeeze out as muchmoisture from the courgettes aspossible.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add them to the pan and cookfor a further 3-4 mins, until tender. Spoonthe vegetables into a large bowl.Stir in the parsley, cheese sauce andspaghetti and season. Beat the eggsand stir into the mixture.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat remaining oil in the frying pan andtip in the spaghetti mixture. Level it out withthe back of a spoon and cook over a mediumheat for 3-5 mins, until almost set.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to a hot grill for 2-3 mins, untilgolden. Leave to cool in the pan for5 mins, then cut into wedges and serve.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine are great choices for Omelet. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. One wine you could try is Villa Sandi Fresco Prosecco. It has 4.3 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'This wine is featured at Starbucks\xae locations where their Evenings menu is offered.Very pale straw yellow and fine, persistent perlage. The aromais fruity and flowery with hints of ripe golden apple and smallmountain flowers. The dry, fresh and flavoursome sensation onthe palate is followed by a fruity and harmonious aftertaste. View More', u'title': u'Villa Sandi Fresco Prosecco', u'price': u'$12.99', u'id': 450027, u'link': u'https://www.wine.com/product/villa-sandi-fresco-prosecco/105669', u'imageUrl': u'https://spoonacular.com/productImages/450027-312x231.jpg'}]}, u'aggregateLikes': 81, u'instructions': u'Heat half the oil in a medium non-stickfrying pan and add the garlic and onion.Cook for 2-3 mins, until softened. Usingyour hands, squeeze out as muchmoisture from the courgettes aspossible. Add them to the pan and cookfor a further 3-4 mins, until tender. Spoonthe vegetables into a large bowl.Stir in the parsley, cheese sauce andspaghetti and season. Beat the eggsand stir into the mixture.Heat remaining oil in the frying pan andtip in the spaghetti mixture. Level it out withthe back of a spoon and cook over a mediumheat for 3-5 mins, until almost set.Transfer to a hot grill for 2-3 mins, untilgolden. Leave to cool in the pan for5 mins, then cut into wedges and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-omelette-222152', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}