{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212625-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 212625, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spring veggie casserole with little herb dumplings', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 120, u'pricePerServing': 292.81, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g baby carrots, scraped but left whole', u'aisle': u'Produce', u'name': u'baby carrots', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11960, u'unit': u'g'}, {u'originalString': u"200g baby courgettes, each cut into 4 chunks, or 2 courgettes cut in sticks Courgette corr-zjet The courgette is a variety of cucurtbit, which means it's from the same family as cucumber,…", u'aisle': u'Produce', u'name': u'baby peas', u'metaInformation': [u"cut into 4 chunks, or 2 courgettes cut in sticks courgette corr-zjet the courgette is a variety of cucurtbit, which means it's from the same family as cucumber,…"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'50g butter at room temperature, cut in pieces Butter butt-err Butter is made when lactic-acid producing bacteria are added to cream and churned to make an…', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cut in pieces butter butt-err butter is made when lactic-acid producing bacteria are added to cream and churned to make an…', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'50g mature cheddar, finely grated', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1009, u'unit': u'g'}, {u'originalString': u'250g chestnut mushrooms, halved if large', u'aisle': u'Produce', u'name': u'chestnut mushrooms', u'metaInformation': [u'large', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11266, u'unit': u'g'}, {u'originalString': u'2 tsp cornflour', u'aisle': u'Baking', u'name': u'cornflour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tsp'}, {u'originalString': u'2-3 fennel bulbs (about 500g total weight), each cut into 8 wedges Fennel bulb Like Marmite, fennel is something that you either love or hate - its strong aniseed flavour…', u'aisle': u'Produce', u'name': u'fennel bulbs', u'metaInformation': [u'cut into 8 wedges fennel bulb like marmite, fennel is something that you either love or hate - its strong aniseed flavour…', u'( 500g total weight)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'3 peeled garlic cloves, cut in half lengthways', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled', u'cut in half lengthways'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'200g green beans, trimmed and cut in half', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'trimmed', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11052, u'unit': u'g'}, {u'originalString': u'pinch of muscovado sugar, light or dark', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'dark', u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'pinch'}, {u'originalString': u'\xbd tsp light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tsp'}, {u'originalString': u'250g small new potatoes, cut int half New potatoes n-ew po-tate-oes New potatoes have thin, wispy skins and a crisp, waxy texture. They are young potatoes and…', u'aisle': u'Produce', u'name': u'new potatoes', u'metaInformation': [u'small', u'crisp', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11352, u'unit': u'g'}, {u'originalString': u"3 tbsp light olive oil Olive oil ol-iv oyl Probably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil cooking spray', u'metaInformation': [u'light', u'fresh', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cooking-spray.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1004679, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp each snipped chives and chopped parsley Parsley par-slee One of the most ubiquitous herbs in British cookery, parsley is also popular in European and…', u'aisle': u'Produce', u'name': u'parsley', u'metaInformation': [u'snipped', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp finely chopped parsley Parsley par-slee One of the most ubiquitous herbs in British cookery, parsley is also popular in European and…', u'aisle': u'Produce', u'name': u'parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'\xbd fresh red chilli, seeded and finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'fresh', u'red', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'100g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}, {u'originalString': u'8 shallots, peeled and cut in half lengthways Shallot shal-lot Related to the onion (as opposed to being a younger version of it), shallots grow in clusters at…', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'peeled', u'cut in half lengthways shallot shal-lot related to the onion (as opposed to being a younger version of it), shallots grow in clusters at…'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'600ml boiling vegetable stock (Marigold Swiss bouillion is good)', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'good', u'boiling', u'(Marigold Swiss bouillion is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 600.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}, {u'originalString': u'300g fruity white wine, such as sauvignon blanc or pinot grigio', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'fruity', u'white', u' such as sauvignon blanc or pinot grigio'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'g'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3291/spring-veggie-casserole-with-little-herb-dumplings', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'To make the dumplings, rub the flour and butter together so it looks like breadcrumbs. Stir in the cheese, parsley and salt and pepper to season and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large pan or flameproof casserole (about 3.5 litres) over a high-ish heat, then throw in the halved shallots. Fry for 2-3 minutes till beginning to soften and turn brown and gold in places. Now still working on quite a high heat, add the potatoes and watch for the same effect, about 5-7 minutes, stirring with a wooden spoon and generally moving the pan about a bit.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the garlic, carrots and fennel, allowing a couple of minutes between each so they get a chance to release their flavours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Pour in the stock along with most of the wine, then stir in the sugar and soy sauce and return to the boil. Simmer covered for 10 minutes. If preparing ahead make up to the end of step 2, cool and chill for up to five hours. About 20 minutes before you are ready to serve, bring back to the boil, and continue with step 3.Stir about 2 tbsp of water into the dumpling mixture to form a soft dough. Break off small pieces to make 20-25 dumplings, then shape into rounds about the size of a cherry tomato.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the green beans and simmer for 5 minutes, then add the mushrooms and courgettes. Stir the cornflour into the remaining wine until it has dissolved, then stir into the casserole until it thickens. Bring to the boil, stir well then gently place the dumplings on top. Cover the pan with a lid and simmer gently for about 15 minutes till the dumplings have risen, and the stew is rich and thick and the vegetables deliciously tender. Check the seasoning.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the chilli and herbs together in a small bowl and scatter on top of the casserole.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}], u'name': u''}], u'aggregateLikes': 258, u'instructions': u'To make the dumplings, rub the flour and butter together so it looks like breadcrumbs. Stir in the cheese, parsley and salt and pepper to season and set aside.Heat the oil in a large pan or flameproof casserole (about 3.5 litres) over a high-ish heat, then throw in the halved shallots. Fry for 2-3 minutes till beginning to soften and turn brown and gold in places. Now still working on quite a high heat, add the potatoes and watch for the same effect, about 5-7 minutes, stirring with a wooden spoon and generally moving the pan about a bit. Add the garlic, carrots and fennel, allowing a couple of minutes between each so they get a chance to release their flavours. Pour in the stock along with most of the wine, then stir in the sugar and soy sauce and return to the boil. Simmer covered for 10 minutes. If preparing ahead make up to the end of step 2, cool and chill for up to five hours. About 20 minutes before you are ready to serve, bring back to the boil, and continue with step 3.Stir about 2 tbsp of water into the dumpling mixture to form a soft dough. Break off small pieces to make 20-25 dumplings, then shape into rounds about the size of a cherry tomato. Add the green beans and simmer for 5 minutes, then add the mushrooms and courgettes. Stir the cornflour into the remaining wine until it has dissolved, then stir into the casserole until it thickens. Bring to the boil, stir well then gently place the dumplings on top. Cover the pan with a lid and simmer gently for about 15 minutes till the dumplings have risen, and the stew is rich and thick and the vegetables deliciously tender. Check the seasoning.Mix the chilli and herbs together in a small bowl and scatter on top of the casserole.', u'spoonacularSourceUrl': u'https://spoonacular.com/spring-veggie-casserole-with-little-herb-dumplings-212625', u'dishTypes': [u'side dish'], u'occasions': [u'spring', u'fall', u'winter', u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}