{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'jewish'], u'image': u'https://spoonacular.com/recipeImages/414945-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 165, u'id': 414945, u'veryPopular': False, u'lowFodmap': False, u'title': u'Holiday Beef Brisket', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 336.82, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 beef bouillon cubes', u'aisle': u'Canned and Jarred', u'name': u'beef bouillon cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 6076, u'unit': u''}, {u'originalString': u'1 fresh beef brisket (3 pounds)', u'aisle': u'Meat', u'name': u'beef brisket', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-brisket.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 13023, u'unit': u'pounds'}, {u'originalString': u'4 medium carrots, cut into chunks', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery ribs, cut into chunks', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'2 large onions, sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'5 small potatoes, peeled and cut into chunks', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'small', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1-1/2 cups hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 96.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/holiday-beef-brisket', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Place onions in a greased shallow roasting pan; top with brisket.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine the ketchup, paprika and garlic powder; spread over brisket. Dissolve bouillon in hot water; pour into pan. Cover and bake at 325\xb0 for 1-1/2 hours.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the potatoes, carrots and celery. Cover and bake 1-1/4 to 1-1/2 hours longer or until meat and vegetables are tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Remove brisket to a serving platter; let stand for 10 minutes. Thinly slice meat across the grain.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with vegetables.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 46, u'instructions': u"Directions                                                                                Place onions in a greased shallow roasting pan; top with brisket. Combine the ketchup, paprika and garlic powder; spread over brisket. Dissolve bouillon in hot water; pour into pan. Cover and bake at 325\xb0 for 1-1/2 hours.                                                                                            Add the potatoes, carrots and celery. Cover and bake 1-1/4 to 1-1/2 hours longer or until meat and vegetables are tender.                                                                                           Remove brisket to a serving platter; let stand for 10 minutes. Thinly slice meat across the grain. Serve with vegetables.                                        Yield: 6 servings.                                                                                                     Editor's Note: This is a fresh beef brisket, not corned beef.                                                                                                Originally published as Holiday Beef Brisket in  Taste of HomeDecember/January 2008, p58                                                                                                                                                                                                        Nutritional Facts                                                                             6 ounces equals 451 calories, 10 g fat (4 g saturated fat), 96 mg cholesterol, 788 mg sodium, 39 g carbohydrate, 4 g fiber, 50 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/holiday-beef-brisket-414945', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'hanukkah'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}