{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/245183-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 245183, u'veryPopular': True, u'lowFodmap': False, u'title': u'Broccoli Rabe with Caramelized Onions', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 64.6, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 large bunch of broccoli rabe (raab, rapini), rinsed and cut into 2-inch long pieces', u'aisle': u'Produce', u'name': u'broccoli rabe', u'metaInformation': [u'large', u'rinsed', u'cut into 2-inch long pieces', u'(raab, rapini)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11096, u'unit': u'bunch'}, {u'originalString': u'2-3 garlic cloves, sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon red chili flakes', u'aisle': u'Spices and Seasonings', u'name': u'red chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 yellow onion, sliced into slivers, lengthwise (with the grain)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'with the grain)', u'sliced into slivers, lengthwise ('], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/broccoli_rabe_with_caramelized_onions/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 Tbsp olive oil in a large saut\xe9 pan on medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Add the onions, spread out in a thin layer.  Cook, stirring occasionally until softened and then lightly browned.  (Tip: to speed up the caramelization process you can sprinkle a pinch of sugar over the onions.) If the onions start to dry out at all, lower the heat (you can add a little water to them too.)  They should brown, but not get dried out.2 After you start the onions, bring a large pot of water to a boil.  The onions take at least 15 minute to cook, so you'll have time to get the water boiling.  Salt the water (about a tablespoon of salt for 3 quarts of water).  Prepare an ice bath, fill a large bowl half way with ice water.", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u"Add the rabe to the boiling water. Blanch for 1 minute. Use a slotted spoon to remove from the boiling water and put in the ice bath to stop the cooking.  Shocking the rabe with ice water will also help keep the rabe bright green colored.Note that some people blanch their rabe, some do not.  Rabe can be rather bitter, so blanching will help take the edge off of the bitterness.  If your rabe isn't particularly bitter, or you like bitter greens, you can easily skip this blanching step.", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the ice water from the rabe.  Use a clean tea towel to gently wring out the excess moisture from the rabe.3 Once the onions are lightly browned, remove them from the pan to a bowl.  Using the same pan, add another Tbsp of olive oil and heat the pan on high heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chili flakes. Once the chili flakes start to sizzle, add the garlic.  Once the garlic just starts to brown at the edges add the broccoli rabe and the onions.  Toss the rabe mixture so that it gets well coated with the olive oil.  Cook on high heat until most of the moisture is gone, about 5 minutes if you blanched first, a minute or too longer if you skipped the blanching.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'id': 11096, u'name': u'broccoli rabe'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 512, u'instructions': u"1 Heat 2 Tbsp olive oil in a large saut\xe9 pan on medium heat.  Add the onions, spread out in a thin layer.  Cook, stirring occasionally until softened and then lightly browned.  (Tip: to speed up the caramelization process you can sprinkle a pinch of sugar over the onions.) If the onions start to dry out at all, lower the heat (you can add a little water to them too.)  They should brown, but not get dried out.2 After you start the onions, bring a large pot of water to a boil.  The onions take at least 15 minute to cook, so you'll have time to get the water boiling.  Salt the water (about a tablespoon of salt for 3 quarts of water).  Prepare an ice bath, fill a large bowl half way with ice water.  Add the rabe to the boiling water. Blanch for 1 minute. Use a slotted spoon to remove from the boiling water and put in the ice bath to stop the cooking.  Shocking the rabe with ice water will also help keep the rabe bright green colored.Note that some people blanch their rabe, some do not.  Rabe can be rather bitter, so blanching will help take the edge off of the bitterness.  If your rabe isn't particularly bitter, or you like bitter greens, you can easily skip this blanching step.Drain the ice water from the rabe.  Use a clean tea towel to gently wring out the excess moisture from the rabe.3 Once the onions are lightly browned, remove them from the pan to a bowl.  Using the same pan, add another Tbsp of olive oil and heat the pan on high heat.  Add the chili flakes. Once the chili flakes start to sizzle, add the garlic.  Once the garlic just starts to brown at the edges add the broccoli rabe and the onions.  Toss the rabe mixture so that it gets well coated with the olive oil.  Cook on high heat until most of the moisture is gone, about 5 minutes if you blanched first, a minute or too longer if you skipped the blanching.", u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-rabe-with-caramelized-onions-245183', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}