{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/469504-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 469504, u'veryPopular': False, u'lowFodmap': False, u'title': u'Green Chili Tomato Soup', u'diets': [u'gluten free'], u'preparationMinutes': 3, u'pricePerServing': 113.31, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (10-3/4 ounces) condensed tomato soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'condensed tomato soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6159, u'unit': u'ounces'}, {u'originalString': u'1 can (4 ounces) chopped green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounces'}, {u'originalString': u'3/4 cup 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/green-chili-tomato-soup', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, combine the soup, milk and chilies until blended. Cook and stir over medium heat until heated through. Sprinkle with cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are great choices for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Codorniu Anna de Codorniu Cava Brut ros\xe9. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u"This Cava combines glamour, innovation and modernity with the experience and history of what is probably Codorniu's most iconic offering, Anna de Codorniu. Elegance and subtlety, which to a large extent come from a blend with approximately 70% of the most prestigious varietal for making rose cavas: Pinot Noir. Delicate cherry color with strawberry tones. Fine and persistent bubbles. Aromas of red fruit, strawberries, cherries and woodland fruits with hints of green apple. Elegant and light on the palate. Well balanced between acid and sweetness with a refreshing finish.", u'title': u'Codorniu Anna de Codorniu Cava Brut Rose', u'price': u'$12.99', u'id': 451641, u'link': u'https://www.wine.com/product/codorniu-anna-de-codorniu-cava-brut-rose/109416', u'imageUrl': u'https://spoonacular.com/productImages/451641-312x231.jpg'}]}, u'aggregateLikes': 74, u'instructions': u'Directions                                                                                In a small saucepan, combine the soup, milk and chilies until blended. Cook and stir over medium heat until heated through. Sprinkle with cheese.                                        Yield: 2 servings.                                                                                                                         Originally published as Green Chili Tomato Soup in  Quick CookingSeptember/October 2005, p18                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 270 calories, 10 g fat (7 g saturated fat), 37 mg cholesterol, 1,328 mg sodium, 33 g carbohydrate, 2 g fiber, 12 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/green-chili-tomato-soup-469504', u'dishTypes': [u'soup'], u'occasions': [u'super bowl', u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 8, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}