{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/536269-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 536269, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican Stuffed Acorn Squash', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 188.27, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'3 Acorn squash (about 1 – 1 1/2 pounds each), sliced in half, seeds removed', u'aisle': u'Produce', u'name': u'acorn squash', u'metaInformation': [u'seeds removed', u'sliced in half, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.5, u'consistency': u'solid', u'id': 11482, u'unit': u'pounds'}, {u'originalString': u'1 15 ounce can black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounce'}, {u'originalString': u'1 15 1/2 ounce can diced tomatoes and green chiles', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/2 pound mild Italian ground sausage', u'aisle': u'Meat', u'name': u'ground sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7063, u'unit': u'pound'}, {u'originalString': u'1 1/2 cups shredded Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'1/2 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 yellow bell pepper, seeded and chopped', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.acedarspoon.com/lisa-ann-garnish-lemon/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 375 degrees.Lightly grease a baking sheet and place squash on pan, cut side down.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 30-45 minutes or until tender (depending on size of squash).While the squash is baking, place oil in a large skillet over medium heat.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add sausage and cook for about 5 - 7 minutes or until sausage is browned on all sides. (Youll need to break it up as it cooks.)', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add onion and bell pepper to the pan, cooking for another 5 minutes or until onions are soft and sausage is cooked through. Stir in garlic, chili powder and cumin and heat for 1 minute.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add tomatoes and beans and stir until combined. Reduce heat to medium low and cook for another 15 minutes or until excess liquid is reduced. Season with salt and pepper.Divide sausage mixture evenly among baked squash halves and top each half with 1/4 cup cheese. Return to oven and bake until cheese is melted, about 8 minutes.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try SketchBook Pinot Noir Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'cherry', u'title': u'SketchBook Pinot Noir Wine', u'price': u'$20.0', u'id': 428766, u'link': u'https://www.amazon.com/2014-SketchBook-Mendocino-County-Pinot/dp/B01FEFJBAU', u'imageUrl': u'https://spoonacular.com/productImages/428766-312x231.jpg'}]}, u'aggregateLikes': 242, u'instructions': u'Preheat oven to 375 degrees.Lightly grease a baking sheet and place squash on pan, cut side down. Bake for 30-45 minutes or until tender (depending on size of squash).While the squash is baking, place oil in a large skillet over medium heat. Add sausage and cook for about 5 - 7 minutes or until sausage is browned on all sides. (Youll need to break it up as it cooks.) Add onion and bell pepper to the pan, cooking for another 5 minutes or until onions are soft and sausage is cooked through. Stir in garlic, chili powder and cumin and heat for 1 minute. Add tomatoes and beans and stir until combined. Reduce heat to medium low and cook for another 15 minutes or until excess liquid is reduced. Season with salt and pepper.Divide sausage mixture evenly among baked squash halves and top each half with 1/4 cup cheese. Return to oven and bake until cheese is melted, about 8 minutes.Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-stuffed-acorn-squash-536269', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}