{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/248827-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 248827, u'veryPopular': True, u'lowFodmap': False, u'title': u'Yakitori', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 128.72, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'1 pound chicken breast (cut into bite sized pieces)', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'cut into bite sized pieces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'pound'}, {u'originalString': u'* green onions (cut into 1 inch long pieces, optional)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'cut into 1 inch long pieces, optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'3 tablespoons mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93830, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons sake', u'aisle': u'Alcoholic Beverages', u'name': u'sake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 43479, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons soy', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16235, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.closetcooking.com/2009/07/yakitori.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Mix the soy, mirin, sake and sugar and marinate the chicken for at least 20 minutes.2. Skewer the chicken and green onions in alternating order.3. Grill the skewered chicken, basting it with the marinade until the chicken is cooked.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'id': 43479, u'name': u'sake'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sake, and Sauvignon Blanc are great choices for Yakitori. Sak\xe9 is an obvious choice when it comes to Japanese food. If you want to stick to grape wine, though, you might opt for sauvignon blanc or riesling. You could try Chateau Ste. Michelle Cold Creek Vineyard Riesling. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'riesling', u'sake', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish.', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 1136, u'instructions': u'Directions:1. Mix the soy, mirin, sake and sugar and marinate the chicken for at least 20 minutes.2. Skewer the chicken and green onions in alternating order.3. Grill the skewered chicken, basting it with the marinade until the chicken is cooked.', u'spoonacularSourceUrl': u'https://spoonacular.com/yakitori-248827', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}