{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/210136-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 210136, u'veryPopular': False, u'lowFodmap': True, u'title': u'Elderflower, lemon & vanilla cordial', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 955.04, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 unwaxed organic lemons, halved, plus a strip of peel', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [u'organic', u'halved', u'plus a strip of peel'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 tbsp citric acid powder or vitamin C powder', u'aisle': u'Spices and Seasonings', u'name': u'alum powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10118371, u'unit': u'tbsp'}, {u'originalString': u'1kg caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'kg'}, {u'originalString': u'1 vanilla pod, seeds reserved', u'aisle': u'Baking', u'name': u'vanilla pod', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2137638/elderflower-lemon-and-vanilla-cordial', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 239, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Fill a large pan with 2 litres water.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sugar, lemons, vanilla pod andpowder, and bring slowly to the boil.Boil rapidly until the mixture has reducedby half, then remove from the heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the elderflowers to the pan andstir gently. Leave to cool completely,then pass through a sieve lined withmuslin into another clean pan.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk inthe vanilla seeds and store the cordialin sterilised bottles with a strip of peeland the vanilla pod added (see tips below). To make a refreshing drink, use1 part cordial to 5 parts iced water.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 56, u'instructions': u'Fill a large pan with 2 litres water.Add the sugar, lemons, vanilla pod andpowder, and bring slowly to the boil.Boil rapidly until the mixture has reducedby half, then remove from the heat.Add the elderflowers to the pan andstir gently. Leave to cool completely,then pass through a sieve lined withmuslin into another clean pan. Whisk inthe vanilla seeds and store the cordialin sterilised bottles with a strip of peeland the vanilla pod added (see tips below). To make a refreshing drink, use1 part cordial to 5 parts iced water.', u'spoonacularSourceUrl': u'https://spoonacular.com/elderflower-lemon-vanilla-cordial-210136', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}