{u'recipes': [{u'sourceName': u'Center Cut Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625203-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 625203, u'veryPopular': True, u'lowFodmap': False, u'title': u'Philly Cheesesteak Sandwiches', u'diets': [u'dairy free'], u'pricePerServing': 363.58, u'creditText': u'Center Cut Cook', u'extendedIngredients': [{u'originalString': u'1/2 tablespoon sauce from the adobo pepper can', u'aisle': u'Ethnic Foods', u'name': u'adobo sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 6979, u'unit': u'tablespoon'}, {u'originalString': u'8 White american cheese slices or 8 pepper-jack cheese slices', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slices'}, {u'originalString': u'4-6 ounces button mushrooms, sliced', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1 chipotle pepper in adobo sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper in adobo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1/2 of a green pepper, thinly sliced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 tablespoon lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'Mayo or chipotle mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'servings'}, {u'originalString': u'1 small onion, thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Dash of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Dash'}, {u'originalString': u'Dash of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'Dash'}, {u'originalString': u'salt, pepper for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'4 soft hoagie rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'1 1/4 pounds top sirloin steak', u'aisle': u'Meat', u'name': u'top sirloin steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/top-sirloin-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'liquid', u'id': 23584, u'unit': u'pounds'}, {u'originalString': u'1-2 tablespoons canola oil or vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://centercutcook.com/philly-cheesesteak-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'1 hour before cooking, place steak in the freezer.  When youre ready to start cooking, pre-heat your oven to 400 degrees.  Melt 1 tablespoon butter in a large skillet over medium heat. Cook veggies until tender.  While the veggies are cooking, remove the steak from the freezer and use a very sharp knife to slice the meat as thinly as possible against the grain.  When the veggies are done cooking, heat 1 tablespoon canola oil over medium high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place 4 hoagie rolls in the oven for 5-7 minutes or until nice and warm, but not crunchy.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add half the meat to the pan and season with a bit of salt and pepper. Cook for a few minutes until it is cooked through. Set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a bit more oil if needed and cook the other half of the meat, seasoning with salt and pepper. Return the first batch of meat to the pan, stir in veggies if yo wish, and top with cheese. Use 8 pepper jack cheese slices for a spicy version, or 8 white American cheese slices for a classic version.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'id': 1253, u'name': u'american cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the cheese over the meat and when it starts to melt, stir the cheese into the meat and veggie mixture.  Divide the meat among the 4 hoagie rolls.  If using chipotle mayo, combine all ingredients in a blender (mayo, chipotle pepper, chipotle sauce, lime juice, salt and pepper) and slather desired amount on each roll. Otherwise spread a thin layer of regular mayo on the roll.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Cut in half and serve immediately.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serves 4.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 5326, u'instructions': u'1 hour before cooking, place steak in the freezer.  When youre ready to start cooking, pre-heat your oven to 400 degrees.  Melt 1 tablespoon butter in a large skillet over medium heat. Cook veggies until tender.  While the veggies are cooking, remove the steak from the freezer and use a very sharp knife to slice the meat as thinly as possible against the grain.  When the veggies are done cooking, heat 1 tablespoon canola oil over medium high heat.  Place 4 hoagie rolls in the oven for 5-7 minutes or until nice and warm, but not crunchy.  Add half the meat to the pan and season with a bit of salt and pepper. Cook for a few minutes until it is cooked through. Set aside.  Heat a bit more oil if needed and cook the other half of the meat, seasoning with salt and pepper. Return the first batch of meat to the pan, stir in veggies if yo wish, and top with cheese. Use 8 pepper jack cheese slices for a spicy version, or 8 white American cheese slices for a classic version. Place the cheese over the meat and when it starts to melt, stir the cheese into the meat and veggie mixture.  Divide the meat among the 4 hoagie rolls.  If using chipotle mayo, combine all ingredients in a blender (mayo, chipotle pepper, chipotle sauce, lime juice, salt and pepper) and slather desired amount on each roll. Otherwise spread a thin layer of regular mayo on the roll.  Cut in half and serve immediately.  Serves 4.', u'spoonacularSourceUrl': u'https://spoonacular.com/philly-cheesesteak-sandwiches-625203', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}