{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/443888-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 443888, u'veryPopular': False, u'lowFodmap': False, u'title': u'Frozen Fruit and Nut Salad', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 83.33, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (15 ounces) mandarin oranges, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounces'}, {u'originalString': u'1 can (20 ounces) crushed pineapple, drained', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'ounces'}, {u'originalString': u'1 can (21 ounces) peach or cherry pie filling', u'aisle': u'Baking', u'name': u'cherry pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19314, u'unit': u'ounces'}, {u'originalString': u'Lettuce leaves, optional', u'aisle': u'Produce', u'name': u'lettuce leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 93623, u'unit': u'leaves'}, {u'originalString': u'2/3 cup chopped pecans or walnuts', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1 can (14 ounces) sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounces'}, {u'originalString': u'1 carton (8 ounces) frozen whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/frozen-fruit-and-nut-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine milk and pie filling.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add oranges, pineapple and nuts. Gently fold in whipped topping.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread in a 13-in. x 9-in. pan. Cover and freeze.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the freezer 15 minutes before serving.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into squares; serve on lettuce-lined plates if desired.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Directions                                                                                In a large bowl, combine milk and pie filling. Add oranges, pineapple and nuts. Gently fold in whipped topping. Spread in a 13-in. x 9-in. pan. Cover and freeze. Remove from the freezer 15 minutes before serving. Cut into squares; serve on lettuce-lined plates if desired.                                        Yield: 12-15 servings.                                                                                                                         Originally published as Frozen Fruit Salad in  Reminisce ExtraFebruary 1994, p47                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 239 calories, 9 g fat (4 g saturated fat), 9 mg cholesterol, 42 mg sodium, 37 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-fruit-and-nut-salad-443888', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}