{u'recipes': [{u'sourceName': u'Amys Healthy Baking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/592781-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 592781, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fireworks and Ice Cream', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 68.84, u'creditText': u'Amys Healthy Baking', u'extendedIngredients': [{u'originalString': u'\xbc tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1/3 c brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19334, u'unit': u'c'}, {u'originalString': u'\xbd tbsp butter, melted and cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp dried wild blueberries (see Notes)', u'aisle': u'Dried Fruits;Produce', u'name': u'dried blueberries', u'metaInformation': [u'wild', u'dried', u'(see Notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries-dried.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93686, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp dried cherries, roughly chopped (see Notes)', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cherries', u'metaInformation': [u'dried', u'roughly chopped', u'(see Notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93822, u'unit': u'tbsp'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'\xbd c fat-free cool whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free cool whip', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1200, u'unit': u'c'}, {u'originalString': u'\xbe c + 1 tbsp all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'1 c fat-free vanilla ice cream or frozen yogurt, slightly thawed', u'aisle': u'Frozen', u'name': u'frozen yogurt', u'metaInformation': [u'fat-free', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frozen-yogurt.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93629, u'unit': u'c'}, {u'originalString': u'1 tbsp fat-free plain Greek (or regular) yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'plain', u'fat-free', u'(or regular)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'tbsp'}, {u'originalString': u'1/8 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'8 paperclips', u'aisle': u'?', u'name': u'paperclips', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'unit': u''}, {u'originalString': u'tin foil', u'aisle': u'?', u'name': u'tin foil', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://amyshealthybaking.com/blog/2013/07/02/blueberry-and-cherry-ice-cream-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Stir the ice cream (or frozen yogurt) and cool whip in a freezer-safe bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frozen-yogurt.png', u'id': 93629, u'name': u'frozen yogurt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in the freezer for at least 1 hour before assembling the ice cream sandwiches.To prepare the cookies, whisk together the flour, baking powder, and salt in a medium bowl. In a large bowl, whisk together the butter and egg white. Stir in the yogurt and vanilla, mixing well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add in the brown sugar, smearing any clumps on the side of the bowl with a spatula.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour the dry ingredients into the wet, and stir just until incorporated. Refrigerate for 45 minutes, or until no longer sticky.Preheat the oven to 350\xb0, and line two baking sheets with parchment paper.Divide the cookie dough into 16 balls, and place on the prepared baking sheets, leaving at least 2” of space between each. Using a small piece of wax paper (about a 2”- or 3”-square), flatten each dough ball to a 1/8” thick circle. Evenly distribute the dried fruit on top of each, gently pressing into the cookie dough.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake at 350\xb0 for 9 minutes. Cool on the pans for 5 minutes before turning out onto a wire rack to cool completely.To assemble, cut long strips of tin foil that are 3” wide. Fold each strip in half. Pair similarly sized cookies together. Wrap a tin foil strip around one cookie with the dried fruit side facing down (see Notes), and secure the ends with a paperclip. Repeat with 7 other cookies, and place on a clean metal baking sheet. (See photo below recipe for how the cookies should look.)', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove the ice cream (or frozen yogurt) mixture from the freezer. Working quickly, place 3 tablespoons of the mixture on top of each cookie wrapped in tin foil. Even out the surface of the filling with a spoon. Press another cookie on top. Repeat with the remaining cookies. Freeze the ice cream sandwiches for at least 2 hours before serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frozen-yogurt.png', u'id': 93629, u'name': u'frozen yogurt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u'Stir the ice cream (or frozen yogurt) and cool whip in a freezer-safe bowl. Place in the freezer for at least 1 hour before assembling the ice cream sandwiches.To prepare the cookies, whisk together the flour, baking powder, and salt in a medium bowl. In a large bowl, whisk together the butter and egg white. Stir in the yogurt and vanilla, mixing well. Add in the brown sugar, smearing any clumps on the side of the bowl with a spatula. Pour the dry ingredients into the wet, and stir just until incorporated. Refrigerate for 45 minutes, or until no longer sticky.Preheat the oven to 350\xb0, and line two baking sheets with parchment paper.Divide the cookie dough into 16 balls, and place on the prepared baking sheets, leaving at least 2” of space between each. Using a small piece of wax paper (about a 2”- or 3”-square), flatten each dough ball to a 1/8” thick circle. Evenly distribute the dried fruit on top of each, gently pressing into the cookie dough. Bake at 350\xb0 for 9 minutes. Cool on the pans for 5 minutes before turning out onto a wire rack to cool completely.To assemble, cut long strips of tin foil that are 3” wide. Fold each strip in half. Pair similarly sized cookies together. Wrap a tin foil strip around one cookie with the dried fruit side facing down (see Notes), and secure the ends with a paperclip. Repeat with 7 other cookies, and place on a clean metal baking sheet. (See photo below recipe for how the cookies should look.)Remove the ice cream (or frozen yogurt) mixture from the freezer. Working quickly, place 3 tablespoons of the mixture on top of each cookie wrapped in tin foil. Even out the surface of the filling with a spoon. Press another cookie on top. Repeat with the remaining cookies. Freeze the ice cream sandwiches for at least 2 hours before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/fireworks-and-ice-cream-592781', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}