{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518531-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 518531, u'veryPopular': False, u'lowFodmap': False, u'title': u'Summer Squash with Cherry Tomatoes', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 105.91, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1/3 cup sliced celery (optional)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 cup cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'1 cup fresh corn kernels (about 1 large ear)', u'aisle': u'Produce', u'name': u'fresh corn kernels', u'metaInformation': [u'fresh', u'large', u'( 1 ear)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011167, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons chopped fresh mint or basil', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'Tablespoons'}, {u'originalString': u'1 Tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'1/4 cup diced roasted red pepper', u'aisle': u'Canned and Jarred', u'name': u'roasted red pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11916, u'unit': u'cup'}, {u'originalString': u'2 cups sliced summer squash', u'aisle': u'Produce', u'name': u'summer squash', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11641, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.recipegirl.com/2007/10/30/summer-squash-with-cherry-tomatoes/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in large skillet.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add squash and saut\xe9, stirring frequently, for 3 minutes over medium-high heat. Stir in peppers, tomatoes, corn and celery (if using). Lower heat to medium and continue cooking, stirring frequently, for another 5 minutes. The vegetables should be barely cooked through and retain their texture. Stir in the herbs just before serving.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 146, u'instructions': u'Heat oil in large skillet. Add squash and saut\xe9, stirring frequently, for 3 minutes over medium-high heat. Stir in peppers, tomatoes, corn and celery (if using). Lower heat to medium and continue cooking, stirring frequently, for another 5 minutes. The vegetables should be barely cooked through and retain their texture. Stir in the herbs just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/summer-squash-with-cherry-tomatoes-518531', u'dishTypes': [u'side dish'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}