{u'recipes': [{u'sourceName': u'Happy Herbivore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/263136-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 263136, u'veryPopular': False, u'lowFodmap': False, u'title': u'Curried Pumpkin Lentil Soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 213.04, u'creditText': u'Happy Herbivore', u'extendedIngredients': [{u'originalString': u'1 whole apple, diced', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'diced', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 cup canned pure pumpkin', u'aisle': u'Baking', u'name': u'canned pumpkin', u'metaInformation': [u'pure', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 tbsp mild curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2015, u'unit': u'tbsp'}, {u'originalString': u'1 tsp garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93663, u'unit': u'tsp'}, {u'originalString': u'1 whole sweet onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'sweet', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tbsp pomegranate molasses', u'aisle': u'Alcoholic Beverages', u'name': u'pomegranate molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grenadine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10042040, u'unit': u'tbsp'}, {u'originalString': u'\xbd cup red lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red lentils', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10016069, u'unit': u'cup'}, {u'originalString': u'3 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'2 whole garlic cloves, minced', u'aisle': u'Produce', u'name': u'whole garlic cloves', u'metaInformation': [u'whole', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'https://happyherbivore.com/recipe/curried-pumpkin-lentil-soup/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Line a medium pot with a thin layer of water.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions and cook over med-high heat for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, then continue to cook until onions are translucent and all of the water has been absorbed.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add broth, lentils and apple and bring to a boil. Once boiling, cover and reduce heat to medium. Continue to cook until lentils are orange and soft, about 7-10 minutes. Stir in pumpkin and spices. Reduce heat to low and cook another 5 minutes, stirring to incorporate all ingredients.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Add salt, pepper and cayenne pepper to taste.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with pomegranate molasses before serving.Nutritional Information', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 10042040, u'name': u'pomegranate molasses'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'3Amount Per Serving', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Calories', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'227Fat', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2g', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Carbohydrate', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'39gDietary Fiber13gSugars12gProtein14g', u'number': 6, u'ingredients': []}], u'name': u'Serving Size 1Servings Per Batch'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 76, u'instructions': u'InstructionsLine a medium pot with a thin layer of water. Add onions and cook over med-high heat for 2 minutes. Add garlic, then continue to cook until onions are translucent and all of the water has been absorbed. Add broth, lentils and apple and bring to a boil. Once boiling, cover and reduce heat to medium. Continue to cook until lentils are orange and soft, about 7-10 minutes. Stir in pumpkin and spices. Reduce heat to low and cook another 5 minutes, stirring to incorporate all ingredients. Add salt, pepper and cayenne pepper to taste. Drizzle with pomegranate molasses before serving.Nutritional InformationServing Size: 1Servings Per Batch:                                     3Amount Per ServingCalories                                     227Fat                                     2g                                      Carbohydrate                                     39gDietary Fiber13gSugars12gProtein14g', u'spoonacularSourceUrl': u'https://spoonacular.com/curried-pumpkin-lentil-soup-263136', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}