{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/368148-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 368148, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bourbon Brat Skewers', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 220.31, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10014037, u'unit': u'cup'}, {u'originalString': u'1 package (16 ounces) uncooked Johnsonville\xae Original Bratwurst, cut into 1-inch slices', u'aisle': u'Meat', u'name': u'bratwurst', u'metaInformation': [u'uncooked', u'cut into 1-inch slices', u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 7013, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 medium green pepper, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1/2 cup reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'2 cups whole mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1 medium onion, cut into wedges', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 medium sweet red peppers, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'red sweet peppers', u'metaInformation': [u'sweet', u'red', u'medium', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 teaspoon seasoned salt', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042047, u'unit': u'teaspoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/bourbon-brat-skewers', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'In a large resealable plastic bag, combine the first five ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the vegetables; seal bag and turn to coat. Refrigerate for at least 1 hour.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}], u'step': u'Drain and reserve marinade. On six metal or soaked wooden skewers, alternately thread the vegetables and bratwurst.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'id': 7013, u'name': u'bratwurst'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush with reserved marinade. Grill, covered, over medium heat for 15-20 minutes or until bratwurst is no longer pink and vegetables are tender, turning and basting frequently with reserved marinade.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'id': 7013, u'name': u'bratwurst'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u'Directions                                                                                In a large resealable plastic bag, combine the first five ingredients. Add the vegetables; seal bag and turn to coat. Refrigerate for at least 1 hour.                                                                                           Drain and reserve marinade. On six metal or soaked wooden skewers, alternately thread the vegetables and bratwurst. Brush with reserved marinade. Grill, covered, over medium heat for 15-20 minutes or until bratwurst is no longer pink and vegetables are tender, turning and basting frequently with reserved marinade.                                        Yield: 6 skewers.                                                                                                                         Originally published as Bourbon Brat Skewers in  Simple & DeliciousAugust/September 2011, p45                                                                                                                                                                                                        Nutritional Facts                                                                             1 skewer equals 346 calories, 22 g fat (8 g saturated fat), 56 mg cholesterol, 1,998 mg sodium, 17 g carbohydrate, 3 g fiber, 15 g protein.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/bourbon-brat-skewers-368148', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}