{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520626-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 9, u'id': 520626, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chewy Sugar Sprinkles Cookies', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 27.45, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 large egg, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tablespoon light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 heaping cup sprinkles, optional', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-chocolate.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93645, u'unit': u'cup'}, {u'originalString': u'1 cup unsalted butter, softened (2 sticks)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.averiecooks.com/2013/01/chewy-sugar-sprinkles-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To the bowl of a stand mixer fitted with the paddle attachment, cream the butter and sugars at medium-high speed until light and fluffy, about 3 minutes. Stop and scrape down the sides of the bowl and add the egg, vanilla, and beat at medium speed until combined, about 30 seconds.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the flour, baking powder, salt and beat at low speed until just combined, about 30 seconds, scraping down the bowl as needed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the sprinkles and beat momentarily to incorporate (the cookies can be made without sprinkles and baked as traditional plain sugar cookies if you prefer plain cookies or prefer to decorate them after baking).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer dough to airtight container and refrigerate for at least 2 hours, and up to 5 days, before baking. Preheat oven to 350F, line baking sheets with a Silpat Non-Stick Baking Mats, parchment, or spray with cooking spray; set aside. Using a 2-inch cookie scoop (about 1 1/2 tablespoons of dough or about 1.10 to 1.20 ounces by weight), form dough mounds and place on prepared baking sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Roll each mound into a smooth ball, and space balls about 2 inches apart on baking sheet (8 to 10 per tray). Use your hand to flatten the balls or for neater cookies, spray a flat-bottomed drinking glass with cooking spray and use it to flatten all balls to 3/4-inches in height, measuring about 2 inches in diameter. Re-spray with cooking spray as needed to prevent sticking. It's very tempting to over-flatten the balls, but don't because the cookies will spread like pancakes and become too flat and crispy while they bake. Err on the side of under- rather than over-flattening.", u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake for 9 minutes, until barely golden brown around the edges, even if slightly underbaked in the center; the tops will not be browned and should be pale. Watch them very closely after 7 minutes as sugar cookies burn easily and I recommend not cooking longer than ten minutes because cookies will darken, crisp, and firm up as they cool (The cookies shown in the photos were baked for 9 minutes and have chewy and slightly crisp edges with soft centers). Allow cookies to cool on the baking sheet for 5 minutes before removing and transferring to a rack to finish cooling. Store cookies in an airtight container at room temperature for up to 5 days or in the freezer for up to 3 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.  Adapted from the The New Best Recipe cookbook', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 9695, u'instructions': u"To the bowl of a stand mixer fitted with the paddle attachment, cream the butter and sugars at medium-high speed until light and fluffy, about 3 minutes. Stop and scrape down the sides of the bowl and add the egg, vanilla, and beat at medium speed until combined, about 30 seconds.  Add the flour, baking powder, salt and beat at low speed until just combined, about 30 seconds, scraping down the bowl as needed. Add the sprinkles and beat momentarily to incorporate (the cookies can be made without sprinkles and baked as traditional plain sugar cookies if you prefer plain cookies or prefer to decorate them after baking). Transfer dough to airtight container and refrigerate for at least 2 hours, and up to 5 days, before baking. Preheat oven to 350F, line baking sheets with a Silpat Non-Stick Baking Mats, parchment, or spray with cooking spray; set aside. Using a 2-inch cookie scoop (about 1 1/2 tablespoons of dough or about 1.10 to 1.20 ounces by weight), form dough mounds and place on prepared baking sheet. Roll each mound into a smooth ball, and space balls about 2 inches apart on baking sheet (8 to 10 per tray). Use your hand to flatten the balls or for neater cookies, spray a flat-bottomed drinking glass with cooking spray and use it to flatten all balls to 3/4-inches in height, measuring about 2 inches in diameter. Re-spray with cooking spray as needed to prevent sticking. It's very tempting to over-flatten the balls, but don't because the cookies will spread like pancakes and become too flat and crispy while they bake. Err on the side of under- rather than over-flattening. Bake for 9 minutes, until barely golden brown around the edges, even if slightly underbaked in the center; the tops will not be browned and should be pale. Watch them very closely after 7 minutes as sugar cookies burn easily and I recommend not cooking longer than ten minutes because cookies will darken, crisp, and firm up as they cool (The cookies shown in the photos were baked for 9 minutes and have chewy and slightly crisp edges with soft centers). Allow cookies to cool on the baking sheet for 5 minutes before removing and transferring to a rack to finish cooling. Store cookies in an airtight container at room temperature for up to 5 days or in the freezer for up to 3 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.  Adapted from the The New Best Recipe cookbook", u'spoonacularSourceUrl': u'https://spoonacular.com/chewy-sugar-sprinkles-cookies-520626', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 34, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}