{u'recipes': [{u'sourceName': u'Alidas Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547500-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 547500, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Vegetable Frittata', u'diets': [u'gluten free'], u'pricePerServing': 312.27, u'creditText': u'Alidas Kitchen', u'extendedIngredients': [{u'originalString': u"2 tablespoons I Can't Believe It's Not Butter! spread, divided", u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apple butter spread', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-jelly.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19294, u'unit': u'tablespoons'}, {u'originalString': u'4 1/2 cups sliced/chopped vegetables (I used red pepper, broccoli, onions)', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'chopped pecans', u'metaInformation': [u'red', u'(I used pepper, broccoli, onions)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'solid', u'id': 10012142, u'unit': u'cups'}, {u'originalString': u'8 eggs (or 4 eggs and 8 egg whites)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'1 cup shredded cheese, divided (I used cheddar)', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded', u'divided', u'(I used cheddar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://alidaskitchen.com/2013/05/09/easy-vegetable-frittata/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"In a large oven-proof nonstick skillet, melt 1 tablespoon I Can't Believe It's Not Butter! over medium heat.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add your vegetables and cook, stirring occasionally, until vegetables are tender (about 5 minutes).  During the last minute, add minced garlic and Italian seasoning, stirring to combine.Meanwhile, melt the remaining tablespoon of  I Can't Believe It's Not Butter!In a large bowl, whisk the eggs, melted  I Can't Believe It's Not Butter! and 3 tablespoons water for about 1 minute, or until frothy.  Stir in 1/2 cup cheese.", u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour egg mixture over vegetables, stirring gently, and cook over medium heat until eggs begin to set.  (Occasionally lift the edges of frittata to allow uncooked mixture to go to the bottom)Top with remaining cheese and broil for 2 minutes, or until cheese is melted and golden brown and eggs are set.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Cut into wedges and serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine are great choices for Frittata. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. You could try Banfi Rosa Regale Brachetto ( half-bottle). Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"This sparkling red wine made from Brachetto d'Acqui in Piedmont, Italy is love at first sip and a perpetual crowd pleaser. The color is a festive cranberry. Aromatic with hints of raspberries, strawberries and rose petals. There is a taste of fresh raspberries, with crisp acidity, enticing the palate with an initial softness, graduating to a clean and dry finish. Perfect for any occasion. A unique and festive sparkling wine, seductive aperitif, and elegant dessert wine. Pairs well with seafood, cheeses, spicy fare and chocolate. Serve chilled.", u'title': u'Banfi Rosa Regale Brachetto ( half-bottle)', u'price': u'$12.99', u'id': 448167, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-375ml-half-bottle-2012/130015', u'imageUrl': u'https://spoonacular.com/productImages/448167-312x231.jpg'}]}, u'aggregateLikes': 82, u'instructions': u"In a large oven-proof nonstick skillet, melt 1 tablespoon I Can't Believe It's Not Butter! over medium heat.  Add your vegetables and cook, stirring occasionally, until vegetables are tender (about 5 minutes).  During the last minute, add minced garlic and Italian seasoning, stirring to combine.Meanwhile, melt the remaining tablespoon of  I Can't Believe It's Not Butter!In a large bowl, whisk the eggs, melted  I Can't Believe It's Not Butter! and 3 tablespoons water for about 1 minute, or until frothy.  Stir in 1/2 cup cheese.Pour egg mixture over vegetables, stirring gently, and cook over medium heat until eggs begin to set.  (Occasionally lift the edges of frittata to allow uncooked mixture to go to the bottom)Top with remaining cheese and broil for 2 minutes, or until cheese is melted and golden brown and eggs are set.  Cut into wedges and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/easy-vegetable-frittata-547500', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}