{u'recipes': [{u'sourceName': u'Perrys Plate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556821-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 556821, u'veryPopular': True, u'lowFodmap': False, u'title': u'Taqueria-Style Shredded Beef', u'diets': [u'gluten free', u'dairy free', u'ketogenic'], u'preparationMinutes': 60, u'pricePerServing': 229.5, u'creditText': u'Perrys Plate', u'extendedIngredients': [{u'originalString': u'3-5 pounds of beef (large roasts work best, any cut)', u'aisle': u'Frozen;Meat', u'name': u'beef', u'metaInformation': [u'large', u'( roasts work best, any cut)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 23572, u'unit': u'pounds'}, {u'originalString': u'2 chipotle peppers, from a can of chipotles in adobo sauce (I seeded mine)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'canned chipotle peppers', u'metaInformation': [u'seeded', u'canned', u'(I mine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'3 cloves garlic, peeled and halved', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 Tablespoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'Tablespoon'}, {u'originalString': u'1 Tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'Tablespoon'}, {u'originalString': u'2 guajillo peppers', u'aisle': u'Produce;Ethnic Foods;Spices and Seasonings', u'name': u'guajillo peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guajillo-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011962, u'unit': u''}, {u'originalString': u'1 Tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tablespoon'}, {u'originalString': u'Juice from one lime (about 2-3 Tablespoons)', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 medium onion, peeled and roughly chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'peeled', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'3-4 dried pasilla peppers', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'1 Tablespoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'Tablespoon'}, {u'originalString': u'2 Tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'Tablespoons'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.perrysplate.com/2013/01/taqueria-style-shredded-beef-slow-cooker.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Heat a skillet to medium heat and add the dried chiles. Toast for a minute or so until they become fragrant. Don't let them burn.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-arbol-chiles.jpg', u'id': 10111962, u'name': u'dried chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and pour boiling water over them.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add another bowl on top of the chiles to keep them submerged.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let them soak for at least 30 minutes, up to a few hours.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Drain chiles (reserving the liquid), remove stems and most of the seeds, and place them in the blender with the remaining ingredients (except the beef). Blend until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add some of the chile-soaking liquid if necessary. Set aside.Unwrap your beef and do whatever you need to do to get it ready for the pan (trimming, etc.)', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a cast-iron or stainless steel skillet with 2-3 Tablespoons of heat-safe oil (like coconut or grapeseed) over high heat. The oil should be shimmering and there should be very faint wisps of smoke.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place the beef in the skillet (you should hear some crazy sizzling or your pan isn't hot enough) and let it sit there for a minute or two. Turn the meat to sear on all sides. It should be crusty brown in spots.", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer seared meat to a 6-quart slow cooker.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Pour blended sauce over top. Cover and cook on low for at least 8 hours. When the meat is tender, remove roasts from the cooker and shred the meat. Set aside to cool for a few minutes. Strain the liquid in the cooker, discarding all the slimy stuff.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pour strained liquid into a bowl and set aside to cool.When the meat and sauce are both cooled off, cover and chill. You can use the meat right away if you like, but the sauce needs time to cool so you can remove the fat from the top. It's lots easier that way. (And you end up with the best enchilada sauce on the planet!)If you want to serve the meat and sauce together, put some meat in a skillet with a few spoonfuls of sauce and cook until the meat has softened and everything's all saucy and happy.", u'number': 11, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 412, u'instructions': u"Heat a skillet to medium heat and add the dried chiles. Toast for a minute or so until they become fragrant. Don't let them burn. Transfer to a bowl and pour boiling water over them. Add another bowl on top of the chiles to keep them submerged. Let them soak for at least 30 minutes, up to a few hours.Drain chiles (reserving the liquid), remove stems and most of the seeds, and place them in the blender with the remaining ingredients (except the beef). Blend until smooth. Add some of the chile-soaking liquid if necessary. Set aside.Unwrap your beef and do whatever you need to do to get it ready for the pan (trimming, etc.) Heat a cast-iron or stainless steel skillet with 2-3 Tablespoons of heat-safe oil (like coconut or grapeseed) over high heat. The oil should be shimmering and there should be very faint wisps of smoke. Place the beef in the skillet (you should hear some crazy sizzling or your pan isn't hot enough) and let it sit there for a minute or two. Turn the meat to sear on all sides. It should be crusty brown in spots. Transfer seared meat to a 6-quart slow cooker. Pour blended sauce over top. Cover and cook on low for at least 8 hours. When the meat is tender, remove roasts from the cooker and shred the meat. Set aside to cool for a few minutes. Strain the liquid in the cooker, discarding all the slimy stuff. Pour strained liquid into a bowl and set aside to cool.When the meat and sauce are both cooled off, cover and chill. You can use the meat right away if you like, but the sauce needs time to cool so you can remove the fat from the top. It's lots easier that way. (And you end up with the best enchilada sauce on the planet!)If you want to serve the meat and sauce together, put some meat in a skillet with a few spoonfuls of sauce and cook until the meat has softened and everything's all saucy and happy.", u'spoonacularSourceUrl': u'https://spoonacular.com/taqueria-style-shredded-beef-556821', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 540, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}