{u'recipes': [{u'sourceName': u'Handle the Heat', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/559439-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 559439, u'veryPopular': False, u'lowFodmap': True, u'title': u'Stuffed Turkey Burgers', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'pricePerServing': 262.16, u'creditText': u'Handle the Heat', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 cup shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1/2 cup chopped roasted red peppers', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11916, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 1/4 pounds lean ground turkey breast', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 5662, u'unit': u'pounds'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.handletheheat.com/2009/08/stuffed-turkey-burgers.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Divide turkey into 4 equal sized rounds. Make 2 equal sized patties out of each round so you have 8 patties total. Sprinkle 4 of the patties with 2 tablespoons red peppers and cheese, and top with remaining patties, working the turkey around the edges to seal burgers closed. Season with salt and a few grinds of pepper. Grill or broil until cooked through, about 5 minutes per side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Turkey Burgers. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Marcelo Pelleriti Reserve Malbec. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'View More', u'title': u'Marcelo Pelleriti Reserve Malbec', u'price': u'$19.99', u'id': 465126, u'link': u'https://www.wine.com/product/marcelo-pelleriti-reserve-malbec-2012/149722', u'imageUrl': u'https://spoonacular.com/productImages/465126-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Divide turkey into 4 equal sized rounds. Make 2 equal sized patties out of each round so you have 8 patties total. Sprinkle 4 of the patties with 2 tablespoons red peppers and cheese, and top with remaining patties, working the turkey around the edges to seal burgers closed. Season with salt and a few grinds of pepper. Grill or broil until cooked through, about 5 minutes per side.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-turkey-burgers-559439', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}