{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556566-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 556566, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sage Pork Chops with Cherry Balsamic Glaze', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 120, u'pricePerServing': 263.76, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'\xbd cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'\xbd tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'12 oz frozen cherries, pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'frozen', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9070, u'unit': u'oz'}, {u'originalString': u'1 tsp dried sage', u'aisle': u'Spices and Seasonings', u'name': u'dried sage', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002038, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'4 boneless center cut pork chops', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'8 drops Stevia, or 1 Tbsp honey', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 8.0, u'consistency': u'solid', u'id': 93628, u'unit': u'drops'}, {u'originalString': u'\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/sage-pork-chops-cherry-balsamic-glaze/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the balsamic vinegar, olive oil, sage and pepper in a large gallon size zip lock bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Add pork chops and marinate for 2 hours or overnight.Turn broiler on low.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add pork chops to cast iron skillet or large baking sheet; ensuring they are spaced evenly apart and not touching. Broil on low for 10 minutes per side, if large pork chops, 7-8 minutes if smaller.Meanwhile, in small sauce pan, add cherries, balsamic vinegar, water, and stevia and bring to a boil. Reduce heat and let simmer until sauce reduces until almost all the liquid has been reduced.To serve, add cherry balsamic glaze atop of pork chops.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'id': 93628, u'name': u'stevia'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pork Chops works really well with Chardonnay, Pinot Noir, and Riesling. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 602, u'instructions': u'Combine the balsamic vinegar, olive oil, sage and pepper in a large gallon size zip lock bag. Add pork chops and marinate for 2 hours or overnight.Turn broiler on low. Add pork chops to cast iron skillet or large baking sheet; ensuring they are spaced evenly apart and not touching. Broil on low for 10 minutes per side, if large pork chops, 7-8 minutes if smaller.Meanwhile, in small sauce pan, add cherries, balsamic vinegar, water, and stevia and bring to a boil. Reduce heat and let simmer until sauce reduces until almost all the liquid has been reduced.To serve, add cherry balsamic glaze atop of pork chops.', u'spoonacularSourceUrl': u'https://spoonacular.com/sage-pork-chops-with-cherry-balsamic-glaze-556566', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 140, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}