{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/203739-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 203739, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Roasted Caper Caesar Salad', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 131.95, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'3 to 4 anchovy fillets, or more to taste', u'aisle': u'Seafood', u'name': u'anchovy', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 3.0, u'consistency': u'solid', u'id': 15001, u'unit': u'fillet'}, {u'originalString': u'Freshly ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 cup capers, drained', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2054, u'unit': u'cup'}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 small cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Hearts from 2 heads romaine lettuce, leaves roughly torn', u'aisle': u'Produce', u'name': u'romaine hearts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'heads', u'unitShort': u'heads', u'amount': 2.0, u'consistency': u'solid', u'id': 10011251, u'unit': u'heads'}, {u'originalString': u'1/4 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/05/roasted-caper-caesar-salad-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400\xb0F.  In a small roasting dish, toss capers with oil.  Roast 18 to 20 minutes, stirring 2 to 3 times during cooking, until just crisp.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the meantime, mince garlic and anchovy in a small food processor (or do so by hand and add subsequent ingredients to a serving bowl).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add egg yolk, lemon juice and Worcestershire sauce and pulse to thoroughly combine.  Season with black pepper. In a slow stream with the machine running, add olive oil to form a dressing.  Pulse in half of the cheese and season dressing to taste with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Combine lettuce and dressing and toss carefully to combine.  Divide among plates and top with roasted capers and remaining Parmesan cheese.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Gavi, Albarino, and Pinot Grigio are my top picks for Caesar Salad. We recommend a crisp, dry white wine such as a Gavi, Albari\xf1o, or Pinot Grigio. These wines stand up to the pungent dressing and complement the other flavors. The Salneval Albarino with a 4.2 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'gavi', u'albarino', u'pinot grigio'], u'productMatches': [{u'description': u'Light straw in color, the nose of this Albari\xf1o is seductive with honey, pear and tropical fruit and a slight mineral component. It is racy andzesty with citrus and floral flavors in the mouth, yet is round and soft at the same time.It matches perfectly with fresh seafood and shellfish; is an ideal accompaniment to salty, spicy Asian cuisine; and is also great on its own as a cocktail wine. Truly adventurous food lovers will amaze and inspire their friends by serving it with the unlikely, but fantastic pairing of traditional barbequed ribs with a sweet, slightly spicy tomato based sauce.', u'title': u'Salneval Albarino', u'price': u'$9.39', u'id': 446012, u'link': u'https://www.wine.com/product/salneval-albarino-2008/98474', u'imageUrl': u'https://spoonacular.com/productImages/446012-312x231.jpg'}]}, u'aggregateLikes': 149, u'instructions': u'Procedures                                                                              1                                                                            Preheat oven to 400\xb0F.  In a small roasting dish, toss capers with oil.  Roast 18 to 20 minutes, stirring 2 to 3 times during cooking, until just crisp.                                                                                                                            2                                                                            In the meantime, mince garlic and anchovy in a small food processor (or do so by hand and add subsequent ingredients to a serving bowl).  Add egg yolk, lemon juice and Worcestershire sauce and pulse to thoroughly combine.  Season with black pepper. In a slow stream with the machine running, add olive oil to form a dressing.  Pulse in half of the cheese and season dressing to taste with salt and pepper.                                                                                                                            3                                                                            Combine lettuce and dressing and toss carefully to combine.  Divide among plates and top with roasted capers and remaining Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-roasted-caper-caesar-salad-203739', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}