{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/698137-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 195, u'id': 698137, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apricot Amaretti Mousse', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 87.2, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'6 amaretti cookies, crumbled', u'aisle': u'Sweet Snacks', u'name': u'amaretti cookies', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 93766, u'unit': u''}, {u'originalString': u'1 1/2 cups apricot nectar', u'aisle': u'Beverages', u'name': u'apricot nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-nectar-or-apricot-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9036, u'unit': u'cups'}, {u'originalString': u'1/8 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup dried apricots', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9032, u'unit': u'cup'}, {u'originalString': u'2 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1 teaspoon unflavored gelatin', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'unflavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'2 tablespoons apricot or peach brandy', u'aisle': u'Produce', u'name': u'peach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/apricot_amaretti_mousse.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine apricot nectar and dried apricots in a small saucepan. Bring to a boil, reduce heat to low and simmer just until the apricots are tender, about 20 minutes.Meanwhile, combine lemon juice and liqueur in a small bowl. Sprinkle with gelatin and set aside to soften.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-nectar-or-apricot-juice.jpg', u'id': 9036, u'name': u'apricot nectar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'id': 9032, u'name': u'dried apricots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Transfer the hot apricots and their cooking liquid to a food processor.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add softened gelatin; process to a smooth puree. Set a fine-mesh stainless-steel sieve over a large bowl, transfer the apricot puree to the sieve and work it through with a rubber spatula. (Discard coarse pulp.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Let the puree cool to room temperature.Bring about 1 inch of water to a simmer in a large saucepan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine sugar, egg whites, cream of tartar and water in a heatproof mixing bowl large enough to fit over the saucepan. Set the bowl over the barely simmering water and beat with an electric mixer on low speed, moving the beaters around the bowl constantly, until an instant-read thermometer registers 140F. (This will take 2 to 4 minutes.) Increase the mixer speed to high and continue beating over the heat for a full 3 1/2 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the heat and beat the meringue until cool, about 4 minutes.Whip cream to soft peaks in a chilled bowl.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk about one-fourth of the meringue into the cooled apricot mixture to lighten it, then fold in the remaining meringue with a rubber spatula. Fold in the whipped cream.Divide the mousse among 6 dessert dishes or stemmed glasses. Cover loosely and refrigerate until set, about 4 hours.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with crumbled amaretti cookies before serving.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'id': 93766, u'name': u'amaretti cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Combine apricot nectar and dried apricots in a small saucepan. Bring to a boil, reduce heat to low and simmer just until the apricots are tender, about 20 minutes.Meanwhile, combine lemon juice and liqueur in a small bowl. Sprinkle with gelatin and set aside to soften.Transfer the hot apricots and their cooking liquid to a food processor. Add softened gelatin; process to a smooth puree. Set a fine-mesh stainless-steel sieve over a large bowl, transfer the apricot puree to the sieve and work it through with a rubber spatula. (Discard coarse pulp.) Let the puree cool to room temperature.Bring about 1 inch of water to a simmer in a large saucepan. Combine sugar, egg whites, cream of tartar and water in a heatproof mixing bowl large enough to fit over the saucepan. Set the bowl over the barely simmering water and beat with an electric mixer on low speed, moving the beaters around the bowl constantly, until an instant-read thermometer registers 140F. (This will take 2 to 4 minutes.) Increase the mixer speed to high and continue beating over the heat for a full 3 1/2 minutes. Remove the bowl from the heat and beat the meringue until cool, about 4 minutes.Whip cream to soft peaks in a chilled bowl. Whisk about one-fourth of the meringue into the cooled apricot mixture to lighten it, then fold in the remaining meringue with a rubber spatula. Fold in the whipped cream.Divide the mousse among 6 dessert dishes or stemmed glasses. Cover loosely and refrigerate until set, about 4 hours. Garnish with crumbled amaretti cookies before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/apricot-amaretti-mousse-698137', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}