{u'recipes': [{u'sourceName': u'Better in Bulk', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/500910-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 500910, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Pot Pie – Perfect for Thanksgiving Leftovers', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 89.08, u'creditText': u'Better in Bulk', u'extendedIngredients': [{u'originalString': u'1 \xbd cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'2 to 3 cups cooked chicken (or turkey left-overs!)', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cooked', u'(or turkey left-overs!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'2 cups frozen vegetables, thawed (ie—corn, carrots, and peas)', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'frozen', u'thawed', u'(ie—corn, carrots, and peas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11583, u'unit': u'cups'}, {u'originalString': u'\xbc tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'Pie crusts for bottom and top of pie (you can either make your own recipe or use frozen pie crust dough)', u'aisle': u'Refrigerated', u'name': u'pie crusts', u'metaInformation': [u'frozen', u'for bottom and top of pie (you can either make your own recipe or use  pie crust dough)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://betterinbulk.net/2012/11/chicken-pot-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 425 F. Prepare piecrusts and place bottom crust in 9-inch pie pan', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, melt butter.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion and cook 2 minutes. Stir in flour, salt, and pepper until well blended. Gradually stir in broth and milk; cook, stirring constantly, until bubbly and thickened.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken and vegetables; remove from heat. Spoon chicken mixture into crust-lined pan.Top pie with remaining crust; cut slits in several places. Bale at 425 F for 30-40 minutes or until crust is golden brown.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 5 minutes before serving.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 53, u'instructions': u'Heat oven to 425 F. Prepare piecrusts and place bottom crust in 9-inch pie panIn a medium saucepan, melt butter. Add onion and cook 2 minutes. Stir in flour, salt, and pepper until well blended. Gradually stir in broth and milk; cook, stirring constantly, until bubbly and thickened.Add chicken and vegetables; remove from heat. Spoon chicken mixture into crust-lined pan.Top pie with remaining crust; cut slits in several places. Bale at 425 F for 30-40 minutes or until crust is golden brown. Let stand 5 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-pot-pie-perfect-for-thanksgiving-leftovers-500910', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}