{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/177055-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 115, u'id': 177055, u'veryPopular': True, u'lowFodmap': False, u'title': u'Stuck Santa Cake', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 76.61, u'extendedIngredients': [{u'originalString': u'1 strip rainbow-berry flavor sweet-sour chewy licorice', u'aisle': u'Produce', u'name': u'berry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'strip', u'unitShort': u'strip', u'amount': 1.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'strip'}, {u'originalString': u'Tray or cardboard covered with wrapping paper and plastic food wrap or foil', u'aisle': u'Sweet Snacks', u'name': u'chocolate covered raisins', u'metaInformation': [u'with wrapping paper and plastic food wrap or foil'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-covered-raisins.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19127, u'unit': u'servings'}, {u'originalString': u'1 container Betty Rich & Creamy chocolate frosting', u'aisle': u'Baking', u'name': u'chocolate frosting', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-frosting.jpg', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'solid', u'id': 19226, u'unit': u'container'}, {u'originalString': u'6 chocolate sugar wafers', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 10118157, u'unit': u''}, {u'originalString': u"1 box Betty devil's food cake mix", u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18087, u'unit': u'box'}, {u'originalString': u'Red gel food color', u'aisle': u'Baking', u'name': u'food color', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'1 red licorice stick, cut in half', u'aisle': u'Bakery/Bread', u'name': u'french stick', u'metaInformation': [u'red', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18029, u'unit': u''}, {u'originalString': u'1 container Betty Whipped fluffy white frosting', u'aisle': u'Baking', u'name': u'frosting', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'solid', u'id': 19230, u'unit': u'container'}, {u'originalString': u'2 small (1-inch) chewy chocolate candies, unwrapped', u'aisle': u'Sweet Snacks', u'name': u"M&M'S Chocolate Candies", u'metaInformation': [u'small', u'()'], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 19157, u'unit': u''}, {u'originalString': u'1 large marshmallow', u'aisle': u'Baking', u'name': u'marshmallow', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u''}, {u'originalString': u'3 miniature marshmallows, cut in half crosswise', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'miniature', u'cut in half crosswise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 19116, u'unit': u''}, {u'originalString': u'2 large peppermint candies', u'aisle': u'Sweet Snacks', u'name': u'peppermint candies', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98859, u'unit': u''}, {u'originalString': u'Powdered sugar, if desired', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1 roll Betty Fruit Roll-Ups\xae strawberry chewy fruit snack (from 5-oz box)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry fruit spread', u'metaInformation': [u'(from 5-oz box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10819297, u'unit': u''}, {u'originalString': u'1 teaspoon red decorating sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'Coarse sugar, if desired', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/stuck-santa-cake/757f6620-6f2f-4beb-948d-1ec741b6aabf', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 325F. Grease 9-inch square pan with shortening; coat with flour (do not use cooking spray). Lightly grease 1 muffin cup in mini muffin pan and 1 muffin cup in regular-size muffin pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Make cake batter as directed on box.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour cake batter into 1 mini muffin cup, and 1 regular-size muffin cup, filling two-thirds full.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour remaining batter into square pan.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake cupcakes 11 to 14 minutes, square 47 to 53 minutes or until toothpick inserted in center comes out clean. Cool 10 minutes.', u'length': {u'number': 68, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove cakes from muffin cups and pan; place rounded sides up on cooling racks. Cool completely, about 1 hour. If necessary, cut off rounded tops of cakes.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Meanwhile, reserve 1/2 cup of the white frosting in small bowl and 1/4 cup of the chocolate frosting in another small bowl.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-frosting.jpg', u'id': 19226, u'name': u'chocolate frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Place square cake layer, rounded side down, on serving plate. Frost with remaining chocolate frosting.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-frosting.jpg', u'id': 19226, u'name': u'chocolate frosting'}]}, {u'equipment': [], u'step': u'5', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Place regular cupcake, rounded side down, on cake.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Place chocolate sugar wafers on their side around the cupcake, using reserved chocolate frosting to hold them in place around the cupcake, to form the chimney. Stack wafers, cutting as necessary to look like bricks, to make 2 layers of cookies on 4 sides of the cupcake.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-frosting.jpg', u'id': 19226, u'name': u'chocolate frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'6', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut mini cupcake in half at an angle. In small bowl, mix 2 tablespoons of the reserved white frosting with red gel food color as desired to get deep red color.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u"Place cupcake at an angle at top of chimney, and frost with red frosting. Sprinkle with red sugar. Press cut miniature marshmallows against bottom of red frosted cupcake. This is Santa's behind.", u'number': 18, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'7', u'number': 19, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Microwave chewy chocolate candies on High 3 to 8 seconds, just until moldable. Firmly press on ends of red licorice sticks, and shape into boots. Press licorice ends into chimney cupcake to make Santas legs.', u'number': 20, u'ingredients': []}, {u'equipment': [], u'step': u'8', u'number': 21, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Spoon remaining reserved frosting into resealable food-storage plastic bag.', u'number': 22, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Cut tiny tip from 1 corner of bag, and pipe white frosting and snow on chimney, and fur around tops of boots.', u'number': 23, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'9', u'number': 24, u'ingredients': []}, {u'equipment': [], u'step': u'Generously spread and mound remaining fluffy white frosting to look like snow drifts over cake, coming up against the chimney in mounds.', u'number': 25, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'10', u'number': 26, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'To make Santas bag, wrap marshmallow with red fruit snack, pinching up at one end to form bag shape. Using paring knife, cut green strip out of rainbow-berry flavor sweet-sour chewy licorice. Wrap green candy strip around top of Santas bag, and gently tie it onto the bag.', u'number': 27, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'11', u'number': 28, u'ingredients': []}, {u'equipment': [], u'step': u'Sprinkle cake with powdered sugar and then with coarse sugar to look like freshly fallen snow. Store loosely covered.', u'number': 29, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'aggregateLikes': 906, u'instructions': u"1                               Heat oven to 325F. Grease 9-inch square pan with shortening; coat with flour (do not use cooking spray). Lightly grease 1 muffin cup in mini muffin pan and 1 muffin cup in regular-size muffin pan.                                                          2                               Make cake batter as directed on box. Pour cake batter into 1 mini muffin cup, and 1 regular-size muffin cup, filling two-thirds full. Pour remaining batter into square pan. Bake cupcakes 11 to 14 minutes, square 47 to 53 minutes or until toothpick inserted in center comes out clean. Cool 10 minutes. Remove cakes from muffin cups and pan; place rounded sides up on cooling racks. Cool completely, about 1 hour. If necessary, cut off rounded tops of cakes.                                                          3                               Meanwhile, reserve 1/2 cup of the white frosting in small bowl and 1/4 cup of the chocolate frosting in another small bowl.                                                           4                               Place square cake layer, rounded side down, on serving plate. Frost with remaining chocolate frosting.                                                           5                               Place regular cupcake, rounded side down, on cake. Place chocolate sugar wafers on their side around the cupcake, using reserved chocolate frosting to hold them in place around the cupcake, to form the chimney. Stack wafers, cutting as necessary to look like bricks, to make 2 layers of cookies on 4 sides of the cupcake.                                                           6                               Cut mini cupcake in half at an angle. In small bowl, mix 2 tablespoons of the reserved white frosting with red gel food color as desired to get deep red color. Place cupcake at an angle at top of chimney, and frost with red frosting. Sprinkle with red sugar. Press cut miniature marshmallows against bottom of red frosted cupcake. This is Santa's behind.                                                          7                               Microwave chewy chocolate candies on High 3 to 8 seconds, just until moldable. Firmly press on ends of red licorice sticks, and shape into boots. Press licorice ends into chimney cupcake to make Santas legs.                                                           8                               Spoon remaining reserved frosting into resealable food-storage plastic bag. Cut tiny tip from 1 corner of bag, and pipe white frosting and snow on chimney, and fur around tops of boots.                                                          9                               Generously spread and mound remaining fluffy white frosting to look like snow drifts over cake, coming up against the chimney in mounds.                                                          10                               To make Santas bag, wrap marshmallow with red fruit snack, pinching up at one end to form bag shape. Using paring knife, cut green strip out of rainbow-berry flavor sweet-sour chewy licorice. Wrap green candy strip around top of Santas bag, and gently tie it onto the bag.                                                           11                               Sprinkle cake with powdered sugar and then with coarse sugar to look like freshly fallen snow. Store loosely covered.", u'spoonacularSourceUrl': u'https://spoonacular.com/stuck-santa-cake-177055', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 175, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}