{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536867-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 536867, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spinach Artichoke Cups', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 36.72, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1 can artichoke hearts in water, drained and chopped', u'aisle': u'Produce', u'name': u'artichoke hearts', u'metaInformation': [u'drained', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 93828, u'unit': u'can'}, {u'originalString': u'1 large bunch of spinach, blanched and chopped (or one package of frozen spinach)', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'large', u'chopped', u'(or one package of spinach)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11463, u'unit': u'bunch'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 Tablespoon hot sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'Tablespoon'}, {u'originalString': u'1 lemon, zest only', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1/3 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/2 cup Parmesan cheese, grated', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'Vegetable Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'Wonton Wrappers', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.macheesmo.com/2011/09/spinach-artichoke-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Bake wrappers at 350 degrees for 12 minutes. let cook and then take out the cups.3) For filling, blanch spinach in salted boiling water for 30 seconds. Then remove and let cool on a few paper towels. Use paper towels to press out as much liquid as possible.4)', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain artichokes and roughly chop them. Once chopped, also press them with a few paper towels to remove extra liquid.5)', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Mix spinach and artichokes with other filling ingredients.6) Fill cups with spinach mixture.7) Store any leftovers separately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 8522, u'instructions': u'Directions1) Lightly oil a muffin tin and stuff a wonton wrapper into each cup. Shape the wrapper up against the edges of the cups.2) Bake wrappers at 350 degrees for 12 minutes. let cook and then take out the cups.3) For filling, blanch spinach in salted boiling water for 30 seconds. Then remove and let cool on a few paper towels. Use paper towels to press out as much liquid as possible.4) Drain artichokes and roughly chop them. Once chopped, also press them with a few paper towels to remove extra liquid.5) Mix spinach and artichokes with other filling ingredients.6) Fill cups with spinach mixture.7) Store any leftovers separately.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-artichoke-cups-536867', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}