{u'recipes': [{u'sourceName': u'My Recipes', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/230351-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 230351, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tandoori Grilled Chicken with Mint Raita', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 187.17, u'creditText': u'My Recipes', u'extendedIngredients': [{u'originalString': u'4 (12-ounce) bone-in chicken leg-thigh quarters, skinned', u'aisle': u'Meat', u'name': u'chicken leg quarters', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 48.0, u'consistency': u'liquid', u'id': 1005091, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup chopped seeded cucumber', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chopped peeled fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'3 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3/4 cup fat-free Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon ground red pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.myrecipes.com/m/recipe/tandoori-grilled-chicken-mint-raita-50400000121353/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'To prepare the marinade, combine first 10 ingredients in a blender; process until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Pour into a large zip-top plastic bag.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add chicken; turn to coat. Marinate chicken in refrigerator for at least 4 hours or overnight.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To prepare the raita, combine 3/4 cup yogurt and remaining ingredients except cooking spray in a small bowl; cover and refrigerate.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove chicken from refrigerator, and let stand at room temperature for 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Prepare the grill for indirect grilling. If using a gas grill, heat one side to medium-high and leave one side with no heat. If using a charcoal grill, arrange hot coals on either side of charcoal grate, leaving an empty space in the middle.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the chicken from marinade, and discard the remaining marinade.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the chicken on unheated part of grill rack coated with cooking spray. Close lid, and grill for 90 minutes or until a thermometer inserted into meaty part of thigh registers 165, turning chicken every 20 minutes.', u'length': {u'number': 110, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try NV Mindbender Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 37, u'instructions': u'To prepare the marinade, combine first 10 ingredients in a blender; process until smooth. Pour into a large zip-top plastic bag. Add chicken; turn to coat. Marinate chicken in refrigerator for at least 4 hours or overnight.                                                                                                 To prepare the raita, combine 3/4 cup yogurt and remaining ingredients except cooking spray in a small bowl; cover and refrigerate.                                                                                                 Remove chicken from refrigerator, and let stand at room temperature for 45 minutes.                                                                                                 Prepare the grill for indirect grilling. If using a gas grill, heat one side to medium-high and leave one side with no heat. If using a charcoal grill, arrange hot coals on either side of charcoal grate, leaving an empty space in the middle.                                                                                                 Remove the chicken from marinade, and discard the remaining marinade. Place the chicken on unheated part of grill rack coated with cooking spray. Close lid, and grill for 90 minutes or until a thermometer inserted into meaty part of thigh registers 165, turning chicken every 20 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/tandoori-grilled-chicken-with-mint-raita-230351', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 590, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}