{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/688145-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 688145, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pizza Pitas: 30 Minute Thursday', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 142.24, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'\xbd cup thinly sliced green peppers', u'aisle': u'Produce', u'name': u'green peppers', u'metaInformation': [u'green', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'2 leaves lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 2.0, u'consistency': u'solid', u'id': 11252, u'unit': u'leaves'}, {u'originalString': u'8-10 slices pepperoni', u'aisle': u'Meat', u'name': u'pepperoni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 7057, u'unit': u'slices'}, {u'originalString': u'1 whole wheat pita, cut in half and split open', u'aisle': u'Bakery/Bread', u'name': u'pita', u'metaInformation': [u'whole wheat', u'split', u'cut in half and  open'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18413, u'unit': u''}, {u'originalString': u'4-5 tbsp pizza sauce, plus extra for dipping', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11549, u'unit': u'tbsp'}, {u'originalString': u'\xbd cup shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'2 Roma tomatos, sliced', u'aisle': u'Produce', u'name': u'tomatos', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.thereciperebel.com/pizza-pitas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Lay a slice of lettuce in the bottom of each half of your pita pocket.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 18413, u'name': u'pita'}]}, {u'equipment': [], u'step': u'Spread with about 2 tbsp pizza sauce (I recommend not placing the sauce next to the bread to keep it from getting soggy).Top with tomatoes, pepperoni, green peppers and cheese (or toppings of your choice).Devour, dunking in extra pizza sauce if desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'id': 7057, u'name': u'pepperoni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Felsina Chianti Colli Senesi with a 4.1 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Lay a slice of lettuce in the bottom of each half of your pita pocket. Spread with about 2 tbsp pizza sauce (I recommend not placing the sauce next to the bread to keep it from getting soggy).Top with tomatoes, pepperoni, green peppers and cheese (or toppings of your choice).Devour, dunking in extra pizza sauce if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/pizza-pitas-30-minute-thursday-688145', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}