{u'recipes': [{u'sourceName': u'The Endless Meal', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474788-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 474788, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bite Sized Appetizers: Mini Beet and Goat Cheese Salads', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 15.31, u'creditText': u'The Endless Meal', u'extendedIngredients': [{u'originalString': u'4 medium beets', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'\xbc cup goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1159, u'unit': u'cup'}, {u'originalString': u'A small handful of micro-greens or herbs (tarragon, parsley or dill work well)', u'aisle': u'Produce', u'name': u'greens', u'metaInformation': [u'small', u'well', u'(tarragon, parsley or dill work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 21052, u'unit': u'handful'}, {u'originalString': u'1 teaspoon cider vinegar or a tablespoon of lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 25.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Oil to toss beets', u'aisle': u'?', u'name': u'oil to toss beets', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 25.0, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.theendlessmeal.com/bite-sized-appetizers-mini-beet-and-goat-cheese-salads/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Wash beets well then slice as thin as possible. Toss beets in oil and lay in a single layer on a baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u"Bake at 350 degrees for 10 minutes, flip beets over and bake for another 7-10 minutes. Watch beets carefully so that they don't burn.Reduce heat to 220 degrees and continue to bake until they are almost crispy, between 1\xbd- 2 hours.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven, toss with salt and set aside to cool.Just before serving whisk together oil and vinegar and lightly coat micro-greens or herbs with the dressing.Top each beet chip with a ball of goat cheese and a few greens.Arrange on a plate to serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Raymond Reserve Selection Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 303, u'instructions': u"Wash beets well then slice as thin as possible. Toss beets in oil and lay in a single layer on a baking sheet. Bake at 350 degrees for 10 minutes, flip beets over and bake for another 7-10 minutes. Watch beets carefully so that they don't burn.Reduce heat to 220 degrees and continue to bake until they are almost crispy, between 1\xbd- 2 hours. Remove from oven, toss with salt and set aside to cool.Just before serving whisk together oil and vinegar and lightly coat micro-greens or herbs with the dressing.Top each beet chip with a ball of goat cheese and a few greens.Arrange on a plate to serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/bite-sized-appetizers-mini-beet-and-goat-cheese-salads-474788', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 25, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}