{u'recipes': [{u'sourceName': u'Sugar Dish Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/517807-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 9, u'id': 517807, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slice-n-Bake Chocolate Peanut Butter Chip Oatmeal Cookies', u'diets': [], u'preparationMinutes': 8, u'pricePerServing': 19.67, u'creditText': u'Sugar Dish Me', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'\xbc cup unsweetened dark cocoa powder *see note*', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'dark', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1\xbd tablespoons milk *see note*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2 cups old fashioned oats', u'aisle': u'Cereal', u'name': u'old fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'2 cups peanut butter chips', u'aisle': u'Baking', u'name': u'peanut butter chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93762, u'unit': u'cups'}, {u'originalString': u'\xbc cup dark or semi-sweet chocolate chips *see note*', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.sugardishme.com/2013/04/15/slice-n-bake-chocolate-peanut-butter-chip-oatmeal-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Beat together the butter and sugars until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the eggs and beat until just combined. Then add the vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the milk in a small saucepan over medium high heat until it just starts to simmer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove it from the heat immediately and then stir in the chocolate chips. Keep stirring until smooth. Scrape the melted chocolate into the batter and beat for about 30 seconds.Sift in the flours, cocoa powder, baking soda, and salt (OR whisk the dry ingredients together in a separate bowl and then add them all at once).Beat until combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Add the oats and peanut butter chips and beat until they are evenly incorporated.Tear off a sheet of parchment paper, wax paper, or plastic wrap (parchment paper is the easiest to work with but I've tried the others-- they will do just fine. Aluminum foil is a No No!). An 18-24 inch sheet will do. Divide the cookie dough in half and portion one half out onto the waiting parchment. Fold one side of the paper over the dough and sort of roll and squeeze until you have a log shape. Use your hands to flatten the ends before you twist the paper around to seal them off. You're aiming for your dough log to be about 1\xbd-2 inches in diameter. Also-- when you fold the paper over and roll the dough be careful that the paper doesn't get rolled INTO the dough (please learn from my mistakes and know that it is super annoying to get the paper out of the frozen cookie dough).Repeat this process with the second half of the dough and place both logs in the freezer.Freeze for at least 2 hours.When you're ready to bake your cookies, pre-heat the oven to 350. Untwist one side of one log of the dough and , using a sharp knife, cut \xbd inch slices off and place them 1\xbd-2 inches apart on an ungreased cookie sheet.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 93762, u'name': u'peanut butter chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [], u'step': u'Bake for 9 minutes. The centers will still look soft but should not look liquid (like cake batter).', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Let them cool for several minutes before removing to a wire rack to cool completely.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 161, u'instructions': u"Beat together the butter and sugars until smooth.Add the eggs and beat until just combined. Then add the vanilla.Heat the milk in a small saucepan over medium high heat until it just starts to simmer. Remove it from the heat immediately and then stir in the chocolate chips. Keep stirring until smooth. Scrape the melted chocolate into the batter and beat for about 30 seconds.Sift in the flours, cocoa powder, baking soda, and salt (OR whisk the dry ingredients together in a separate bowl and then add them all at once).Beat until combined.Add the oats and peanut butter chips and beat until they are evenly incorporated.Tear off a sheet of parchment paper, wax paper, or plastic wrap (parchment paper is the easiest to work with but I've tried the others-- they will do just fine. Aluminum foil is a No No!). An 18-24 inch sheet will do. Divide the cookie dough in half and portion one half out onto the waiting parchment. Fold one side of the paper over the dough and sort of roll and squeeze until you have a log shape. Use your hands to flatten the ends before you twist the paper around to seal them off. You're aiming for your dough log to be about 1\xbd-2 inches in diameter. Also-- when you fold the paper over and roll the dough be careful that the paper doesn't get rolled INTO the dough (please learn from my mistakes and know that it is super annoying to get the paper out of the frozen cookie dough).Repeat this process with the second half of the dough and place both logs in the freezer.Freeze for at least 2 hours.When you're ready to bake your cookies, pre-heat the oven to 350. Untwist one side of one log of the dough and , using a sharp knife, cut \xbd inch slices off and place them 1\xbd-2 inches apart on an ungreased cookie sheet.Bake for 9 minutes. The centers will still look soft but should not look liquid (like cake batter).Let them cool for several minutes before removing to a wire rack to cool completely.", u'spoonacularSourceUrl': u'https://spoonacular.com/slice-n-bake-chocolate-peanut-butter-chip-oatmeal-cookies-517807', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 17, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}