{u'recipes': [{u'sourceName': u'Kawaling Pinoy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/568285-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 568285, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pinakbet', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 159.75, u'creditText': u'Kawaling Pinoy', u'extendedIngredients': [{u'originalString': u'1 bitter melon, seeded, halved and cut into 1-inch thick', u'aisle': u'Produce', u'name': u'bitter melon', u'metaInformation': [u'halved', u'seeded', u'cut into '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bitter-melon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11024, u'unit': u''}, {u'originalString': u'1 large eggplant, ends trimmed and cut into 1-inch thick', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'large', u'trimmed', u'cut into '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'2 cloves garlic, peeled and minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 small kabocha (calabasa) peeled and cut into pieces', u'aisle': u'Produce', u'name': u'kabocha', u'metaInformation': [u'small', u'peeled', u'cut into pieces', u'(calabasa)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kabocha.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10311643, u'unit': u''}, {u'originalString': u'1 tablespoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'6 to 8 okra, ends trimmed', u'aisle': u'Produce', u'name': u'okra', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11278, u'unit': u''}, {u'originalString': u'1 small onion, peeled and chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 pound pork belly, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 10005, u'unit': u'pound'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon shrimp paste', u'aisle': u'Seafood', u'name': u'shrimp paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93657, u'unit': u'tablespoon'}, {u'originalString': u'2 medium tomatoes, chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1/2 bunch long beans, ends trimmed and cut into into 3-inch lengths', u'aisle': u'Produce', u'name': u'yard long beans', u'metaInformation': [u'trimmed', u'cut into into 3-inch lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chinese-long-beans.jpg', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11199, u'unit': u'bunch'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.kawalingpinoy.com/2013/04/pinakbet/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In pot over medium heat, heat oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add onions and garlic and cook, stirring regularly, until limp and aromatic.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add pork and cook, stirring occasionally, until meat is lightly browned.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add shrimp paste and continue to cook, stirring occasionally, for about 3 to 5 minutes or until shrimp paste begins to brown.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp-paste.jpg', u'id': 93657, u'name': u'belacan'}]}, {u'equipment': [], u'step': u'Add tomatoes and cook, mashing with back of spoon, for about 5 minutes or until softened and have released juice.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add water and bring to a boil. Lower heat, cover and cook for about 10 to 15 minutes or until meat is tender.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add squash and cook for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add okra, long beans, bitter melon and eggplant. Continue to cook for about 4 to 5 minutes or until vegetables are tender yet crisp. Season with salt and pepper to taste.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bitter-melon.jpg', u'id': 11024, u'name': u'bitter gourd'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'id': 11278, u'name': u'okra'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'In pot over medium heat, heat oil. Add onions and garlic and cook, stirring regularly, until limp and aromatic. Add pork and cook, stirring occasionally, until meat is lightly browned. Add shrimp paste and continue to cook, stirring occasionally, for about 3 to 5 minutes or until shrimp paste begins to brown. Add tomatoes and cook, mashing with back of spoon, for about 5 minutes or until softened and have released juice. Add water and bring to a boil. Lower heat, cover and cook for about 10 to 15 minutes or until meat is tender. Add squash and cook for about 2 minutes. Add okra, long beans, bitter melon and eggplant. Continue to cook for about 4 to 5 minutes or until vegetables are tender yet crisp. Season with salt and pepper to taste. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/pinakbet-568285', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}