{u'recipes': [{u'sourceName': u'Skinny Chef', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/472863-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 472863, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cherry Almond Smoothie', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 98.47, u'creditText': u'Skinny Chef', u'extendedIngredients': [{u'originalString': u'1 teaspoon almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup frozen or fresh pitted cherries', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'fresh', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'cup'}, {u'originalString': u'2 tablespoon granulated sugar or honey', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons ground flax', u'aisle': u'Health Foods;Baking', u'name': u'ground flax seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tablespoons'}, {u'originalString': u'8 ice cubes', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10014412, u'unit': u''}, {u'originalString': u'1 cup non-fat, plain yogurt', u'aisle': u'Meat', u'name': u'duck fat', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lard.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4574, u'unit': u'cup'}, {u'originalString': u'1/4 cup toasted whole almonds', u'aisle': u'Nuts', u'name': u'whole almonds', u'metaInformation': [u'whole', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://skinnychef.com/recipes/cherry-almond-smoothie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender or food processor, blend all ingredients until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern on the menu? Try pairing with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Premier Old Vine Zinfandel. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'Strawberry, Blackbery, Chocolate', u'title': u'Premier Old Vine Zinfandel', u'price': u'$19.99', u'id': 428280, u'link': u'https://www.amazon.com/2014-Premier-Old-Vine-Zinfandel/dp/B01M2DES4R', u'imageUrl': u'https://spoonacular.com/productImages/428280-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'In a blender or food processor, blend all ingredients until smooth.  Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-almond-smoothie-472863', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}