{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582937-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 582937, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy s – Crockpot Chicken Spaghetti #WeekdaySupper', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 186.84, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'\xbd stick of butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'stick', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'1 can Rotel diced tomatoes and green chilies', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'can'}, {u'originalString': u'16 oz. of chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'oz'}, {u'originalString': u'2 cans cream of chicken soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'cans'}, {u'originalString': u'1 tablespoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tablespoon'}, {u'originalString': u'shredded cheese for the top when serving', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded', u'for the top when serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'servings'}, {u'originalString': u'4-6 boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'24 oz. cooked spaghetti noodles', u'aisle': u'Pasta and Rice', u'name': u'spaghetti noodles', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'oz'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://dailydishrecipes.com/easy-recipes-crockpot-chicken-spaghetti-weekdaysupper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Mix up the cream of chicken, rotel, melted butter, Parmesan cheese, garlic powder and chicken broth in the bottom of the crock pot.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place the chicken breasts into the mixture.Cook on low for 8-12 hours, or on high for 4-6 hours.About 45 minutes to an hour before serving, take out the chicken and shred it, and cook the spaghetti noodles and add them. Put everything back in and mix everything and allow to continue cooking for about 45 minutes to an hour.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Serve and sprinkle with shredded cheese pair with a salad and garlic bread for an easy meal.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1011026, u'name': u'shredded cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Raymond Reserve Selection Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 241, u'instructions': u'Mix up the cream of chicken, rotel, melted butter, Parmesan cheese, garlic powder and chicken broth in the bottom of the crock pot.Place the chicken breasts into the mixture.Cook on low for 8-12 hours, or on high for 4-6 hours.About 45 minutes to an hour before serving, take out the chicken and shred it, and cook the spaghetti noodles and add them. Put everything back in and mix everything and allow to continue cooking for about 45 minutes to an hour.Serve and sprinkle with shredded cheese pair with a salad and garlic bread for an easy meal.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-s-crockpot-chicken-spaghetti-weekdaysupper-582937', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 260, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}