{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223139-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 223139, u'veryPopular': False, u'lowFodmap': False, u'title': u'English summer salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 58.97, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'500g peas and broad beans (freshly podded if possible)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'broad beans', u'metaInformation': [u'podded', u'(freshly if possible)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 16053, u'unit': u'g'}, {u'originalString': u'handful chervil and flat-leaf parsley leaves', u'aisle': u'Produce', u'name': u'flat leaf parsley leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'juice and zest 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'assortment of lettuce leaves, such as wild rocket, Baby Gem, water or land cress', u'aisle': u'Produce', u'name': u'lettuce leaves', u'metaInformation': [u'wild', u' such as  rocket, baby gem, water or land cress'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 93623, u'unit': u'leaves'}, {u'originalString': u'3 tbsp extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'6 or so spring onions, trimmed and thinly sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'trimmed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}], u'healthScore': 60.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/11231/english-summer-salad', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Throw the peas and beans into a largepan of rapidly boiling salted water. Bringback to the boil for no more than 1-2 mins.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and allow to cool naturally (ratherthan plunging into iced water, which inmy opinion washes off flavour).Dress while still warm in a little of theolive oil, scatter over the spring onionsand season well. Finally, dress the lettuceleaves in the remaining oil, the lemonjuice and zest. Season well. Toss togetherwith the peas, broad beans and springonions. Scatter the herbs over the top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'id': 16053, u'name': u'fava beans'}]}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'Throw the peas and beans into a largepan of rapidly boiling salted water. Bringback to the boil for no more than 1-2 mins.Drain and allow to cool naturally (ratherthan plunging into iced water, which inmy opinion washes off flavour).Dress while still warm in a little of theolive oil, scatter over the spring onionsand season well. Finally, dress the lettuceleaves in the remaining oil, the lemonjuice and zest. Season well. Toss togetherwith the peas, broad beans and springonions. Scatter the herbs over the top.', u'spoonacularSourceUrl': u'https://spoonacular.com/english-summer-salad-223139', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}