{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604983-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 604983, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Muscavado Sugar Vanilla Ice Cream', u'diets': [u'gluten free'], u'pricePerServing': 552.9, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 cups hickory or mesquite wood chips, soaked in water for at least 30 minutes', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u'for at least 30 minutes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19003, u'unit': u'cups'}, {u'originalString': u'8 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 quart heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'quart'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup muscavado sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/07/smoked-muscavado-sugar-vanilla-ice-cream-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 136, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"For the Smoked Cream: Set up your smoker with 1/2 cup wood chips for low-temperature (about 150\xb0F) smoking following the manufacturer's instructions.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Fill a shallow disposable aluminum baking pan with enough ice to come halfway up pan, and just enough water to nearly cover ice. Nest a smaller shallow disposable aluminum baking pan with at least 2-quart capacity into the ice bath. Set pans in smoker and add 1 quart of cream to smaller pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Close smoker, adjusting vents to maintain as low a temperature as possible, and smoke until cream develops a strong, but not overpowering, smoky flavor, about 1 1/2 to 2 hours; replenishing wood chips 1/2 cup at a time as needed, and stirring cream occasionally. Monitor temperature of cream: If an instant-read thermometer registers above 60\xb0F, discard ice bath and replace with a fresh one.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Pour cream into an airtight container and refrigerate.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'4', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'For the Ice Cream: Blend smoked cream with fresh cream to taste, starting with 1/2 cup smoked cream and 1/2 cup fresh cream and adding more of each to taste, until volume totals 2 cups and smokey flavor is pleasant and not overpowering. Reserve additional smoked and fresh creams for another use.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'5', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together egg yolks and muscavado sugar in a heavy-bottomed saucepan.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in diluted smoked cream and milk until fully combined, then place over medium-low heat. Cook, stirring frequently, until liquid reaches 170\xb0F or until a finger swiped across the back of the spoon leaves a clean line.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'6', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u"Pour custard through a fine mesh strainer into an airtight container, stir in vanilla and salt, and chill in an ice bath or refrigerator until it registers no more than 45\xb0F on an instant-read thermometer, at least 4 hours and up to overnight. Churn according to manufacturer's instructions.", u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Transfer ice cream to airtight container and chill in freezer for at least 4 to 5 hours before serving.', u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Vanillan Ice Cream. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 35, u'instructions': u"Procedures                                                          1                                              For the Smoked Cream: Set up your smoker with 1/2 cup wood chips for low-temperature (about 150\xb0F) smoking following the manufacturer's instructions.                                                                                    2                                              Fill a shallow disposable aluminum baking pan with enough ice to come halfway up pan, and just enough water to nearly cover ice. Nest a smaller shallow disposable aluminum baking pan with at least 2-quart capacity into the ice bath. Set pans in smoker and add 1 quart of cream to smaller pan.                                                                                    3                                              Close smoker, adjusting vents to maintain as low a temperature as possible, and smoke until cream develops a strong, but not overpowering, smoky flavor, about 1 1/2 to 2 hours; replenishing wood chips 1/2 cup at a time as needed, and stirring cream occasionally. Monitor temperature of cream: If an instant-read thermometer registers above 60\xb0F, discard ice bath and replace with a fresh one. Pour cream into an airtight container and refrigerate.                                                                                    4                                              For the Ice Cream: Blend smoked cream with fresh cream to taste, starting with 1/2 cup smoked cream and 1/2 cup fresh cream and adding more of each to taste, until volume totals 2 cups and smokey flavor is pleasant and not overpowering. Reserve additional smoked and fresh creams for another use.                                                                                    5                                              Whisk together egg yolks and muscavado sugar in a heavy-bottomed saucepan. Whisk in diluted smoked cream and milk until fully combined, then place over medium-low heat. Cook, stirring frequently, until liquid reaches 170\xb0F or until a finger swiped across the back of the spoon leaves a clean line.                                                                                    6                                              Pour custard through a fine mesh strainer into an airtight container, stir in vanilla and salt, and chill in an ice bath or refrigerator until it registers no more than 45\xb0F on an instant-read thermometer, at least 4 hours and up to overnight. Churn according to manufacturer's instructions. Transfer ice cream to airtight container and chill in freezer for at least 4 to 5 hours before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-muscavado-sugar-vanilla-ice-cream-604983', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}