{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/432232-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 432232, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cobb Salad Dip', u'diets': [u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 22.14, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 avocado, chopped', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'4 slices OSCAR MAYER\xae Fully Cooked Bacon, crumbled', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'fully cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1/4 cup KRAFT\xae ROKA Blue Cheese Dressing', u'aisle': u'Cheese', u'name': u'blue cheese dressing', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese-dressing.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 43020, u'unit': u'cup'}, {u'originalString': u'1 package (8 ounces) PHILADELPHIA\xae Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'2 hard-cooked eggs, finely chopped', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard cooked eggs', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'1 cup finely chopped iceberg lettuce', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u'cup'}, {u'originalString': u'2 small plum tomatoes, finely chopped', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'1/2 cup OSCAR MAYER\xae CARVING BOARD Oven Roasted Turkey Breast', u'aisle': u'Meat', u'name': u'turkey breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 5696, u'unit': u'cup'}, {u'originalString': u'WHEAT THINS\xae Big Snacks', u'aisle': u'Savory Snacks', u'name': u'wheat thins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93728, u'unit': u'T'}, {u'originalString': u'1/4 cup ATHENOS\xae Crumbled Blue Cheese', u'aisle': u'?', u'name': u'athenos\xae cheese', u'metaInformation': [u'blue', u'crumbled'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cobb-salad-dip', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'MIX cream cheese and dressing until blended; spread onto bottom of pie plate. Refrigerate 1 hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'TOP with layers of all remaining ingredients except WHEAT THINS.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers', u'id': 93728, u'name': u'wheat thins'}]}, {u'equipment': [], u'step': u'SERVE with WHEAT THINS.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers', u'id': 93728, u'name': u'wheat thins'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'Directions                                                                                MIX cream cheese and dressing until blended; spread onto bottom of pie plate. Refrigerate 1 hour.                                                                                           TOP with layers of all remaining ingredients except WHEAT THINS.                                                                                           SERVE with WHEAT THINS.                                        Yield: 52 SERVINGS.                                                                                                     SERVING SUGGESTION: Serve with RITZ Crackers instead of WHEAT THINS                                                                                                Originally published as Cobb Salad Dip Provided by Philadelphia\xae Cream Cheese                                                                                                                                                                                                Nutritional Facts                                                                             1  serving equals 180 calories, 8 g fat (2 g saturated fat), 15 mg cholesterol, 300 mg sodium, 23 g carbohydrate, 0 fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cobb-salad-dip-432232', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 15, u'servings': 52, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}