{u'recipes': [{u'sourceName': u'Mountain Mama Cooks', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/615293-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615293, u'veryPopular': False, u'lowFodmap': False, u'title': u'Scrambled Egg and Roasted Tomato Breakfast Burrito', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 603.06, u'creditText': u'Mountain Mama Cooks', u'extendedIngredients': [{u'originalString': u'sliced avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'2 pints cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 2.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'pints'}, {u'originalString': u'cilantro for garnish', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1 tablespoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'3 eggs + 3 egg whites (or all', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons garlic infused olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'garlic-infused oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1004053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 Toufayan Bakeries Wholesome Wheat Wraps', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'whole-wheat wraps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortillas-whole-wheat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93675, u'unit': u''}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.mountainmamacooks.com/2014/09/scrambled-egg-roasted-tomato-breakfast-burrito/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 300F degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/glass-baking-tray.jpg', u'id': 406921, u'name': u'glass baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place tomatoes in a glass baking pan. Toss with garlic infused oil and sprinkle with salt. Roast in a preheated oven for 2- 2 1/2 hours until soft and caramelized.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-oil.jpg', u'id': 1004053, u'name': u'garlic oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat coconut oil in non-stick saut pan over medium-low heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine eggs and egg whites in a  bowl with a splash of water. Use a fork or whisk to whip the eggs until light and fluffy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the eggs into pan and cook, over low heat until fluffy and cooked to your liking. Season with salt and pepper.Divide the eggs between two tortillas and top with sliced avocado and a smattering of roasted tomatoes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Garnish with cilantro if you like, roll up and enjoy!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'aggregateLikes': 313, u'instructions': u'Preheat oven to 300F degrees. Place tomatoes in a glass baking pan. Toss with garlic infused oil and sprinkle with salt. Roast in a preheated oven for 2- 2 1/2 hours until soft and caramelized. Heat coconut oil in non-stick saut pan over medium-low heat. Combine eggs and egg whites in a  bowl with a splash of water. Use a fork or whisk to whip the eggs until light and fluffy. Pour the eggs into pan and cook, over low heat until fluffy and cooked to your liking. Season with salt and pepper.Divide the eggs between two tortillas and top with sliced avocado and a smattering of roasted tomatoes. Garnish with cilantro if you like, roll up and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/scrambled-egg-and-roasted-tomato-breakfast-burrito-615293', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}