{u'recipes': [{u'sourceName': u"Keepin' It Kind", u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/631005-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631005, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brownie Ice Cream Sandwiches', u'diets': [u'gluten free'], u'pricePerServing': 85.48, u'creditText': u"Keepin' It Kind", u'extendedIngredients': [{u'originalString': u'1/2 cup applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons vegan butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons chocolate extract', u'aisle': u'Baking', u'name': u'chocolate extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 13411111, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'3 tablespoons dutch-process cocoa', u'aisle': u'Baking', u'name': u'dutch process cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dutch-process-cocoa-powder.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10019165, u'unit': u'tablespoons'}, {u'originalString': u'1 cup gluten-free flour (or all-purpose flour)', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten-free flour', u'metaInformation': [u'gluten-free', u'all-purpose', u'(or flour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93620, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon xanthum gum (only if using gluten-free flour, optional)', u'aisle': u'Sweet Snacks', u'name': u'gum drop', u'metaInformation': [u'gluten-free', u'(only if using flour, optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spice-drops-or-gumdrops.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19106, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 large container of vegan vanilla ice cream (I used Trader Joe\'s "Soy Creamy" vegan vanilla ice cream).', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [u'large', u'(I used Trader Joe\'s "Soy Creamy" vegan vanilla ice cream)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'container'}, {u'originalString': u'1 cup vegan dark chocolate, chopped', u'aisle': u'Health Foods;Baking', u'name': u'vegan chocolate chips', u'metaInformation': [u'dark', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98848, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://keepinitkind.com/brownie-ice-cream-sandwiches/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350. Line two square baking dishes with parchment paper. Set aside.In a medium bowl, mix together your dry ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat your cup of chopped chocolate with the vegan butter in a in a large glass bowl over a pot of boiling water. Once it is fully melted, remove from heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add in the rest of the wet ingredients and mix thoroughly.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the dry ingredients to the wet ingredients and stir until just combined.Dived the batter between the two baking dishes and spread until smooth and even.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place both dishes in the oven and bake for 25-30 minutes until set and the edges are pulling away from the pan slightly.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and let cool for 1-2 hours.Once the brownies are cool, place the the two brownie dishes in the freezer.  Leave there for 30 minutes.  After 30 minutes, take your ice cream out of the freezer.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Let it sit for a few minutes to soften.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the brownies from the freezer.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread ice cream on top of the brownie layer in ONE pan. Create a layer that is about -1 inch thick and spread out evenly.Carefully lift the brownie layer from the other dish and place on a flat surface. Very carefully, lift and place the layer on top of the ice cream layer. Gently press down to compress the sandwiches. Cover the dish and freeze for about 30-60 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the dish from the freezer. Use the parchment paper to lift the big sandwich from the pan and place on a flat surface, like a cutting board.  Use a cookie cutter, biscuit cutter or a knife to cut out desired sandwich shapes.  You will have to gently push from the bottom, underneath the parchment paper, to get the sandwiches to pop up.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Place the sandwiches in an airtight container.  Freeze until ready to serve. Enjoy!', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Ice Cream Sandwiches can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 855, u'instructions': u'Preheat the oven to 350. Line two square baking dishes with parchment paper. Set aside.In a medium bowl, mix together your dry ingredients.Heat your cup of chopped chocolate with the vegan butter in a in a large glass bowl over a pot of boiling water. Once it is fully melted, remove from heat. Add in the rest of the wet ingredients and mix thoroughly.Add the dry ingredients to the wet ingredients and stir until just combined.Dived the batter between the two baking dishes and spread until smooth and even. Place both dishes in the oven and bake for 25-30 minutes until set and the edges are pulling away from the pan slightly. Remove from oven and let cool for 1-2 hours.Once the brownies are cool, place the the two brownie dishes in the freezer.  Leave there for 30 minutes.  After 30 minutes, take your ice cream out of the freezer. Let it sit for a few minutes to soften.  Remove the brownies from the freezer.  Spread ice cream on top of the brownie layer in ONE pan. Create a layer that is about -1 inch thick and spread out evenly.Carefully lift the brownie layer from the other dish and place on a flat surface. Very carefully, lift and place the layer on top of the ice cream layer. Gently press down to compress the sandwiches. Cover the dish and freeze for about 30-60 minutes.Remove the dish from the freezer. Use the parchment paper to lift the big sandwich from the pan and place on a flat surface, like a cutting board.  Use a cookie cutter, biscuit cutter or a knife to cut out desired sandwich shapes.  You will have to gently push from the bottom, underneath the parchment paper, to get the sandwiches to pop up.  Place the sandwiches in an airtight container.  Freeze until ready to serve. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/brownie-ice-cream-sandwiches-631005', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}