{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/149100-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 149100, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salmon, Red Quinoa, and Arugula Salad', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 438.91, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'2 cups arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cups'}, {u'originalString': u'1/2 cup canned chickpeas, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'canned', u'rinsed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16058, u'unit': u'cup'}, {u'originalString': u'1 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/4 cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons harissa (available at Whole Foods Market)', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [u'whole', u'(available at Foods Market)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'tablespoons'}, {u'originalString': u'Juice of 2 lemons', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 1/2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup red quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'4 skinless salmon fillets (3 ounces each)', u'aisle': u'Seafood', u'name': u'salmon fillets', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons toasted slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10012061, u'unit': u'tablespoons'}, {u'originalString': u'3 sprigs thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'1 teaspoon turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'1 white onion, sliced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'1 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 50.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/51165800', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot, boil wine and 4 cups water.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add salmon, onion and thyme. Reduce heat to simmer;poach salmon until cooked through, about 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove salmon; cool. In another large pot, boil4 cups water.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Add quinoa and cook until tender,about 11 minutes; drain.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, mix quinoa, chickpeas, raisins and spices; cool.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [], u'step': u'Toss quinoa-chickpea mixture with arugula. Dresssalad with lemon juice and oil. Season with salt andfreshly ground black pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}, {u'equipment': [], u'step': u'Divide salad and poached salmon among 4 plates.Top each salmon fillet with 1 tablespoon harissa.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'id': 1006972, u'name': u'harissa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Garnish withcilantro and almonds.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Per serving: 488 calories, 21 g fat, 4 g saturated fat, 46 g carbohydrate, 7 g fiber, 25 g protein', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Nutritional analysis provided by', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Self', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Vampire Pinot Grigio Wine. It has 4.5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This dry, zestful combination is reminiscent of ripe pears and roses', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 214, u'instructions': u'Preparation                                                                    In a large pot, boil wine and 4 cups water.                                                                            Add salmon, onion and thyme. Reduce heat to simmer;poach salmon until cooked through, about 7 minutes.                                                                            Remove salmon; cool. In another large pot, boil4 cups water. Add quinoa and cook until tender,about 11 minutes; drain.                                                                            In a bowl, mix quinoa, chickpeas, raisins and spices; cool.                                                                            Toss quinoa-chickpea mixture with arugula. Dresssalad with lemon juice and oil. Season with salt andfreshly ground black pepper.                                                                            Divide salad and poached salmon among 4 plates.Top each salmon fillet with 1 tablespoon harissa. Garnish withcilantro and almonds.                                                                         Per serving: 488 calories, 21 g fat, 4 g saturated fat, 46 g carbohydrate, 7 g fiber, 25 g protein                            Nutritional analysis provided by                                        Self', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-red-quinoa-and-arugula-salad-149100', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}