{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597264-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 597264, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Coconut Noodle Soup', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 60, u'pricePerServing': 635.03, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 pounds boneless chicken thighs or breasts, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'boneless chicken thighs', u'metaInformation': [u'boneless', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5091, u'unit': u'pounds'}, {u'originalString': u'7 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 cup cilantro sprigs', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 13 1/2-ounce cans coconut milk (5 cups)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 15.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cups'}, {u'originalString': u'Fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'servings'}, {u'originalString': u'1/2 cup garbanzo bean flour, whisked into 1/2 cup warm water to make a smooth, runny paste', u'aisle': u'Gluten Free;Ethnic Foods;Health Foods', u'name': u'garbanzo bean flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16157, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, chopped (1 tablespoon)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'2-inch piece fresh ginger, peeled and grated (2 tablespoons)', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'fresh', u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'2 green onions, white and green parts, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 teaspoons ground paprika', u'aisle': u'Spices and Seasonings', u'name': u'ground paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoons'}, {u'originalString': u'6 hard-boiled eggs, peeled and cut crosswise into 1/4-inch-thick slices', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled eggs', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 1129, u'unit': u'slices'}, {u'originalString': u'3 limes, quartered', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'3 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'1 large sweet onion, halved, cut into thin crescents, and soaked in water', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large', u'halved', u'cut into thin crescents, and soaked in water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'2 medium yellow onions, chopped (2 cups)', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u'cups'}, {u'originalString': u'4 tablespoons ground dried red chilies, pan-roasted until dark and fragrant', u'aisle': u'?', u'name': u'ground chilies', u'metaInformation': [u'dark', u'dried', u'red'], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'unit': u'tablespoons'}], u'healthScore': 47.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://leitesculinaria.com/22068/recipes-chicken-coconut-noodle-soup.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 82, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make the chicken noodle soup1. In a medium bowl, combine the fish sauce, soy sauce, garlic, ginger, and turmeric.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Add the chicken and mix well with your hands (use gloves to prevent your nails from being stained ochre by the turmeric). Set aside.2. In a medium heavy-bottomed pot or Dutch oven, heat the oil over medium-high heat until it becomes runny and starts to shimmer. Stir in the onions and cook until soft and translucent, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the paprika and mix until the onions are well coated.3. Tumble in the chicken and raise the heat to medium-high. Stir and cook until the chicken is no longer pink, 4 to 5 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the coconut milk and stock and bring to a gentle boil, stirring constantly to prevent the mixture from curdling. Reduce the heat to medium-low, cover, and simmer gently for 20 minutes to allow the flavors to meld.4. Stir in the garbanzo bean flour paste and return to a boil. Simmer over medium-low heat until the sauce is thick like heavy cream, 5 to 10 minutes. Adjust the consistency with more stock for a thinner gravy or more garbanzo bean flour for a thicker gravy. Taste and add more fish or soy sauce if necessary. Reduce the heat to very low and keep warm until ready to serve.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'id': 16157, u'name': u'chickpea flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Serve the chicken coconut soup5. Just before serving the soup, cook the noodles in a large pot of water according to package directions. Tip into a colander over the sink and rinse under cold running water.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Drain and place in a bowl. Toss in a little oil to prevent sticking.6. Divide the noodles among individual soup bowls and ladle about 1 1/2 cups sauce over them.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with eggs, chilies, onions, cilantro, limes, and fish sauce as desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 63, u'instructions': u'Make the chicken noodle soup1. In a medium bowl, combine the fish sauce, soy sauce, garlic, ginger, and turmeric. Add the chicken and mix well with your hands (use gloves to prevent your nails from being stained ochre by the turmeric). Set aside.2. In a medium heavy-bottomed pot or Dutch oven, heat the oil over medium-high heat until it becomes runny and starts to shimmer. Stir in the onions and cook until soft and translucent, 3 to 4 minutes. Add the paprika and mix until the onions are well coated.3. Tumble in the chicken and raise the heat to medium-high. Stir and cook until the chicken is no longer pink, 4 to 5 minutes. Add the coconut milk and stock and bring to a gentle boil, stirring constantly to prevent the mixture from curdling. Reduce the heat to medium-low, cover, and simmer gently for 20 minutes to allow the flavors to meld.4. Stir in the garbanzo bean flour paste and return to a boil. Simmer over medium-low heat until the sauce is thick like heavy cream, 5 to 10 minutes. Adjust the consistency with more stock for a thinner gravy or more garbanzo bean flour for a thicker gravy. Taste and add more fish or soy sauce if necessary. Reduce the heat to very low and keep warm until ready to serve.Serve the chicken coconut soup5. Just before serving the soup, cook the noodles in a large pot of water according to package directions. Tip into a colander over the sink and rinse under cold running water. Drain and place in a bowl. Toss in a little oil to prevent sticking.6. Divide the noodles among individual soup bowls and ladle about 1 1/2 cups sauce over them. Garnish with eggs, chilies, onions, cilantro, limes, and fish sauce as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-coconut-noodle-soup-597264', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}