{u'recipes': [{u'sourceName': u'The Roasted Root', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/607505-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 607505, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy One-Pot Seafood Paella', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 361.57, u'creditText': u'The Roasted Root', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 cups brown rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'1 cup canned peas, drained', u'aisle': u'Canned and Jarred', u'name': u'canned peas', u'metaInformation': [u'canned', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11306, u'unit': u'cup'}, {u'originalString': u'1 pound chorizo links, sliced**', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 7019, u'unit': u'pound'}, {u'originalString': u'1 pound clams, scrubbed', u'aisle': u'Seafood', u'name': u'clams', u'metaInformation': [u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15157, u'unit': u'pound'}, {u'originalString': u'\xbd teaspoon ground turmeric*', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon kosher salt (or to taste)', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 cups low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'2 tablespoons grapeseed or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 pound raw shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'raw shrimp', u'metaInformation': [u'raw', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 red bell pepper, chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.theroastedroot.net/seafood-paella-and-tapas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot or paella pan, heat the oil over medium and saut the onion until very fragrant, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chopped red bell pepper, uncooked brown rice, and turmeric and continue sauting until vegetables have softened, about 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'id': 20040, u'name': u'brown rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}]}, {u'equipment': [], u'step': u'Add thelow-sodium chicken broth, salt, and bay leaf and bring to a full boil.Reduce the heat and cover. Allow the rice and veggies to simmer until much of the liquid has been absorbed, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the peas, shrimp, and chorizo and mix.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the clams, hinge-side down into the paella and cover the pot. Cook for an additional 8 to 10 minutes, or until chorizo is heated, shrimp is cooked through, and clams have opened.Discard any clams that refuse to open.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [], u'step': u'Serve with your favorite wine!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tempranillo, Albarino, and Grenache are my top picks for Paella. When pairing wine with Spanish dishes, why not follow the rule 'what grows together goes together'? We recommend albari\xf1o for white wine and garnachan and tempranillo for red. One wine you could try is Steppe Cellars Tempranillo - Grenache - Mourvedre. It has 5 out of 5 stars and a bottle costs about 28 dollars.", u'pairedWines': [u'tempranillo', u'albarino', u'grenache'], u'productMatches': [{u'description': u'chocolate , clove , dark cherry', u'title': u'Steppe Cellars Tempranillo - Grenache - Mourvedre', u'price': u'$27.5', u'id': 430068, u'link': u'https://www.amazon.com/2008-Steppe-Cellars-Tempranillo-Mourvedre/dp/B00DVT3TDM', u'imageUrl': u'https://spoonacular.com/productImages/430068-312x231.jpg'}]}, u'aggregateLikes': 44, u'instructions': u'In a large pot or paella pan, heat the oil over medium and saut the onion until very fragrant, about 5 minutes. Add the chopped red bell pepper, uncooked brown rice, and turmeric and continue sauting until vegetables have softened, about 3 to 5 minutes.Add thelow-sodium chicken broth, salt, and bay leaf and bring to a full boil.Reduce the heat and cover. Allow the rice and veggies to simmer until much of the liquid has been absorbed, about 30 minutes.Add the peas, shrimp, and chorizo and mix. Place the clams, hinge-side down into the paella and cover the pot. Cook for an additional 8 to 10 minutes, or until chorizo is heated, shrimp is cooked through, and clams have opened.Discard any clams that refuse to open.Serve with your favorite wine!', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-one-pot-seafood-paella-607505', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}