{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549425-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 9, u'id': 549425, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brown Butter Sea Salt Chocolate Chip Cookies Stuffed with Nutella and Dulce de Leche', u'diets': [], u'preparationMinutes': 120, u'pricePerServing': 81.59, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 1/4 Teaspoon Baking Soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 18372, u'unit': u'Teaspoon'}, {u'originalString': u'Dulce de Leche', u'aisle': u'Nut butters, Jams, and Honey;Ethnic Foods;Frozen;Baking', u'name': u'dulce de leche', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caramel-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 98861, u'unit': u'servings'}, {u'originalString': u'1 Large Egg, plus 1 large egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/3 cups Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.3333333333333335, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 Tablespoon Greek Yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'Tablespoon'}, {u'originalString': u'1 1/4 cup Light Brown Sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3/4 cup Milk Chocolate Chips (we prefer ghirardelli)', u'aisle': u'Baking', u'name': u'milk chocolate chips', u'metaInformation': [u'(we prefer ghirardelli)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'Nutella', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 19125, u'unit': u'servings'}, {u'originalString': u'1/4 Teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'3/4 cup Semi Sweet Chocolate Chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 cup of Unsalted Butter (2 sticks)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1/2 Teaspoon Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'Teaspoon'}, {u'originalString': u'1/4 cup White Sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2013/06/dulce-de-leche-stuffed-cookies-nutella-browned-butter-chocolate-chip.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large skillet over medium heat, add the butter and cook, stirring slowly with a whisk until golden, nutty scented and foamy, about 3-5 minutes. Set aside to cool.Meanwhile, mix the flour, salt and baking soda in a bowl.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the sugar and brown sugar to a standing mixer and add the browned butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Mix for 2 minutes to properly combine the sugar mixture.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the yogurt and vanilla and mix again. Finally add the egg and egg yolk and mix for a few seconds or until the egg is incorporated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the flour bowl contents and mix for 30-60 seconds before adding the chocolate chips.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place a large sheet of saran wrap on the counter and dump out the dough. Form the dough into a long log and cover tightly with saran wrap. Refrigerate the dough overnight, or at least 2 hours. Allow the dough to rest on the counter for 30-60 minutes before handling. Slice the dough into circles to make it easier to flatten. Meanwhile, heat the oven to 350 and line a few baking sheets with parchment paper or Silpat mats. Press a ball of the dough in the palm of your hand and place 1/2 teaspoon of nutella and 1/2 teaspoon of dulce de leche on the dough. Wrap the dough over the filling and shape into a ball.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caramel-sauce.jpg', u'id': 98861, u'name': u'dulce de leche'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on baking sheets and bake for 9-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and immediately sprinkle with a little sea salt. Allow to cool for a minute or two before placing on a cooling rack.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 5801, u'instructions': u'In a large skillet over medium heat, add the butter and cook, stirring slowly with a whisk until golden, nutty scented and foamy, about 3-5 minutes. Set aside to cool.Meanwhile, mix the flour, salt and baking soda in a bowl. Add the sugar and brown sugar to a standing mixer and add the browned butter. Mix for 2 minutes to properly combine the sugar mixture. Add the yogurt and vanilla and mix again. Finally add the egg and egg yolk and mix for a few seconds or until the egg is incorporated. Add the flour bowl contents and mix for 30-60 seconds before adding the chocolate chips. Place a large sheet of saran wrap on the counter and dump out the dough. Form the dough into a long log and cover tightly with saran wrap. Refrigerate the dough overnight, or at least 2 hours. Allow the dough to rest on the counter for 30-60 minutes before handling. Slice the dough into circles to make it easier to flatten. Meanwhile, heat the oven to 350 and line a few baking sheets with parchment paper or Silpat mats. Press a ball of the dough in the palm of your hand and place 1/2 teaspoon of nutella and 1/2 teaspoon of dulce de leche on the dough. Wrap the dough over the filling and shape into a ball. Place on baking sheets and bake for 9-10 minutes. Remove from the oven and immediately sprinkle with a little sea salt. Allow to cool for a minute or two before placing on a cooling rack.', u'spoonacularSourceUrl': u'https://spoonacular.com/brown-butter-sea-salt-chocolate-chip-cookies-stuffed-with-nutella-and-dulce-de-leche-549425', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 129, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}