{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573494-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 573494, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rustic Strawberry Peach Tart', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 487.7, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u'1 egg, beaten for egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten', u'for egg wash'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups (190 grams) all-purpose flour (careful not to overmeasure)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'(careful not to overmeasure)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 190.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'3 Tablespoons (45 grams) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 45.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'1/4 cup (60 ml) ice water, plus more as needed', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 60.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'ml'}, {u'originalString': u'2 ripe peaches, peeled, pitted, sliced (not frozen)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'frozen', u'pitted', u'ripe', u'peeled', u'sliced', u'(not )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (about 300 grams) fresh strawberries, sliced (not frozen)', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'frozen', u'sliced', u'(not )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 9316, u'unit': u'grams'}, {u'originalString': u'additional sugar for sprinkling', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'serving'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2013/08/14/rustic-strawberry-peach-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the peaches and strawberries together in a medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the sugar and vanilla, tossing well to coat the fruit. Set aside and allow the mixture to soak as you prepare the crust.For the crust: In a medium bowl, whisk the flour, sugar, and salt together in a medium bowl. Using a pastry cutter (or your hands), cut in the butter until the mixture resembles coarse, pea-sized crumbs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add 1/4 cup of ice water, stirring with a fork until the flour is moistened.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add up to 2 more Tablespoons of ice water if the dough seems dry. Gently knead the dough a few times in the bowl until it all comes together. Shape the dough into a ball and flatten it into a thick disk, as pictured above. Wrap it in plastic wrap and refrigerate it for at least 1 hour.Preheat oven to 425F degrees. Line a large baking sheet with parchment paper or a silicone baking mat. Set aside.On a lightly floured surface, roll the dough into a 12-inch circle. Trim the rim of the circle to make a clean cut if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer dough to the prepared baking sheet.Spoon the fruit (not the juices) into the center of the dough, leaving a 2-3 inch border all around, as pictured above. Gently fold the edges of the dough over the fruit, overlapping the dough as necessary. Press gently to seal the edges.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour most of the reserved juices over the fruit, leaving about 1-2 Tablespoons behind. Too much juice and the dough will become soggy.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the crust with the beaten egg and sprinkle with sugar.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 25-35 minutes or until the crust is golden brown,', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow to slightly cool before serving.If you wish to drizzle with vanilla glaze, use the glaze recipe from here.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Serve warm or at room temperature.', u'number': 10, u'ingredients': []}], u'name': u'For the filling'}], u'winePairing': {u'pairingText': u"Tart works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 69056, u'instructions': u'For the filling: Mix the peaches and strawberries together in a medium bowl. Add the sugar and vanilla, tossing well to coat the fruit. Set aside and allow the mixture to soak as you prepare the crust.For the crust: In a medium bowl, whisk the flour, sugar, and salt together in a medium bowl. Using a pastry cutter (or your hands), cut in the butter until the mixture resembles coarse, pea-sized crumbs. Add 1/4 cup of ice water, stirring with a fork until the flour is moistened. Add up to 2 more Tablespoons of ice water if the dough seems dry. Gently knead the dough a few times in the bowl until it all comes together. Shape the dough into a ball and flatten it into a thick disk, as pictured above. Wrap it in plastic wrap and refrigerate it for at least 1 hour.Preheat oven to 425F degrees. Line a large baking sheet with parchment paper or a silicone baking mat. Set aside.On a lightly floured surface, roll the dough into a 12-inch circle. Trim the rim of the circle to make a clean cut if desired. Transfer dough to the prepared baking sheet.Spoon the fruit (not the juices) into the center of the dough, leaving a 2-3 inch border all around, as pictured above. Gently fold the edges of the dough over the fruit, overlapping the dough as necessary. Press gently to seal the edges. Pour most of the reserved juices over the fruit, leaving about 1-2 Tablespoons behind. Too much juice and the dough will become soggy.Brush the crust with the beaten egg and sprinkle with sugar. Bake for 25-35 minutes or until the crust is golden brown, Remove from the oven and allow to slightly cool before serving.If you wish to drizzle with vanilla glaze, use the glaze recipe from here. Serve warm or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/rustic-strawberry-peach-tart-573494', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}