{u'recipes': [{u'sourceName': u'Jelly Toast Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/825668-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 825668, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Spice White Hot Chocolate', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 223.41, u'creditText': u'Jelly Toast Blog', u'extendedIngredients': [{u'originalString': u'marshmallows for serving', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19116, u'unit': u'servings'}, {u'originalString': u"1/4 cup International Delight's Pumpkin Spice Creamer", u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1002035, u'unit': u'cup'}, {u'originalString': u'pinch of pumpkin spice for garnish', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'pinch'}, {u'originalString': u'4 ounces white chocolate, chopped', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 19087, u'unit': u'ounces'}, {u'originalString': u'3 1/2 cups whole milk (or 2%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'2%', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://jellytoastblog.com/pumpkin-spice-white-hot-chocolate/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"Gently heat milk, International Delight's Pumpkin Spice Creamer, and white chocolate in a small sauce pan over medium/low heat. Stir constantly until chocolate is completely melted and milk is hot, but not boiling.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from heat, pour into mugs, and top with marshmallows and pumpkin spice, if desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 16, u'instructions': u"Gently heat milk, International Delight's Pumpkin Spice Creamer, and white chocolate in a small sauce pan over medium/low heat. Stir constantly until chocolate is completely melted and milk is hot, but not boiling. Remove from heat, pour into mugs, and top with marshmallows and pumpkin spice, if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-spice-white-hot-chocolate-825668', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}