{u'recipes': [{u'sourceName': u"Akila's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/494853-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 494853, u'veryPopular': False, u'lowFodmap': False, u'title': u'How to make Kollu Sundal / Horse Gram Sundal', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 27.01, u'creditText': u"Akila's Kitchen", u'extendedIngredients': [{u'originalString': u'Asafoetida - a pinch', u'aisle': u'Spices and Seasonings', u'name': u'asafoetida', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032035, u'unit': u'pinch'}, {u'originalString': u'Dried red chillies - 2', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'Grated Coconut - 1 tsp ( optional )', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'grated', u'( optional )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'tsp'}, {u'originalString': u'Curry leaves - few', u'aisle': u'Ethnic Foods', u'name': u'curry leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 93604, u'unit': u'leaves'}, {u'originalString': u'Black gram / urud dal - 1/4 tsp', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dal', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'gram', u'unitShort': u'g', u'amount': 1.0, u'consistency': u'solid', u'id': 16069, u'unit': u'gram'}, {u'originalString': u'Mustard seeds - a pinch', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'pinch'}, {u'originalString': u'Oil - 1 tsp', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'Salt - as per taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'per taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Horsegram - 1 cup', u'aisle': u'?', u'name': u'horsegram', u'metaInformation': [], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.akilaskitchen.com/2013/07/horse-gram-sundal-kollu-sundal-sundal.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Add the required salt. Finally add the coconut to it and give a stir again and switch off the stove.7.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve hot as a tea time snack - a really healthy snack.\xa0', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 10, u'instructions': u'Method1. Horsegram / kollu is bit a hard gram. So we need to soak it overnight for good resuts. If cannot, soak in hotwater for 4 hrs, changing hot water on every hour.2. Discard the drained water and add fresh water and pressure cook it for 4 whistles. If you can able to smash it, by pressing it hard, then it is cooked perfectly.3. Now drain this water and keep the drained horsegram separately and water separately. Use this water for Horsegram rasam and the horsegram we are going to do horsegram sundal now.4. Take a vessel and heat oil. Once it is hot add the mustard seeds, black gram. \xa0When they turn to slight brown, add the red chillies, n curry leaves and fry for a minute.5. Now add the Asafoetida and cooked Horsegram and give a nice stir. Atleast 2 min.6. Add the required salt. Finally add the coconut to it and give a stir again and switch off the stove.7. Serve hot as a tea time snack - a really healthy snack.\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/how-to-make-kollu-sundal-horse-gram-sundal-494853', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}