{u'recipes': [{u'sourceName': u'Caf\xe9 Terra Blog', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/514960-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 514960, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Greek Yogurt Pretzel Bars', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 106.68, u'creditText': u'Caf\xe9 Terra Blog', u'extendedIngredients': [{u'originalString': u'\xbd cup Florida Crystals Pure Cane Sugar', u'aisle': u'Baking', u'name': u'cane sugar', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd tsp cardamom', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'8 oz cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'2 pkg of unflavored gelatin + \xbd cup cold water (add gelatin after strawberries off burner)', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'unflavored', u'cold', u'(add gelatin after strawberries off burner)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'packages', u'unitShort': u'pkg', u'amount': 2.0, u'consistency': u'solid', u'id': 19177, u'unit': u'pkg'}, {u'originalString': u'2 (6oz) containers of Strawberry Chobani Greek Yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'oz'}, {u'originalString': u'4 Tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbsp'}, {u'originalString': u'2 cups pretzels (yields about 3 cups roughly crushed)', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [u'crushed', u'(yields 3 cups roughly )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19047, u'unit': u'cups'}, {u'originalString': u'2 (16oz) bags of frozen strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 9316, u'unit': u'oz'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 stick unsalted butter, melted (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.cafeterrablog.com/2012/06/12/strawberry-greek-yogurt-pretzel-bars/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350 degrees Fahrenheit. Grease 9 x 13 pan with cooking spray.Crush pretzels roughly, (I used a meat tenderizer to crush the pretzels roughly.) In small bowl – mix crushed pretzels with honey and butter. You do not need the butter, but it does add some delicious butter flavor to the bars.In greased 9 x 13 pan, spread out pretzel crust evenly and bake for 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let cool.In large pot on stove, on medium heat, cook down frozen strawberries. Once the strawberries are cooked down, add in sugar and cardamom.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the strawberries cook down, then mash them. Take off heat, and place in medium bowl. In a separate small bowl, mix together unflavored gelatin and cold water, let sit for a few minutes to solidify.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Add gelatin mixture to strawberries, and place in refrigerator, stir frequently to cool properly, strawberries will start to thicken.With mixer, mix together softened cream cheese and Greek yogurt really well, add in sugar and mix.To assemble bars – spread cream cheese mixture over cooled pretzel crust, let chill for 30 minutes in refrigerator, spread thickened strawberry sauce over cream cheese layer.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Let chill in cooler for additional two hours, or for best results let it sit overnight.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Greek Yogurt. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 194, u'instructions': u'Preheat oven to 350 degrees Fahrenheit. Grease 9 x 13 pan with cooking spray.Crush pretzels roughly, (I used a meat tenderizer to crush the pretzels roughly.) In small bowl – mix crushed pretzels with honey and butter. You do not need the butter, but it does add some delicious butter flavor to the bars.In greased 9 x 13 pan, spread out pretzel crust evenly and bake for 12 minutes. Let cool.In large pot on stove, on medium heat, cook down frozen strawberries. Once the strawberries are cooked down, add in sugar and cardamom. Let the strawberries cook down, then mash them. Take off heat, and place in medium bowl. In a separate small bowl, mix together unflavored gelatin and cold water, let sit for a few minutes to solidify. Add gelatin mixture to strawberries, and place in refrigerator, stir frequently to cool properly, strawberries will start to thicken.With mixer, mix together softened cream cheese and Greek yogurt really well, add in sugar and mix.To assemble bars – spread cream cheese mixture over cooled pretzel crust, let chill for 30 minutes in refrigerator, spread thickened strawberry sauce over cream cheese layer. Let chill in cooler for additional two hours, or for best results let it sit overnight.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-greek-yogurt-pretzel-bars-514960', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}