{u'recipes': [{u'sourceName': u'Blender Babes', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/581677-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 581677, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dr. Oz Mango Lassi Milkshake', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 184.27, u'creditText': u'Blender Babes', u'extendedIngredients': [{u'originalString': u'3/4 cup coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 tablespoons ground flax-seed (optional)', u'aisle': u'Health Foods;Baking', u'name': u'ground flax seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tablespoons'}, {u'originalString': u'2 cups ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cups'}, {u'originalString': u'1 mango, flesh removed from skin (discard skin)', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'(discard skin)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'1 large nectarine or peach', u'aisle': u'Produce', u'name': u'nectarine', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nectarines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9191, u'unit': u''}, {u'originalString': u'2 heaping tablespoons (Vega) vanilla plant-based protein powder', u'aisle': u'Health Foods', u'name': u'vanilla protein powder', u'metaInformation': [u'(Vega)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 99076, u'unit': u'tablespoons'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.blenderbabes.com/lifestyle-diet/dairy-free/dr-oz-mango-peach-lassi-milkshake-smoothie-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place all ingredients in the jar in order listed', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'For Blendtec: Press the SMOOTHIE Button', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'For Vitamix: Select VARIABLE, speed #1. Turn on machine and quickly increase speed to #10; then to HIGH. Run for 45 seconds or until smooth.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Milkshake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Place all ingredients in the jar in order listedFor Blendtec: Press the SMOOTHIE ButtonFor Vitamix: Select VARIABLE, speed #1. Turn on machine and quickly increase speed to #10; then to HIGH. Run for 45 seconds or until smooth.', u'spoonacularSourceUrl': u'https://spoonacular.com/dr-oz-mango-lassi-milkshake-581677', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}