{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536980-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 536980, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta with Cream Sauce', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 224.32, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'3-4 ounces chopped bacon, pancetta, or prosciutto', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'ounces'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'8 ounces linguine', u'aisle': u'Pasta and Rice', u'name': u'linguine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10720420, u'unit': u'ounces'}, {u'originalString': u'Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons minced shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.macheesmo.com/2009/02/pasta-with-cream-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 47, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add butter to a large skillet over medium heat. Stir in minced shallots and bacon (or other cured meat).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Let cook until bacon starts to crisp and shallots are soft, about 6-7 minutes. Season with a pinch of salt.2)', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add a cup of cream to the pan and bring it to a light simmer. Stir and let reduce.3) Cook pasta according to package in heavily salted water (1-2 tablespoons per gallon of water). 4) When pasta is done, immediately add it to cream sauce and stir to combine. The cream sauce should just hold onto the pasta. If it's very thick, add a few tablespoons of pasta water to the sauce. If it's too thin, let it simmer a bit to reduce further.5)", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve pasta immediately with grated Parmesan cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 149, u'instructions': u"Directions1) Add butter to a large skillet over medium heat. Stir in minced shallots and bacon (or other cured meat). Let cook until bacon starts to crisp and shallots are soft, about 6-7 minutes. Season with a pinch of salt.2) Add a cup of cream to the pan and bring it to a light simmer. Stir and let reduce.3) Cook pasta according to package in heavily salted water (1-2 tablespoons per gallon of water). 4) When pasta is done, immediately add it to cream sauce and stir to combine. The cream sauce should just hold onto the pasta. If it's very thick, add a few tablespoons of pasta water to the sauce. If it's too thin, let it simmer a bit to reduce further.5) Serve pasta immediately with grated Parmesan cheese.", u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-with-cream-sauce-536980', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}