{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/436853-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 436853, u'veryPopular': False, u'lowFodmap': True, u'title': u'Grilled Pineapple & Maple Sundaes', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 137.06, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'3/4 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 fresh pineapple, peeled, cut into 8 wedges', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'peeled', u'cut into 8 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'8 scoops vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'scoops', u'unitShort': u'scoops', u'amount': 8.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'scoops'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/grilled-pineapple---maple-sundaes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a large resealable bag, combine the syrup, brown sugar and cinnamon; add pineapple. Seal bag and turn to coat. Refrigerate for 10-20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Drain, reserving syrup mixture.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Moisten a paper towel with cooking oil; using long-handled tongs, lightly coat the grill rack. Grill pineapple, covered, over medium heat or broil 4 in. from the heat for 8-10 minutes or until lightly browned, turning once.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Serve pineapple with ice cream and drizzle with reserved syrup mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert on the menu? Try pairing with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                In a large resealable bag, combine the syrup, brown sugar and cinnamon; add pineapple. Seal bag and turn to coat. Refrigerate for 10-20 minutes. Drain, reserving syrup mixture.                                                                                            Moisten a paper towel with cooking oil; using long-handled tongs, lightly coat the grill rack. Grill pineapple, covered, over medium heat or broil 4 in. from the heat for 8-10 minutes or until lightly browned, turning once.                                                                                           Serve pineapple with ice cream and drizzle with reserved syrup mixture.                                        Yield: 8 servings.                                                                                                                         Originally published as Grilled Pineapple & Maple Sundaes in  Simple & DeliciousAugust/September 2012, p31                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 253 calories, 7 g fat (4 g saturated fat), 29 mg cholesterol, 57 mg sodium, 47 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-pineapple-maple-sundaes-436853', u'dishTypes': [u'dessert'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}