{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/507503-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 507503, u'veryPopular': True, u'lowFodmap': False, u'title': u"S'mores Brownies", u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 18.9, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'3 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'Additional graham crackers, broken into pieces', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18617, u'unit': u'pieces'}, {u'originalString': u'\xbc cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 bag mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'bag'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.browneyedbaker.com/2011/08/11/smores-brownies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Butter a 9x13-inch baking pan. Line the pan with foil, leaving some overhang, and then butter the foil; set aside.2.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the graham cracker crumbs, sugar and salt, mixing well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add the melted butter and, using a fork, toss until the entire mixture is moist. Dump the graham cracker mixture into the prepared baking pan, pressing it into an even layer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}, {u'equipment': [], u'step': u'Bake for about 15 minutes, or until golden brown.3. Meanwhile, prepare your brownie recipe.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the brownie batter over the cooked graham cracker crust, spreading it into an even layer.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the brownies according to the directions.4. As soon as the brownies come out of the oven, switch the oven to broil.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Pour the bag of mini marshmallows onto the brownies, covering it in an even layer. Pop the pan back in the oven for a few minutes. Keep a close eye on them - you want them to start to char so you get that s'mores flavor, but don't want to completely burn them.5. As soon as the pan comes out of the oven, top the marshmallow layer with the pieces of graham cracker, pressing down slightly so that the pieces of graham cracker get nestled into the marshmallow.6. Cool completely and then cut into squares. Store at room temperature in an airtight container.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 6424, u'instructions': u"1. Preheat oven to 350 degrees F. Butter a 9x13-inch baking pan. Line the pan with foil, leaving some overhang, and then butter the foil; set aside.2. Combine the graham cracker crumbs, sugar and salt, mixing well. Add the melted butter and, using a fork, toss until the entire mixture is moist. Dump the graham cracker mixture into the prepared baking pan, pressing it into an even layer. Bake for about 15 minutes, or until golden brown.3. Meanwhile, prepare your brownie recipe. Pour the brownie batter over the cooked graham cracker crust, spreading it into an even layer. Bake the brownies according to the directions.4. As soon as the brownies come out of the oven, switch the oven to broil. Pour the bag of mini marshmallows onto the brownies, covering it in an even layer. Pop the pan back in the oven for a few minutes. Keep a close eye on them - you want them to start to char so you get that s'mores flavor, but don't want to completely burn them.5. As soon as the pan comes out of the oven, top the marshmallow layer with the pieces of graham cracker, pressing down slightly so that the pieces of graham cracker get nestled into the marshmallow.6. Cool completely and then cut into squares. Store at room temperature in an airtight container.", u'spoonacularSourceUrl': u'https://spoonacular.com/smores-brownies-507503', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}