{u'recipes': [{u'sourceName': u'Oh She Glows', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/13389-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 13389, u'veryPopular': False, u'lowFodmap': False, u'title': u'New Year’s Smoky BBQ Chili with Flat & Crispy Cornbread', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 567.6, u'creditText': u'Oh She Glows', u'extendedIngredients': [{u'originalString': u'2 tbsp your fav BBQ sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup dry/uncooked black eyed peas', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black eyed peas', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-eyed-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16063, u'unit': u'cup'}, {u'originalString': u'1 (28-oz) can diced tomatoes, liquid drained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1/4 tsp cayenne pepper (or crushed red pepper flakes)', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'red', u'crushed', u'(or pepper flakes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'1 tbsp chia seeds (or ground flax), to thicken', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [u'(or ground flax)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tbsp'}, {u'originalString': u'2.5 tbsp chili powder, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2009, u'unit': u'tbsp'}, {u'originalString': u'1 tsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tsp'}, {u'originalString': u'1 cup frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'4 garlic cloves, peeled and chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 jalapeno pepper, seeded and chopped (optional)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/2 tsp kosher salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 red pepper, chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 tsp smoked paprika (optional)', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'tsp'}, {u'originalString': u'couple handfuls of chopped spinach, or other greens like collard, kale, etc', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'handfuls'}, {u'originalString': u'1 sweet onion, peeled and chopped', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'2 tbsp tomato paste, to thicken', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}, {u'originalString': u'6 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'3/4 cup dry/uncooked black beans', u'aisle': u'?', u'name': u'dry/uncooked beans', u'metaInformation': [u'black'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'unit': u'cup'}], u'healthScore': 79.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://ohsheglows.com/2011/12/31/new-years-smoky-bbq-chili-with-flat-crispy-cornbread/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to medium broil (#3 on my oven).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place an 8-10 inch cast-iron skillet in the oven to pre-heat. In a microwave-safe bowl, whisk together the dry ingredients (cornmeal, flour, salt, sugar). Now whisk in the water and melted 1/2 tbsp coconut oil.2. Microwave batter on high for 60 seconds. Batter will have thickened up a bit and cooked around the edges.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk vigorously until all clumps are gone.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place back in microwave and heat on high for another 20 seconds.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove and whisk well until no clumps remain.3. Carefully remove the cast iron skillet from the oven.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1/2 tbsp of coconut oil. Move it back and forth to coat bottom and edges.4.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour batter into the skillet and quickly spread it around with the back of a large spoon. Its ok if it doesnt touch the edges perfectly. This will depend on the size of your skillet.5.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place skillet in the oven and broil over medium heat for 10 minutes, watching it very closely as oven temperatures will vary! I kept an eye on it the entire time. When edges start to blacken (for me, after 10 minutes) remove carefully and gently flip it over using a flat metal spatula.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for an additional 2 minutes on the other side watching very closely.6.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and let it sit in the skillet for 3-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Place on cutting board and slice into 4-6 pieces. You can slice off any blackened edges if necessary, but a little bit adds to the fun.I wasnt expecting much from this cornbread, but I could not stop eating it.I had a few slices for breakfast this morning and I had to peel myself away from it to keep from eating the entire thing! Its just perfect on its own and even better dipped into chili. I can see myself having a lot of fun adapting this recipe.Well, thats a wrap for 2011 I guess. :)Thank you for making 2011 an exciting, fun, and memorable year for me. I am so thankful for everyone of you who have impacted my life in so many positive ways.I wish you a 2012 filled with glowing health, love, happiness, and the courage to follow your dreams.Ill catch you on the flip side!', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u"Let's get social! Follow Angela on Instagram (@ohsheglows + @theglowspot), Facebook, Twitter, Pinterest, and Google+Leave a Comment | Share on Facebook |Twitter |Pinterest |Google+ | Stumble Upon", u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili can be paired with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Codorniu Anna de Codorniu Cava Brut ros\xe9 with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u"This Cava combines glamour, innovation and modernity with the experience and history of what is probably Codorniu's most iconic offering, Anna de Codorniu. Elegance and subtlety, which to a large extent come from a blend with approximately 70% of the most prestigious varietal for making rose cavas: Pinot Noir. Delicate cherry color with strawberry tones. Fine and persistent bubbles. Aromas of red fruit, strawberries, cherries and woodland fruits with hints of green apple. Elegant and light on the palate. Well balanced between acid and sweetness with a refreshing finish.", u'title': u'Codorniu Anna de Codorniu Cava Brut Rose', u'price': u'$12.99', u'id': 451641, u'link': u'https://www.wine.com/product/codorniu-anna-de-codorniu-cava-brut-rose/109416', u'imageUrl': u'https://spoonacular.com/productImages/451641-312x231.jpg'}]}, u'aggregateLikes': 93, u'instructions': u"1. Preheat oven to medium broil (#3 on my oven). Place an 8-10 inch cast-iron skillet in the oven to pre-heat. In a microwave-safe bowl, whisk together the dry ingredients (cornmeal, flour, salt, sugar). Now whisk in the water and melted 1/2 tbsp coconut oil.2. Microwave batter on high for 60 seconds. Batter will have thickened up a bit and cooked around the edges. Whisk vigorously until all clumps are gone. Place back in microwave and heat on high for another 20 seconds. Remove and whisk well until no clumps remain.3. Carefully remove the cast iron skillet from the oven. Add 1/2 tbsp of coconut oil. Move it back and forth to coat bottom and edges.4. Pour batter into the skillet and quickly spread it around with the back of a large spoon. Its ok if it doesnt touch the edges perfectly. This will depend on the size of your skillet.5. Place skillet in the oven and broil over medium heat for 10 minutes, watching it very closely as oven temperatures will vary! I kept an eye on it the entire time. When edges start to blacken (for me, after 10 minutes) remove carefully and gently flip it over using a flat metal spatula. Bake for an additional 2 minutes on the other side watching very closely.6. Remove and let it sit in the skillet for 3-5 minutes. Place on cutting board and slice into 4-6 pieces. You can slice off any blackened edges if necessary, but a little bit adds to the fun.I wasnt expecting much from this cornbread, but I could not stop eating it.I had a few slices for breakfast this morning and I had to peel myself away from it to keep from eating the entire thing! Its just perfect on its own and even better dipped into chili. I can see myself having a lot of fun adapting this recipe.Well, thats a wrap for 2011 I guess. :)Thank you for making 2011 an exciting, fun, and memorable year for me. I am so thankful for everyone of you who have impacted my life in so many positive ways.I wish you a 2012 filled with glowing health, love, happiness, and the courage to follow your dreams.Ill catch you on the flip side!Let's get social! Follow Angela on Instagram (@ohsheglows + @theglowspot), Facebook, Twitter, Pinterest, and Google+Leave a Comment | Share on Facebook |Twitter |Pinterest |Google+ | Stumble Upon", u'spoonacularSourceUrl': u'https://spoonacular.com/new-years-smoky-bbq-chili-with-flat-crispy-cornbread-13389', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl', u"new year's eve"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}