{u'recipes': [{u'sourceName': u'Iowa Girl Eats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/631073-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631073, u'veryPopular': True, u'lowFodmap': True, u'title': u'Baked Pesto Chicken Parmesan (30 Minute Meal) - Iowa Girl Eats', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'pricePerServing': 234.56, u'creditText': u'Iowa Girl Eats', u'extendedIngredients': [{u'originalString': u'8oz fresh mozzarella cheese, sliced', u'aisle': u'Cheese', u'name': u'fresh mozzarella cheese', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1026, u'unit': u'oz'}, {u'originalString': u'1 cup marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'cup'}, {u'originalString': u'1/3 cup pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93698, u'unit': u'cup'}, {u'originalString': u'salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1lb boneless skinless chicken thighs, about 8 (could use chicken breasts pounded thin then cut in half)', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'boneless', u'skinless', u'cut in half)', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5096, u'unit': u'lb'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://iowagirleats.com/2014/02/24/baked-pesto-chicken-parmesan/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. Season chicken thighs with salt and pepper then add to a 8x8" or 9x12" baking dish.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Addpesto then use hands to evenly coat. Spoon marinara sauce over top of thighs followed by mozzarella cheese then cover tightly with foil and bake for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10111549, u'name': u'marinara sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil then bake for 10 more minutes, or until chicken is cooked through and cheese is golden brown and bubbly.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Barbera Wine, Chianti, and Montepulciano are my top picks for Chicken Parmesan. When chicken is paired with tomato sauce and cheese, it can handle a light or medium bodied red wine. Since this is an Italian-American dish, we went for Italian wines. The Desert Wind Barbera Wahluke Slope Sacagewea Vineyard with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'barbera wine', u'chianti', u'montepulciano'], u'productMatches': [{u'description': u"The Barbera grape, hailing from the Piedmont region of Italy, thrives in eastern Washington's hot, arid climate. Our 2014 Barbera is dark red in color with flavors of cherry, blackberry, and a touch of nutmeg. This wine was aged in neutral oak barrels so as to not mask its natural aromatics. Barbera inherently displays high acidity, making this wine a perfect pairing with pasta and other tomato-based dishes. Enjoy now or cellar for up to five years for a softer finish.", u'title': u'Desert Wind Barbera Wahluke Slope Sacagewea Vineyard', u'price': u'$20.0', u'id': 429003, u'link': u'https://www.amazon.com/Desert-Wind-Barbera-Sacagewea-Vineyard/dp/B01N0ARK4U', u'imageUrl': u'https://spoonacular.com/productImages/429003-312x231.jpg'}]}, u'aggregateLikes': 636, u'instructions': u'Preheat oven to 400 degrees. Season chicken thighs with salt and pepper then add to a 8x8" or 9x12" baking dish. Addpesto then use hands to evenly coat. Spoon marinara sauce over top of thighs followed by mozzarella cheese then cover tightly with foil and bake for 20 minutes. Remove foil then bake for 10 more minutes, or until chicken is cooked through and cheese is golden brown and bubbly.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-pesto-chicken-parmesan-30-minute-meal-iowa-girl-eats-631073', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}