{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536817-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 536817, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppermint Cookie Bark', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 921.37, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1 large egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'A few handfuls of chopped red and white peppermint candy', u'aisle': u'Sweet Snacks', u'name': u'peppermint candy', u'metaInformation': [u'white', u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 3.0, u'consistency': u'solid', u'id': 98859, u'unit': u'handfuls'}, {u'originalString': u'1/4 Teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'6 ounces bittersweet or semisweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, room temp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 Teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'Teaspoon'}, {u'originalString': u'3 ounces high quality white chocolate', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19087, u'unit': u'ounces'}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.macheesmo.com/2009/12/peppermint-cookie-bark/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 227, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Add your butter to a mixing bowl and either mix it with a stand mixer or hand mixer until its creamy.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add sugar and beat it until its light and fluffy. 5)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the vanilla and egg yolk and continue to beat. Remember to scrape down the sides of the bowl every once in awhile.6)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread out cookie dough onto the prepared baking sheet. Take a fork and stab it all around. 7)', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake this for about 25-30 minutes or until the cookie crust is slightly browned all over. 8) As soon as the gigantic cookie comes out of the oven, sprinkle the chocolate over the surface.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Let this sit for about 5 minutes. The chocolate will slowly melt.9) Unwrap a bunch of peppermint candies, put them in a plastic bag and give them a few whacks with a mallet or rolling pin. Its okay if they are broken up kind of unevenly.10)', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 98859, u'name': u'peppermint candy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Spread melted chocolate out using a flat spatula or knife. Make sure the chocolate covers all the cookie crust. Then sprinkle your peppermint all over the surface.11) Melt the white chocolate in the microwave (on low) or in a double boiler.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}]}, {u'equipment': [], u'step': u'Add a few tablespoons of water no matter how you do it to make sure that your chocolate sauce is smooth and liquidy. That just makes it easier to drizzle.12) Once its melted, drizzle it over the surface of bark using a fork.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Place in the fridge for at least a few hours to make sure everything is hardened.13)', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and break it up with your hands!', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Bark on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Directions1) Preheat oven to 350 degrees.2) Line a 13X9 baking sheet with parchment paper. If you dont have any parchment paper, you can just spray the sheet with nonstick spray.3) In a small bowl, whisk the flour and salt together and set it aside.4) Add your butter to a mixing bowl and either mix it with a stand mixer or hand mixer until its creamy. Add sugar and beat it until its light and fluffy. 5) Add the vanilla and egg yolk and continue to beat. Remember to scrape down the sides of the bowl every once in awhile.6) Spread out cookie dough onto the prepared baking sheet. Take a fork and stab it all around. 7) Bake this for about 25-30 minutes or until the cookie crust is slightly browned all over. 8) As soon as the gigantic cookie comes out of the oven, sprinkle the chocolate over the surface. Let this sit for about 5 minutes. The chocolate will slowly melt.9) Unwrap a bunch of peppermint candies, put them in a plastic bag and give them a few whacks with a mallet or rolling pin. Its okay if they are broken up kind of unevenly.10) Spread melted chocolate out using a flat spatula or knife. Make sure the chocolate covers all the cookie crust. Then sprinkle your peppermint all over the surface.11) Melt the white chocolate in the microwave (on low) or in a double boiler. Add a few tablespoons of water no matter how you do it to make sure that your chocolate sauce is smooth and liquidy. That just makes it easier to drizzle.12) Once its melted, drizzle it over the surface of bark using a fork. Place in the fridge for at least a few hours to make sure everything is hardened.13) Remove and break it up with your hands!', u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-cookie-bark-536817', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}