{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/70725-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 70725, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick Cherry Cheesecake', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 151.85, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 tub (24.2 oz.) PHILADELPHIA Ready-To-Eat Cheesecake Filling', u'aisle': u'Baking', u'name': u'cheesecake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.2, u'consistency': u'solid', u'id': 98951, u'unit': u'oz'}, {u'originalString': u'1 cup cherry pie filling', u'aisle': u'Baking', u'name': u'cherry pie filling', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19314, u'unit': u'cup'}, {u'originalString': u'1 HONEY MAID Graham Pie Crust (6 oz.)', u'aisle': u'Baking', u'name': u'graham cracker pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 18942, u'unit': u'oz'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/quick-cherry-cheesecake-106854.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Spoon cheesecake filling  into crust. Smooth top lightly with back of spoon to form even layer.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Top with cherry pie filling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'id': 19314, u'name': u'cherry pie filling'}]}, {u'equipment': [], u'step': u'Serve immediately, or cover and refrigerate until ready to serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Spoon cheesecake filling  into crust. Smooth top lightly with back of spoon to form even layer.                                             Top with cherry pie filling.                                              Serve immediately, or cover and refrigerate until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-cherry-cheesecake-70725', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}