{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/448377-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 448377, u'veryPopular': False, u'lowFodmap': False, u'title': u'Double-Chocolate Espresso Cookies', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 17.36, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon instant coffee granules', u'aisle': u'Tea and Coffee', u'name': u'instant coffee granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (12 ounces) semisweet chocolate chips, divided', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounces'}, {u'originalString': u'1 cup plus 2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 ounces unsweetened chocolate, chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 19078, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/double-chocolate-espresso-cookies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small heavy saucepan, melt unsweetened chocolate, 1 cup chocolate chips and butter with coffee granules; stir until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 19078, u'name': u'unsweetened baking chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 14214, u'name': u'instant coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Remove from the heat; set aside to cool.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, beat sugar and eggs for 3 minutes or until thick and lemon-colored. Beat in the chocolate mixture.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Combine the flour, baking powder and salt; add to chocolate mixture. Stir in remaining chips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Drop by rounded teaspoonfuls 2 in. apart onto greased baking sheets.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 10-12 minutes or until puffed and tops are cracked. Cool for 5 minutes before removing to wire racks.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 39, u'instructions': u'Directions                                                                                In a small heavy saucepan, melt unsweetened chocolate, 1 cup chocolate chips and butter with coffee granules; stir until smooth. Remove from the heat; set aside to cool.                                                                                           In a small bowl, beat sugar and eggs for 3 minutes or until thick and lemon-colored. Beat in the chocolate mixture. Combine the flour, baking powder and salt; add to chocolate mixture. Stir in remaining chips.                                                                                           Drop by rounded teaspoonfuls 2 in. apart onto greased baking sheets. Bake at 350\xb0 for 10-12 minutes or until puffed and tops are cracked. Cool for 5 minutes before removing to wire racks.                                        Yield: 3 dozen.                                                                                                                         Originally published as Double-Chocolate Espresso Cookies in  Taste of HomeAugust/September 2007, p22                                                                                                                                                                                                        Nutritional Facts                                                                             1 cookie equals 112 calories, 6 g fat (4 g saturated fat), 25 mg cholesterol, 54 mg sodium, 15 g carbohydrate, 1 g fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/double-chocolate-espresso-cookies-448377', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}