{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/482359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 482359, u'veryPopular': False, u'lowFodmap': False, u'title': u"Pork, Asparagus, and Soba From 'The VB6 Cookbook", u'diets': [u'dairy free'], u'pricePerServing': 277.68, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 1/2 pounds asparagus (thick ends peeled if you like), thinly cut on an angle', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'thick', u'peeled', u'( ends if you like)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11011, u'unit': u'pounds'}, {u'originalString': u'1 small dried hot red chile (like Thai), or pinch of red chile flakes, or more to taste', u'aisle': u'Spices and Seasonings', u'name': u'chile flakes', u'metaInformation': [u'dried', u'red', u'hot', u'small', u'to taste', u'(like Thai)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u''}, {u'originalString': u'1 tablespoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 pound pork shoulder, cut into thin strips', u'aisle': u'Meat', u'name': u'pork shoulder', u'metaInformation': [u'cut into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10072, u'unit': u'pound'}, {u'originalString': u'1 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2 scallions, sliced, for garnish', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'8 ounces soba noodles', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'soba noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20114, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon soy sauce, or to taste', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/05/pork-asparagus-and-soba-from-the-vb6-cookbook.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of water to a boil and add 1 teaspoon salt. Put a large skillet over high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 tablespoon oil, swirl it around, and immediately add the pork and sprinkle it with the remaining 1/2 teaspoon salt and the pepper. Cook undisturbed until the pieces brown and release from the pan easily. Then add the garlic, ginger, and chile and stir frequently, until the meat is no longer pink and the vegetables soften, 3 to 5 minutes total.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the meat mixture from the pan and the pan from the heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cook the noodles in the boiling water until tender but not mushy. Start checking them after 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drain the noodles, reserving about 1 cup of the cooking water, and toss the soba with the sesame oil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Return the skillet to medium-high heat and add the asparagus along with 1/4 cup water, stirring to scrape up any browned bits from the bottom of the pan. Cook until the asparagus is dry and beginning to brown, 5 to 10 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Add a little more water if necessary to prevent them from burning.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Stir in the soy sauce, noodles, and a small splash of the noodle-cooking water; return the pork to the skillet. Cook, stirring and adding just enough water to keep everything from sticking, until the pork and noodles are hot, no more than 1 minute. Taste and adjust the seasoning, adding more soy sauce if necessary.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Garnish with the scallions and serve hot or at room temperature.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 49, u'instructions': u'Procedures                                                          1                                              Bring a large pot of water to a boil and add 1 teaspoon salt. Put a large skillet over high heat. Add 1 tablespoon oil, swirl it around, and immediately add the pork and sprinkle it with the remaining 1/2 teaspoon salt and the pepper. Cook undisturbed until the pieces brown and release from the pan easily. Then add the garlic, ginger, and chile and stir frequently, until the meat is no longer pink and the vegetables soften, 3 to 5 minutes total. Remove the meat mixture from the pan and the pan from the heat.                                                                                    2                                              Cook the noodles in the boiling water until tender but not mushy. Start checking them after 3 minutes. Drain the noodles, reserving about 1 cup of the cooking water, and toss the soba with the sesame oil.                                                                                     3                                              Return the skillet to medium-high heat and add the asparagus along with 1/4 cup water, stirring to scrape up any browned bits from the bottom of the pan. Cook until the asparagus is dry and beginning to brown, 5 to 10 minutes. Add a little more water if necessary to prevent them from burning.                                                                                    4                                              Stir in the soy sauce, noodles, and a small splash of the noodle-cooking water; return the pork to the skillet. Cook, stirring and adding just enough water to keep everything from sticking, until the pork and noodles are hot, no more than 1 minute. Taste and adjust the seasoning, adding more soy sauce if necessary. Garnish with the scallions and serve hot or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-asparagus-and-soba-from-the-vb6-cookbook-482359', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}