{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/546037-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 546037, u'veryPopular': True, u'lowFodmap': False, u'title': u'Stuffing-Crusted Creamy Chicken Casserole', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 138.55, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 can (7 oz.) corn, drained', u'aisle': u'Canned and Jarred', u'name': u'canned corn', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 11177, u'unit': u'oz'}, {u'originalString': u'1/2 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 pkg. (16 oz.) frozen stir-fry vegetables, thawed, well drained', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'frozen', u'thawed', u'drained', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11583, u'unit': u'oz'}, {u'originalString': u'1/4 cup KRAFT Lite Ranch Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}, {u'originalString': u'6 small boneless skinless chicken breasts (1-1/2 lb.)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'1 pkg. (6 oz.) STOVE TOP Stuffing Mix for Chicken', u'aisle': u'Bakery/Bread;Pasta and Rice', u'name': u'stuffing mix', u'metaInformation': [u'for chicken'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 18081, u'unit': u'oz'}, {u'originalString': u'1-1/2 cups hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/stuffing-crusted-creamy-chicken-casserole-75583.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place chicken in 13x9-inch baking dish sprayed with cooking spray; sprinkle with garlic powder. Cover with stir-fry vegetables.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}]}, {u'equipment': [], u'step': u'Combine corn and dressing; spoon over vegetable layer in dish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'id': 11583, u'name': u'vegetable'}]}, {u'equipment': [], u'step': u'Add hot water to stuffing mix; stir just until moistened.  Spoon over corn mixture; cover.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'id': 18081, u'name': u'stuffing mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Bake 45 min. or until chicken is done (165F), uncovering for the last 15 min.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 546, u'instructions': u'Heat oven to 350F.                                            Place chicken in 13x9-inch baking dish sprayed with cooking spray; sprinkle with garlic powder. Cover with stir-fry vegetables. Combine corn and dressing; spoon over vegetable layer in dish.                                             Add hot water to stuffing mix; stir just until moistened.  Spoon over corn mixture; cover.                                            Bake 45 min. or until chicken is done (165F), uncovering for the last 15 min.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffing-crusted-creamy-chicken-casserole-546037', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}