{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/250300-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 250300, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mango Lassi Ice Cream', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 204.04, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'2 tablespoons arrowroot powder', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tablespoons'}, {u'originalString': u'1 cup organic canned coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'organic', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'cup'}, {u'originalString': u'2 cups dairy-free creamer (such as So Delicious French Vanilla Coconut Milk Creamer)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non-dairy creamer', u'metaInformation': [u'french', u'(such as So Delicious Vanilla Coconut Milk Creamer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1067, u'unit': u'cups'}, {u'originalString': u'1 teaspoon ground cardamom (tip: cardamom is much cheaper online than in stores)', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [u'(tip: cardamom is much cheaper online than in stores)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2006, u'unit': u'teaspoon'}, {u'originalString': u'2 cups pureed mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'pureed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9176, u'unit': u'cups'}, {u'originalString': u'1/2 cup vegan sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/mango-lassi-ice-cream', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, mix 1/4 cup of coconut milk with the arrowroot and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the remaining 3/4 cup coconut milk and the rest of ingredients in a medium sauce pan over medium high to high heat. Once mixture boils, remove from heat, and add arrowroot mixture. Do not walk away while waiting for mixture to boil. It will inevitably boil over. Trust me it has happened to me twice.Cover with saran wrap with it touching the ice cream liquid. This will prohibit that ’skin’ from forming on top. Refrigerate 2 hours or overnight.Once chilled, pour mixture in ice cream maker and process according to directions.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert can be paired with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 668, u'instructions': u'In a small bowl, mix 1/4 cup of coconut milk with the arrowroot and set aside.Combine the remaining 3/4 cup coconut milk and the rest of ingredients in a medium sauce pan over medium high to high heat. Once mixture boils, remove from heat, and add arrowroot mixture. Do not walk away while waiting for mixture to boil. It will inevitably boil over. Trust me it has happened to me twice.Cover with saran wrap with it touching the ice cream liquid. This will prohibit that ’skin’ from forming on top. Refrigerate 2 hours or overnight.Once chilled, pour mixture in ice cream maker and process according to directions.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-lassi-ice-cream-250300', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}