{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/407245-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 407245, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raspberry Cream Croissants', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 125.56, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u"Confectioners' sugar, optional", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'4 to 6 croissants', u'aisle': u'Bakery/Bread', u'name': u'croissants', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18239, u'unit': u''}, {u'originalString': u'1-1/4 cups fresh or frozen unsweetened raspberries, thawed', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'unsweetened', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cups'}, {u'originalString': u'1/2 cup seedless raspberry jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'raspberry jam', u'metaInformation': [u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10719297, u'unit': u'cup'}, {u'originalString': u'Whipped cream in a can or whipped topping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 42135, u'unit': u'can'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/raspberry-cream-croissants', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the croissants in half horizontally; spread cut halves with jam.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'id': 18239, u'name': u'croissant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [], u'step': u"Spread whipped cream over bottom halves; top with raspberries. Replace tops. Dust with confectioners' sugar if desired.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 40, u'instructions': u"Directions                                                                                Cut the croissants in half horizontally; spread cut halves with jam. Spread whipped cream over bottom halves; top with raspberries. Replace tops. Dust with confectioners' sugar if desired. Serve immediately.                                        Yield: 4-6 servings.                                                                                                                         Originally published as Raspberry Cream Croissants in  Quick CookingMarch/April 1999, p21                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 234 calories, 8 g fat (4 g saturated fat), 25 mg cholesterol, 283 mg sodium, 38 g carbohydrate, 3 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-cream-croissants-407245', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}