{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/210042-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 250, u'id': 210042, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow-roast pork with apples & peppers', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 215.09, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'few bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 3.0, u'consistency': u'solid', u'id': 2004, u'unit': u'leaves'}, {u'originalString': u'50g butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'3 tbsp cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp demerara sugar', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10019908, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'3 onions, thinly sliced, and 2 small eating apples (we used Braeburns), quartered, cored and thinly sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'cored', u'small', u'thinly sliced', u'quartered', u'(we used Braeburns)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'7-8 red, yellow and/or orange peppers, each cut into quarters, cores and seeds discarded', u'aisle': u'Produce', u'name': u'orange peppers', u'metaInformation': [u'red', u'yellow', u'cut into quarters, cores and seeds discarded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'2-2\xbckg 4lb 8oz-5lb pork shoulder joint (or 2 x 1kg 2lb 4oz joints), scored and tied', u'aisle': u'Meat', u'name': u'pork shoulder joint', u'metaInformation': [u'(or 2 x 1kg 2lb 4oz joints)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shoulder-joint-of-pork.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 10083, u'unit': u'lb'}, {u'originalString': u'2 tbsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tbsp'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/691661/slowroast-pork-with-apples-and-peppers', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 160C/140C fan/gas 3.Sit the pork on a sheet of foil in a roastingtin.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Mix the butter, sugar and mustardwith 2 tsp salt, rub all over the top andends of the joint (or joints), then scrunchup the foil to seal tightly in a parcel.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Mix the onions and apples in a large,shallow roasting tin. Scatter the peppersover the top and poke in some bayleaves.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Mix the vinegar, oil, mustard andsugar with 100ml water and drizzle overeverything. Roast the pork for 3\xbd hrswhile you cook the peppers on the shelfbelow for the first 2 hrs. When youremove the apples and peppers after2 hrs, set aside and put the Salt-bakedpotatoes (see 'Goes well with', right) into the ovenunderneath the pork instead.After 3 hrs, unwrap the foil from thepork. Scrape any mustard mixture stuckto the foil back onto the pork, sit it andany juices back in the tin and increaseoven to 200C/180C fan/gas 6. Roast for30-45 mins more until the skin is brownand crisping.", u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Remove the pork from theoven, cover and rest for 20 mins whileyou put the peppers back on the topshelf for 20 mins to finish.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the porkthickly sliced alongside the apples andpeppers, with any tin juices poured over.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 99, u'instructions': u"Heat oven to 160C/140C fan/gas 3.Sit the pork on a sheet of foil in a roastingtin. Mix the butter, sugar and mustardwith 2 tsp salt, rub all over the top andends of the joint (or joints), then scrunchup the foil to seal tightly in a parcel.Mix the onions and apples in a large,shallow roasting tin. Scatter the peppersover the top and poke in some bayleaves. Mix the vinegar, oil, mustard andsugar with 100ml water and drizzle overeverything. Roast the pork for 3\xbd hrswhile you cook the peppers on the shelfbelow for the first 2 hrs. When youremove the apples and peppers after2 hrs, set aside and put the Salt-bakedpotatoes (see 'Goes well with', right) into the ovenunderneath the pork instead.After 3 hrs, unwrap the foil from thepork. Scrape any mustard mixture stuckto the foil back onto the pork, sit it andany juices back in the tin and increaseoven to 200C/180C fan/gas 6. Roast for30-45 mins more until the skin is brownand crisping. Remove the pork from theoven, cover and rest for 20 mins whileyou put the peppers back on the topshelf for 20 mins to finish. Serve the porkthickly sliced alongside the apples andpeppers, with any tin juices poured over.", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-roast-pork-with-apples-peppers-210042', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 270, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}