{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/196211-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196211, u'veryPopular': False, u'lowFodmap': False, u'title': u"Choco-Nacho from 'Ultimate Nachos", u'diets': [u'gluten free'], u'pricePerServing': 134.33, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'Chocolate Cayenne Ganache', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2031, u'unit': u'servings'}, {u'originalString': u'1 1/2 teaspoons cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoons'}, {u'originalString': u'16 perfect chips; if prepared fresh, use 4 corn tortillas, each cut into 4 triangles', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u'fresh', u'prepared', u'cut into 4 triangles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 19003, u'unit': u''}, {u'originalString': u"Goat's Milk Caramel (Cajeta)", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'goat milk', u'metaInformation': [u'(Cajeta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1106, u'unit': u'servings'}, {u'originalString': u"2 cups goat's milk", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u"goat's milk", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1106, u'unit': u'cups'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'3 1/2 ounces semisweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/06/choco-nacho-from-ultimate-nachos.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the ganache in the microwave: In a microwave safe bowl, combine the chopped chocolate and heavy cream. Microwave until the chocolate starts to melt, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Stir and continue to microwave at 15-second intervals until smooth.Be careful not to burn the ganache. If it burns, there’s no way to save it. When the ganache is melted and smooth, add the cayenne.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}]}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'To make the ganache on the stovetop: Fill a medium saucepan halfway with water and bring to a simmer over low heat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'4', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chopped chocolate and cream to a heatproof glass bowl.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place over the saucepan of simmering water; the bottom of the bowl should not touch the water. Stir the ganache mixture until melted.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'5', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Once it has melted, remove the bowl from the saucepan, add the cayenne, and stir the ganache until smooth. The ganache can be stored in the refrigerator for up to 2 weeks and reheated when needed', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}]}, {u'equipment': [], u'step': u'6', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the caramel: In a small bowl, dissolve the baking soda with 1 tablespoon of water and set aside.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'7', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan over medium-high heat combine the goat’s milk, sugar, and vanilla. Stir regularly until the milk comes to a simmer and the sugar has dissolved.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'8', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove the saucepan from the heat and stir in the baking soda and water mixture carefully, continuing to stir to keep the mixture from bubbling over. Reduce the heat to medium and continue to cook the caramel, stirring regularly, until the mixture turns pale golden, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'9', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'To assemble the choco-nachos: Dip each tortilla chip in melted ganache halfway. Repeat this step for all 16 chips, placing them on a wire cooling rack to allow the ganache to set.', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'10', u'number': 20, u'ingredients': []}, {u'equipment': [], u'step': u'Once the ganache has set, drizzle the cajeta over each chip.', u'number': 21, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood on the menu? Try pairing with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Champagne Marc Hebrart Cuvee de Reserve Brut Premier Cru. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 48 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The signature are there, and there's a stealthy richness on the mid-palate; with five minutes in the glass it really exhales. A sumptuous yet articulate wine.", u'title': u'Champagne Marc Hebrart Cuvee de Reserve Brut Premier Cru', u'price': u'$47.99', u'id': 464318, u'link': u'https://www.wine.com/product/champagne-marc-hebrart-cuvee-de-reserve-brut-premier-cru/147542', u'imageUrl': u'https://spoonacular.com/productImages/464318-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Procedures                                                                              1                                                                            To make the ganache in the microwave: In a microwave safe bowl, combine the chopped chocolate and heavy cream. Microwave until the chocolate starts to melt, about 1 minute.                                                                                                                            2                                                                            Stir and continue to microwave at 15-second intervals until smooth.Be careful not to burn the ganache. If it burns, there’s no way to save it. When the ganache is melted and smooth, add the cayenne.                                                                                                                            3                                                                            To make the ganache on the stovetop: Fill a medium saucepan halfway with water and bring to a simmer over low heat.                                                                                                                            4                                                                            Add the chopped chocolate and cream to a heatproof glass bowl. Place over the saucepan of simmering water; the bottom of the bowl should not touch the water. Stir the ganache mixture until melted.                                                                                                                            5                                                                            Once it has melted, remove the bowl from the saucepan, add the cayenne, and stir the ganache until smooth. The ganache can be stored in the refrigerator for up to 2 weeks and reheated when needed                                                                                                                            6                                                                            To make the caramel: In a small bowl, dissolve the baking soda with 1 tablespoon of water and set aside.                                                                                                                            7                                                                            In a medium saucepan over medium-high heat combine the goat’s milk, sugar, and vanilla. Stir regularly until the milk comes to a simmer and the sugar has dissolved.                                                                                                                            8                                                                            Remove the saucepan from the heat and stir in the baking soda and water mixture carefully, continuing to stir to keep the mixture from bubbling over. Reduce the heat to medium and continue to cook the caramel, stirring regularly, until the mixture turns pale golden, about 20 minutes.                                                                                                                            9                                                                            To assemble the choco-nachos: Dip each tortilla chip in melted ganache halfway. Repeat this step for all 16 chips, placing them on a wire cooling rack to allow the ganache to set.                                                                                                                            10                                                                            Once the ganache has set, drizzle the cajeta over each chip.', u'spoonacularSourceUrl': u'https://spoonacular.com/choco-nacho-from-ultimate-nachos-196211', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}