{u'recipes': [{u'sourceName': u'I Heart Nap Time', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/612430-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 612430, u'veryPopular': True, u'lowFodmap': True, u'title': u'Crock pot grape jelly and BBQ meatballs', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 36.82, u'creditText': u'I Heart Nap Time', u'extendedIngredients': [{u'originalString': u'1 18oz BBQ sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 6150, u'unit': u'oz'}, {u'originalString': u'1 18oz jar grape jelly', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'grape jelly', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 10519297, u'unit': u'oz'}, {u'originalString': u'1 32oz bag frozen fully cooked meatballs (about 50)', u'aisle': u'Meat', u'name': u'meatballs', u'metaInformation': [u'frozen', u'fully cooked', u'( 50)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10110219, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.iheartnaptime.net/bbq-meatballs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine sauces in your crock-pot and stir until combined.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add meatballs and stir until they are coated with the sauce. Cook on high for 3 hours.Enjoy as an appetizer or serve over rice for a main dish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2383, u'instructions': u'Combine sauces in your crock-pot and stir until combined. Add meatballs and stir until they are coated with the sauce. Cook on high for 3 hours.Enjoy as an appetizer or serve over rice for a main dish.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-grape-jelly-and-bbq-meatballs-612430', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 50, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}