{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/199755-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199755, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Tacos de Rajas con Crema', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 204.26, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'12 fresh corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'5 ounces Mexican crema', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican crema', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 93772, u'unit': u'ounces'}, {u'originalString': u'5 poblano chiles', u'aisle': u'Produce', u'name': u'poblano chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'1/2 white onion, sliced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'1/2 cup Chihuahua cheese, shredded', u'aisle': u'?', u'name': u'chihuahua cheese', u'metaInformation': [u'shredded'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2010/10/dinner-tonight-tacos-de-rajas-con-crema-roasted-poblanos-cream-cheese-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u"Char the poblanos directly on top of the gas burner on your stove, rotating them often until most of the skin is blistered and black. If you don't have gas burners, char the poblanos on a tray underneath the broiler.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Transfer each to a plastic bag and let steam for 15 minutes. Rub off the skin, remove seeds and stems, and slice into strips about 1/4 inch thick 2 inches long.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt butter in a 10-inch stainless steel skillet over medium heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the onion, and cook until it just begins and change color and caramelize.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the poblano strips and stir well. Cook, stirring often, until they are slightly wilted, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in the crema, stir well, and cook until the cream has reduced into a thick sauce, about 2 more minutes. Reduce heat to low and sprinkle in the cheese. Keep stirring until all the cheese has melted. It should almost disappear into the sauce. Season with salt to taste', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 93772, u'name': u'mexican crema'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with warm corn tortillas.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Tacos works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Argyle Reserve Pinot Noir. It has 4.3 out of 5 stars and a bottle costs about 30 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 84, u'instructions': u"Procedures                                                                              1                                                                            Char the poblanos directly on top of the gas burner on your stove, rotating them often until most of the skin is blistered and black. If you don't have gas burners, char the poblanos on a tray underneath the broiler. Transfer each to a plastic bag and let steam for 15 minutes. Rub off the skin, remove seeds and stems, and slice into strips about 1/4 inch thick 2 inches long.                                                                                                                             2                                                                            Melt butter in a 10-inch stainless steel skillet over medium heat. Add the onion, and cook until it just begins and change color and caramelize. Add the poblano strips and stir well. Cook, stirring often, until they are slightly wilted, about 2 minutes.                                                                                                                            3                                                                            Pour in the crema, stir well, and cook until the cream has reduced into a thick sauce, about 2 more minutes. Reduce heat to low and sprinkle in the cheese. Keep stirring until all the cheese has melted. It should almost disappear into the sauce. Season with salt to taste                                                                                                                            4                                                                            Serve with warm corn tortillas.", u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-tacos-de-rajas-con-crema-199755', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}