{u'recipes': [{u'sourceName': u'Healthy Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483933-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_FULL', u'cookingMinutes': 10, u'id': 483933, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mashed Cauliflower', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 79.96, u'creditText': u'Healthy Recipes', u'extendedIngredients': [{u'originalString': u'1 medium cauliflower (1 lb trimmed)', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'medium', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'lb'}, {u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter, soft', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://healthyrecipesblogs.com/2011/11/19/mashed-cauliflower-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash the cauliflower,towel dry, trim outer leaves and cut into florets, or just into chunks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a microwave-safe bowl, add a tablespoon of water to the bottom of the bowl, cover with a microwave-safe plate and microwave on high around 10 minutes, until very tender.Meanwhile, prepare the other ingredients.When the cauliflower is done, carefully remove it from the microwave (bowl and plate will be hot and steam will escape) and transfer to the food processor.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [], u'step': u'Add the remaining ingredients. Process until very smooth, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 21952, u'instructions': u'Wash the cauliflower,towel dry, trim outer leaves and cut into florets, or just into chunks. Place in a microwave-safe bowl, add a tablespoon of water to the bottom of the bowl, cover with a microwave-safe plate and microwave on high around 10 minutes, until very tender.Meanwhile, prepare the other ingredients.When the cauliflower is done, carefully remove it from the microwave (bowl and plate will be hot and steam will escape) and transfer to the food processor. Add the remaining ingredients. Process until very smooth, about 1 minute. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/mashed-cauliflower-483933', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}