{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [u'european', u'eastern european'], u'image': u'https://spoonacular.com/recipeImages/511998-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 511998, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Beef Stroganoff #SundaySupper', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 270.03, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 small English cut beef chuck roast (about 2 pounds), cut into 2-inch pieces', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'english', u'small', u'cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pounds'}, {u'originalString': u'8 ounces button mushrooms, quartered', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt and ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 cup low-sodium beef broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium beef broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 10093741, u'unit': u'cup'}, {u'originalString': u'1/4 cup Gallo Family Vineyards Merlot', u'aisle': u'Alcoholic Beverages', u'name': u'merlot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14602, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'teaspoons'}, {u'originalString': u'1 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 package (16 ounces) old fashioned wide egg noodles', u'aisle': u'Pasta and Rice', u'name': u'wide egg noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 20409, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}, {u'originalString': u'1/2 large yellow onion, thinly sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://foxeslovelemons.com/slow-cooker-beef-stroganoff-sundaysupper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In large skillet, heat 1 tablespoon oil over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add mushrooms and season with salt and pepper. Cook 5 to 6 minutes or until browned; stirring occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer mushrooms to bowl of slow cooker.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add remaining 1 tablespoon oil to skillet.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add beef and season with salt and pepper. Cook 6 to 8 minutes or until browned; stirring occasionally.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add flour; cook 1 minute, stirring constantly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add wine and cook 1 minute, using spoon to scrape browned bits from bottom of skillet.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer meat and drippings to slow cooker.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}], u'step': u'Add garlic, bay leaf, onion, broth, mustard, Worcestershire and vinegar to slow cooker; stir to combine. Cover and cook on low for 8 hours, or on high for 4 hours. Just before the slow cooker timer is up, cook noodles according to package instructions; drain. Use wooden spoon to coarsely break up beef in slow cooker.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add sour cream; stir to combine well.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [], u'step': u'Serve stroganoff over egg noodles, garnished with parsley.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 20409, u'name': u'egg noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Nero D Avola, Primitivo, and Shiraz are my top picks for Beef Stroganoff. For a creamy, mushroomy beef stroganoff, you'll want a bold red to match. The Regaleali Nero d'Avola with a 4.3 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'nero d avola', u'primitivo', u'shiraz'], u'productMatches': [{u'description': u'Ruby red in color with a delicate bouquet. Dry with a lingering finish, and balanced acidity and tannins. Recommended with grilled meats. Particularly excellent with roast game and hard spicy cheeses.', u'title': u"Regaleali Nero d'Avola", u'price': u'$10.99', u'id': 432968, u'link': u'https://www.wine.com/product/regaleali-nero-davola-1998/25350', u'imageUrl': u'https://spoonacular.com/productImages/432968-312x231.jpg'}]}, u'aggregateLikes': 731, u'instructions': u'In large skillet, heat 1 tablespoon oil over medium-high heat. Add mushrooms and season with salt and pepper. Cook 5 to 6 minutes or until browned; stirring occasionally. Transfer mushrooms to bowl of slow cooker. Add remaining 1 tablespoon oil to skillet. Add beef and season with salt and pepper. Cook 6 to 8 minutes or until browned; stirring occasionally. Add flour; cook 1 minute, stirring constantly. Add wine and cook 1 minute, using spoon to scrape browned bits from bottom of skillet. Transfer meat and drippings to slow cooker. Add garlic, bay leaf, onion, broth, mustard, Worcestershire and vinegar to slow cooker; stir to combine. Cover and cook on low for 8 hours, or on high for 4 hours. Just before the slow cooker timer is up, cook noodles according to package instructions; drain. Use wooden spoon to coarsely break up beef in slow cooker. Add sour cream; stir to combine well. Serve stroganoff over egg noodles, garnished with parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-beef-stroganoff-sundaysupper-511998', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 510, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}