{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/433725-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 433725, u'veryPopular': False, u'lowFodmap': False, u'title': u'Atlantic Corn Chowder', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 76.26, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (14.75 ounce) can cream-style corn', u'aisle': u'Canned and Jarred', u'name': u'canned corn', u'metaInformation': [u'cream-style', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.75, u'consistency': u'solid', u'id': 11177, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups 2 % evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1214, u'unit': u'cups'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 potatoes, peeled and cubed', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'cubed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Atlantic-Corn-Chowder/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place potatoes in a large pot with water to cover.  Stir in onions.  Bring to a boil over medium heat, then reduce heat to medium-low and simmer until potatoes are tender, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Stir in evaporated milk and corn.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1214, u'name': u'evaporated milk'}]}, {u'equipment': [], u'step': u'Heat through, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Corn Chowder works really well with Chardonnay, Riesling, and Sauvignon Blanc. Chowder can benefit from a crisp white to cut through the rich, creamy broth - or you can go big or go home with a rich, buttery chardonnay. You could try District 7 Estate Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'riesling', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Place potatoes in a large pot with water to cover.  Stir in onions.  Bring to a boil over medium heat, then reduce heat to medium-low and simmer until potatoes are tender, about 20 minutes.                            Stir in evaporated milk and corn.  Heat through, about 10 minutes.  Serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/atlantic-corn-chowder-433725', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}