{u'recipes': [{u'sourceName': u'Buns in My Oven', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/834613-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 834613, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Chocolate Christmas Popcorn', u'diets': [u'gluten free'], u'preparationMinutes': 1, u'pricePerServing': 64.36, u'creditText': u'Buns in My Oven', u'extendedIngredients': [{u'originalString': u"1 bag Orville Redenbacher's microwaveable Butter Popcorn", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'bag'}, {u'originalString': u'1 teaspoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'teaspoon'}, {u'originalString': u'red and green sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [u'green', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1/2 cup white chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.bunsinmyoven.com/2016/12/13/white-chocolate-christmas-popcorn/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pop the popcorn according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread popcorn on parchment lined baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the white chocolate chips and coconut oil to a microwave safe bowl and microwave until smooth and melted, stirring every 30 seconds. This took 1 minute 30 seconds in my microwave. Spoon white chocolate over the popcorn and immediately add sprinkles.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}, {u'equipment': [], u'step': u'Let sit until white chocolate has hardened, about 2 hours.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}]}], u'name': u''}], u'aggregateLikes': 14, u'instructions': u'Pop the popcorn according to package directions. Spread popcorn on parchment lined baking sheet. Add the white chocolate chips and coconut oil to a microwave safe bowl and microwave until smooth and melted, stirring every 30 seconds. This took 1 minute 30 seconds in my microwave. Spoon white chocolate over the popcorn and immediately add sprinkles. Let sit until white chocolate has hardened, about 2 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-christmas-popcorn-834613', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 6, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}