{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527868-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527868, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Salmon & Lentils', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 462.28, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1/4 tsp. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 cups cooked lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cooked lentils', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16070, u'unit': u'cups'}, {u'originalString': u'1/2 cup fresh cilantro, chopped', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 lemon, quartered', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 Tbsp. + 2 tsp. olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'half a red onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'2 salmon filets', u'aisle': u'Seafood', u'name': u'salmon filets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 15076, u'unit': u''}, {u'originalString': u'1/8 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.gimmesomeoven.com/baked-salmon-and-lentils/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Preheat broiler. Prepare a baking sheet with aluminum foil, then mist with oil or cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place salmon filets on the baking sheet, and brush each with about 1 teaspoon of the oil. Season liberally with salt and black pepper. Broil for 4-5 minutes, or until cooked through. (Cooking time will depend on the thickness of your salmon.)Meanwhile, heat 1 tablespoon of oil in a medium skillet over medium-high heat.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Add the diced red onion and saute for 2 minutes until partially cooked.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}, {u'equipment': [], u'step': u'Add the lentils, cumin, coriander, black pepper and salt, and stir to combine. Cook for an additional 2 minutes, or until the lentils are heated through.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in fresh cilantro.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}]}, {u'equipment': [], u'step': u'Serve lentils topped with the fresh salmon, sprinkled with the juice from the lemons to taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'aggregateLikes': 13, u'instructions': u'Preheat broiler. Prepare a baking sheet with aluminum foil, then mist with oil or cooking spray. Place salmon filets on the baking sheet, and brush each with about 1 teaspoon of the oil. Season liberally with salt and black pepper. Broil for 4-5 minutes, or until cooked through. (Cooking time will depend on the thickness of your salmon.)Meanwhile, heat 1 tablespoon of oil in a medium skillet over medium-high heat. Add the diced red onion and saute for 2 minutes until partially cooked. Add the lentils, cumin, coriander, black pepper and salt, and stir to combine. Cook for an additional 2 minutes, or until the lentils are heated through. Remove from heat and stir in fresh cilantro.Serve lentils topped with the fresh salmon, sprinkled with the juice from the lemons to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-salmon-lentils-527868', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}