{u'recipes': [{u'sourceName': u'Table', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/584928-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 584928, u'veryPopular': False, u'lowFodmap': False, u'title': u'Date, Prosciutto, and Goat Cheese Crostini', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 126.18, u'creditText': u'Table', u'extendedIngredients': [{u'originalString': u'12 thin slices of baguette', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'solid', u'id': 18033, u'unit': u'slices'}, {u'originalString': u'4 oz. goat cheese, softened', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'12 medjool dried dates, pitted and chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'medjool dates', u'metaInformation': [u'dried', u'pitted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 9421, u'unit': u''}, {u'originalString': u'3 tbsp. milk or cream (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'3 oz. prosciutto, thinly sliced', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'oz'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://table.io/goat-cheese-crostini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Using an indoor grill set to medium-high heat, toast the slices of baguette. Alternatively, you may toast the slices of baguette in a preheated 350 degree Fahrenheit oven for 10 to 15 minutes.While the baguette slices are toasting, prepare the goat cheese. In a small bowl, mix together the goat cheese with the milk or cream until the desired consistency is achieved (however, the milk may also be omitted completely). The goat cheese should be easily spreadable, but not too thin. Season with a little salt and pepper, to taste.Top the baguette slices with a little goat cheese, followed by a chopped date, arugula, and a thin slice of prosciutto.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Piper-Heidsieck Brut Cuvee with a 4.4 out of 5 star rating seems like a good match. It costs about 40 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance.', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 37, u'instructions': u'Using an indoor grill set to medium-high heat, toast the slices of baguette. Alternatively, you may toast the slices of baguette in a preheated 350 degree Fahrenheit oven for 10 to 15 minutes.While the baguette slices are toasting, prepare the goat cheese. In a small bowl, mix together the goat cheese with the milk or cream until the desired consistency is achieved (however, the milk may also be omitted completely). The goat cheese should be easily spreadable, but not too thin. Season with a little salt and pepper, to taste.Top the baguette slices with a little goat cheese, followed by a chopped date, arugula, and a thin slice of prosciutto.', u'spoonacularSourceUrl': u'https://spoonacular.com/date-prosciutto-and-goat-cheese-crostini-584928', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}