{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217045-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 195, u'id': 217045, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stout-braised steak with stacked chips', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 893.61, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'600g large baking potatoes', u'aisle': u'Produce', u'name': u'baking potatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'solid', u'id': 11353, u'unit': u'g'}, {u'originalString': u'3 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 beef stock cube, crumbled', u'aisle': u'Canned and Jarred', u'name': u'beef stock cube', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6076, u'unit': u''}, {u'originalString': u'2 x 250g steaks of beef shin', u'aisle': u'Meat', u'name': u'beef tenderloin steaks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023583, u'unit': u''}, {u'originalString': u'500ml bottle of Guinness or other stout', u'aisle': u'Alcoholic Beverages', u'name': u'guinness', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 93619, u'unit': u'ml'}, {u'originalString': u'1 tsp grated horseradish, or 2 tsp creamed', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002055, u'unit': u'tsp'}, {u'originalString': u'4 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1 tbsp fine polenta or plain flour', u'aisle': u'Pasta and Rice;Ethnic Foods;Baking', u'name': u'polenta', u'metaInformation': [u'plain', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10035137, u'unit': u'tbsp'}, {u'originalString': u'4 shallots, 3 halved with their skin still on, 1 chopped as finely as you can', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'with their skin still on, 1 chopped as finely as you can', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2 tbsp brown sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'2 handfuls watercress', u'aisle': u'Produce', u'name': u'watercress', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 11591, u'unit': u'handfuls'}, {u'originalString': u'1 tbsp white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tbsp'}], u'healthScore': 72.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/stout-braised-steak-stacked-chips', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4. Season the steaks well on all sides, then heat a frying pan with 2 tsp of the oil. Brown the steaks well on all sides, then transfer to a snug casserole or narrow, deep baking dish.Tip the Guinness into the frying pan and bring to a simmer, scraping up any stuck meaty bits.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'id': 93619, u'name': u'guinness'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Pour over the steaks along with the stock cube, Worcestershire sauce, brown sauce, bay and skin-on halved shallots (leave the skins on to save time – they are removed from the sauce later). Cover the dish tightly with foil first, then add the lid (or a flat baking tray).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': None, u'id': 1026076, u'name': u'bouillon cube'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Bake in the oven for 3 hrs until the meat is meltingly tender. Can be done up to 1 day in advance, then cooled and chilled.For the chips, 1 hr before serving, turn up oven to 200C/180C fan/gas 6. Bring a large pan of salted water to the boil while you cut the potatoes into as many 3cm fat chips (save the trimmings in a bowl of water and use for mash another night). Par-boil for 3 mins, then drain and let steam-dry for a few mins. Tip onto a baking tray, toss with the polenta or flour and some sea salt, then drizzle over the oil and toss again. Roast for 45 mins until really crisp and golden.When the chips have 20 mins left, lift your steaks from their cooking liquid and use a few sheets of baking parchment to wrap them in a parcel, followed by foil. Put on a low shelf in the oven to heat through for 20 mins. Meanwhile, strain the cooking liquid into a pan, discarding the herbs and shallots. Boil fiercely until reduced by three-quarters. Taste for seasoning, then keep warm.', u'length': {u'number': 88, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10035137, u'name': u'polenta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the chopped shallot, horseradish, remaining 2 tsp oil, vinegar and 1 tsp water with some seasoning, then use to dress the watercress.To serve, carefully open the meat parcel over your saucepan to catch any juices, and add your beef to the sauce to coat. Stack your chips between 2 plates and add a pile of dressed watercress. Lift a steak onto each plate and spoon over the syrupy juices. Any extra can be served in a jug on the side.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'id': 11591, u'name': u'watercress'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The NV The Big Kahuna Merlot with a 4.5 out of 5 star rating seems like a good match. It costs about 7 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'A ripe and rounded Merlot with notes of plum, blackberry, and hint of spice .', u'title': u'NV The Big Kahuna Merlot', u'price': u'$6.99', u'id': 430475, u'link': u'https://www.amazon.com/Big-Kahuna-Merlot-Red-Wine/dp/B01F5XPTUW', u'imageUrl': u'https://spoonacular.com/productImages/430475-312x231.jpg'}]}, u'aggregateLikes': 46, u'instructions': u'Heat oven to 180C/160C fan/gas 4. Season the steaks well on all sides, then heat a frying pan with 2 tsp of the oil. Brown the steaks well on all sides, then transfer to a snug casserole or narrow, deep baking dish.Tip the Guinness into the frying pan and bring to a simmer, scraping up any stuck meaty bits. Pour over the steaks along with the stock cube, Worcestershire sauce, brown sauce, bay and skin-on halved shallots (leave the skins on to save time – they are removed from the sauce later). Cover the dish tightly with foil first, then add the lid (or a flat baking tray). Bake in the oven for 3 hrs until the meat is meltingly tender. Can be done up to 1 day in advance, then cooled and chilled.For the chips, 1 hr before serving, turn up oven to 200C/180C fan/gas 6. Bring a large pan of salted water to the boil while you cut the potatoes into as many 3cm fat chips (save the trimmings in a bowl of water and use for mash another night). Par-boil for 3 mins, then drain and let steam-dry for a few mins. Tip onto a baking tray, toss with the polenta or flour and some sea salt, then drizzle over the oil and toss again. Roast for 45 mins until really crisp and golden.When the chips have 20 mins left, lift your steaks from their cooking liquid and use a few sheets of baking parchment to wrap them in a parcel, followed by foil. Put on a low shelf in the oven to heat through for 20 mins. Meanwhile, strain the cooking liquid into a pan, discarding the herbs and shallots. Boil fiercely until reduced by three-quarters. Taste for seasoning, then keep warm.Whisk the chopped shallot, horseradish, remaining 2 tsp oil, vinegar and 1 tsp water with some seasoning, then use to dress the watercress.To serve, carefully open the meat parcel over your saucepan to catch any juices, and add your beef to the sauce to coat. Stack your chips between 2 plates and add a pile of dressed watercress. Lift a steak onto each plate and spoon over the syrupy juices. Any extra can be served in a jug on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/stout-braised-steak-with-stacked-chips-217045', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 215, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}