{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214530-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 214530, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salmon & smoked haddock fish cakes', u'diets': [u'pescatarian'], u'pricePerServing': 66.27, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'fresh breadcrumb, for coating', u'aisle': u'Pasta and Rice', u'name': u'breadcrumb', u'metaInformation': [u'fresh', u'for coating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 18079, u'unit': u'servings'}, {u'originalString': u'50g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 egg, beaten for dipping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten', u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tbsp chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'250g smoked haddock fillets', u'aisle': u'Seafood', u'name': u'haddock fillets', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/catfish.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 15033, u'unit': u'g'}, {u'originalString': u'2 hard-boiled eggs, finely chopped', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled eggs', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'300ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'oil or butter, for cooking', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for cooking'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1 onion, halved', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'plain flour, for coating', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain', u'for coating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 20081, u'unit': u'servings'}, {u'originalString': u'250g mashed potatoes (boil and mash 350g 12oz potatoes)', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'mashed', u'(boil and mash 350g 12oz potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'175g salmon fillets', u'aisle': u'Seafood', u'name': u'salmon fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 15076, u'unit': u'g'}, {u'originalString': u'1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1717/salmon-and-smoked-haddock-fish-cakes', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Simmer the smoked haddock and salmon in the milk with the clove, half the onion and bay leaf for 5 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove the fish from the milk and, when cool enough to handle, discard any skin or bone then flake. (The milk can be used to make a parsley sauce.)Finely chop the remaining \xbd onion and fry in half the butter until softened. Stir into the mash with the smoked haddock and Worcestershire sauce until smoothish, lightly mix in the salmon, boiled eggs and herbs, then season, preferably by hand so you don’t overmix. Chill for 1 hr for the flavours to meld and the mixture to firm.Divide the mixture into 20 equal amounts, then shape into patties. Dip in flour, egg and breadcrumbs and reshape. Chill again before cooking. These can be made up to a day ahead at this stage then chilled.Fry in a non-stick frying pan with a little oil for 5-7 mins on each side until the coating is crispy, or grill topped with tiny knobs of butter.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve with tomato sauce for dipping, if you like.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Fetzer Vineyards Valley Oaks Pinot Grigio with a 5 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This Pinot Grigio is clean with a fruit forward character and a crisp acid backbone . There are aromas of mango, pear, orange spice, lemongrass and pineapple. In the mouth, there are flavors of tropical fruit, apples, pears and a nice orange citrus note, balanced with minerality and a wonderful, round finish.', u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Simmer the smoked haddock and salmon in the milk with the clove, half the onion and bay leaf for 5 mins. Remove the fish from the milk and, when cool enough to handle, discard any skin or bone then flake. (The milk can be used to make a parsley sauce.)Finely chop the remaining \xbd onion and fry in half the butter until softened. Stir into the mash with the smoked haddock and Worcestershire sauce until smoothish, lightly mix in the salmon, boiled eggs and herbs, then season, preferably by hand so you don’t overmix. Chill for 1 hr for the flavours to meld and the mixture to firm.Divide the mixture into 20 equal amounts, then shape into patties. Dip in flour, egg and breadcrumbs and reshape. Chill again before cooking. These can be made up to a day ahead at this stage then chilled.Fry in a non-stick frying pan with a little oil for 5-7 mins on each side until the coating is crispy, or grill topped with tiny knobs of butter. Serve with tomato sauce for dipping, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-smoked-haddock-fish-cakes-214530', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}