{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/299580-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 299580, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Sardine Caesar with Salumi and Pan-Croutons', u'diets': [u'pescatarian'], u'preparationMinutes': 25, u'pricePerServing': 100.28, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 1/2 cups torn chunks of ciabatta bread', u'aisle': u'Bakery/Bread', u'name': u'ciabatta bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 93655, u'unit': u'cups'}, {u'originalString': u'2 tablespoons chopped fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'3 cloves garlic, 1 finely grated, 2 smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely grated', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'5 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cups'}, {u'originalString': u'12 cups torn romaine lettuce (from about 1 head)', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'(from 1 head)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'3 tablespoons salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoons'}, {u'originalString': u'2 smoked sardines (kippers)', u'aisle': u'Seafood', u'name': u'sardines', u'metaInformation': [u'smoked', u'(kippers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sardines-canned.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 15088, u'unit': u''}, {u'originalString': u'Fine sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon sweet paprika', u'aisle': u'Spices and Seasonings', u'name': u'sweet paprika', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'teaspoon'}, {u'originalString': u'3 ounces salumi (cured Italian salami), cut into wide matchsticks', u'aisle': u'?', u'name': u'salumi', u'metaInformation': [u'italian', u'cut into wide matchsticks', u'(cured salami)'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'unit': u'ounces'}], u'healthScore': 10.0, u'imageType': u'jpeg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/amy-thielen/smoked-sardine-caesar-with-salumi-and-pan-croutons.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the dressing, combine the clove of grated garlic and the smoked sardines in a small bowl and mash to a rough paste with a fork.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sardines-canned.jpg', u'id': 15088, u'name': u'sardines'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the mayonnaise, 1/2 cup of the Parmesan cheese, the lemon juice, 3 tablespoons of the olive oil, 1/4 teaspoon salt and 1/2 teaspoon pepper, and mix together. Thin the dressing with a tablespoon or so of water, until it has the consistency of thick cream.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the croutons, heat a large heavy skillet over medium heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining 2 tablespoons olive oil to coat the bottom of the pan, and then add the smashed garlic cloves, butter, paprika and bread. Season with salt and pepper and cook, stirring often, until the bread turns crisp throughout and darkens on the edges, about 5 minutes. Discard the garlic, and allow the croutons to cool.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To serve, place the lettuce in a bowl and season with a little salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add enough dressing to coat, and then add the salumi, remaining 1 cup Parmesan cheese, the croutons and mint, and toss.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Vampire Pinot Grigio Wine. It has 4.5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'fresh , floral , fruity', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'For the dressing, combine the clove of grated garlic and the smoked sardines in a small bowl and mash to a rough paste with a fork. Add the mayonnaise, 1/2 cup of the Parmesan cheese, the lemon juice, 3 tablespoons of the olive oil, 1/4 teaspoon salt and 1/2 teaspoon pepper, and mix together. Thin the dressing with a tablespoon or so of water, until it has the consistency of thick cream.                          For the croutons, heat a large heavy skillet over medium heat. Add the remaining 2 tablespoons olive oil to coat the bottom of the pan, and then add the smashed garlic cloves, butter, paprika and bread. Season with salt and pepper and cook, stirring often, until the bread turns crisp throughout and darkens on the edges, about 5 minutes. Discard the garlic, and allow the croutons to cool.                          To serve, place the lettuce in a bowl and season with a little salt and pepper. Add enough dressing to coat, and then add the salumi, remaining 1 cup Parmesan cheese, the croutons and mint, and toss.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-sardine-caesar-with-salumi-and-pan-croutons-299580', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}