{u'recipes': [{u'sourceName': u'Healthy Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/484033-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 484033, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Donuts', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 150, u'pricePerServing': 8.99, u'creditText': u'Healthy Recipes', u'extendedIngredients': [{u'originalString': u'2\xbd cups bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 envelope rapid rise yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'envelope'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://healthyrecipesblogs.com/2011/12/14/baked-donuts-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bread-machine.jpg', u'id': 5607, u'name': u'bread machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place milk, butter, egg, bread flour, sugar, salt and yeast in the pan of your electric bread machine and set on the dough cycle. When done, remove from machine, cover and let rest for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Roll dough out \xbd-inch thick on a floured countertop. Use a doughnut cutter to cut the doughnuts and the holes. You can gather the scraps and re-roll to get more donuts, although it gets progressively harder to do. Doing this, I managed to extract 15 donuts out of this recipe.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer donuts to a parchment-lined baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer donut holes to another baking sheet. Cover baking sheets with clean towels and let rise in a warm place (next to a warm oven os great) for 45 minutes. Preheat oven to 375 degrees F. Or you can cover with plastic wrap and refrigerate overnight. The next morning, an hour before baking, take out of the fridge and allow to rise in a warm place, then continue with step 4.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake in a 375 degree F oven about 10 minutes (8 minutes for doughnut holes), until tops are golden. Cool for a couple of minutes on a wire rack that you have placed on foil.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush each donut with melted butter and dip in cinnamon sugar.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar.jpg', u'id': 10219335, u'name': u'cinnamon sugar'}]}], u'name': u''}], u'aggregateLikes': 4200, u'instructions': u'Place milk, butter, egg, bread flour, sugar, salt and yeast in the pan of your electric bread machine and set on the dough cycle. When done, remove from machine, cover and let rest for 10 minutes.Roll dough out \xbd-inch thick on a floured countertop. Use a doughnut cutter to cut the doughnuts and the holes. You can gather the scraps and re-roll to get more donuts, although it gets progressively harder to do. Doing this, I managed to extract 15 donuts out of this recipe.Transfer donuts to a parchment-lined baking sheet. Transfer donut holes to another baking sheet. Cover baking sheets with clean towels and let rise in a warm place (next to a warm oven os great) for 45 minutes. Preheat oven to 375 degrees F. Or you can cover with plastic wrap and refrigerate overnight. The next morning, an hour before baking, take out of the fridge and allow to rise in a warm place, then continue with step 4.Bake in a 375 degree F oven about 10 minutes (8 minutes for doughnut holes), until tops are golden. Cool for a couple of minutes on a wire rack that you have placed on foil. Brush each donut with melted butter and dip in cinnamon sugar.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-donuts-484033', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 160, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}