{u'recipes': [{u'sourceName': u'Cinnamon Spice and Everything Nice', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/492426-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 492426, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sugar Cookie Tartlets', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 126.61, u'creditText': u'Cinnamon Spice and Everything Nice', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u"confectioners' sugar for sprinkling over top", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [u'for sprinkling over top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1/2 cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'about 3/4 cup strawberry or seedless raspberry jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'raspberry jam', u'metaInformation': [u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10719297, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'2 + 1/2 cup unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10020081, u'unit': u''}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.cinnamonspiceandeverythingnice.com/sugar-cookie-tartlets/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl beat the shortening, butter, sour cream, sugars, salt, baking powder and vanilla together on medium speed until smooth and creamy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the egg and beat until fluffy.In a separate bowl whisk together the flour and cornstarch then stir into the wet mixture.Divide the dough in half and form into 2 disks. Wrap in plastic wrap and refrigerate 30 minutes. Preheat oven to 350 degrees F. On a lightly floured surface roll the dough 1/8" thick.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Cut the dough into shapes with a round cookie cutter and then cut the middle out of half of them with a small heart or round cookie cutter.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Bake on lightly greased cookie sheets 8 - 10 minutes until light brown around the edges. Cool on wire racks. To assemble spoon about a half teaspoon jam into the center of the round cookies and place a center-cut cookie on top. Sprinkle with  confectioners' sugar.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood on the menu? Try pairing with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is NV ONEHOPE Brut. It has 4.7 out of 5 stars and a bottle costs about 20 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'crisp , peach , cream', u'title': u'NV ONEHOPE Brut', u'price': u'$19.99', u'id': 428232, u'link': u'https://www.amazon.com/ONEHOPE-California-Brut-Sparkling-750/dp/B00C3164HC', u'imageUrl': u'https://spoonacular.com/productImages/428232-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'In a large bowl beat the shortening, butter, sour cream, sugars, salt, baking powder and vanilla together on medium speed until smooth and creamy. Add the egg and beat until fluffy.In a separate bowl whisk together the flour and cornstarch then stir into the wet mixture.Divide the dough in half and form into 2 disks. Wrap in plastic wrap and refrigerate 30 minutes. Preheat oven to 350 degrees F. On a lightly floured surface roll the dough 1/8" thick. Cut the dough into shapes with a round cookie cutter and then cut the middle out of half of them with a small heart or round cookie cutter.Bake on lightly greased cookie sheets 8 - 10 minutes until light brown around the edges. Cool on wire racks. To assemble spoon about a half teaspoon jam into the center of the round cookies and place a center-cut cookie on top. Sprinkle with  confectioners\' sugar.', u'spoonacularSourceUrl': u'https://spoonacular.com/sugar-cookie-tartlets-492426', u'dishTypes': [u'fingerfood', u'antipasti', u'dessert', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}