{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474621-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 474621, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vegetarian Buddha’s Delight', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 173.06, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'1 10-ounce can Sauteed Dried Tofu and Bamboo Shoots', u'aisle': u'Ethnic Foods', u'name': u'bamboo shoots', u'metaInformation': [u'dried', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11028, u'unit': u'ounce'}, {u'originalString': u'1 square fermented bean curd, mashed up, optional', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'bean curd', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'square', u'unitShort': u'square', u'amount': 1.0, u'consistency': u'solid', u'id': 16162, u'unit': u'square'}, {u'originalString': u'2 tablespoons dried wood ear fungus', u'aisle': u'Produce', u'name': u'ear corn', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11167, u'unit': u'tablespoons'}, {u'originalString': u'1 slice ginger, the size of a quarter, minced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'slice'}, {u'originalString': u'1 1.7 ounce pack mung bean noodles', u'aisle': u'Produce;Ethnic Foods', u'name': u'mung bean sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.7, u'consistency': u'solid', u'id': 11043, u'unit': u'ounce'}, {u'originalString': u'4 dried shitake mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'2 cups bok choy or napa cabbage, cut into bite size pieces', u'aisle': u'Produce', u'name': u'napa cabbage leaves', u'metaInformation': [u'cut into bite size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/napa-cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011970, u'unit': u'cups'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'a drizzle of sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'servings'}, {u'originalString': u'1 9-ounce can Vegetarian Sausage with Mushrooms, and Bamboo Shoots (leave out for gluten-free version)', u'aisle': u'Frozen', u'name': u'vegetarian sausage', u'metaInformation': [u'gluten-free', u'with mushrooms, and bamboo shoots (leave out for  version)', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 98971, u'unit': u'ounce'}, {u'originalString': u'1/4 cup dried daylily buds', u'aisle': u'?', u'name': u'daylily buds', u'metaInformation': [u'dried'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'cup'}], u'healthScore': 68.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/2014/01/vegetarian-buddhas-delight.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Soak mushrooms, tiger lily buds and wood ear fungus in water overnight. To keep ingredients immersed, place a wet folded paper towel on top; strain and reserve soaking liquid.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Cut mushrooms in halves or quarters depending on the size.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Cut off tough ends of tiger lily buds.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u'Cut black wood ear fungus into bite size pieces.Soak mung bean noodles for 1/2 hour or longer; strain. Use scissors to cut into 2" lengths.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat oil in a wok or large pan.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Saute ginger until fragrant, just a few seconds.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add mushrooms, day lily buds,wood ear fungus, Vegetarian Sausage with Mushrooms and Bamboo Shoots, and', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'id': 11028, u'name': u'bamboo shoots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Sauteed Dried Tofu and Bamboo Shoots.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'id': 11028, u'name': u'bamboo shoots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Saute 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add 3/4 cup reserved soaking liquid and fermented bean curd. Cover and cook 5-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Add mung bean noodles and bok choy. Cover and cook another 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with sesame oil.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1101, u'instructions': u'Soak mushrooms, tiger lily buds and wood ear fungus in water overnight. To keep ingredients immersed, place a wet folded paper towel on top; strain and reserve soaking liquid.Cut mushrooms in halves or quarters depending on the size. Cut off tough ends of tiger lily buds. Cut black wood ear fungus into bite size pieces.Soak mung bean noodles for 1/2 hour or longer; strain. Use scissors to cut into 2" lengths.Heat oil in a wok or large pan. Saute ginger until fragrant, just a few seconds. Add mushrooms, day lily buds,wood ear fungus, Vegetarian Sausage with Mushrooms and Bamboo Shoots, and Sauteed Dried Tofu and Bamboo Shoots. Saute 3-4 minutes. Add 3/4 cup reserved soaking liquid and fermented bean curd. Cover and cook 5-7 minutes. Add mung bean noodles and bok choy. Cover and cook another 2 minutes. Drizzle with sesame oil.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetarian-buddhas-delight-474621', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}