{u'recipes': [{u'sourceName': u'Home Cooking Adventure', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/550842-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 550842, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coffee Cake with Meringue Topping', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 652.86, u'creditText': u'Home Cooking Adventure', u'extendedIngredients': [{u'originalString': u'4 tbsp apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19719, u'unit': u'tbsp'}, {u'originalString': u'2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'150 g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 tbsp dark cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'30 ml vanilla coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 14209, u'unit': u'ml'}, {u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'500 g flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 cake layer, crushed', u'aisle': u'Bakery/Bread', u'name': u'lb cake', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 18133, u'unit': u''}, {u'originalString': u'150 ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'2 tbsp sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tbsp'}, {u'originalString': u'10 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 10.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp ground walnuts', u'aisle': u'?', u'name': u'ground walnuts', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp lard', u'aisle': u'?', u'name': u'lard', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'unit': u'tbsp'}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.homecookingadventure.com/recipes/coffee-cake-with-meringue-topping', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 194, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F (180 degrees C).Make cake layers.In a large bowl, cream together butter, lard and sugar until well mixed. Beat in the egg yolks and sour cream. Stir dry ingredients together: flour and baking powder. Gradually add into butter mixture. Split the dough in 3 pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Roll each piece on the back of a baking pan (12 inch x 10 inch) and bake for 10 minutes. I used smaller round pans but is easier with a rectangular pan.\xa0Prepare the filling. Crush one cake layer and moist with milk and coffee.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Add butter, walnuts, cocoa powder apricot jam and sugar and stir until well combined.Assemble the cake, the 2 cake layers left \xa0and the filling between.\xa0Whip egg whites until foamy with a mixer. Continue whipping over bain-marie. Gradually add the sugar whipping the whole time until it holds very stiff peaks.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from heat and layer it over the cake. Sprinkle chocolate on top and for a more unique flavor sprinkle ground coffee.\xa0', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Preheat oven to 375 degrees F (180 degrees C).Make cake layers.In a large bowl, cream together butter, lard and sugar until well mixed. Beat in the egg yolks and sour cream. Stir dry ingredients together: flour and baking powder. Gradually add into butter mixture. Split the dough in 3 pieces. Roll each piece on the back of a baking pan (12 inch x 10 inch) and bake for 10 minutes. I used smaller round pans but is easier with a rectangular pan.\xa0Prepare the filling. Crush one cake layer and moist with milk and coffee. Add butter, walnuts, cocoa powder apricot jam and sugar and stir until well combined.Assemble the cake, the 2 cake layers left \xa0and the filling between.\xa0Whip egg whites until foamy with a mixer. Continue whipping over bain-marie. Gradually add the sugar whipping the whole time until it holds very stiff peaks. Remove from heat and layer it over the cake. Sprinkle chocolate on top and for a more unique flavor sprinkle ground coffee.\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/coffee-cake-with-meringue-topping-550842', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}