{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/570551-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 570551, u'veryPopular': False, u'lowFodmap': False, u'title': u'Old Fashioned Chocolate Cake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 64.87, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'\xbe teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'1\xbd cups well-shaken buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'well-shaken'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'1\xbd cups hot brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'hot', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 14209, u'unit': u'cups'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2\xbd cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1\xbc teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'3 ounces semisweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'3 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1\xbd cups unsweetened cocoa powder (not Dutch process)', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'(not Dutch process)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cups'}, {u'originalString': u'\xbe teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/old-fashioned-chocolate-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Kick the tires and light the fires to 300 degrees.Get the chocolate and chop it up.Melt the chopped up chocolate in the hot coffee until it is completely dissolved and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together your dry ingredients.Beat your eggs for 2-3 minutes, until they are thick and lemon colored. Time to add the oil, buttermilk and vanilla.Once those are in, add the coffee/chocolate mixture slowly.Then it’s time for the dry ingredients, dump them in and mix at a moderate speed until they are combined completely.Grease and parchment line your cake pan.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake at 300 degrees until done.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 85, u'instructions': u'Kick the tires and light the fires to 300 degrees.Get the chocolate and chop it up.Melt the chopped up chocolate in the hot coffee until it is completely dissolved and set aside.Whisk together your dry ingredients.Beat your eggs for 2-3 minutes, until they are thick and lemon colored. Time to add the oil, buttermilk and vanilla.Once those are in, add the coffee/chocolate mixture slowly.Then it’s time for the dry ingredients, dump them in and mix at a moderate speed until they are combined completely.Grease and parchment line your cake pan.Bake at 300 degrees until done.', u'spoonacularSourceUrl': u'https://spoonacular.com/old-fashioned-chocolate-cake-570551', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}