{u'recipes': [{u'sourceName': u'Pressure Cooking Today', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/487250-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 487250, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pressure Cooker Shepherd’s Pie', u'diets': [u'gluten free'], u'pricePerServing': 176.13, u'creditText': u'Pressure Cooking Today', u'extendedIngredients': [{u'originalString': u'1 cup beef stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u'1 cup diced carrot, diced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2 cup Cheddar Cheese or cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1009, u'unit': u'cup'}, {u'originalString': u'2 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons flat leaf parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, minced or pressed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 pounds ground lamb, or ground meat', u'aisle': u'Meat', u'name': u'ground meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds potatoes, peeled and quartered', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'peeled', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoon cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.pressurecookingtoday.com/2014/03/shepherds-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Preheat oven to 375 F. Lightly grease a 2 quart casserole or 9-inch deep dish pie plate.Select Browning and add oil to pressure cooking pot. When hot, add the onion and carrots and saute until onion is translucent, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic and saute an additional minute.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add ground meat and brown, breaking the meat apart as it cooks.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [], u'step': u'Drain grease from the meat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add beef stock, tomato paste, salt and pepper to beef mixture in pressure cooking pot. Cover and lock lid in place. Select High Pressure and 3 minutes cook time. When timer beeps, turn off and use a quick pressure release.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine the cornstarch and water, whisking until smooth.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add cornstarch mixture to the pressure cooking pot. Select Simmer and bring to a boil, stirring constantly. After sauce thickens, taste, adjust seasoning if necessary.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Add the parsley, corn and peas to the meat mixture.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour meat mixture into the bottom of prepared baking dish or pie plate.Rinse out pressure cooking pot.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/steamer.jpg', u'id': 404767, u'name': u'steamer basket'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place potatoes into a steamer basket or on metal trivet in the pressure cooking pot.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}], u'step': u'Add 1 cup water. Cover and lock lid in place. Select High Pressure and 5 minutes cook time. When timer beeps, turn off and use a quick pressure release.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Drain potatoes. Put drained potatoes into a mixing bowl and mash with a potato masher. Stir in milk, butter, salt and pepper, and grated cheese.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Spread mashed potatoes evenly over the meat mixture right to the edges. If desired, use a pastry bag with a large star tip to create a decorative topping with the mashed potatoes.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven 30 to 35 minutes until golden brown.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot.', u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is McFadden Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'apricot , apple , honey', u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 1584, u'instructions': u'Preheat oven to 375 F. Lightly grease a 2 quart casserole or 9-inch deep dish pie plate.Select Browning and add oil to pressure cooking pot. When hot, add the onion and carrots and saute until onion is translucent, about 3 minutes. Add garlic and saute an additional minute. Add ground meat and brown, breaking the meat apart as it cooks. Drain grease from the meat.Add beef stock, tomato paste, salt and pepper to beef mixture in pressure cooking pot. Cover and lock lid in place. Select High Pressure and 3 minutes cook time. When timer beeps, turn off and use a quick pressure release.Combine the cornstarch and water, whisking until smooth. Add cornstarch mixture to the pressure cooking pot. Select Simmer and bring to a boil, stirring constantly. After sauce thickens, taste, adjust seasoning if necessary. Add the parsley, corn and peas to the meat mixture. Pour meat mixture into the bottom of prepared baking dish or pie plate.Rinse out pressure cooking pot. Place potatoes into a steamer basket or on metal trivet in the pressure cooking pot. Add 1 cup water. Cover and lock lid in place. Select High Pressure and 5 minutes cook time. When timer beeps, turn off and use a quick pressure release.Drain potatoes. Put drained potatoes into a mixing bowl and mash with a potato masher. Stir in milk, butter, salt and pepper, and grated cheese.Spread mashed potatoes evenly over the meat mixture right to the edges. If desired, use a pastry bag with a large star tip to create a decorative topping with the mashed potatoes.Bake in preheated oven 30 to 35 minutes until golden brown. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/pressure-cooker-shepherds-pie-487250', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}