{u'recipes': [{u'sourceName': u'Seeded at the Table', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619950-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 619950, u'veryPopular': False, u'lowFodmap': False, u'title': u'Five-Cheese, Fifteen-Minute Stovetop Mac ‘n Cheese', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 169.35, u'creditText': u'Seeded at the Table', u'extendedIngredients': [{u'originalString': u'1/4 cup (1 ounce) shredded Asiago', u'aisle': u'Cheese', u'name': u'asiago', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1001033, u'unit': u'ounce'}, {u'originalString': u'1 cup (4 ounces) shredded yellow extra-sharp Cheddar', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'shredded', u'yellow', u'extra-sharp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 cup (4 ounces) shredded smoked Gouda', u'aisle': u'Cheese', u'name': u'gouda', u'metaInformation': [u'smoked', u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gouda.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1022, u'unit': u'ounces'}, {u'originalString': u'1/2 cup (2 ounces) shredded Gruy\xe9re', u'aisle': u'Cheese', u'name': u'gruyere', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1023, u'unit': u'ounces'}, {u'originalString': u'2 cups heavy cream, warmed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound twisted pasta (like Rotini or gemelli)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'(like Rotini or gemelli)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (8 ounces) shredded white sharp Cheddar', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'shredded', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.seededatthetable.com/2014/11/17/five-cheese-fifteen-minute-stovetop-mac-n-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a large Dutch oven or pot, melt the butter over medium heat.  Stir in the flour and mustard and whisk until a thick paste forms, about 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the cream and bring to a simmer, stirring constantly until thickened.  Stir in all the cheese until melted and smooth.  This will take a few minutes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the cooked pasta and toss to coat.  Stir in the sour cream, salt and pepper.  Continue to cook for a few minutes until heated through, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [], u'step': u'Serve immediately.Recipe Source: Back Around the Table: An "In the Kitchen with David" Cookbook', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 319, u'instructions': u'In a large Dutch oven or pot, melt the butter over medium heat.  Stir in the flour and mustard and whisk until a thick paste forms, about 2-3 minutes.  Add the cream and bring to a simmer, stirring constantly until thickened.  Stir in all the cheese until melted and smooth.  This will take a few minutes.  Add the cooked pasta and toss to coat.  Stir in the sour cream, salt and pepper.  Continue to cook for a few minutes until heated through, about 3 minutes.  Serve immediately.Recipe Source: Back Around the Table: An "In the Kitchen with David" Cookbook', u'spoonacularSourceUrl': u'https://spoonacular.com/five-cheese-fifteen-minute-stovetop-mac-n-cheese-619950', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}