{u'recipes': [{u'sourceName': u'Minimalist Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/500589-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 500589, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mediterranean Wheat Berry Salad', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 109.8, u'creditText': u'Minimalist Baker', u'extendedIngredients': [{u'originalString': u'3 cloves garlic minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Hummus, Pine Nuts, Fresh Parsley, Pita Chips', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'servings'}, {u'originalString': u'1/4 cup Kalamata olives, halved', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'2 large leeks, green stems removed, thoroughly washed and diced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'diced', u'green', u'washed and ', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1/2 cup good Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 tsp dried oregano (or sub 1/4 cup fresh, chopped)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried', u'fresh', u'chopped', u'(or sub 1/4 cup , )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/4 cup red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022068, u'unit': u'cup'}, {u'originalString': u'1/4 tsp each salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1102047, u'unit': u'tsp'}, {u'originalString': u'1 cup baby tomatoes, halved', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'1 cup wheat berries', u'aisle': u'Health Foods', u'name': u'wheat berries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wheat-berries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98872, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://minimalistbaker.com/mediterranean-wheat-berry-salad/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.Bring 3 cups water to a boil in a small saucepan, then add a pinch of salt, 1 cup wheat berries and reduce heat to a simmer. Cover and continue cook for 25-30 minutes or until tender. They should be chewy but not tough.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wheat-berries.jpg', u'id': 98872, u'name': u'wheatberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain and add to a large serving bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add 2 tsp olive oil and a pinch of salt for added flavor.Prep leeks and onions, then place on a foil- or parchment-lined baking sheet and toss with 1 Tbsp olive oil and a pinch each salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake for 23-28 minutes or until tender and golden brown. Toss halfway through for even cooking. Set aside.In the meantime, prepare dressing by combining all ingredients except olive oil in a small mixing bowl. Stream in olive oil as you whisk to emulsify. Otherwise, add all ingredients to a jar and shake vigorously to combine. Taste and adjust seasonings as needed.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u"Add tomatoes, olives, roasted leeks and onions to the wheat berries and toss with enough dressing to coat. You'll likely have leftover dressing.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wheat-berries.jpg', u'id': 98872, u'name': u'wheatberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Serves 4 generously. Cover and refrigerate to keep for up to several days. The longer it sits and marinates, the more intense the flavor becomes.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Additional garnishes might include hummus, pine nuts, parsley and pita chips.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 345, u'instructions': u"Preheat oven to 400 degrees F.Bring 3 cups water to a boil in a small saucepan, then add a pinch of salt, 1 cup wheat berries and reduce heat to a simmer. Cover and continue cook for 25-30 minutes or until tender. They should be chewy but not tough.Drain and add to a large serving bowl. Add 2 tsp olive oil and a pinch of salt for added flavor.Prep leeks and onions, then place on a foil- or parchment-lined baking sheet and toss with 1 Tbsp olive oil and a pinch each salt and pepper. Bake for 23-28 minutes or until tender and golden brown. Toss halfway through for even cooking. Set aside.In the meantime, prepare dressing by combining all ingredients except olive oil in a small mixing bowl. Stream in olive oil as you whisk to emulsify. Otherwise, add all ingredients to a jar and shake vigorously to combine. Taste and adjust seasonings as needed.Add tomatoes, olives, roasted leeks and onions to the wheat berries and toss with enough dressing to coat. You'll likely have leftover dressing.Serves 4 generously. Cover and refrigerate to keep for up to several days. The longer it sits and marinates, the more intense the flavor becomes.Additional garnishes might include hummus, pine nuts, parsley and pita chips.", u'spoonacularSourceUrl': u'https://spoonacular.com/mediterranean-wheat-berry-salad-500589', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}