{u'recipes': [{u'sourceName': u'White on Rice Couple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/589800-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 589800, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Fruit Burglar and Chocolate Cherry Crisp', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 143.7, u'creditText': u'White on Rice Couple', u'extendedIngredients': [{u'originalString': u'2 lbs fresh Cherries, pitted and halved', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'fresh', u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 9070, u'unit': u'lbs'}, {u'originalString': u'1 c (180g) Dark Chocolate Chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 180.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'g'}, {u'originalString': u'3/4 c (100g) all-purpose Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1/2 t (3g) Sea Salt or Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 3.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'g'}, {u'originalString': u'1/4 c (50g) packed Light-Brown Sugar', u'aisle': u'Baking', u'name': u'light-brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'1 c (90g) old-fashioned Rolled Oats (not quick-cooking)', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [u'(not quick-cooking)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 90.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'1/4 c (50g) Granular Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'8 T (1 stick) (115g) cold, unsalted Butter, cut into small cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'small', u'cut into  cubes', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 115.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://whiteonricecouple.com/recipes/chocolate-cherry-crisp/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees. In a large bowl, mix together flour, brown sugar, and salt. Pinch butter into flour, using your fingers or a pastry blender until mixture is the texture of coarse meal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add oats, and use your hands to toss and squeeze mixture until large, moist clumps form.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to freezer to chill while you prepare filling.(If desired, set aside a handful of cherries to decorate the top of the crisp.) In another large bowl, toss cherries with chocolate chips, sugar and flour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to a shallow 2-quart baking dish, and sprinkle with topping mixture.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place reserved cherries to decorate top of crisp.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place baking dish on a rimmed baking sheet, and bake until golden and bubbling, 45 to 55 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Crisp on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 552, u'instructions': u'Preheat oven to 375 degrees. In a large bowl, mix together flour, brown sugar, and salt. Pinch butter into flour, using your fingers or a pastry blender until mixture is the texture of coarse meal. Add oats, and use your hands to toss and squeeze mixture until large, moist clumps form. Transfer to freezer to chill while you prepare filling.(If desired, set aside a handful of cherries to decorate the top of the crisp.) In another large bowl, toss cherries with chocolate chips, sugar and flour. Transfer to a shallow 2-quart baking dish, and sprinkle with topping mixture. Place reserved cherries to decorate top of crisp. Place baking dish on a rimmed baking sheet, and bake until golden and bubbling, 45 to 55 minutes. Let cool 10 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-fruit-burglar-and-chocolate-cherry-crisp-589800', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}