{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474900-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 474900, u'veryPopular': True, u'lowFodmap': False, u'title': u'Marbled Caramel Chocolate Slice {Cookbook of the Month }', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 21.03, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'7 tablespoons butter, diced', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3 1/2 ounces milk chocolate', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 19081, u'unit': u'ounces'}, {u'originalString': u'3 1/2 ounces semi-sweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 14-ounce cans of sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounce'}, {u'originalString': u'2 ounces white chocolate', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19087, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.tasteandtellblog.com/cookbook-of-the-month-recipe-marbled-caramel-chocolate-slice/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 deg. F. Line a 13 x 9-inch jelly roll pan or baking dish with parchment paper and lightly grease it.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the flour and sugar into a bowl and cut in the butter until the mixture resembles fine breadcrumbs. Work it together until it forms a dough', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the dough into the prepared pan and press it out with your hand to cover the base. Press it evenly into the pan. Prick all over with a fork and bake for about 20 minutes, or until firm to the touch and very light brown. Set aside and leave it in the pan to cool.To make the filling, put the butter, brown sugar and condensed milk into a pan over medium het, stirring until the sugar has dissolved. Stirring constantly, bring to the boil. Reduce the heat andsimmer the mixture very gently, stirring constantly, for about 5 – 10 minutes, or until it has thickened and has turned a caramel color. Make sure to stir constantly to avoid burning the caramel.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from the heat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the filling mixture over the cookie base, spread evenly, then leave until cool.To make the topping, melt each type of chocolate separately in a microwave or in a heatproof bowl set over a pan of hot water. Spoon stripes about 2 inches wide of semisweet and milk chocolate down the length of the pan, alternating semisweet and milk chocolate.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'milk chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Place spoonfuls of the white chocolate randomly over the top. Use a skewer to form a marbled effect on the topping.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}]}, {u'equipment': [], u'step': u'Let sit until the chocolate sets.Once set, cut into bars 1"x2".', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'aggregateLikes': 2704, u'instructions': u'Preheat the oven to 350 deg. F. Line a 13 x 9-inch jelly roll pan or baking dish with parchment paper and lightly grease it.Put the flour and sugar into a bowl and cut in the butter until the mixture resembles fine breadcrumbs. Work it together until it forms a dough Put the dough into the prepared pan and press it out with your hand to cover the base. Press it evenly into the pan. Prick all over with a fork and bake for about 20 minutes, or until firm to the touch and very light brown. Set aside and leave it in the pan to cool.To make the filling, put the butter, brown sugar and condensed milk into a pan over medium het, stirring until the sugar has dissolved. Stirring constantly, bring to the boil. Reduce the heat andsimmer the mixture very gently, stirring constantly, for about 5 – 10 minutes, or until it has thickened and has turned a caramel color. Make sure to stir constantly to avoid burning the caramel. Remove from the heat. Pour the filling mixture over the cookie base, spread evenly, then leave until cool.To make the topping, melt each type of chocolate separately in a microwave or in a heatproof bowl set over a pan of hot water. Spoon stripes about 2 inches wide of semisweet and milk chocolate down the length of the pan, alternating semisweet and milk chocolate. Place spoonfuls of the white chocolate randomly over the top. Use a skewer to form a marbled effect on the topping.  Let sit until the chocolate sets.Once set, cut into bars 1"x2".', u'spoonacularSourceUrl': u'https://spoonacular.com/marbled-caramel-chocolate-slice-cookbook-of-the-month--474900', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 54, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}