{u'recipes': [{u'sourceName': u'Minimalist Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/500737-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 500737, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy No Bake Pumpkin Pie', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 390, u'pricePerServing': 153.97, u'creditText': u'Minimalist Baker', u'extendedIngredients': [{u'originalString': u'3.5 Tbsp cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.5, u'consistency': u'solid', u'id': 20027, u'unit': u'Tbsp'}, {u'originalString': u'2 cups pitted dates (deglet nour or medjool)', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'pitted', u'(deglet nour or medjool)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9087, u'unit': u'cups'}, {u'originalString': u'1 13.5 ounce can full fat coconut milk chilled overnight (I recommend Thai Kitchen brand)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [u'chilled', u'canned', u'(I recommend Thai Kitchen brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'ounce'}, {u'originalString': u"1 2/3 cup unsweetened milk (any kind, though I'd recommend almond or dairy)", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'unsweetened', u"(any kind, though I'd recommend almond or dairy)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 cups raw nuts (I used half pecans, half almonds)', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'raw', u'(I used half pecans, half almonds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12135, u'unit': u'cups'}, {u'originalString': u'1/4 cup gluten free oats (or sub unsweetened coconut flakes for a different flavor)', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'gluten free', u'unsweetened', u'for a different flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'2-5 Tbsp powdered sugar, depending on preferred sweetness', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'Tbsp'}, {u'originalString': u'1/2 tsp pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'1 cup pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1/3 cup sugar (raw or granulated)', u'aisle': u'Health Foods;Baking', u'name': u'raw sugar', u'metaInformation': [u'raw', u'( or granulated)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19908, u'unit': u'cup'}, {u'originalString': u'pinch sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1/2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://minimalistbaker.com/creamy-no-bake-pumpkin-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'To make the filling, place all dry ingredients in a saucepan and whisk to combine. Then add pumpkin puree and whisk again. Slowly pour in milk and stir again until well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place over medium heat and bring to a low bubble - not boil - whisking often. Once it starts bubbling and getting thick, reduce heat to medium-low and continue cooking until a visible ribbon forms when spooning it across the top. It should be thick and kind of jiggly. During this process switch to a rubber spatula for stirring to ensure the pudding isn't sticking to the bottom or sides of the pan.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from heat and add vanilla and whisk.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let set for 5-10 minutes, then transfer to a glass bowl and cover with plastic wrap, making sure the wrap TOUCHES the pudding - otherwise a film will form.Refrigerate for several hours or until completely chilled and set.In the meantime, prepare crust by adding dates to the food processor and pulse until it forms a ball - or at least until small bits remain.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Remove from food processor and then add nuts, pumpkin pie spice and oats. Pulse until almost a meal, then add back in the dates a little at a time until a "dough" forms.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/glass-baking-tray.jpg', u'id': 406921, u'name': u'glass baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u"Transfer to a lightly greased pie pan or small glass baking dish and press until uniformly flat and it comes up the edges 1.5-2 inches, making a crust (see photo). It doesn't have to be perfect, just make sure there are no gaps or cracks. Cover with plastic wrap and refrigerate or set on counter until filling is chilled.When the pudding is ready, place a glass mixing bowl in the freezer to chill for a few minutes so you can prepare your coconut whipped cream (make sure the can has been chilled overnight to harden - otherwise it won't whip).Without shaking or tipping the can, remove the top and gently scoop out the top thick, solid portion of the coconut milk, known as the cream. Leave the clear liquid at the bottom of the can and reserve this for smoothies or other uses.Beat the cream to incorporate it. At this point it should start firming up, but if not add a couple Tbsp of tapioca flour and it should thicken right up! Then add in desired amount of powdered sugar 1 Tbsp at a time, as well as the vanilla extract. Cover and refrigerate until serving the pie.Once the crust and filling are both ready, pour the pudding over the crust and spread to smooth.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}, {u'equipment': [], u'step': u'Let it chill for several more hours or ideally, overnight. Top with coconut cream when serving. Will keep for several days covered in the fridge.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Ice Wine, Moscato, and Vin Santo are great choices for Pumpkin Pie. Vin santo is typically sweet with notes of baking spices and nuts, so it pairs really well with pumpkin spiced desserts. A good sparkling Moscato would work too, and if you feel like splurging, an ice wine. The Renwood Amador Ice, Ice Wine with a 4.6 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'ice wine', u'moscato', u'vin santo'], u'productMatches': [{u'description': u'strawberry , orange peel , crisp', u'title': u'Renwood Amador Ice, Ice Wine', u'price': u'$34.99', u'id': 428483, u'link': u'https://www.amazon.com/2012-Renwood-Amador-Wine-County/dp/B00VGTIC68', u'imageUrl': u'https://spoonacular.com/productImages/428483-312x231.jpg'}]}, u'aggregateLikes': 7011, u'instructions': u'To make the filling, place all dry ingredients in a saucepan and whisk to combine. Then add pumpkin puree and whisk again. Slowly pour in milk and stir again until well combined.Place over medium heat and bring to a low bubble - not boil - whisking often. Once it starts bubbling and getting thick, reduce heat to medium-low and continue cooking until a visible ribbon forms when spooning it across the top. It should be thick and kind of jiggly. During this process switch to a rubber spatula for stirring to ensure the pudding isn\'t sticking to the bottom or sides of the pan.Remove from heat and add vanilla and whisk. Let set for 5-10 minutes, then transfer to a glass bowl and cover with plastic wrap, making sure the wrap TOUCHES the pudding - otherwise a film will form.Refrigerate for several hours or until completely chilled and set.In the meantime, prepare crust by adding dates to the food processor and pulse until it forms a ball - or at least until small bits remain. Remove from food processor and then add nuts, pumpkin pie spice and oats. Pulse until almost a meal, then add back in the dates a little at a time until a "dough" forms.Transfer to a lightly greased pie pan or small glass baking dish and press until uniformly flat and it comes up the edges 1.5-2 inches, making a crust (see photo). It doesn\'t have to be perfect, just make sure there are no gaps or cracks. Cover with plastic wrap and refrigerate or set on counter until filling is chilled.When the pudding is ready, place a glass mixing bowl in the freezer to chill for a few minutes so you can prepare your coconut whipped cream (make sure the can has been chilled overnight to harden - otherwise it won\'t whip).Without shaking or tipping the can, remove the top and gently scoop out the top thick, solid portion of the coconut milk, known as the cream. Leave the clear liquid at the bottom of the can and reserve this for smoothies or other uses.Beat the cream to incorporate it. At this point it should start firming up, but if not add a couple Tbsp of tapioca flour and it should thicken right up! Then add in desired amount of powdered sugar 1 Tbsp at a time, as well as the vanilla extract. Cover and refrigerate until serving the pie.Once the crust and filling are both ready, pour the pudding over the crust and spread to smooth. Let it chill for several more hours or ideally, overnight. Top with coconut cream when serving. Will keep for several days covered in the fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-no-bake-pumpkin-pie-500737', u'dishTypes': [], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 400, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}