{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/218392-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 218392, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti & meatballs', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 217.98, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g fresh breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'2 eggs, beaten with a fork', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'with a fork', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd a large bunch flat-leaf parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u''}, {u'originalString': u'4 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1kg beef mince', u'aisle': u'Meat', u'name': u'mince beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'kg'}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'85g parmesan, grated, plus extra to serve if you like', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'8 good-quality pork sausages', u'aisle': u'Meat', u'name': u'pork sausages', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 1007063, u'unit': u''}, {u'originalString': u'125ml red wine (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 125.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'ml'}, {u'originalString': u"spaghetti, to serve (you'll need about 100g per serving)", u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [u'per serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'g'}, {u'originalString': u'3 tbsp caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'4 x 400g cans chopped tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/453623/spaghetti-and-meatballs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'First make the meatballs. Split thesausage skins and squeeze out the meatinto your largest mixing bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add themince, onion, parsley, Parmesan,breadcrumbs, beaten eggs and lots ofseasoning. Get your hands in and mixtogether really well – the more yousqueeze and mash the mince, themore tender the meatballs will be.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 220C/200C fan/gas 7.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the mince mixture into about 50golf-ball-size meatballs. Set aside anymeatballs for freezing, allowing about5 per portion, then spread the rest outin a large roasting tin – the meatballs willbrown better if spaced out a bit.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzlewith a little oil (about 1 tsp per portion),shake to coat, then roast for 20-30 minsuntil browned.Meanwhile, make the sauce.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat theoil in your largest pan.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the garlic andsizzle for 1 min. Stir in the tomatoes, wine,if using, sugar, parsley and seasoning.Simmer for 15-20 mins until slightlythickened. Stir in the basil leaves, if using,spoon out any portions for freezing, thenadd the cooked meatballs to the pan tokeep warm while you boil the spaghetti.Spoon the sauce and meatballs overspaghetti, or stir them all together andserve with extra Parmesan and afew basil leaves, if you like.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 213, u'instructions': u'First make the meatballs. Split thesausage skins and squeeze out the meatinto your largest mixing bowl. Add themince, onion, parsley, Parmesan,breadcrumbs, beaten eggs and lots ofseasoning. Get your hands in and mixtogether really well – the more yousqueeze and mash the mince, themore tender the meatballs will be.Heat oven to 220C/200C fan/gas 7.Roll the mince mixture into about 50golf-ball-size meatballs. Set aside anymeatballs for freezing, allowing about5 per portion, then spread the rest outin a large roasting tin – the meatballs willbrown better if spaced out a bit. Drizzlewith a little oil (about 1 tsp per portion),shake to coat, then roast for 20-30 minsuntil browned.Meanwhile, make the sauce. Heat theoil in your largest pan. Add the garlic andsizzle for 1 min. Stir in the tomatoes, wine,if using, sugar, parsley and seasoning.Simmer for 15-20 mins until slightlythickened. Stir in the basil leaves, if using,spoon out any portions for freezing, thenadd the cooked meatballs to the pan tokeep warm while you boil the spaghetti.Spoon the sauce and meatballs overspaghetti, or stir them all together andserve with extra Parmesan and afew basil leaves, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-meatballs-218392', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}