{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570112-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 570112, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Piccata', u'diets': [], u'pricePerServing': 185.26, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'3 T all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'T'}, {u'originalString': u'\xbc t black pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 10211821, u'unit': u't'}, {u'originalString': u'\xbc cup capers, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2054, u'unit': u'cup'}, {u'originalString': u'4 (4 oz each) thin boneless skinless chicken breast cutlets (1 lb total) – you can also get two 8 oz breasts, cut them and pound them \xbc - 1/2” thin', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'boneless', u'skinless', u'thin', u'canned', u'(1 lb total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 5062, u'unit': u'oz'}, {u'originalString': u'\xbd cup low sodium fat free chicken broth', u'aisle': u'Canned and Jarred', u'name': u'fat free chicken broth', u'metaInformation': [u'fat free', u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6984, u'unit': u'cup'}, {u'originalString': u'fresh parsley, chopped, for garnish (not pictured)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnish (not pictured)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3 T fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'T'}, {u'originalString': u'1 T light butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'light butter', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4602, u'unit': u'T'}, {u'originalString': u'1 T olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'T'}, {u'originalString': u'\xbc t salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u't'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.emilybites.com/2012/11/chicken-piccata.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the flour, salt and pepper into a large Ziploc bag and shake to mix.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the chicken, seal the bag and shake until the breasts are thoroughly coated.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter and oil in a large skillet over medium-high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chicken breasts in a single layer and cook for 3 minutes or until the bottoms are golden. Flip the chicken breasts over and cook for an additional 3-4 minutes until the underside is golden and the chicken is cooked through.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove chicken to a separate plate and cover in foil to keep warm.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the chicken broth into the same pan and stir to scrape up any browned bits from the chicken and flour.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the lemon juice, garlic and capers and cook for another 4-5 minutes while sauce reduces.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Pour sauce over chicken and garnish with chopped parsley if desired.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chicken Piccata works really well with Sauvignon Blanc and Gruener Veltliner. Both Gr\xfcner Veltliner and Sauvignon Blanc have citrus and herbal flavors that complement chicken piccata's lemon and parsley. The Fetzer Vineyards Echo Ridge Sauvignon Blanc with a 5 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u'This Sauvignon Blanc has the traditional aromas of cut grass followed by melon, orange, pear and apricot with tropical notes of passion fruit and mango. Jasmine and other floral aromas add interest to the wine. The balanced acids give this wine a wonderful mouth-feel, with the predominant flavor of grapefruit.', u'title': u'Fetzer Vineyards Echo Ridge Sauvignon Blanc', u'price': u'$10.99', u'id': 428660, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Ridge-Sauvignon-Blanc/dp/B072FH93HK', u'imageUrl': u'https://spoonacular.com/productImages/428660-312x231.jpg'}]}, u'aggregateLikes': 3639, u'instructions': u'Combine the flour, salt and pepper into a large Ziploc bag and shake to mix. Add the chicken, seal the bag and shake until the breasts are thoroughly coated.Heat the butter and oil in a large skillet over medium-high heat. Add the chicken breasts in a single layer and cook for 3 minutes or until the bottoms are golden. Flip the chicken breasts over and cook for an additional 3-4 minutes until the underside is golden and the chicken is cooked through. Remove chicken to a separate plate and cover in foil to keep warm.Pour the chicken broth into the same pan and stir to scrape up any browned bits from the chicken and flour. Add the lemon juice, garlic and capers and cook for another 4-5 minutes while sauce reduces. Pour sauce over chicken and garnish with chopped parsley if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-piccata-570112', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}