{u'recipes': [{u'sourceName': u'Spoonful of Flavor', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521408-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 521408, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fusilli with Asparagus, Peas and Arugula', u'diets': [], u'pricePerServing': 192.77, u'creditText': u'Spoonful of Flavor', u'extendedIngredients': [{u'originalString': u'1 bunch asparagus, tough ends trimmed, and sliced on the bias into 1 inch lengths', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'2 cups baby arugula (or baby spinach)', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [u'(or baby spinach)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cups'}, {u'originalString': u'1 \xbc cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'2 tsp. fresh thyme, minced', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'12 ounces fusilli pasta', u'aisle': u'Pasta and Rice', u'name': u'fusilli pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11320420, u'unit': u'ounces'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd cup crumbled goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1159, u'unit': u'cup'}, {u'originalString': u'1 leek, white and light green parts only, halved lengthwise and sliced thin', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'light', u'white', u'green', u'halved lengthwise', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'3 tbsp. fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'4 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'\xbe cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.spoonfulofflavor.com/2013/04/02/fusilli-with-asparagus/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 teaspoons of the oil in a non-stick skillet over medium heat until shimmering.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the leeks and cook until softened and beginning to brown at the edges, about 5 to 7 minutes. Stir in the garlic and thyme and cook until fragrant, about 30 seconds.Slowly whisk in the broth and bring to a simmer, scraping up any browned bits.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Remove from heat; stir in the peas and lemon juice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let stand until the peas are heated through, at least 2 minutes. Season with salt and pepper to taste.Meanwhile, bring a large pot of water to a boil.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Add the asparagus and 1 teaspoon salt and cook, stirring often, until the asparagus is crisp-tender, 2 to 4 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the asparagus with a slotted spoon and set aside.Return the water to a boil, add the pasta, and cook according to the package directions until al dente. When the pasta is finished cooking, reserve \xbc cup of the pasta water, then drain the pasta and return it to the pot.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the arugula to the pasta and toss to wilt.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the leek-broth mixture, asparagus, goat cheese, and remaining 2 teaspoons of oil, toss to combine. Before serving, add the reserved cooking water as needed to loosen the sauce.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 269, u'instructions': u'Heat 2 teaspoons of the oil in a non-stick skillet over medium heat until shimmering. Add the leeks and cook until softened and beginning to brown at the edges, about 5 to 7 minutes. Stir in the garlic and thyme and cook until fragrant, about 30 seconds.Slowly whisk in the broth and bring to a simmer, scraping up any browned bits. Remove from heat; stir in the peas and lemon juice. Let stand until the peas are heated through, at least 2 minutes. Season with salt and pepper to taste.Meanwhile, bring a large pot of water to a boil. Add the asparagus and 1 teaspoon salt and cook, stirring often, until the asparagus is crisp-tender, 2 to 4 minutes. Remove the asparagus with a slotted spoon and set aside.Return the water to a boil, add the pasta, and cook according to the package directions until al dente. When the pasta is finished cooking, reserve \xbc cup of the pasta water, then drain the pasta and return it to the pot.Add the arugula to the pasta and toss to wilt. Add the leek-broth mixture, asparagus, goat cheese, and remaining 2 teaspoons of oil, toss to combine. Before serving, add the reserved cooking water as needed to loosen the sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/fusilli-with-asparagus-peas-and-arugula-521408', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}