{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/584798-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 584798, u'veryPopular': True, u'lowFodmap': False, u'title': u'Black Bean Patties with Avocado & Tomato Salsa', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 79.57, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'2 avocados, cut into 3/4 inch pieces', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'cut into 3/4 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/2 tsp freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 (15 oz.) can black beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'3 tbsp olive or canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1 cup cherry tomatoes, cut in half', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 1/4 cups cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20041, u'unit': u'cups'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'2 tbsp minced jalapeno pepper, membranes and seeds removed', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeds removed', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'2 tsp fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tsp'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 pieces day-old or toasted whole wheat sandwich bread', u'aisle': u'Bakery/Bread', u'name': u'white sandwich bread', u'metaInformation': [u'whole wheat', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 18069, u'unit': u'pieces'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.cookincanuck.com/2011/09/black-bean-patties-with-avocado-tomato-salsa-recipe/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the patties: In the bowl of a food processor, pulse sandwich bread to form breadcrumbs.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour into a bowl and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tablespoon olive or canola oil in a large skillet set over medium heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [], u'step': u'Add onion and saut\xe9 until soft.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, jalapeno, and cumin.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Saute for additional 2 minutes.  Scrape the mixture into the food processor.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add black beans, brown rice, lime juice, salt, and pepper.  Pulse until the beans are chopped, but not pureed.  Scrape the black bean mixture into a large bowl.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add half of the breadcrumbs and the chopped cilantro.  Stir the mixture until combined.Divide the mixture into 8 equal portions and form into patties. If the mixture is too moist to form patties, add more breadcrumbs.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place the patties on a baking sheet lined with plastic wrap and cover with additional plastic wrap.  Refrigerate for at least 1/2 hour.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tablespoon canola oil in a large skillet (preferably not nonstick, so a good crust can form) set over medium heat.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [], u'step': u'Add 4 patties and cook for 4 minutes per side.  Repeat with 1 tablespoon oil and remaining 4 patties.For the salsa, gently stir together avocado, tomatoes and lime juice.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve 2 patties on each plate, topped with salsa.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Argyle Reserve Pinot Noir. It has 4.3 out of 5 stars and a bottle costs about 30 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 11418, u'instructions': u'For the patties: In the bowl of a food processor, pulse sandwich bread to form breadcrumbs.  Pour into a bowl and set aside.Heat 1 tablespoon olive or canola oil in a large skillet set over medium heat.  Add onion and saut\xe9 until soft.  Add garlic, jalapeno, and cumin.  Saute for additional 2 minutes.  Scrape the mixture into the food processor.  Add black beans, brown rice, lime juice, salt, and pepper.  Pulse until the beans are chopped, but not pureed.  Scrape the black bean mixture into a large bowl.  Add half of the breadcrumbs and the chopped cilantro.  Stir the mixture until combined.Divide the mixture into 8 equal portions and form into patties. If the mixture is too moist to form patties, add more breadcrumbs.  Place the patties on a baking sheet lined with plastic wrap and cover with additional plastic wrap.  Refrigerate for at least 1/2 hour.Heat 1 tablespoon canola oil in a large skillet (preferably not nonstick, so a good crust can form) set over medium heat.  Add 4 patties and cook for 4 minutes per side.  Repeat with 1 tablespoon oil and remaining 4 patties.For the salsa, gently stir together avocado, tomatoes and lime juice.Serve 2 patties on each plate, topped with salsa.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-patties-with-avocado-tomato-salsa-584798', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}