{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/697823-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 697823, u'veryPopular': True, u'lowFodmap': False, u'title': u'Scallops in Saffron-Tarragon Broth', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 35, u'pricePerServing': 208.12, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'8 ounces baby red potatoes, cut into 1/4-inch-thick rounds', u'aisle': u'Produce', u'name': u'baby potatoes', u'metaInformation': [u'red', u'cut into 1/4-inch-thick rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11352, u'unit': u'ounces'}, {u'originalString': u'2 stalks celery, thinly sliced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'2 teaspoons chopped fresh tarragon', u'aisle': u'Produce', u'name': u'fresh tarragon', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2041, u'unit': u'teaspoons'}, {u'originalString': u'2 cloves garlic, thinly sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 cup grape tomatoes, halved', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'1 cup reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup thinly sliced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon saffron threads, (see Note)', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron threads', u'metaInformation': [u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2037, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound large dry sea scallops, (see Note)', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'dry', u'large', u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pound'}, {u'originalString': u'1 5-ounce can tomato juice, (scant 3/4 cup)', u'aisle': u'Beverages', u'name': u'tomato juice', u'metaInformation': [u'canned', u'(scant 3/4 cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 11886, u'unit': u'ounce'}, {u'originalString': u'1/4 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/scallops_in_saffron_tarragon_broth.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pat scallops dry and sprinkle both sides with salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large nonstick skillet over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the scallops and cook until light brown, 1 to 2 minutes per side.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to a plate.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add onion, celery and garlic to the pan and cook, stirring, until just beginning to soften, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add wine and simmer for 1 minute. Stir in potatoes, broth, tomatoes, tomato juice and saffron and bring to a boil. Reduce to a simmer, cover and cook until the potatoes are tender and the tomatoes are beginning to break down, 12 to 14 minutes.Return the scallops and any accumulated juices to the pan along with tarragon. Cover and cook until the scallops are just cooked through, 2 to 4 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'id': 11886, u'name': u'tomato juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}]}], u'name': u''}], u'aggregateLikes': 509, u'instructions': u'Pat scallops dry and sprinkle both sides with salt. Heat oil in a large nonstick skillet over medium-high heat. Add the scallops and cook until light brown, 1 to 2 minutes per side. Transfer to a plate. Add onion, celery and garlic to the pan and cook, stirring, until just beginning to soften, about 2 minutes. Add wine and simmer for 1 minute. Stir in potatoes, broth, tomatoes, tomato juice and saffron and bring to a boil. Reduce to a simmer, cover and cook until the potatoes are tender and the tomatoes are beginning to break down, 12 to 14 minutes.Return the scallops and any accumulated juices to the pan along with tarragon. Cover and cook until the scallops are just cooked through, 2 to 4 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/scallops-in-saffron-tarragon-broth-697823', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}