{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/471601-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 471601, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel Cake', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 46.62, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/2 cups sifted all-purpose flour, plus more for the pans', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'plus more for the pans', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 teaspoons kosher salt, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'4 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, softened, plus more for the pans', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'plus more for the pans', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'Hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}, {u'originalString': u'3/4 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/51156830', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'1 Make the cake: Preheat the oven to 350\xb0F. Grease and flour two round 9 by 2-inch cake pans.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Pour about a tablespoon of flour into each of the pans and roll it around, tapping as you go, until the sides and bottom are covered completely with a thin layer of flour. Tip the pans, and tap out excess flour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'2 In a large mixing bowl, mix thoroughly with a whisk the flour, baking powder, salt, and baking soda.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'3 In a separate large bowl, beat the butter with an electric mixer until creamy, about 30 seconds.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the sugar in 1/2-cup measures, beating about 15 seconds after each addition and scraping down the sides of the bowl if necessary, until the mixture has lightened in color and become fluffy, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the eggs and egg yolks, one at a time, and the vanilla, beating for 15 seconds after each addition.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'4', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the flour mixture to the butter mixture in thirds, alternating with additions of the milk. To avoid overmixing the batter, mix gently with a wooden spoon or rubber spatula after each addition, until the ingredient is just incorporated. Beat until all the ingredients have been incorporated, and then just a few strokes beyond. Divide the batter between the cake pans and spread the tops evenly.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'5', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake until a cake tester or toothpick emerges clean, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let the cakes cool in their pans on a rack for 10 minutes, then slide a thin paring knife around the edge of the pans, and invert the cakes. Turn each cake again so its rounded top is facing up, and cool the cakes completely on the rack.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the milk and 3 cups of the sugar into a large, deep, heavy-bottomed pot over medium-high heat, mixing with a whisk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the butter and the salt, whisking occasionally until the butter melts. When mixture just simmers, cut the heat, but keep over the warm burner.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'7', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour the remaining 1 cup sugar into a saucepan. Cook the sugar over medium-high heat until it becomes a syrup, stirring every so often with a wooden spoon as it begins to brown, until the sugar syrup is evenly amber colored, 5 to 8 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the syrup into the warm milk mixture, being very careful, as the caramel will bubble and sputter when it hits the hot milk. Turn the heat beneath the pot to high and, whisking gently until all the syrup has completely dissolved into the roiling milk mixture, continue to cook to the soft-ball stage, about 238\xb0F; this may take 8 to 12 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'8', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the heat beneath the caramel and gently whisk in the vanilla and the baking soda. Dip a spoon into the caramel, and let it cool to taste it. Season the caramel to taste with salt, and pour it into the bowl of a standing mixer (or use an electric hand-mixer and a large bowl). Beat on low speed as it cools, 15 to 20 minutes depending on the temperature of your kitchen, until the icing is creamy and thick (between 100\xb0F and 105\xb0F).', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the mixer stand and let cool 5 to 10 minutes more, until the icing is between 95\xb0F and 98\xb0F—it should fall off your spatula in a ribbon that remains discernible on the surface of the icing for 10 seconds.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'9 Set the first cake layer on a rack set over a sheet plan lined with waxed paper. Have an electric hand-mixer and the hot water nearby to blend a teaspoon or two into the icing if it becomes too thick to spread.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Pour enough of the icing over the cake to cover the top in a layer about 1/4 inch thick (if it drips over the edge in places, that's fine; this is an early test of whether it's going to set in place or not). Top the first cake with the second cake layer and pour the rest of the icing in stages over the top of the cake, letting it run down the sides and using an icing spatula to guide the icing around the cake as it drips, until the entire cake is covered, for a traditional, classic look. (If you prefer the dramatic look of cake layers peeking out from behind a curtain of icing drips, by all means choose that route!) If you need to reuse any icing that overflows into the pan, simply move the cake on its rack temporarily, scrape up the icing from the waxed paper with a spatula and return it to the bowl, replace the rack over the pan, and continue to ice the cake.", u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'10 Once the icing has set, using two spatulas carefully transfer the cake from the rack to a cake stand and let stand at room temperature beneath a cake dome until ready to serve. Only refrigerate if you plan to store the cake for more than 2 days.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Reprinted with permission from The Lee Bros. Charleston Kitchen by Matt Lee & Ted Lee, \xa9 2013 Clarkson Potter', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u"Matt Lee and Ted Lee, founders of The Lee Bros. Boiled Peanuts Catalogue, a mail-order source for Southern pantry staples, grew up in Charleston, South Carolina. They are the authors of The Lee Bros. Southern Cookbook, which won the James Beard Award for Cookbook of the Year in 2007, and The Lee Bros. Simple Fresh Southern, which won the IACP Award for Best American Cookbook in 2011. They are contributing editors for Travel + Leisure and contributors on Cooking Channel's Unique Eats.", u'number': 13, u'ingredients': []}], u'name': u'6 Make the icing'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Caramel Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 164, u'instructions': u"Preparation                                                        1 Make the cake: Preheat the oven to 350\xb0F. Grease and flour two round 9 by 2-inch cake pans. Pour about a tablespoon of flour into each of the pans and roll it around, tapping as you go, until the sides and bottom are covered completely with a thin layer of flour. Tip the pans, and tap out excess flour.                                                                2 In a large mixing bowl, mix thoroughly with a whisk the flour, baking powder, salt, and baking soda.                                                                3 In a separate large bowl, beat the butter with an electric mixer until creamy, about 30 seconds. Add the sugar in 1/2-cup measures, beating about 15 seconds after each addition and scraping down the sides of the bowl if necessary, until the mixture has lightened in color and become fluffy, about 2 minutes. Add the eggs and egg yolks, one at a time, and the vanilla, beating for 15 seconds after each addition.                                                                4 Add the flour mixture to the butter mixture in thirds, alternating with additions of the milk. To avoid overmixing the batter, mix gently with a wooden spoon or rubber spatula after each addition, until the ingredient is just incorporated. Beat until all the ingredients have been incorporated, and then just a few strokes beyond. Divide the batter between the cake pans and spread the tops evenly.                                                                5 Bake until a cake tester or toothpick emerges clean, about 30 minutes. Remove from the oven and let the cakes cool in their pans on a rack for 10 minutes, then slide a thin paring knife around the edge of the pans, and invert the cakes. Turn each cake again so its rounded top is facing up, and cool the cakes completely on the rack.                                                                6 Make the icing: Pour the milk and 3 cups of the sugar into a large, deep, heavy-bottomed pot over medium-high heat, mixing with a whisk. Add the butter and the salt, whisking occasionally until the butter melts. When mixture just simmers, cut the heat, but keep over the warm burner.                                                                7 Pour the remaining 1 cup sugar into a saucepan. Cook the sugar over medium-high heat until it becomes a syrup, stirring every so often with a wooden spoon as it begins to brown, until the sugar syrup is evenly amber colored, 5 to 8 minutes. Pour the syrup into the warm milk mixture, being very careful, as the caramel will bubble and sputter when it hits the hot milk. Turn the heat beneath the pot to high and, whisking gently until all the syrup has completely dissolved into the roiling milk mixture, continue to cook to the soft-ball stage, about 238\xb0F; this may take 8 to 12 minutes.                                                                8 Cut the heat beneath the caramel and gently whisk in the vanilla and the baking soda. Dip a spoon into the caramel, and let it cool to taste it. Season the caramel to taste with salt, and pour it into the bowl of a standing mixer (or use an electric hand-mixer and a large bowl). Beat on low speed as it cools, 15 to 20 minutes depending on the temperature of your kitchen, until the icing is creamy and thick (between 100\xb0F and 105\xb0F). Remove the bowl from the mixer stand and let cool 5 to 10 minutes more, until the icing is between 95\xb0F and 98\xb0F—it should fall off your spatula in a ribbon that remains discernible on the surface of the icing for 10 seconds.                                                                9 Set the first cake layer on a rack set over a sheet plan lined with waxed paper. Have an electric hand-mixer and the hot water nearby to blend a teaspoon or two into the icing if it becomes too thick to spread. Pour enough of the icing over the cake to cover the top in a layer about 1/4 inch thick (if it drips over the edge in places, that's fine; this is an early test of whether it's going to set in place or not). Top the first cake with the second cake layer and pour the rest of the icing in stages over the top of the cake, letting it run down the sides and using an icing spatula to guide the icing around the cake as it drips, until the entire cake is covered, for a traditional, classic look. (If you prefer the dramatic look of cake layers peeking out from behind a curtain of icing drips, by all means choose that route!) If you need to reuse any icing that overflows into the pan, simply move the cake on its rack temporarily, scrape up the icing from the waxed paper with a spatula and return it to the bowl, replace the rack over the pan, and continue to ice the cake.                                                                10 Once the icing has set, using two spatulas carefully transfer the cake from the rack to a cake stand and let stand at room temperature beneath a cake dome until ready to serve. Only refrigerate if you plan to store the cake for more than 2 days.                                                                            Reprinted with permission from The Lee Bros. Charleston Kitchen by Matt Lee & Ted Lee, \xa9 2013 Clarkson PotterMatt Lee and Ted Lee, founders of The Lee Bros. Boiled Peanuts Catalogue, a mail-order source for Southern pantry staples, grew up in Charleston, South Carolina. They are the authors of The Lee Bros. Southern Cookbook, which won the James Beard Award for Cookbook of the Year in 2007, and The Lee Bros. Simple Fresh Southern, which won the IACP Award for Best American Cookbook in 2011. They are contributing editors for Travel + Leisure and contributors on Cooking Channel's Unique Eats.", u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-cake-471601', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}