{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/625784-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 625784, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spicy Sweet Potato and Green Rice Burrito Bowls', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 386.18, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'1 avocado, pitted and sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'pitted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1\xbd cup baby spinach, lightly packed', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11457, u'unit': u'cup'}, {u'originalString': u'2 cans (14 ounces each) black beans or 3 cups cooked black beans, with their cooking liquid', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup cilantro (mostly leaves, stems are ok), lightly packed', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'packed', u'(mostly leaves, stems are ok)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'Chopped cilantro', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'Crumbled feta (optional, not vegan)', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'crumbled', u'(optional, not vegan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1019, u'unit': u'servings'}, {u'originalString': u'1 garlic clove, peeled, roughly chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'peeled', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon sherry vinegar or lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cups long grain brown rice', u'aisle': u'Pasta and Rice', u'name': u'long grain brown rice', u'metaInformation': [u'long grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20036, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup pepitas (green pumpkin seeds)', u'aisle': u'Savory Snacks', u'name': u'pepitas', u'metaInformation': [u'green', u'( pumpkin seeds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10012014, u'unit': u'cup'}, {u'originalString': u'Jarred mild salsa verde', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa verde', u'metaInformation': [u'jarred'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 27028, u'unit': u'servings'}, {u'originalString': u'\xbc teaspoon salt, more to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'Sea salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 jalape\xf1o or serrano pepper, seeded, membranes removed and roughly chopped', u'aisle': u'Produce', u'name': u'serrano pepper', u'metaInformation': [u'seeded', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/serrano-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11977, u'unit': u''}, {u'originalString': u'1 medium shallot, peeled and roughly chopped', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'medium', u'peeled', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'\xbd teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds sweet potatoes (3 to 4 medium sweet potatoes), peeled and sliced into 1-inch chunks', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'medium', u'peeled', u'sliced into 1-inch chunks', u'(3 to 4 sweet potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u'pounds'}, {u'originalString': u'3 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 76.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://cookieandkate.com/2015/vegan-sweet-potato-green-rice-burrito-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees Fahrenheit. Line one large, rimmed baking sheet and one smaller sheet with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the spinach, cilantro, jalapeo, shallot, garlic, salt and  cup of the vegetable broth in a food processor or blender. Blend until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat the oil in a heavy-bottomed pot over medium heat until shimmering.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rice and stir to coat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Spread the rice in an even layer on the bottom of the pot and let the rice lightly brown. This happens quickly! When the rice starts to brown, stir it and spread it out in an even layer again so that more of the rice browns.When most of the rice has lightly browned, scrape the green pure into the rice. Stir until the rice is evenly coated with green pure and continue to cook, stirring constantly, for a minute.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the rest of the vegetable broth to the pot. Bring to a boil, then reduce the heat to a low simmer and cover the pot. Cook the rice on a very low simmer until tender, 35 to 40 minutes.While the rice cooks, toss the sweet potatoes in the olive oil, smoked paprika and salt until the sweet potatoes are evenly coated in oil. Arrange in a single layer on your prepared baking sheet.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Bake for 35 to 40 minutes, tossing halfway, until the sweet potatoes are tender and caramelizing at the edges.Meanwhile, transfer the beans and their cooking liquid (don't drain the beans) to a medium pot. Stir in the cumin and chili powder and warm over medium heat. Once the beans are simmering, cover the beans and reduce heat to maintain a very gentle simmer until you're ready to serve.Once the rice is done cooking, remove the pot from heat. Uncover the pot and place a clean terry towel or dish towel over the pot, then recover. The towel will help absorb excess liquid as the rice continues to cook in its own steam. (If you don't have a clean towel, you can skip this step, just cover normally.)", u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Let sit for 10 minutes.Once the sweet potatoes are done cooking, toss the pepitas with  teaspoon olive oil and a sprinkle of salt on the small baking sheet. Toast the seeds in the oven for 4 to 5 minutes, until they're turning lightly golden and making little popping noises. Set aside to cool.Fluff the rice with a fork and season with salt if necessary.", u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove beans from heat, stir in the vinegar and season to taste with salt and pepper.Assemble your bowls: First add green rice, then use a slotted spoon or fork to transfer beans to the bowls. Top with sweet potatoes and add a few slices of avocado to each bowl. Sprinkle with toasted pepitas and cilantro and optional feta.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [], u'step': u'Serve with salsa verde on the side.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}]}], u'name': u''}], u'aggregateLikes': 503, u'instructions': u"Preheat oven to 425 degrees Fahrenheit. Line one large, rimmed baking sheet and one smaller sheet with parchment paper. Place the spinach, cilantro, jalapeo, shallot, garlic, salt and  cup of the vegetable broth in a food processor or blender. Blend until smooth.Heat the oil in a heavy-bottomed pot over medium heat until shimmering. Add the rice and stir to coat. Spread the rice in an even layer on the bottom of the pot and let the rice lightly brown. This happens quickly! When the rice starts to brown, stir it and spread it out in an even layer again so that more of the rice browns.When most of the rice has lightly browned, scrape the green pure into the rice. Stir until the rice is evenly coated with green pure and continue to cook, stirring constantly, for a minute. Add the rest of the vegetable broth to the pot. Bring to a boil, then reduce the heat to a low simmer and cover the pot. Cook the rice on a very low simmer until tender, 35 to 40 minutes.While the rice cooks, toss the sweet potatoes in the olive oil, smoked paprika and salt until the sweet potatoes are evenly coated in oil. Arrange in a single layer on your prepared baking sheet. Bake for 35 to 40 minutes, tossing halfway, until the sweet potatoes are tender and caramelizing at the edges.Meanwhile, transfer the beans and their cooking liquid (don't drain the beans) to a medium pot. Stir in the cumin and chili powder and warm over medium heat. Once the beans are simmering, cover the beans and reduce heat to maintain a very gentle simmer until you're ready to serve.Once the rice is done cooking, remove the pot from heat. Uncover the pot and place a clean terry towel or dish towel over the pot, then recover. The towel will help absorb excess liquid as the rice continues to cook in its own steam. (If you don't have a clean towel, you can skip this step, just cover normally.) Let sit for 10 minutes.Once the sweet potatoes are done cooking, toss the pepitas with  teaspoon olive oil and a sprinkle of salt on the small baking sheet. Toast the seeds in the oven for 4 to 5 minutes, until they're turning lightly golden and making little popping noises. Set aside to cool.Fluff the rice with a fork and season with salt if necessary. Remove beans from heat, stir in the vinegar and season to taste with salt and pepper.Assemble your bowls: First add green rice, then use a slotted spoon or fork to transfer beans to the bowls. Top with sweet potatoes and add a few slices of avocado to each bowl. Sprinkle with toasted pepitas and cilantro and optional feta. Serve with salsa verde on the side.", u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-sweet-potato-and-green-rice-burrito-bowls-625784', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}