{u'recipes': [{u'sourceName': u'An Edible Mosaic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/838765-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 838765, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Garlic and Chive White Bean Chowder with Leeks', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 62.57, u'creditText': u'An Edible Mosaic', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 oz (57 g) cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 57.0, u'consistency': u'solid', u'id': 1017, u'unit': u'g'}, {u'originalString': u'1\xbd (32 oz/6 cups) Swanson\xae Organic Free-Range Chicken (or Vegetable) Broth', u'aisle': u'Canned and Jarred', u'name': u'fat free chicken broth', u'metaInformation': [u'organic', u'swanson\xae', u'(32 oz/6 cups)', u'(or Vegetable)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.5, u'consistency': u'liquid', u'id': 6984, u'unit': u''}, {u'originalString': u'3 tablespoons minced fresh chives, divided', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'divided', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons minced fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'6 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'4 large leeks, white parts only, halved, thinly sliced, and rinsed well', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'white', u'large', u'rinsed', u'halved', u'thinly sliced', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1 (15.5 oz/439 g) can no-salt-added white beans (such as cannellini beans, great northern beans, etc.), rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'no salt added diced tomatoes', u'metaInformation': [u'white', u'rinsed', u'drained', u'canned', u'(such as cannellini beans, great northern beans, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 11885, u'unit': u'oz'}, {u'originalString': u'\xbe teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.anediblemosaic.com/creamy-garlic-and-chive-white-bean-chowder-with-leeks-gluten-free/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the butter to a 5-quart pot over medium heat. Once melted, add the leeks and cook until softened, about 6 to 8 minutes, stirring occasionally.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add the garlic and thyme and cook 1 minute more, stirring constantly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the broth, beans, salt, and pepper, and bring up to a boil. Cover the pot, turn the heat down to simmer, and cook 10 minutes, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the cream cheese, and carefully puree the soup using an immersion blender or in batches using a regular blender.Return the soup to the pot and bring it back up to a gentle simmer.Right before serving, stir in 2 tablespoons minced chives, reserving the remaining 1 tablespoon for garnish.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Riesling, and Sauvignon Blanc are my top picks for Chowder. Chowder can benefit from a crisp white to cut through the rich, creamy broth - or you can go big or go home with a rich, buttery chardonnay. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'riesling', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 52, u'instructions': u'Add the butter to a 5-quart pot over medium heat. Once melted, add the leeks and cook until softened, about 6 to 8 minutes, stirring occasionally.Add the garlic and thyme and cook 1 minute more, stirring constantly.Add the broth, beans, salt, and pepper, and bring up to a boil. Cover the pot, turn the heat down to simmer, and cook 10 minutes, stirring occasionally.Add the cream cheese, and carefully puree the soup using an immersion blender or in batches using a regular blender.Return the soup to the pot and bring it back up to a gentle simmer.Right before serving, stir in 2 tablespoons minced chives, reserving the remaining 1 tablespoon for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-garlic-and-chive-white-bean-chowder-with-leeks-838765', u'dishTypes': [u'soup'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}