{u'recipes': [{u'sourceName': u'Carries Experimental Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612415-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 612415, u'veryPopular': False, u'lowFodmap': False, u'title': u"Moscato Plum Chicken | Carrie's Experimental Kitchen", u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 208.53, u'creditText': u'Carries Experimental Kitchen', u'extendedIngredients': [{u'originalString': u'1/2 c. All Purpose Flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'2 tbsp. Butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. Canola Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'12 Chicken Tenderloins', u'aisle': u'Meat', u'name': u'chicken tenderloins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 1015062, u'unit': u''}, {u'originalString': u'Fresh Ground Black Pepper, as desired', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Kosher Salt, as desired', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 Plums, peeled and sliced', u'aisle': u'Produce', u'name': u'plums', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plums-red.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9279, u'unit': u''}, {u'originalString': u'1 c. Moscato Wine', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14084, u'unit': u'c'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.carriesexperimentalkitchen.com/moscato-plum-chicken/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}], u'step': u'Gently flatten the chicken with a meat mallet until uniform in size and thickness; then dredge in the flour. Repeat for all pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tbsp. of the butter and oil in a large saut pan over medium heat; then fry the chicken for approximately 3-4 minutes per side. If doing in batches, remove the cooked chicken until all pieces have been cooked through. When all pieces have been cooked place them all back into the skillet and add the wine, plums and remaining 1 tbsp. butter. Simmer over low heat for approximately 5 minutes until the sauce thickens slightly. Season with salt and pepper.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14084, u'name': u'wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'aggregateLikes': 11, u'instructions': u'Gently flatten the chicken with a meat mallet until uniform in size and thickness; then dredge in the flour. Repeat for all pieces. Heat 2 tbsp. of the butter and oil in a large saut pan over medium heat; then fry the chicken for approximately 3-4 minutes per side. If doing in batches, remove the cooked chicken until all pieces have been cooked through. When all pieces have been cooked place them all back into the skillet and add the wine, plums and remaining 1 tbsp. butter. Simmer over low heat for approximately 5 minutes until the sauce thickens slightly. Season with salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/moscato-plum-chicken-carries-experimental-kitchen-612415', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}