{u'recipes': [{u'sourceName': u'Food and Spice', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/794352-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 794352, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Potato Salad with Cashew Dressing and Fresh Basil', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 187.1, u'creditText': u"Lisa's Vegetarian Kitchen", u'extendedIngredients': [{u'originalString': u'3 to 4 tablespoons almond milk, or as needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'or as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 lb (700 g) baby potatoes', u'aisle': u'Produce', u'name': u'baby potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 700.0, u'consistency': u'solid', u'id': 11352, u'unit': u'g'}, {u'originalString': u'3/4 cup fresh basil leaves, roughly torn if large', u'aisle': u'Produce', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'1 1/2 tablespoons fresh chives, chopped', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh mint leaves, chopped', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons fresh parsley, trimmed and chopped', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'trimmed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup fresh or frozen peas, blanched', u'aisle': u'Produce', u'name': u'fresh peas', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'fresh ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 teaspoon Dijon honey mustard', u'aisle': u'Condiments', u'name': u'honey dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4703, u'unit': u'teaspoon'}, {u'originalString': u'juice from 2 lemons (3 tablespoons)', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 Kalamata olives, pitted and chopped (optional)', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'pitted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 1009195, u'unit': u''}, {u'originalString': u'3 to 4 tablespoons nutritional yeast, to taste', u'aisle': u'Spices and Seasonings;Health Foods', u'name': u'nutritional yeast', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93690, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'3/4 cup raw cashews, soaked in warm water for 3 hours and drained', u'aisle': u'Nuts;Savory Snacks', u'name': u'raw cashews', u'metaInformation': [u'raw', u'drained', u'for 3 hours and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'1 teaspoon rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons sea salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon Dijon grain mustard', u'aisle': u'Condiments', u'name': u'whole grain dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'teaspoon'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://foodandspice.blogspot.com/2016/07/creamy-potato-salad-with-cashew.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'side dish'], u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring the potatoes to a boil in a large pot of water. Reduce the heat to medium and cook until they are fork tender  about 10 to 12 minutes. Do not overcook.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain well and let cool for 10 minutes or longer before transferring to a large bowl along with the peas, basil leaves and olives if using.To make the dressing, combine all the ingredients in a small blender or food processor and pulse into smooth. If it is too thick, add a bit more olive oil or almond milk. Taste for seasoning and adjust nutritional yeast, salt and pepper to taste. Toss the potatoes with the dressing and serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'id': 93690, u'name': u'nutritional yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'aggregateLikes': 18, u'instructions': u'Bring the potatoes to a boil in a large pot of water. Reduce the heat to medium and cook until they are fork tender  about 10 to 12 minutes. Do not overcook. Drain well and let cool for 10 minutes or longer before transferring to a large bowl along with the peas, basil leaves and olives if using.To make the dressing, combine all the ingredients in a small blender or food processor and pulse into smooth. If it is too thick, add a bit more olive oil or almond milk. Taste for seasoning and adjust nutritional yeast, salt and pepper to taste. Toss the potatoes with the dressing and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-potato-salad-with-cashew-dressing-and-fresh-basil-794352', u'license': u'CC BY 2.5 CA', u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}