{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'caribbean', u'central american'], u'image': u'https://spoonacular.com/recipeImages/397648-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 397648, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppermint Ribbon Cake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 26.43, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u"1 cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 tablespoon 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup plus 2 tablespoons crushed peppermint candies, divided', u'aisle': u'Sweet Snacks', u'name': u'peppermint candies', u'metaInformation': [u'divided', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 98859, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon red food coloring', u'aisle': u'Baking', u'name': u'red food coloring', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10711111, u'unit': u'teaspoon'}, {u'originalString': u'1 package white cake mix (regular size)', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white', u'(regular size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'package'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/peppermint-ribbon-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare cake batter according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer 1 cup to a small bowl; stir in the extract, food coloring and 1/2 cup crushed candies.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spoon 2 cups of remaining batter into a greased and floured 10-in. fluted tube pan. Carefully top with peppermint batter; do not swirl. Top with remaining plain batter.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake at 350\xb0 for 35-45 minutes or until a toothpick inserted near the center comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Combine confectioners' sugar and milk; drizzle over cake. Sprinkle with remaining crushed candies.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u"Directions                                                                                Prepare cake batter according to package directions. Transfer 1 cup to a small bowl; stir in the extract, food coloring and 1/2 cup crushed candies.                                                                                           Spoon 2 cups of remaining batter into a greased and floured 10-in. fluted tube pan. Carefully top with peppermint batter; do not swirl. Top with remaining plain batter.                                                                                           Bake at 350\xb0 for 35-45 minutes or until a toothpick inserted near the center comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely.                                                                                           Combine confectioners' sugar and milk; drizzle over cake. Sprinkle with remaining crushed candies.                                        Yield: 12 servings.                                                                                                                         Originally published as Peppermint Ribbon Cake in  Taste of Home Christmas AnnualAnnual 2009, p156                                                                                                                                                                                                       Nutritional Facts                                                                             1 slice equals 300 calories, 10 g fat (2 g saturated fat), trace cholesterol, 312 mg sodium, 49 g carbohydrate, 0 fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-ribbon-cake-397648', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}