{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/549487-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 549487, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Parmesan Subs', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 261.09, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'3 Cloves of Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Cloves', u'unitShort': u'Cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'Cloves'}, {u'originalString': u"Garlic Salt (we prefer Johnny's or Lawry's)", u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [u"(we prefer Johnny's or Lawry's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'servings'}, {u'originalString': u'1/2 Lb Ground Turkey', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'Lbs', u'unitShort': u'Lb', u'amount': 0.5, u'consistency': u'solid', u'id': 5662, u'unit': u'Lb'}, {u'originalString': u'Mozzarella', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'oz'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 Pkg Johnsonville Sweet Italian Sausage', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'sweet', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'Pkgs', u'unitShort': u'Pkg', u'amount': 0.5, u'consistency': u'solid', u'id': 1017063, u'unit': u'Pkg'}, {u'originalString': u'Sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'4Hoagie rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u'servings'}, {u'originalString': u'1/2 Sweet onion or 2 shallots, minced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'2 Small Cans Tomato Sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'Cans', u'unitShort': u'Cans', u'amount': 2.0, u'consistency': u'solid', u'id': 11549, u'unit': u'Cans'}, {u'originalString': u'1 Large Can Diced Tomatoes with Garlic and Basil', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'with garlic and basil', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'Can'}, {u'originalString': u'Unsalted Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'servings'}, {u'originalString': u'1 Splash Red Wine (we use cooking red wine and I think it works great)', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [u'red', u'(we use cooking wine and I think it works great)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 14084, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2009/05/chicken-parm-subs.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drizzle olive oil in a large pan and heat to med.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion and cook until translucent.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add garlic and cook until fragrant.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add meat and cook until just barely done.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the rest of the ingredients, kosher salt and fresh black pepper to taste. Simmer for 1 hour.Cook the chicken and proceed by heating the oven to broil. Butter the insides of the bread and sprinkle with garlic salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}]}, {u'equipment': [], u'step': u'Add a spoonful or two of sauce to the bottom and place the chicken on top. Cover the chicken in the sauce and add cheese.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place under the broiler until the cheese is bubbly and add a dash of parsley to brighten the meal. Enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Ricasoli Castello di Brolio Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 46 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage.', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 425, u'instructions': u'Drizzle olive oil in a large pan and heat to med. Add onion and cook until translucent. Add garlic and cook until fragrant.Add meat and cook until just barely done. Add the rest of the ingredients, kosher salt and fresh black pepper to taste. Simmer for 1 hour.Cook the chicken and proceed by heating the oven to broil. Butter the insides of the bread and sprinkle with garlic salt. Add a spoonful or two of sauce to the bottom and place the chicken on top. Cover the chicken in the sauce and add cheese. Place under the broiler until the cheese is bubbly and add a dash of parsley to brighten the meal. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-parmesan-subs-549487', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}