{u'recipes': [{u'sourceName': u'Oh My Veggies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/495634-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 495634, u'veryPopular': True, u'lowFodmap': False, u'title': u'Curried Red Lentil & Quinoa Bowls with Cilantro-Mint Chutney', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 153.63, u'creditText': u'Oh My Veggies', u'extendedIngredients': [{u'originalString': u'1 tablespoons apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup packed cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 tablespoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon Madras (hot) curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [u'hot', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2015, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 (1-inch) piece ginger, grated', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'2 tablespoons chopped golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9297, u'unit': u'tablespoons'}, {u'originalString': u'1/8 teaspoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'Lime wedges and Cilantro-Mint Chutney for serving', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1/2 cup packed mint leaves', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1 cup uncooked quinoa, rinsed', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'rinsed', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'1 cup split red lentils, rinsed and picked over', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red lentils', u'metaInformation': [u'split', u'red', u'picked over', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10016069, u'unit': u'cup'}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 1/2 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://ohmyveggies.com/curried-red-lentil-quinoa-bowls-with-cilantro-mint-chutney/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the quinoa and water in a medium saucepan. Bring to a boil, then reduce heat to low and cover. Simmer for about 15 minutes, or until the water is absorbed.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove from heat and let stand, covered, for 5 minutes.While the quinoa is cooking, start the curried lentils. Melt the coconut oil in a large saucepan over medium heat.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [], u'step': u'Add the onion and cook for about 5 minutes, until softened and just beginning to turn golden brown. Stir in the ginger, garlic, and curry powder; cook for about 1 minute, until fragrant.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the lentils and cook 1 minute more.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Pour in the broth and bring the mixture to a boil. Partially cover the saucepan and reduce the heat to low. Simmer for 10-12 minutes, until the lentils have fallen apart, then remove the lid and cook for about 5 minutes more to thicken. Season with salt and pepper to taste.Fluff the quinoa with a fork and divide it into four bowls, then ladle the curried red lentils over the quinoa.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'id': 10016069, u'name': u'red lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Serve with lime wedges and Cilantro-Mint Chutney.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine all of the ingredients through coriander in the small bowl of a food processor. Process until smooth, then season to taste with salt.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 714, u'instructions': u'Combine the quinoa and water in a medium saucepan. Bring to a boil, then reduce heat to low and cover. Simmer for about 15 minutes, or until the water is absorbed. Remove from heat and let stand, covered, for 5 minutes.While the quinoa is cooking, start the curried lentils. Melt the coconut oil in a large saucepan over medium heat. Add the onion and cook for about 5 minutes, until softened and just beginning to turn golden brown. Stir in the ginger, garlic, and curry powder; cook for about 1 minute, until fragrant. Add the lentils and cook 1 minute more.Pour in the broth and bring the mixture to a boil. Partially cover the saucepan and reduce the heat to low. Simmer for 10-12 minutes, until the lentils have fallen apart, then remove the lid and cook for about 5 minutes more to thicken. Season with salt and pepper to taste.Fluff the quinoa with a fork and divide it into four bowls, then ladle the curried red lentils over the quinoa. Serve with lime wedges and Cilantro-Mint Chutney.Combine all of the ingredients through coriander in the small bowl of a food processor. Process until smooth, then season to taste with salt.', u'spoonacularSourceUrl': u'https://spoonacular.com/curried-red-lentil-quinoa-bowls-with-cilantro-mint-chutney-495634', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}