{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/517748-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 517748, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Vegetable Chili', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 274.41, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 cup light beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'1 (15 ounce) can black beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounce'}, {u'originalString': u'1 Tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tablespoon'}, {u'originalString': u'1/3 cup freshly chopped cilantro (for serving)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped', u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 medium jalape\xf1o chiles, seeded and finely chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno chiles', u'metaInformation': [u'medium', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'3/4 cup shredded reduced-fat cheddar cheese (for serving)', u'aisle': u'Cheese', u'name': u'low fat shredded cheddar cheese', u'metaInformation': [u'shredded', u'reduced-fat', u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1001168, u'unit': u'cup'}, {u'originalString': u'4 Tablespoons reduced-fat sour cream (for serving)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'reduced-fat', u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1179, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 large portobello mushroom caps', u'aisle': u'Produce', u'name': u'portobello mushroom caps', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11265, u'unit': u''}, {u'originalString': u'1 large red bell pepper, quartered', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'large', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 medium red onion, sliced 3/4-inch thick', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 Tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'Tablespoons'}, {u'originalString': u'1 cup vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'1 large yellow bell pepper, quartered', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'large', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}, {u'originalString': u'2 medium zucchini, sliced 1/2-inch thick', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.recipegirl.com/2008/09/21/grilled-vegetable-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat a grill to medium-high. Lightly brush the zucchini, bell peppers, portobellos and red onion with 3 Tablespoons olive oil; season with salt and pepper. Cover and grill, turning once, until charred, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'id': 11265, u'name': u'portobello mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Transfer to a plate to cool. Chop into 1/2-inch chunks.2.  In a large saucepan, heat remaining 1 Tablespoon olive oil over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add garlic and jalape\xf1os and cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the black beans and heat through. Stir in grilled vegetables and chili powder; season with salt and pepper. Stir in tomato paste and cook for 2 minutes. Stir in the beer and cook until slightly reduced, about 10 minutes. Stir in vegetable broth and simmer over low heat until thickened, about 5 minutes.3.  Divide chili among 4 bowls. Top with cilantro, cheese and sour cream.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Campo Viejo Cava Brut ros\xe9 with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A bright sparkling pink color. Pleasant and powerful on the nose with a strong presence of ripe red berries.With has a rounded, pleasant feel in the mouth.', u'title': u'Campo Viejo Cava Brut Rose', u'price': u'$11.99', u'id': 468840, u'link': u'https://www.wine.com/product/campo-viejo-cava-brut-rose/132863', u'imageUrl': u'https://spoonacular.com/productImages/468840-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'1.  Preheat a grill to medium-high. Lightly brush the zucchini, bell peppers, portobellos and red onion with 3 Tablespoons olive oil; season with salt and pepper. Cover and grill, turning once, until charred, about 8 minutes. Transfer to a plate to cool. Chop into 1/2-inch chunks.2.  In a large saucepan, heat remaining 1 Tablespoon olive oil over medium heat. Add garlic and jalape\xf1os and cook for 1 minute. Add the black beans and heat through. Stir in grilled vegetables and chili powder; season with salt and pepper. Stir in tomato paste and cook for 2 minutes. Stir in the beer and cook until slightly reduced, about 10 minutes. Stir in vegetable broth and simmer over low heat until thickened, about 5 minutes.3.  Divide chili among 4 bowls. Top with cilantro, cheese and sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-vegetable-chili-517748', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl', u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}