{u'recipes': [{u'sourceName': u'My Colombian Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/227335-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 227335, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quinoa con Vegetales Asados (Quinoa with Roasted Vegetables)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 314.2, u'creditText': u'My Colombian Recipes', u'extendedIngredients': [{u'originalString': u'Queso Fresco or feta cheese for serving', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1019, u'unit': u'servings'}, {u'originalString': u'Fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'5 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 pint of grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'pint'}, {u'originalString': u'1 green pepper, sliced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1/4 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 orange bell pepper', u'aisle': u'Produce', u'name': u'orange bell pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'2 cups quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cups'}, {u'originalString': u'1 red bell pepper, sliced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Sea salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 yellow zucchini, sliced', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'yellow', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 76.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.mycolombianrecipes.com/quinoa-con-vegetales-asados-quinoa-with-roasted-vegetables', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u're-heat the oven to 350F.\xa0', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Put the vegetables in a baking dish lined with baking paper to prevent them from sticking.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Drizzle with olive oil and season with cumin, salt and pepper. Use your hands to mix well, then roast for 20-30 minutes.Rinse the quinoa in a fine-meshed strainer. In a medium saucepan place the quinoa and 4 cups water until boiling. Reduce heat and simmer until water is absorbed and quinoa fluffs up, about 15 minutes. Set aside.In a large mixing bowl combine the quinoa and roasted vegetables. Adjust the seasoning, add lemon juice, and sprinkle cheese and parsley on top.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Serve at room temperature.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 29, u'instructions': u're-heat the oven to 350F.\xa0Put the vegetables in a baking dish lined with baking paper to prevent them from sticking. Drizzle with olive oil and season with cumin, salt and pepper. Use your hands to mix well, then roast for 20-30 minutes.Rinse the quinoa in a fine-meshed strainer. In a medium saucepan place the quinoa and 4 cups water until boiling. Reduce heat and simmer until water is absorbed and quinoa fluffs up, about 15 minutes. Set aside.In a large mixing bowl combine the quinoa and roasted vegetables. Adjust the seasoning, add lemon juice, and sprinkle cheese and parsley on top. Serve at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/quinoa-con-vegetales-asados-quinoa-with-roasted-vegetables-227335', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}