{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/760961-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760961, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Hawaii', u'diets': [], u'pricePerServing': 116.0, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbc cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbc cup shredded coconut as garnish', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'2 Tbs. diced crystallized ginger, or more as desired, for garnish', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'crystallized ginger', u'metaInformation': [u'diced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-ginger-or-crystallized-ginger.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 93751, u'unit': u'Tbs'}, {u'originalString': u'1 pkg. instant coconut-flavored pudding mix', u'aisle': u'Baking', u'name': u'instant lemon pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 19332, u'unit': u'pkg'}, {u'originalString': u'\xbc cup crushed macadamia nuts as garnish', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'macadamia nuts', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macadamia-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12131, u'unit': u'cup'}, {u'originalString': u'1 \xbe cups nonfat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}, {u'originalString': u'1 prepared crumb pie shell', u'aisle': u'Refrigerated', u'name': u'pie shell', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'1 \xbe cups canned shredded pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'shredded', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 9266, u'unit': u'cups'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/baked-hawaii/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix instant pudding with milk and vanilla extract, and pour into prepared pie shell. Put in freezer immediately.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Drain pineapple, and reserve juice for another use. Squeeze excess juice from shreds, and put shreds in baking dish. Sprinkle with brown sugar, and bake for 15 minutes, or until sugar bubbles.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven. Take firmed pudding mixture from freezer, spoon pineapple mixture over top and garnish with macadamia nuts, coconut  shreds and crystallized ginger.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-ginger-or-crystallized-ginger.jpg', u'id': 93751, u'name': u'candied ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macadamia-nuts.jpg', u'id': 12131, u'name': u'macadamia nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'aggregateLikes': 35, u'instructions': u'Preheat oven to 450F.Mix instant pudding with milk and vanilla extract, and pour into prepared pie shell. Put in freezer immediately.Drain pineapple, and reserve juice for another use. Squeeze excess juice from shreds, and put shreds in baking dish. Sprinkle with brown sugar, and bake for 15 minutes, or until sugar bubbles. Remove from oven. Take firmed pudding mixture from freezer, spoon pineapple mixture over top and garnish with macadamia nuts, coconut  shreds and crystallized ginger.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-hawaii-760961', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}