{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/465402-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 465402, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cookie Burgers', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 52.75, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup baking cocoa', u'aisle': u'Baking', u'name': u'baking cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3/4 cup flaked coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u"2-2/3 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 package (17-1/2 ounces) sugar cookie mix', u'aisle': u'Baking', u'name': u'gf sugar cookie mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 17.0, u'consistency': u'solid', u'id': 99046, u'unit': u'ounces'}, {u'originalString': u'5 to 6 drops green food coloring', u'aisle': u'Baking', u'name': u'green food coloring', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 5.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups peanut butter chips, chopped', u'aisle': u'Baking', u'name': u'peanut butter chips', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93762, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 drops yellow food coloring, optional', u'aisle': u'Baking', u'name': u'yellow food coloring', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 2.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cookie-burgers', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Prepare cookie dough according to package directions; add yellow food coloring if desired. Stir in peanut butter chips. Shape into 1-1/4-in. balls; place 2 in. apart on ungreased baking sheets. Flatten slightly with a glass.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'yellow food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 93762, u'name': u'peanut butter chips'}]}, {u'equipment': [], u'step': u'Bake at 375\xb0 for 9-10 minutes or until lightly browned.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove to wire racks to cool.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Place coconut in a plastic bag; sprinkle 5-6 drops green food coloring into bag and shake until color is evenly distributed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'green food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, cream butter until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u"Add the confectioners' sugar, cocoa, milk and vanilla; beat until smooth.  Frost the bottoms of 22 cookies; sprinkle with coconut. Top with remaining cookies and gently squeeze together.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'aggregateLikes': 59, u'instructions': u'Directions                                                                                Prepare cookie dough according to package directions; add yellow food coloring if desired. Stir in peanut butter chips. Shape into 1-1/4-in. balls; place 2 in. apart on ungreased baking sheets. Flatten slightly with a glass. Bake at 375\xb0 for 9-10 minutes or until lightly browned.  Remove to wire racks to cool.                                                                                             Place coconut in a plastic bag; sprinkle 5-6 drops green food coloring into bag and shake until color is evenly distributed.                                                                                             In a small bowl, cream butter until smooth. Add the confectioners\' sugar, cocoa, milk and vanilla; beat until smooth.  Frost the bottoms of 22 cookies; sprinkle with coconut. Top with remaining cookies and gently squeeze together.                                        Yield: 22 sandwich cookies.                                                                                                     Editor\'s Note: was "You may substitute your favorite sugar cookie recipe for the cookie mix, eggs oil and water; just add the peanut butter chips" Now "You may substitute your favorite sugar cookie recipe for the cookie mix; just add the yellow food coloring if desired and the peanut butter chips" EO 6-24-05                                                                                                Originally published as Cookie Burgers in  Quick CookingMay/June 1998, p41                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cookie-burgers-465402', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 22, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}