{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/525001-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 525001, u'veryPopular': False, u'lowFodmap': True, u'title': u'Gael Greene’s Morning After Orange Fruit Soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 138.67, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u'\xbd cup frozen concentrated orange juice', u'aisle': u'Frozen', u'name': u'concentrated orange juice', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9214, u'unit': u'cup'}, {u'originalString': u'2 cups fruit (chopped fruit*)', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'chopped', u'( fruit*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9431, u'unit': u'cups'}, {u'originalString': u'2 tablespoons quick-cooking tapioca', u'aisle': u'Baking', u'name': u'quick cooking tapioca', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93660, u'unit': u'tablespoons'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1-1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://simple-nourished-living.com/2012/05/gael-greenes-morning-after-orange-fruit-soup-46-on-gourmets-50-women-game-changers-in-food/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, mix together the instant tapioca and water. Cook over medium heat, stirring constantly, until it comes to a full boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from the heat and stir in the sugar, salt, and orange juice concentrate, until well blended.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9214, u'name': u'orange juice concentrate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let the mixture cool for 15 minutes, then stir it again. Cover and chill for at least 3 hours.Just before serving, fold in the fruit.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve in chilled bowls or balloon goblets.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 14, u'instructions': u'In a small saucepan, mix together the instant tapioca and water. Cook over medium heat, stirring constantly, until it comes to a full boil.Remove pan from the heat and stir in the sugar, salt, and orange juice concentrate, until well blended. Let the mixture cool for 15 minutes, then stir it again. Cover and chill for at least 3 hours.Just before serving, fold in the fruit.Serve in chilled bowls or balloon goblets.', u'spoonacularSourceUrl': u'https://spoonacular.com/gael-greenes-morning-after-orange-fruit-soup-525001', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}