{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/759521-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_FULL', u'id': 759521, u'veryPopular': True, u'lowFodmap': False, u'title': u'Perfect Steamed Artichokes', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 130.49, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'4 globe artichokes', u'aisle': u'Produce', u'name': u'artichokes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11007, u'unit': u''}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 clove garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'Chopped parsley for garnish, optional', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}], u'healthScore': 67.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/perfect-steamed-artichokes/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Break off artichoke stems to remove tough fibers.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/steamer.jpg', u'id': 404767, u'name': u'steamer basket'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Cut stem ends. Trim off pointed leaf tops of artichokes with scissors. Rub cut parts with lemon half.2. Fill large pot with 2 inches water, and add bay leaf and garlic clove. Squeeze juice from lemon halves into water, and place steamer basket in pot. Set artichokes top down in steamer basket, cover, and bring water to a boil. 3. Reduce heat to medium, and steam artichokes, covered, 45 to 50 minutes, or until a bottom leaf from each base pulls away easily.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Remove from heat, and cool to room temperature. Sprinkle with chopped parsley, if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve with a dipping sauce, if desired.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 444, u'instructions': u'1. Break off artichoke stems to remove tough fibers. Cut stem ends. Trim off pointed leaf tops of artichokes with scissors. Rub cut parts with lemon half.2. Fill large pot with 2 inches water, and add bay leaf and garlic clove. Squeeze juice from lemon halves into water, and place steamer basket in pot. Set artichokes top down in steamer basket, cover, and bring water to a boil. 3. Reduce heat to medium, and steam artichokes, covered, 45 to 50 minutes, or until a bottom leaf from each base pulls away easily. Remove from heat, and cool to room temperature. Sprinkle with chopped parsley, if desired. Serve with a dipping sauce, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/perfect-steamed-artichokes-759521', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}