{u'recipes': [{u'sourceName': u'Moms Dish', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/717560-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 717560, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hummus Eggplant Canapes', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 26.08, u'creditText': u'Moms Dish', u'extendedIngredients': [{u'originalString': u'1 Baguette', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'3 cups Eggplant Ikra Spread', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11209, u'unit': u'cups'}, {u'originalString': u'Fresh Herbs; for garnish', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 40.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'servings'}, {u'originalString': u'2 cups You Favorite Hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://momsdish.com/recipe/733/hummus-eggplant-canapes', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare all ingredients for the recipe. Slice baguette into half inch slices. Apply a spoonful of hummus onto the baguette slices.Top it off with eggplant and decorate it with garnish. Keep them covered and refrigerated until serving.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Hummus. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Prepare all ingredients for the recipe. Slice baguette into half inch slices. Apply a spoonful of hummus onto the baguette slices.Top it off with eggplant and decorate it with garnish. Keep them covered and refrigerated until serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/hummus-eggplant-canapes-717560', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 40, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}