{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205428-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205428, u'veryPopular': False, u'lowFodmap': False, u'title': u'Decadent Chocolate Coins', u'diets': [], u'pricePerServing': 8.92, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 tablespoons Dutch-processed cocoa powder', u'aisle': u'Baking', u'name': u'dutch processed cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dutch-process-cocoa-powder.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10019165, u'unit': u'tablespoons'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 cup plus 2 tablespoons packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 teaspoons grated orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoons'}, {u'originalString': u'1 cup semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon table salt', u'aisle': u'Spices and Seasonings', u'name': u'table salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons (1/2 stick) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/03/one-girl-cookies-decadent-chocolate-coins-cookie-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the chocolate chips and the butter into a microwave-safe bowl, and heat on high power for 1 minute. Stir them together, and then heat for 1 additional minute. You may need to heat the mixture for an additional minute or more, but be sure to stir the mixture thoroughly between heatings and do not overheat it.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let the chocolate cool for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, whisk together the flour, brown sugar, cocoa powder, and salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of an electric mixer fitted with the paddle attachment, combine the eggs and orange zest and mix on low speed for 1 minute. With the mixer running on low speed, pour in the melted chocolate and mix for 1 minute, scraping down the sides of the bowl as needed.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the flour mixture and mix on low speed for 10 seconds.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Turn the dough out onto a lightly floured work surface and knead it for about 30 seconds, until all of the flour has been incorporated and the dough comes together. Divide the dough in half; cover one half with plastic wrap and set it aside.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'5', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Place a sheet of parchment paper on a work surface, and put the other half of the dough on the parchment. Flatten the dough slightly with your hand and then top it with a second sheet of parchment. With a rolling pin, roll the dough out between the sheets of parchment to about 1/8-inch thickness. You can use a light dusting of flour if the dough is sticky. Unwrap the other half of the dough and roll it out as you did the first half.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer the dough, still sandwiched between the parchment, to a baking sheet and chill it in the refrigerator for about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'6', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350\xb0F.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'7', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Remove the dough from the refrigerator, peel off both sheets of parchment, and put the dough on a cutting board. Using a cookie cutter (you can use whatever shape you desire, but make it about 2 1/2 inches in diameter), cut cookies out of the dough, rerolling the scraps once.', u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Put the cookies on a parchment paper–lined baking sheet, spacing them 1 inch apart.', u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'8', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Bake the cookies for 10 to 12 minutes. The cookies are done when they begin to feel slightly firm and you can smell the chocolate. Be careful not to overbake them.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 20, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer the cookies to a wire rack and let them cool.', u'number': 21, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 26, u'instructions': u'Procedures                                                                              1                                                                             Put the chocolate chips and the butter into a microwave-safe bowl, and heat on high power for 1 minute. Stir them together, and then heat for 1 additional minute. You may need to heat the mixture for an additional minute or more, but be sure to stir the mixture thoroughly between heatings and do not overheat it. Let the chocolate cool for 5 minutes.                                                                                                                            2                                                                            In a medium bowl, whisk together the flour, brown sugar, cocoa powder, and salt.                                                                                                                            3                                                                            In the bowl of an electric mixer fitted with the paddle attachment, combine the eggs and orange zest and mix on low speed for 1 minute. With the mixer running on low speed, pour in the melted chocolate and mix for 1 minute, scraping down the sides of the bowl as needed. Add the flour mixture and mix on low speed for 10 seconds.                                                                                                                            4                                                                            Turn the dough out onto a lightly floured work surface and knead it for about 30 seconds, until all of the flour has been incorporated and the dough comes together. Divide the dough in half; cover one half with plastic wrap and set it aside.                                                                                                                            5                                                                            Place a sheet of parchment paper on a work surface, and put the other half of the dough on the parchment. Flatten the dough slightly with your hand and then top it with a second sheet of parchment. With a rolling pin, roll the dough out between the sheets of parchment to about 1/8-inch thickness. You can use a light dusting of flour if the dough is sticky. Unwrap the other half of the dough and roll it out as you did the first half. Transfer the dough, still sandwiched between the parchment, to a baking sheet and chill it in the refrigerator for about 30 minutes.                                                                                                                            6                                                                            Preheat the oven to 350\xb0F.                                                                                                                            7                                                                            Remove the dough from the refrigerator, peel off both sheets of parchment, and put the dough on a cutting board. Using a cookie cutter (you can use whatever shape you desire, but make it about 2 1/2 inches in diameter), cut cookies out of the dough, rerolling the scraps once. Put the cookies on a parchment paper–lined baking sheet, spacing them 1 inch apart.                                                                                                                            8                                                                            Bake the cookies for 10 to 12 minutes. The cookies are done when they begin to feel slightly firm and you can smell the chocolate. Be careful not to overbake them. Transfer the cookies to a wire rack and let them cool.', u'spoonacularSourceUrl': u'https://spoonacular.com/decadent-chocolate-coins-205428', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}