{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/464507-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 464507, u'veryPopular': False, u'lowFodmap': False, u'title': u'Parmesan Ham Frittata', u'diets': [u'gluten free', u'primal', u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 116.66, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup cubed fully cooked ham', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'cubed', u'fully cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 7214, u'unit': u'cup'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup chopped green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/parmesan-ham-frittata', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a 6-in. broiler-proof skillet, saute the onion, green pepper and garlic in oil. Reduce heat to medium. In a bowl, beat eggs, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add egg mixture and ham to vegetables.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'As eggs set, lift edges, letting uncooked portion flow underneath. When eggs are nearly set, sprinkle with cheese. Broil 4-5 in. from the heat for 1-2 minutes or until eggs are completely set.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine are my top picks for Frittata. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. You could try Champagne Marc Hebrart Cuvee de Reserve Brut Premier Cru. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 48 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"The signature are there, and there's a stealthy richness on the mid-palate; with five minutes in the glass it really exhales. A sumptuous yet articulate wine.", u'title': u'Champagne Marc Hebrart Cuvee de Reserve Brut Premier Cru', u'price': u'$47.99', u'id': 464318, u'link': u'https://www.wine.com/product/champagne-marc-hebrart-cuvee-de-reserve-brut-premier-cru/147542', u'imageUrl': u'https://spoonacular.com/productImages/464318-312x231.jpg'}]}, u'aggregateLikes': 44, u'instructions': u'Directions                                                                                In a 6-in. broiler-proof skillet, saute the onion, green pepper and garlic in oil. Reduce heat to medium. In a bowl, beat eggs, salt and pepper. Add egg mixture and ham to vegetables.                                                                                            As eggs set, lift edges, letting uncooked portion flow underneath. When eggs are nearly set, sprinkle with cheese. Broil 4-5 in. from the heat for 1-2 minutes or until eggs are completely set.                                        Yield: 2 servings.                                                                                                                         Originally published as Parmesan Ham Frittata in  ReminisceMay/June 2001, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1/2 each) equals 388 calories, 30 g fat (8 g saturated fat), 451 mg cholesterol, 761 mg sodium, 6 g carbohydrate, 1 g fiber, 24 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/parmesan-ham-frittata-464507', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}