{u'recipes': [{u'sourceName': u'Amys Healthy Baking', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/592858-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 592858, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Brownie Shortbread Parfaits + A Giveaway! {Ended}', u'diets': [], u'pricePerServing': 163.03, u'creditText': u'Amys Healthy Baking', u'extendedIngredients': [{u'originalString': u'2 tsp agave', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tsp'}, {u'originalString': u'1 tsp unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9019, u'unit': u'tsp'}, {u'originalString': u'1 c plain nonfat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'c'}, {u'originalString': u'7 Walkers Mini Scottie Dogs Pure Butter Shortbread cookies, divided', u'aisle': u'Sweet Snacks', u'name': u'shortbread cookies', u'metaInformation': [u'pure', u'mini', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 18192, u'unit': u''}, {u'originalString': u'\xbc c diced strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9316, u'unit': u'c'}, {u'originalString': u'1 \xbc tsp Truvia (or other sweetener, to taste)', u'aisle': u'Baking', u'name': u'truvia', u'metaInformation': [u'to taste', u'(or other sweetener, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'2 tbsp unsweetened cocoa powder (measured correctly)', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'(measured correctly)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 tbsp water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}, {u'originalString': u'1 \xbd tbsp whole wheat flour (measured correctly)', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat', u'(measured correctly)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 20080, u'unit': u'tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://amyshealthybaking.com/blog/2014/03/21/strawberry-brownie-shortbread-parfaits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'To prepare the brownie, lightly coat a 1-cup ramekin with nonstick cooking spray, and set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the cocoa powder and flour in a small bowl. In a separate bowl, stir together the water, Greek yogurt, agave, and vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add in the flour mixture, stirring just until incorporated.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Spread into the prepared ramekin, and microwave on 40% power for 2 minutes 15 seconds (2:15).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Let it cool completely before slicing into cubes.While the brownie cooks and cools, prepare the crust. Crumble 6 of the shortbread cookies in a food processor or with the back of a wooden spoon. Stir in the applesauce. Divide the mixture between 2 parfait glasses with narrow bottoms, and press into the bottom of each.To prepare the vanilla yogurt filling, stir together the 1 cup of Greek yogurt, Truvia, and \xbc teaspoon of vanilla extract.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 18192, u'name': u'shortbread cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'id': 93628, u'name': u'stevia'}]}, {u'equipment': [], u'step': u'Spread \xbc cup of the vanilla yogurt filling on top of each of the crusts. Top with most of the diced strawberries and brownie chunks.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Spread the remaining vanilla yogurt filling on top, and sprinkle with the remaining brownie chunks and strawberries. Crumble the remaining shortbread cookie, and dust the top of each parfait with the crumbs.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 18192, u'name': u'shortbread cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 189, u'instructions': u'To prepare the brownie, lightly coat a 1-cup ramekin with nonstick cooking spray, and set aside. Whisk together the cocoa powder and flour in a small bowl. In a separate bowl, stir together the water, Greek yogurt, agave, and vanilla. Add in the flour mixture, stirring just until incorporated. Spread into the prepared ramekin, and microwave on 40% power for 2 minutes 15 seconds (2:15). Let it cool completely before slicing into cubes.While the brownie cooks and cools, prepare the crust. Crumble 6 of the shortbread cookies in a food processor or with the back of a wooden spoon. Stir in the applesauce. Divide the mixture between 2 parfait glasses with narrow bottoms, and press into the bottom of each.To prepare the vanilla yogurt filling, stir together the 1 cup of Greek yogurt, Truvia, and \xbc teaspoon of vanilla extract. Spread \xbc cup of the vanilla yogurt filling on top of each of the crusts. Top with most of the diced strawberries and brownie chunks. Spread the remaining vanilla yogurt filling on top, and sprinkle with the remaining brownie chunks and strawberries. Crumble the remaining shortbread cookie, and dust the top of each parfait with the crumbs.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-brownie-shortbread-parfaits-+-a-giveaway-ended-592858', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}