{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/772453-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 772453, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry and Farm Fresh Blueberry Smoothie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 187.13, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'1 cup coconut water', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12119, u'unit': u'cup'}, {u'originalString': u'Fresh mint, for garnish', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2064, u'unit': u'servings'}, {u'originalString': u'Granola, for garnish', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 8212, u'unit': u'servings'}, {u'originalString': u'2 cups strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'1 cup strawberry yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'strawberry yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-yogurt.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1197, u'unit': u'cup'}], u'healthScore': 33.0, u'imageType': u'jpeg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/strawberry-and-farm-fresh-blueberry-smoothie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/straw.jpg', u'id': 405924, u'name': u'drinking straws'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}], u'step': u'Special equipment: a plastic straw and two 16-ounce (or four 8-ounce) Mason jars, optional', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/straw.jpg', u'id': 405924, u'name': u'drinking straws'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Using the plastic straw, remove the white bitter interior and stem of each strawberry. You do this by centering the straw on the bottom pointed end of the fruit, pushing up through the inside to the top and popping off the stem in one smooth motion. Staying centered on the fruit with the straw is the key to quickly hulling and removing the bitter core of strawberries. (You can alternatively cut the stems and white bitter flesh out with a knife.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, combine the strawberries, blueberries, coconut water and strawberry yogurt and cover with the lid. Press the setting for puree and let it run until the texture is nice and smooth, at least 30 seconds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-yogurt.jpg', u'id': 1197, u'name': u'strawberry yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'id': 12119, u'name': u'coconut water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}], u'step': u'Pour into two 16-ounce Mason jars (or glasses), or four 8-ounce jars.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with granola and mint leaves.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'id': 8212, u'name': u'granola'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Mexican on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Trombetta Gap's Crown Vineyard Pinot Noir. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 59 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Rich garnet color. Aromas of vanilla, clove and cooking spiceswith hints of ripe berry, pomegranate and toast. Soft entry,balanced tannin and berry fruit mingled with pleasant acidityand lingering finish.', u'title': u"Trombetta Gap's Crown Vineyard Pinot Noir", u'price': u'$58.99', u'id': 439275, u'link': u'https://www.wine.com/product/trombetta-gaps-crown-vineyard-pinot-noir-2012/138834', u'imageUrl': u'https://spoonacular.com/productImages/439275-312x231.jpg'}]}, u'aggregateLikes': 2576, u'instructions': u'Watch how to make this recipe.      Special equipment: a plastic straw and two 16-ounce (or four 8-ounce) Mason jars, optional              Using the plastic straw, remove the white bitter interior and stem of each strawberry. You do this by centering the straw on the bottom pointed end of the fruit, pushing up through the inside to the top and popping off the stem in one smooth motion. Staying centered on the fruit with the straw is the key to quickly hulling and removing the bitter core of strawberries. (You can alternatively cut the stems and white bitter flesh out with a knife.)                          In a blender, combine the strawberries, blueberries, coconut water and strawberry yogurt and cover with the lid. Press the setting for puree and let it run until the texture is nice and smooth, at least 30 seconds.                          Pour into two 16-ounce Mason jars (or glasses), or four 8-ounce jars. Garnish with granola and mint leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-and-farm-fresh-blueberry-smoothie-772453', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}