{u'recipes': [{u'sourceName': u'Paleo Newbie', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/620056-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 620056, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Sausage & Potato Quick Skillet Meal', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 232.07, u'creditText': u'Paleo Newbie', u'extendedIngredients': [{u'originalString': u'1 tsp basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1 green pepper, diced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1lb. package of pre-cooked sausage (Italian or whatever flavor links you like), sliced', u'aisle': u'Meat', u'name': u'italian sausage', u'metaInformation': [u'italian', u'pre-cooked', u'sliced', u'( or whatever flavor links you like)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7036, u'unit': u'lb'}, {u'originalString': u'1/2 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 tsp parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tsp'}, {u'originalString': u'1 red pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4 tsp red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 small white sweet potatoes, peeled and sliced into thin circles', u'aisle': u'Produce', u'name': u'white sweet potatoes', u'metaInformation': [u'white', u'small', u'peeled', u'sliced into thin circles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011507, u'unit': u''}, {u'originalString': u'1 zucchini, sliced into thin circles', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'sliced into thin circles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://paleonewbie.com/italian-sausage-potato-quick-skillet-meal/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'First combine the dry seasoning mix in a small bowl and set aside', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1032027, u'name': u'seasoning mix'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Next brown the pre-cooked sausage slices in a large skillet with a little coconut oil over medium heat  transfer sausage to a plate and set aside', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Next add raw potato slices and a little more coconut oil to the hot skillet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread out potato slices along the bottom of the pan and brown on one side', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Next add the onions, peppers, zucchini and seasoning mix to the pan right on top of the potatoes  cook everything for about 5 minutes Now turn the potatoes and veggies over with a spatula and push the potatoes' un-browned sides to the bottom of the pan - cook everything for another 5 minutes or so until potatoes are tender", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1032027, u'name': u'seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add salt and pepper to taste (and any additional seasonings you'd like)Grab the sausage you set aside and toss back into the pan with the veggies to reheat for about 2 minutes.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve hot from skillet to plate and enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Carpineta Fontalpino Chianti Classico. It has 4.6 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The color is typical of the purity of the Sangiovese, a deep red with traces of violet. An interesting nose of plum, cherry, currant, rose, violet, cinnamon and cocoa. On the palate, this wine is elegant and persistent, with a tannic structure and high acidity. It is well-balanced with aromas of flowers and spices evolving on a long and round finish.', u'title': u'Carpineta Fontalpino Chianti Classico', u'price': u'$19.99', u'id': 446740, u'link': u'https://www.wine.com/product/carpineta-fontalpino-chianti-classico-2009/116281', u'imageUrl': u'https://spoonacular.com/productImages/446740-312x231.jpg'}]}, u'aggregateLikes': 87, u'instructions': u"First combine the dry seasoning mix in a small bowl and set asideNext brown the pre-cooked sausage slices in a large skillet with a little coconut oil over medium heat  transfer sausage to a plate and set asideNext add raw potato slices and a little more coconut oil to the hot skillet. Spread out potato slices along the bottom of the pan and brown on one sideNext add the onions, peppers, zucchini and seasoning mix to the pan right on top of the potatoes  cook everything for about 5 minutes Now turn the potatoes and veggies over with a spatula and push the potatoes' un-browned sides to the bottom of the pan - cook everything for another 5 minutes or so until potatoes are tenderAdd salt and pepper to taste (and any additional seasonings you'd like)Grab the sausage you set aside and toss back into the pan with the veggies to reheat for about 2 minutes.Serve hot from skillet to plate and enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/italian-sausage-potato-quick-skillet-meal-620056', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}