{u'recipes': [{u'sourceName': u'Lady Behind the Curtain', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/571877-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 23, u'id': 571877, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon Blueberry Swirl Cupcakes', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 56.41, u'creditText': u'Lady Behind the Curtain', u'extendedIngredients': [{u'originalString': u'3 tablespoons blueberry jelly', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'blueberry jelly', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberry-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11219297, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u"4 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'4 ounce cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3.4 ounce instant lemon pudding mix', u'aisle': u'Baking', u'name': u'instant lemon pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19332, u'unit': u'ounce'}, {u'originalString': u'1 cup lemon lime soda', u'aisle': u'Beverages', u'name': u'lemon lime soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14144, u'unit': u'cup'}, {u'originalString': u'3/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 - white cake mix', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 18137, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.ladybehindthecurtain.com/lemon-blueberry-swirl-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.Line 24 cupcake wells with liners.In a large mixing bowl combine the cake mix, pudding, oil, eggs and soda.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix until creamy.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u"Add 1 tablespoon of batter to each cupcake well, 1 tablespoon of blueberry sauce or jelly and top with an additional tablespoon of batter. Using a skewer swirl the batter.  NOTE: Make sure you don't over mix you still want to see yellow and purple separate.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake 18 to 23 minutes or until a wooden toothpick inserted into the center comes out clean.Cool on a wire rack in the cupcake tins.NOTE:  If some of the cupcakes overflow, trim the edges with kitchen scissors.Cream together the butter, cream cheese and blueberry jelly.Whip  until light and fluffy.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberry-jam.jpg', u'id': 11219297, u'name': u'blueberry jelly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u"Add confectioners' sugar 1 cup at a time making sure all the sugar is incorporated before adding more sugar.  Pipe or spread on cupcakes.Store cupcakes in the refrigerator until ready to serve.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 820, u'instructions': u"Preheat oven to 350 degrees.Line 24 cupcake wells with liners.In a large mixing bowl combine the cake mix, pudding, oil, eggs and soda.Mix until creamy.Add 1 tablespoon of batter to each cupcake well, 1 tablespoon of blueberry sauce or jelly and top with an additional tablespoon of batter. Using a skewer swirl the batter.  NOTE: Make sure you don't over mix you still want to see yellow and purple separate. Bake 18 to 23 minutes or until a wooden toothpick inserted into the center comes out clean.Cool on a wire rack in the cupcake tins.NOTE:  If some of the cupcakes overflow, trim the edges with kitchen scissors.Cream together the butter, cream cheese and blueberry jelly.Whip  until light and fluffy.Add confectioners' sugar 1 cup at a time making sure all the sugar is incorporated before adding more sugar.  Pipe or spread on cupcakes.Store cupcakes in the refrigerator until ready to serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-blueberry-swirl-cupcakes-571877', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 43, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}