{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/553262-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553262, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cajun Chicken Jambalaya', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 212.23, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'2 cups whole grain or brown rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'1 14.5 oz can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2-3 carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 lb chicken breast, pieces, I always use organic chicken', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'lb'}, {u'originalString': u'1 lb chicken sausage, chopped', u'aisle': u'Meat', u'name': u'chicken sausage', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93668, u'unit': u'lb'}, {u'originalString': u'5-6 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'4 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2-3 green onions, optional', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'6-8 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2-3 peppers. chopped', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'Pepper flakes, optional', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'servings'}, {u'originalString': u'2-3 tbsp Cajun spices', u'aisle': u'Spices and Seasonings', u'name': u'spices', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2035, u'unit': u'tbsp'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.eatgood4life.com/cajun-chicken-jambalaya/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large pan and add the chicken and chicken sausage (the chicken sausage will cook rather fast so remove it from the pan after 2-3 minutes, just when you see that it has browned).Keep cooking the chicken for another 2-3 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'id': 93668, u'name': u'chicken sausage'}]}, {u'equipment': [], u'step': u'Add the onion, chopped peppers, carrots and garlic and cook for another 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chopped can tomatoes and cook for another 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rice and stir.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the Cajun spices and mix in well.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 2035, u'name': u'spices'}]}, {u'equipment': [], u'step': u'Add the chicken stock and bring to a simmer. (At this stage I added 5 cups of chicken stock but had to add another extra cup to cook the rice further)Once the rice its almost cooked add the chicken sausage and finish cooking the rice, it took me about 30 minutes. Turn of heat and let the rice rest for 10-15 minutes before serving.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'id': 93668, u'name': u'chicken sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [], u'step': u'Add salt and pepper to taste and sprinkle the green onions and pepper flakes if using.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Jambalayan on the menu? Try pairing with ros\xe9 Wine, Sauvignon Blanc, and Albarino. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. The Mionetto Cuvee Sergio Prosecco with a 4.1 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'rose wine', u'sauvignon blanc', u'albarino'], u'productMatches': [{u'description': u'A cuvee that successfully introduces emotions and the special unmistakable flavor of wine skillfully produced to enhance the characteristics of the native grape varieties of a unique area, at the foot of the Pre-alps of Veneto, where Mionetto has been based since 1887. These flavors and aromas have disappeared over the years but now Mionetto are reintroducing them in this excellent cuv\xe9e.A delicate pale yellow color, with a characteristic aroma that blends with hints of honey and crab apples. It is dry and pleasantly slightly bitter on the palate. Lean due to the right level of acidity, it is moderately full-bodied with a fine and intense perlage.A balanced, smooth and refreshing sparkling wine that is ideal for any occasion, thanks to its moderate alcohol content and versatility. It is best served with simple light fish or vegetable dishes. It is an excellent aperitif accompanied by savory tarts or more delicate finger food such as shrimp vol-au-vent.', u'title': u'Mionetto Cuvee Sergio Prosecco', u'price': u'$17.99', u'id': 454770, u'link': u'https://www.wine.com/product/mionetto-cuvee-sergio-prosecco/58520', u'imageUrl': u'https://spoonacular.com/productImages/454770-312x231.jpg'}]}, u'aggregateLikes': 108, u'instructions': u'Heat the oil in a large pan and add the chicken and chicken sausage (the chicken sausage will cook rather fast so remove it from the pan after 2-3 minutes, just when you see that it has browned).Keep cooking the chicken for another 2-3 minutes. Add the onion, chopped peppers, carrots and garlic and cook for another 5 minutes. Add the chopped can tomatoes and cook for another 1 minute.Add the rice and stir. Add the Cajun spices and mix in well. Add the chicken stock and bring to a simmer. (At this stage I added 5 cups of chicken stock but had to add another extra cup to cook the rice further)Once the rice its almost cooked add the chicken sausage and finish cooking the rice, it took me about 30 minutes. Turn of heat and let the rice rest for 10-15 minutes before serving. Add salt and pepper to taste and sprinkle the green onions and pepper flakes if using.', u'spoonacularSourceUrl': u'https://spoonacular.com/cajun-chicken-jambalaya-553262', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}