{u'recipes': [{u'sourceName': u'Baked Chicago', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/629006-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 629006, u'veryPopular': False, u'lowFodmap': True, u'title': u'Cinn-full & Sweet Hot Chocolate', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 2, u'pricePerServing': 56.68, u'creditText': u'Baked Chicago', u'extendedIngredients': [{u'originalString': u'cinnamon stick, for garnish', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u'stick'}, {u'originalString': u'1/4 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u"1 tablespoon Ghirardelli's Sweet Ground Chocolate and Cocoa Mix", u'aisle': u'Beverages', u'name': u'hot cocoa mix', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14197, u'unit': u'tablespoon'}, {u'originalString': u'mini marshmallows, for garnish', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'serving'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://bakedchicago.com/cinn-full-sweet-hot-chocolate/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a microwaveable mug (that holds at least 16 ounces), combine the Ghirardellis Sweet Ground Chocolate and Cocoa', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix, ground cinnamon, vanilla and 2 tablespoons of milk.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'ground cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Mix thoroughly until youre left with a thick syrup.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Pour in 1 cup of milk and heat for 90 seconds on high in microwave.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove from microwave and give it a good stir until well blended.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Heat on high for an additional 2 minutes. Give a final stir, then garnish with a cinnamon stick and mini marshmallows.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}]}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u'In a microwaveable mug (that holds at least 16 ounces), combine the Ghirardellis Sweet Ground Chocolate and Cocoa Mix, ground cinnamon, vanilla and 2 tablespoons of milk. Mix thoroughly until youre left with a thick syrup.Pour in 1 cup of milk and heat for 90 seconds on high in microwave. Remove from microwave and give it a good stir until well blended. Heat on high for an additional 2 minutes. Give a final stir, then garnish with a cinnamon stick and mini marshmallows.', u'spoonacularSourceUrl': u'https://spoonacular.com/cinn-full-sweet-hot-chocolate-629006', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 6, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}