{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/751048-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 751048, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mexican Tortilla Casserole', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 132.82, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 15-ounce can kidney beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16034, u'unit': u'ounce'}, {u'originalString': u'1 15-ounce can pinto beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned pinto beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16044, u'unit': u'ounce'}, {u'originalString': u'4 teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'1 11-ounce can corn kernels, drained', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounce'}, {u'originalString': u'Sour cream and cilantro, for serving', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'sour', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'servings'}, {u'originalString': u'10 large (burrito-size) flour tortillas or 12 small flour or corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'small', u'large', u'(burrito-size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1 pound grated cheddar-jack cheese', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'pound'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 teaspoons paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 cups red enchilada sauce', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'red enchilada sauce', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 6599, u'unit': u'cups'}, {u'originalString': u'2 cups cooked rice (from 2/3 cup dry)', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'dry', u'cooked', u'(from 2/3 cup )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20444, u'unit': u'cups'}, {u'originalString': u'1 16-ounce jar salsa verde', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa verde', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 27028, u'unit': u'ounce'}, {u'originalString': u'1 large boneless, skinless chicken breast (about 12 ounces), cut into bite-size pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless', u'large', u'cut into bite-size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'ounces'}, {u'originalString': u'2 cups diced fresh tomatoes (about 3 to 5)', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'diced', u'( 3 to 5)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpeg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/mexican-tortilla-casserole.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet over medium-high heat, heat 1 tablespoon of the olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the tomatoes, onion and garlic, stir and cook for a minute or two to soften the onion.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add 2 teaspoons of the chili powder, 1 teaspoon of the paprika and 1 teaspoon of the cumin. Stir and cook the mixture for another minute or two to release the flavors of the spices.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the mixture to a bowl and set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In the same skillet, heat the remaining 1 tablespoon olive oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the chicken along with the remaining 2 teaspoons chili powder, 1 teaspoon paprika, 1 teaspoon cumin and 1/2 teaspoon salt.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Saute the chicken until it's deep golden brown and done in the middle, about 4 to 5 minutes.", u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u"Add 1 cup water and stir to make a sauce. Bring the sauce to a boil and cook until it's reduced by half, about 3 to 4 minutes. Stir in the beans and set aside.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'To assemble the casserole, pour half a jar (about 1 cup) of salsa verde into the bottom of a 9-by-13-inch casserole dish or disposable foil baking pan.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}]}, {u'equipment': [], u'step': u'Add a layer of half the tortillas on top of the salsa verde, overlapping the edges. Spoon the rice over the tortillas, spread the tomato mixture over the rice, then sprinkle the corn over the tomatoes. Next, add the chicken and bean mixture, then sprinkle on half the cheese and pour over half the enchilada sauce. Next, add the rest of the tortillas, then pour on the rest of the salsa verde and the rest of the enchilada sauce and sprinkle on the rest of the cheese.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"If you're baking the casserole right away, preheat the oven to 375 degrees F and bake, covered with foil, for 20 minutes. Then remove the foil and continue baking for 15 to 20 minutes, or until hot and bubbly.", u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with sour cream and cilantro.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u"Find this recipe and more in Ree's new book, The Pioneer Woman Cooks: Dinnertime ($30, William Morrow Cookbooks).", u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Photograph by Steve Giralt', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Siduri Sta. Rita Hills Pinot Noir. It has 4.2 out of 5 stars and a bottle costs about 33 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The 2014 Sta. Rita Hills Pinot Noir is a blend of fruit from the John Sebastiano, Clos Pepe, Cargasacchi, and Lindley Vineyards.  The actual blend is 64% John Sebastiano Vineyard Pinot Noir, 22% Clos Pepe, 9% Lindley, and 6% Cargasacchi. Clonally, this wine is a blend of 8 different clones which also provides for a wide range of flavors within one wine. The 2014 Pinot Noir Sta. Rita Hills should be a classic expression of the region, showing lots of spice, red fruit and dried soils aromas and flavors. Balanced, polished and elegant with plenty of fruit, it should certainly be an outstanding wine, and at the price, is an excellent value in Pinot Noir. View More', u'title': u'Siduri Sta. Rita Hills Pinot Noir', u'price': u'$32.99', u'id': 454206, u'link': u'https://www.wine.com/product/siduri-sta-rita-hills-pinot-noir-2014/168102', u'imageUrl': u'https://spoonacular.com/productImages/454206-312x231.jpg'}]}, u'aggregateLikes': 2047, u'instructions': u"In a large skillet over medium-high heat, heat 1 tablespoon of the olive oil. Add the tomatoes, onion and garlic, stir and cook for a minute or two to soften the onion. Add 2 teaspoons of the chili powder, 1 teaspoon of the paprika and 1 teaspoon of the cumin. Stir and cook the mixture for another minute or two to release the flavors of the spices. Remove the mixture to a bowl and set aside.                          In the same skillet, heat the remaining 1 tablespoon olive oil. Add the chicken along with the remaining 2 teaspoons chili powder, 1 teaspoon paprika, 1 teaspoon cumin and 1/2 teaspoon salt. Saute the chicken until it's deep golden brown and done in the middle, about 4 to 5 minutes. Add 1 cup water and stir to make a sauce. Bring the sauce to a boil and cook until it's reduced by half, about 3 to 4 minutes. Stir in the beans and set aside.                          To assemble the casserole, pour half a jar (about 1 cup) of salsa verde into the bottom of a 9-by-13-inch casserole dish or disposable foil baking pan. Add a layer of half the tortillas on top of the salsa verde, overlapping the edges. Spoon the rice over the tortillas, spread the tomato mixture over the rice, then sprinkle the corn over the tomatoes. Next, add the chicken and bean mixture, then sprinkle on half the cheese and pour over half the enchilada sauce. Next, add the rest of the tortillas, then pour on the rest of the salsa verde and the rest of the enchilada sauce and sprinkle on the rest of the cheese.                          If you're baking the casserole right away, preheat the oven to 375 degrees F and bake, covered with foil, for 20 minutes. Then remove the foil and continue baking for 15 to 20 minutes, or until hot and bubbly. Serve with sour cream and cilantro.                          Find this recipe and more in Ree's new book, The Pioneer Woman Cooks: Dinnertime ($30, William Morrow Cookbooks).                          Photograph by Steve Giralt", u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-tortilla-casserole-751048', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}