{u'recipes': [{u'sourceName': u'Gourmande in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512204-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 512204, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chilled Double Tomato Soup (Raw, Vegan, Paleo)', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 93.88, u'creditText': u'Gourmande in the Kitchen', u'extendedIngredients': [{u'originalString': u'5 Brazil nuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'brazil nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brazil-nuts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 93710, u'unit': u''}, {u'originalString': u"2 small peeled (and grated if you don't have a high speed blender) carrots", u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated', u'small', u'peeled', u"(and if you don't have a high speed blender)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 Tablespoons/30ml Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tablespoons'}, {u'originalString': u'Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'6 Olive Oil packed sundried tomatoes halves', u'aisle': u'Canned and Jarred', u'name': u'oil packed sundried tomatoes', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11956, u'unit': u''}, {u'originalString': u'1/4th teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u''}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 large ripe tomato, seeded and finely chopped', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'ripe', u'large', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 lb/450g ripe tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'lb'}, {u'originalString': u'1 cup/240ml filtered water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'filtered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://gourmandeinthekitchen.com/2013/chilled-double-tomato-soup-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Halve the tomatoes crosswise (reserving one for garnish) and squeeze the seeds and pulp from the center of the tomatoes into a fine mesh strainer set over a medium sized bowl, letting the liquid drain into the bowl.  (This separates the bitter seeds from the flavorful liquid).  Press to release as much liquid as possible and discard the seeds.Coarsely chop the tomato halves and transfer to a high speed blender along with the remaining ingredients and blend on high until very smooth and creamy.  (Actual time will vary depending on the strength of your blender).  Chill until cold, about 2 hours to allow flavors to blend.  Taste and season with additional salt or pepper as necessary if desired.  Divide soup among small bowls or glasses and top with finely chopped tomato and a drizzle of olive oil and serve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 75, u'instructions': u'Halve the tomatoes crosswise (reserving one for garnish) and squeeze the seeds and pulp from the center of the tomatoes into a fine mesh strainer set over a medium sized bowl, letting the liquid drain into the bowl.  (This separates the bitter seeds from the flavorful liquid).  Press to release as much liquid as possible and discard the seeds.Coarsely chop the tomato halves and transfer to a high speed blender along with the remaining ingredients and blend on high until very smooth and creamy.  (Actual time will vary depending on the strength of your blender).  Chill until cold, about 2 hours to allow flavors to blend.  Taste and season with additional salt or pepper as necessary if desired.  Divide soup among small bowls or glasses and top with finely chopped tomato and a drizzle of olive oil and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/chilled-double-tomato-soup-raw-vegan-paleo-512204', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 140, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}