{u'recipes': [{u'sourceName': u'Skinny Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/473421-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 473421, u'veryPopular': False, u'lowFodmap': False, u'title': u'Concord Grape Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 72.85, u'creditText': u'Skinny Chef', u'extendedIngredients': [{u'originalString': u'1/2 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds (about 4 cups) concord grapes', u'aisle': u'Produce', u'name': u'concord grapes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1009132, u'unit': u'cups'}, {u'originalString': u'1 tablespoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 9-inch unbaked pie crust', u'aisle': u'Refrigerated', u'name': u'unbaked pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'9-inch', u'unitShort': u'9-inch', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u'9-inch'}, {u'originalString': u'1/4 cup unsalted butter, chilled, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'chilled', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1/2 cup "white" whole wheat flour or whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://skinnychef.com/recipes/concord-grape-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash grapes, and remove the skins, and set them aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place grape pulp in a large saucepan; mash a few at the bottom to release their juice. Cook over medium low heat until grapes come to a full boil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Remove pulp from heat, and press through a food mill or strainer to remove the seeds. Stir in the skins, butter, and lemon juice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Add sugar, flour, and salt, into grape mixture, stirring well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour filling into pie crust, and dot with butter. Make the crumble topping.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the flour, sugar, and butter into a food processor. Pulse 10 to 15 times until the flour mixture is coarse and small "pea-size" pieces of butter form.  Sprinkle over the grape mixture.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake at 350\xb0F,  45 to 50 minutes, or until topping is brown and juice begins to bubble around the edges of the crust. Cool 10 minutes before slicing.  Cool completely before covering with aluminum foil and storing refrigerated, up to 5 days.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie on the menu? Try pairing with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'apricot , apple , honey', u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 154, u'instructions': u'Wash grapes, and remove the skins, and set them aside. Place grape pulp in a large saucepan; mash a few at the bottom to release their juice. Cook over medium low heat until grapes come to a full boil. Remove pulp from heat, and press through a food mill or strainer to remove the seeds. Stir in the skins, butter, and lemon juice.Add sugar, flour, and salt, into grape mixture, stirring well. Pour filling into pie crust, and dot with butter. Make the crumble topping.  Place the flour, sugar, and butter into a food processor. Pulse 10 to 15 times until the flour mixture is coarse and small "pea-size" pieces of butter form.  Sprinkle over the grape mixture.Bake at 350\xb0F,  45 to 50 minutes, or until topping is brown and juice begins to bubble around the edges of the crust. Cool 10 minutes before slicing.  Cool completely before covering with aluminum foil and storing refrigerated, up to 5 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/concord-grape-pie-473421', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}