{u'recipes': [{u'sourceName': u'Pale Omg', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/509628-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 509628, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coconut Coffee Cake', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 180.52, u'creditText': u'Pale Omg', u'extendedIngredients': [{u'originalString': u'\xbd cup almond flour/meal', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond meal flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93740, u'unit': u'cup'}, {u'originalString': u'1 cup sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Gold Label Virgin Coconut Oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup Chameleon Cold Brew Coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'4 eggs, whisked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 teaspoon ground coffee', u'aisle': u'Tea and Coffee', u'name': u'ground coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10093715, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons Raw Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'\xbd teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://paleomg.com/coconut-coffee-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix all dry ingredients: almond meal, coconut flour, shredded coconut, baking soda and baking powder, cinnamon, and salt.Then add your wet remaining ingredients to the dry ingredients.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 93740, u'name': u'almond meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/glass-baking-tray.jpg', u'id': 406921, u'name': u'glass baking pan'}], u'step': u'Mix together.Grease a 8\xd78 or 9\xd79 glass baking dish and pour into the dish.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 25-30 minutes or until edges are browned and middle is completely cooked through.While your cake is cooking, pull out a large skillet and place over medium heat.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add your coconut oil then almonds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Mix to coat almonds.When the almonds begin to toast and have a bit of browning to them (be careful because they burn easily) add your honey, maple syrup, cinnamon, vanilla and salt and mix thoroughly.Cook for a couple minutes longer being sure not to burn the almonds, but remove from heat.Once cake is done cooking, top with almonds and slightly press down to help stick to the cake.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let cool then serve with some delicious Chameleon Cold Brew Coffee!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 2043, u'instructions': u'Preheat your oven to 350 degrees.Mix all dry ingredients: almond meal, coconut flour, shredded coconut, baking soda and baking powder, cinnamon, and salt.Then add your wet remaining ingredients to the dry ingredients. Mix together.Grease a 8\xd78 or 9\xd79 glass baking dish and pour into the dish.Bake for 25-30 minutes or until edges are browned and middle is completely cooked through.While your cake is cooking, pull out a large skillet and place over medium heat.Add your coconut oil then almonds. Mix to coat almonds.When the almonds begin to toast and have a bit of browning to them (be careful because they burn easily) add your honey, maple syrup, cinnamon, vanilla and salt and mix thoroughly.Cook for a couple minutes longer being sure not to burn the almonds, but remove from heat.Once cake is done cooking, top with almonds and slightly press down to help stick to the cake. Let cool then serve with some delicious Chameleon Cold Brew Coffee!', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-coffee-cake-509628', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}