{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603257-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 603257, u'veryPopular': True, u'lowFodmap': False, u'title': u'Hazelnut and Salted Caramel Ice Cream', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 82.14, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'8 ounces salted caramel, I used this brand', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramel', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 19074, u'unit': u'ounces'}, {u'originalString': u'8 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 1/2 cups Real\xae half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [u'real\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'8 ounces toasted hazelnuts, chopped', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 12120, u'unit': u'ounces'}, {u'originalString': u'pinch of kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'3 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'2 1/2 cups Real\xae whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [u'real\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cups'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.foodiecrush.com/2014/06/hazelnut-and-salted-caramel-ice-cream/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Over medium heat, add the half and half to a medium saucepan and heat until hot, but not boiling. Stir often.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}]}, {u'equipment': [], u'step': u'Remove from heat and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place egg yolks and sugar in the mixer bowl of a stand mixer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix on low with a wire whip for about 30 seconds or until slightly thickened. Gradually add half and half and mix until blended. Return the mixture to the saucepan and cook over medium heat until mixture is steaming, but not boiling. Stir constantly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Transfer to a large bowl and stir in the whipping cream, vanilla and salt. Cover and chill for at least 8 hours or overnight. Freeze in an ice cream maker according to manufacturer's directions.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the chopped hazelnuts in the last 5 minutes of churning.Layer 1/3 of the ice cream mixture into the bottom of a chilled freezer safe container.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Drizzle with 1/3 of the salted caramel in large ribbons and use a knife to gently cut into the ice cream. Repeat 2 times, ending with more large ribbons of caramel. Sprinkle with additional hazelnuts if desired. Cover with plastic wrap or foil and freeze for at least 2 hours or up to 3 days.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert on the menu? Try pairing with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1939, u'instructions': u"Over medium heat, add the half and half to a medium saucepan and heat until hot, but not boiling. Stir often. Remove from heat and set aside. Place egg yolks and sugar in the mixer bowl of a stand mixer. Mix on low with a wire whip for about 30 seconds or until slightly thickened. Gradually add half and half and mix until blended. Return the mixture to the saucepan and cook over medium heat until mixture is steaming, but not boiling. Stir constantly. Transfer to a large bowl and stir in the whipping cream, vanilla and salt. Cover and chill for at least 8 hours or overnight. Freeze in an ice cream maker according to manufacturer's directions. Add the chopped hazelnuts in the last 5 minutes of churning.Layer 1/3 of the ice cream mixture into the bottom of a chilled freezer safe container. Drizzle with 1/3 of the salted caramel in large ribbons and use a knife to gently cut into the ice cream. Repeat 2 times, ending with more large ribbons of caramel. Sprinkle with additional hazelnuts if desired. Cover with plastic wrap or foil and freeze for at least 2 hours or up to 3 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/hazelnut-and-salted-caramel-ice-cream-603257', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}