{u'recipes': [{u'sourceName': u'The Culinary Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575038-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 22, u'id': 575038, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gluten Free Brioche Buns: AKA, Chocolate Things', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 118.45, u'creditText': u'The Culinary Life', u'extendedIngredients': [{u'originalString': u'\xbd cup brown rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'brown rice flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20090, u'unit': u'cup'}, {u'originalString': u'2 cups minus 2 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'cups'}, {u'originalString': u'4 ounces dark chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1\xbd teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1\xbc cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'\xbd cup tapioca starch (tapioca flour)', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca starch', u'metaInformation': [u'(tapioca flour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93696, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 tablespoon xanthan gum', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'xanthan gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93626, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon granulated yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tablespoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.theculinarylife.com/2010/gluten-free-chocolate-brioche-buns-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the brown rice flour, tapioca starch, cornstarch, yeast, salt and xanthan gum in a 5-quart bowl, or a lidded (not airtight) food container.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'id': 20090, u'name': u'brown rice flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93626, u'name': u'xanthan gum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'Combine the liquid ingredients and gradually mix them into the dry ingredients using one of the following: a spoon, a food processor (with dough attachment) or a stand mixer with a paddle attachment.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Mix just until there are no dry bits of flour. You might need to use wet hands to get the last bits of flour to incorporate if you are not using a machine.Cover (not airtight!) and allow the dough to rest at room temperature for 2 hours.Coat your hands and a flat surface liberally with corn starch, and I mean liberally. Trust me – this dough sticks to everything, even parchment paper.Turn the dough out onto starched surface, then spread and press with your hands until it isabout 1 inch thick and roughly square shaped. Coat a rolling pin with cornstarch and sprinkle a little more on the surface of your dough.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Roll the dough until it is \xbd inch thick.Using a knife dipped in cornstarch, cut the edges of the dough so it’s relatively close to square-shaped. Sprinkle chopped chocolate around the dough square, not heavily coating it but spreading chocolate chunks evenly around. As tightly as you can without breaking it, roll the dough into a thick log.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Cut into 6 equal-sized rolls with a very sharp knife. Coat your hands with a little more cornstarch and gently form the rolls into rough ball shapes.Set a piece of parchment on a baking sheet (don’t worry – with the amount of cornstarch you used by now, nothing will stick at this point) and place the rolls at least two inches apart. Cover loosely and allow dough to rest for 45 minutes. Preheat oven to 350\xb0F while you’re waiting, allowing the full 45 minutes so that the oven heats properly.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the center of the oven for about 22 minutes. The rolls are done once they start to brown nicely and are firm to the touch.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let rolls cool on the baking sheet for two minutes, then remove from the pan and allow to cool on a rack before eating. Eat hot, right out of the oven, or allow them to cool fully before storing them in an airtight container for up to four days. If wrapped up tightly, these rolls can be frozen for up to a month.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 834, u'instructions': u'Whisk together the brown rice flour, tapioca starch, cornstarch, yeast, salt and xanthan gum in a 5-quart bowl, or a lidded (not airtight) food container.Combine the liquid ingredients and gradually mix them into the dry ingredients using one of the following: a spoon, a food processor (with dough attachment) or a stand mixer with a paddle attachment. Mix just until there are no dry bits of flour. You might need to use wet hands to get the last bits of flour to incorporate if you are not using a machine.Cover (not airtight!) and allow the dough to rest at room temperature for 2 hours.Coat your hands and a flat surface liberally with corn starch, and I mean liberally. Trust me – this dough sticks to everything, even parchment paper.Turn the dough out onto starched surface, then spread and press with your hands until it isabout 1 inch thick and roughly square shaped. Coat a rolling pin with cornstarch and sprinkle a little more on the surface of your dough. Roll the dough until it is \xbd inch thick.Using a knife dipped in cornstarch, cut the edges of the dough so it’s relatively close to square-shaped. Sprinkle chopped chocolate around the dough square, not heavily coating it but spreading chocolate chunks evenly around. As tightly as you can without breaking it, roll the dough into a thick log. Cut into 6 equal-sized rolls with a very sharp knife. Coat your hands with a little more cornstarch and gently form the rolls into rough ball shapes.Set a piece of parchment on a baking sheet (don’t worry – with the amount of cornstarch you used by now, nothing will stick at this point) and place the rolls at least two inches apart. Cover loosely and allow dough to rest for 45 minutes. Preheat oven to 350\xb0F while you’re waiting, allowing the full 45 minutes so that the oven heats properly.Bake in the center of the oven for about 22 minutes. The rolls are done once they start to brown nicely and are firm to the touch.Let rolls cool on the baking sheet for two minutes, then remove from the pan and allow to cool on a rack before eating. Eat hot, right out of the oven, or allow them to cool fully before storing them in an airtight container for up to four days. If wrapped up tightly, these rolls can be frozen for up to a month.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-brioche-buns-aka-chocolate-things-575038', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 82, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}