{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/867858-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 867858, u'veryPopular': True, u'lowFodmap': False, u'title': u'Portuguese Baked Eggs', u'diets': [], u'pricePerServing': 219.08, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'2 beefsteak tomatoes, cut into wedges', u'aisle': u'Produce', u'name': u'beefsteak tomatoes', u'metaInformation': [u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beefsteak-tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011529, u'unit': u''}, {u'originalString': u'3 bell peppers, any color, thinly sliced', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'Toasted country-style bread (for serving)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'country-style', u'toasted', u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18064, u'unit': u'servings'}, {u'originalString': u'1\xbd teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'8 garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 jalape\xf1o, with seeds, halved lengthwise', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'with seeds, halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh oregano leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup grated Parmesan (about 1 oz.)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'oz'}, {u'originalString': u'1 medium red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 cup ricotta', u'aisle': u'Cheese', u'name': u'ricotta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'1 cup grated sharp white cheddar (about 4 oz.)', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'white', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'oz'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bonappetit.com/recipe/portuguese-baked-eggs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer bell pepper mixture to a 13x9 baking dish. Using the back of a spoon, make 6 evenly spaced divots in mixture. Spoon a dollop of ricotta into each divot, then crack 1 egg into each. Top with cheddar and Parmesan; season with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake, rotating dish halfway through, until Parmesan is melted and egg whites are almost set but yolks are still runny, 1518 minutes.', u'length': {u'number': 1518, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Serve baked eggs with toast. (Yolks will continue to cook as dish sits, so serve right away if you prefer your eggs soft.)DO AHEAD: Bell pepper mixture can be cooked 1 day ahead.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Let cool; cover and chill.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23271, u'instructions': u'Preheat oven to 400. Transfer bell pepper mixture to a 13x9 baking dish. Using the back of a spoon, make 6 evenly spaced divots in mixture. Spoon a dollop of ricotta into each divot, then crack 1 egg into each. Top with cheddar and Parmesan; season with salt and pepper. Bake, rotating dish halfway through, until Parmesan is melted and egg whites are almost set but yolks are still runny, 1518 minutes.Serve baked eggs with toast. (Yolks will continue to cook as dish sits, so serve right away if you prefer your eggs soft.)DO AHEAD: Bell pepper mixture can be cooked 1 day ahead. Let cool; cover and chill.', u'spoonacularSourceUrl': u'https://spoonacular.com/portuguese-baked-eggs-867858', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}