{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537201-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 100, u'id': 537201, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Gingerbread Boy', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 27.5, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'3/4 Teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'Teaspoon'}, {u'originalString': u'3/4 cups butter (preferably unsalted) at room temp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'(preferably )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cups'}, {u'originalString': u'1 Tablespoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tablespoon'}, {u'originalString': u'1/2 cup dark-brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 1/4 cups sifted all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 Teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2011, u'unit': u'Teaspoon'}, {u'originalString': u'1 Tablespoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'Tablespoon'}, {u'originalString': u'1/2 Teaspoon ground nutmeg (fresh is best)', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [u'fresh', u'( is best)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'Teaspoon'}, {u'originalString': u'1/4 Teaspoon finely ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'Teaspoon'}, {u'originalString': u'1/2 Teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'Teaspoon'}, {u'originalString': u'1 3/4 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 Teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'1/2 cup unsulfured molasses', u'aisle': u'Baking', u'name': u'unsulfured molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 17.0, u'sourceUrl': u'http://www.macheesmo.com/2008/12/the-gingerbread-boy/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Roll dough into about 1/4 inch thick.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into any shapes you want!6)', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Bake cookies on an ungreased cookie sheet for 7-8 minutes at 350 degrees F. 7) For a quick icing, just beat one egg white which I beat until fluffy and then I whisked in my lemon juice and powdered sugar. Super-easy and works great for decorating these guys. I put mine in a Ziploc bag and cut off the very tip of it to make a redneck pastry bag.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Gingerbread works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 37, u'instructions': u'Directions1) To start this recipe take your dry ingredients (flour, spices, and baking soda) and mix them well in a bowl. 2) Then you want to cream your butter with your sugar. Start beating your butter for a few minutes and then add in your sugar. The sugar will help make the butter light and fluffy. After a few minutes beat in your egg and molasses as well.3) Slowly mix in your dry ingredients with your wet and you will have a very thick dough. Near the end you will probably have to work it with your hands.4) Divide the dough into two balls and place it in a cold place to chill for at least an hour. 5) Roll dough into about 1/4 inch thick. Cut into any shapes you want!6) Bake cookies on an ungreased cookie sheet for 7-8 minutes at 350 degrees F. 7) For a quick icing, just beat one egg white which I beat until fluffy and then I whisked in my lemon juice and powdered sugar. Super-easy and works great for decorating these guys. I put mine in a Ziploc bag and cut off the very tip of it to make a redneck pastry bag.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-gingerbread-boy-537201', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}