{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/545790-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 545790, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pinata Cake', u'diets': [u'dairy free'], u'preparationMinutes': 80, u'pricePerServing': 259.52, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 16-to-18-ounce boxes chocolate cake mix (plus required ingredients)', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [u'(plus required ingredients)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 99040, u'unit': u'ounce'}, {u'originalString': u'Gel or neon food coloring (purple, yellow, blue, orange and pink)', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [u'blue', u'yellow', u'(purple, , , orange and pink)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'7 wafer ice cream cones', u'aisle': u'Frozen', u'name': u'ice cream cones', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cream-cone.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 18271, u'unit': u''}, {u'originalString': u'Black icing, for decorating', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [u'black', u'for decorating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'servings'}, {u'originalString': u'3 7-ounce bags shredded sweetened coconut', u'aisle': u'Baking', u'name': u'sweetened shredded coconut', u'metaInformation': [u'shredded', u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 12179, u'unit': u'ounce'}, {u'originalString': u'2 16-ounce tubs vanilla frosting', u'aisle': u'Baking', u'name': u'vanilla frosting', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'ounce'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/pinata-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 48, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Preheat the oven to 325 degrees F. Coat two 9-by-5-inch loaf pans with cooking spray; line with parchment, leaving an overhang. Prepare the cake mixes as directed. Fill the pans about two-thirds of the way with batter (you' ll have a little left over).", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the cakes 45 minutes, then remove 1 cake from the oven and insert the top 1/2 inch of an ice cream cone 1 1/2 inches from an end as shown. Continue baking both cakes 10 to 15 more minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cream-cone.jpg', u'id': 18271, u'name': u'ice cream cone'}]}, {u'equipment': [], u'step': u'Let cool, then lift out of the pans.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}], u'step': u'Use a serrated knife to trim the domed top of the cake without the cone; set trimmed-side down on a work surface. Use frosting to attach 4 ice cream cones to the 4 corners for legs.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cream-cone.jpg', u'id': 18271, u'name': u'ice cream cone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Transfer to the freezer.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}], u'step': u'Trim the bottoms of the 2 remaining cones with a serrated knife to make pointed ears.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the cake with the baked-in cone in half to form the head (you won\'t need the other half). Set cut-side down. Use frosting to attach the "ears" to the top of the head; transfer to the freezer.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Divide the coconut among 5 zip-top bags.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add a few drops of food coloring to each bag, then shake and massage to mix.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}]}, {u'equipment': [], u'step': u'Add more food coloring as needed until the colors are bright.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}]}, {u'equipment': [], u'step': u'Remove the cake with legs from the freezer. Cover the cones with frosting and press purple coconut around them. Frost half of the body as shown and cover with yellow coconut.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Invert the cake so it stands on the cone legs. Frost the rest of the body and cover with blue coconut on the sides and orange coconut on the top, leaving a square bare as shown. Return to the freezer.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Frost the head, ears and snout; cover with stripes of purple, blue, pink and yellow coconut.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Place on top of the body as shown. Use the remaining white frosting and the black icing to make eyes and nostrils.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [], u'step': u'Photograph by Andrew Purcell', u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 105, u'instructions': u'Preheat the oven to 325 degrees F. Coat two 9-by-5-inch loaf pans with cooking spray; line with parchment, leaving an overhang. Prepare the cake mixes as directed. Fill the pans about two-thirds of the way with batter (you\' ll have a little left over).                          Bake the cakes 45 minutes, then remove 1 cake from the oven and insert the top 1/2 inch of an ice cream cone 1 1/2 inches from an end as shown. Continue baking both cakes 10 to 15 more minutes. Let cool, then lift out of the pans.                          Use a serrated knife to trim the domed top of the cake without the cone; set trimmed-side down on a work surface. Use frosting to attach 4 ice cream cones to the 4 corners for legs. Transfer to the freezer.                          Trim the bottoms of the 2 remaining cones with a serrated knife to make pointed ears.                          Cut the cake with the baked-in cone in half to form the head (you won\'t need the other half). Set cut-side down. Use frosting to attach the "ears" to the top of the head; transfer to the freezer.                          Divide the coconut among 5 zip-top bags. Add a few drops of food coloring to each bag, then shake and massage to mix. Add more food coloring as needed until the colors are bright.                          Remove the cake with legs from the freezer. Cover the cones with frosting and press purple coconut around them. Frost half of the body as shown and cover with yellow coconut.                          Invert the cake so it stands on the cone legs. Frost the rest of the body and cover with blue coconut on the sides and orange coconut on the top, leaving a square bare as shown. Return to the freezer.                          Frost the head, ears and snout; cover with stripes of purple, blue, pink and yellow coconut. Place on top of the body as shown. Use the remaining white frosting and the black icing to make eyes and nostrils.                          Photograph by Andrew Purcell', u'spoonacularSourceUrl': u'https://spoonacular.com/pinata-cake-545790', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 140, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}