{u'recipes': [{u'sourceName': u"Roti 'n' Rice", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/670739-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 670739, u'veryPopular': True, u'lowFodmap': True, u'title': u'Grilled Steaks with Balsamic Worcestershire Marinade', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 526.4, u'creditText': u"Roti 'n' Rice", u'extendedIngredients': [{u'originalString': u'2 tbsp balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp chopped rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'4 (1-inch thick) bone-in New York strip steaks (or any meat cut)', u'aisle': u'Meat', u'name': u'steaks', u'metaInformation': [u'bone-in', u'or any meat cut)', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 23232, u'unit': u''}, {u'originalString': u'2 tbsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tbsp'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.rotinrice.com/2015/07/grilled-steaks-with-balsamic-worcestershire-marinade/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place steaks in a Ziploc bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Add all remaining ingredients. Seal the bag and massage the meat lightly to get everything in the bag well mixed.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place on a tray and refrigerate for at least 2 hours.Preheat grill to high.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Brush some oil on the grates.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and discard marinade.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place steaks on the grates and close the lid. Grill steaks for 7. Watch closely to avoid flare-ups by opening the lid occasionally. Move steaks to a different part of the grill to avoid charring if flare-ups occur. Flip steaks and grill for another 5 to 6 minutes for medium doneness.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer steaks to a platter. Cover loosely with aluminum foil and allow them to rest for 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try Franciscan Estate Merlot. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 25 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Our Oakville estate produces distinctive, supple Merlot characterized by flavors of cherries and plums.  This wine shows rich, lush and velvety fruit flavors of cherries, plums and blackberries that merge with light toasted oak.  Blended with a samll percentage of Cabernet Sauvignon and Cabernet Franc this wine is well balanced and structured with a lingering finish.Alcohol: 13.5% View More', u'title': u'Franciscan Estate Merlot', u'price': u'$25.49', u'id': 443286, u'link': u'https://www.wine.com/product/franciscan-estate-merlot-1998/7308', u'imageUrl': u'https://spoonacular.com/productImages/443286-312x231.jpg'}]}, u'aggregateLikes': 913, u'instructions': u'Place steaks in a Ziploc bag. Add all remaining ingredients. Seal the bag and massage the meat lightly to get everything in the bag well mixed. Place on a tray and refrigerate for at least 2 hours.Preheat grill to high. Brush some oil on the grates.Drain and discard marinade. Place steaks on the grates and close the lid. Grill steaks for 7. Watch closely to avoid flare-ups by opening the lid occasionally. Move steaks to a different part of the grill to avoid charring if flare-ups occur. Flip steaks and grill for another 5 to 6 minutes for medium doneness.Transfer steaks to a platter. Cover loosely with aluminum foil and allow them to rest for 10 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-steaks-with-balsamic-worcestershire-marinade-670739', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 23, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}