{u'recipes': [{u'sourceName': u'Cravings of a Lunatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/538951-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 538951, u'veryPopular': False, u'lowFodmap': False, u'title': u'Farro with Dried Cherries and Pistachios | Celebrating #HealthySpring with a @KitchenIQ #Giveaway', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 201.62, u'creditText': u'Cravings of a Lunatic', u'extendedIngredients': [{u'originalString': u'3/4 cup dried cherries, chopped roughly', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cherries', u'metaInformation': [u'dried', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93822, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups of farro', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'farro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020005, u'unit': u'cups'}, {u'originalString': u"1 to 2 tablespoons dried parsley (you can use fresh if it's handy)", u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'dried', u'fresh', u'canned', u"(you can use if it's handy)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup pistachios, chopped roughly', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'Salt and Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.cravingsofalunatic.com/2014/05/farro-with-dried-cherries-and-pistachios-celebrating-healthyspring-with-a-kitcheniq-giveaway.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse your farro before cooking.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add farro to a large saucepan, add water so it covers the farro by about 1 and 1/2 to 2 inches, add salt, and bring to a boil, cook for about 18 to 22 minutes. Stir occasionally. You can cook it in broth for more flavour if you like, but I did this one plain.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain and rinse with cold water.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let the water completely drain off.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Place a large skillet on the stove over medium heat, add the olive oil and let the oil start to shimmer a bit. Toss in the pistachios, cook for about 3 to 5 minutes, turning them to brown them on all sides.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the cherries, continue cooking for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a touch more oil if needed. Now toss the rinsed and dried farro in the skillet and cook until it warms back up and everything mixes together perfectly.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}]}, {u'equipment': [], u'step': u'Add some salt and pepper to taste. You can eat this as a side dish, or a light lunch, or you can toss it with greens for an amazing salad.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve with a big old healthy smile!', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 160, u'instructions': u'Rinse your farro before cooking.Add farro to a large saucepan, add water so it covers the farro by about 1 and 1/2 to 2 inches, add salt, and bring to a boil, cook for about 18 to 22 minutes. Stir occasionally. You can cook it in broth for more flavour if you like, but I did this one plain. Drain and rinse with cold water. Let the water completely drain off.Place a large skillet on the stove over medium heat, add the olive oil and let the oil start to shimmer a bit. Toss in the pistachios, cook for about 3 to 5 minutes, turning them to brown them on all sides. Add the cherries, continue cooking for about 2 minutes. Add a touch more oil if needed. Now toss the rinsed and dried farro in the skillet and cook until it warms back up and everything mixes together perfectly. Add some salt and pepper to taste. You can eat this as a side dish, or a light lunch, or you can toss it with greens for an amazing salad. Serve with a big old healthy smile!', u'spoonacularSourceUrl': u'https://spoonacular.com/farro-with-dried-cherries-and-pistachios-celebrating-healthyspring-with-a-kitcheniq-giveaway-538951', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}