{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/212177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 212177, u'veryPopular': False, u'lowFodmap': False, u'title': u'Artichoke & pecorino bruschetta', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 162.44, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'pinch of chilli flakes', u'aisle': u'Spices and Seasonings', u'name': u'chilli flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'small handful mint leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, sliced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'zest \xbd lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 tbsp olive oil, plus extra for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'140g artichokes in olive oil, drained', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'g'}, {u'originalString': u'50g pecorino, thinly sliced (or vegetarian alternative)', u'aisle': u'Cheese', u'name': u'pecorino', u'metaInformation': [u'thinly sliced', u'(or vegetarian alternative)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1038, u'unit': u'g'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipe/artichoke-pecorino-bruschetta', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Halve or quarter the artichokes, if whole,and put them in a bowl with the chilliflakes, mint, zest and oil. Season lightlywith salt and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Put the bread on a baking sheet andscatter over the garlic.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Drizzle with oliveoil and season with sea salt.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for10 mins, or until golden and crisp. Setaside to cool.Fold the pecorino through themarinated artichokes and spoon over thegarlic bruschetta just before eating.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chianti, Sparkling ros\xe9, and Sparkling Wine are my top picks for Bruschetta. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Castello di Volpaia Chianti Classico Riserva with a 4.1 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'chianti', u'sparkling rose', u'sparkling wine', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Color: Ruby red with a trace of garnet Nose: Elegant and intense with hints of spices connected with fruity scents Taste: Good structure with evident tannins and long persistence', u'title': u'Castello di Volpaia Chianti Classico Riserva', u'price': u'$23.99', u'id': 439055, u'link': u'https://www.wine.com/product/castello-di-volpaia-chianti-classico-riserva-2003/92756', u'imageUrl': u'https://spoonacular.com/productImages/439055-312x231.jpg'}]}, u'aggregateLikes': 183, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Halve or quarter the artichokes, if whole,and put them in a bowl with the chilliflakes, mint, zest and oil. Season lightlywith salt and set aside.Put the bread on a baking sheet andscatter over the garlic. Drizzle with oliveoil and season with sea salt. Bake for10 mins, or until golden and crisp. Setaside to cool.Fold the pecorino through themarinated artichokes and spoon over thegarlic bruschetta just before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/artichoke-pecorino-bruschetta-212177', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}