{u'recipes': [{u'sourceName': u'Fed and Fit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/584011-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 270, u'id': 584011, u'veryPopular': False, u'lowFodmap': False, u'title': u'Moroccan-Marinated Chicken Breasts with Wilted Onions', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 155.59, u'creditText': u'Fed and Fit', u'extendedIngredients': [{u'originalString': u'1 \xbd tsp Freshly Ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp Ground Allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp Ground Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp Ground Coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp Ground Ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'Tbsp'}, {u'originalString': u'\xbe tsp Ground Nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'\xbc cup/60 mL Organic Extra-Virgin Olive Oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'organic', u'extra-virgin', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Fine Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'4 Medium-Size Boneless, Skinless Organic Chicken Breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'organic', u'medium-size'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 Medium-Size Yellow Onion, halved and cut into 1/4-inch/0.65 cm slices', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium-size', u'halved', u'cut into 1/4-inch/0.65 cm slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://fedandfit.com/2013/03/22/moroccan-marinated-chicken-breasts-with-wilted-onions/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a small bowl, combine the cinnamon, coriander, ginger, pepper, nutmeg, allspice, and 2 tablespoons of the oil. Arrange the chicken on a plate or platter and spread both sides with the spice paste. Sprinkle both sides with salt. Cover and chill in the refrigerator for at least 4 hours, or overnight.Preheat the oven to 450\xb0F/230\xb0F and let the chicken come to room temperature.In a large, ovenproof skillet over medium-high heat, heat the remaining 2 tablespoons of oil. Sear the chicken without moving on one side until browned, 4 to 5 minutes. Turn the chicken, transfer the skillet to the oven, and roast until the chicken is cooked through, 8 to 10 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the skillet from the oven (careful—the handle of the skillet will be very hot), transfer the chicken to a plate, and let it rest, covered loosely with foil.Meanwhile, place the skillet on the stovetop over medium heat and add the onion. Cook, stirring occasionally and scraping up any browned bits in the skillet, until it starts to soften, about 3 minutes. Lower the heat to low and cook until tender and wilted, about 7 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add salt to taste.Arrange the chicken on plates or a platter and top with the onion.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Cut the onions into large wedges with the root intact. Wipe all sides of the onion in a thin layer of EVOO.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place on grill at high heat for 3 minutes each side. To deglaze the pan, juice one large lemon over low heat and stir until the drippings and spices release and form a consistent sauce.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over chicken.', u'number': 3, u'ingredients': []}], u'name': u'Serve hot, drizzled with any accumulated juices or pan drippings.These chicken breasts would also be good cooked on the grill, topped with grilled onion. Keeping the root end intact, cut the whole onion into wedges (so that each wedge has a bit of root holding it together) and grill them on both sides.F&F Alternative'}], u'winePairing': {u'pairingText': u'Chicken Breast on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'In a small bowl, combine the cinnamon, coriander, ginger, pepper, nutmeg, allspice, and 2 tablespoons of the oil. Arrange the chicken on a plate or platter and spread both sides with the spice paste. Sprinkle both sides with salt. Cover and chill in the refrigerator for at least 4 hours, or overnight.Preheat the oven to 450\xb0F/230\xb0F and let the chicken come to room temperature.In a large, ovenproof skillet over medium-high heat, heat the remaining 2 tablespoons of oil. Sear the chicken without moving on one side until browned, 4 to 5 minutes. Turn the chicken, transfer the skillet to the oven, and roast until the chicken is cooked through, 8 to 10 minutes. Remove the skillet from the oven (careful—the handle of the skillet will be very hot), transfer the chicken to a plate, and let it rest, covered loosely with foil.Meanwhile, place the skillet on the stovetop over medium heat and add the onion. Cook, stirring occasionally and scraping up any browned bits in the skillet, until it starts to soften, about 3 minutes. Lower the heat to low and cook until tender and wilted, about 7 minutes. Add salt to taste.Arrange the chicken on plates or a platter and top with the onion. Serve hot, drizzled with any accumulated juices or pan drippings.These chicken breasts would also be good cooked on the grill, topped with grilled onion. Keeping the root end intact, cut the whole onion into wedges (so that each wedge has a bit of root holding it together) and grill them on both sides.F&F Alternative: Cut the onions into large wedges with the root intact. Wipe all sides of the onion in a thin layer of EVOO. Place on grill at high heat for 3 minutes each side. To deglaze the pan, juice one large lemon over low heat and stir until the drippings and spices release and form a consistent sauce. Serve over chicken.', u'spoonacularSourceUrl': u'https://spoonacular.com/moroccan-marinated-chicken-breasts-with-wilted-onions-584011', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 300, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}