{u'recipes': [{u'sourceName': u'Eggless Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/246929-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 246929, u'veryPopular': False, u'lowFodmap': False, u'title': u'Low Fat Samosas', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 28.82, u'creditText': u'Eggless Cooking', u'extendedIngredients': [{u'originalString': u'To garnish Cilantro/Coriander Leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Leave', u'unitShort': u'Leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Leaves'}, {u'originalString': u'1 teaspoon Coriander Powder', u'aisle': u'Spices and Seasonings', u'name': u'coriander powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Cumin Seed', u'aisle': u'Spices and Seasonings', u'name': u'cumin seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'As Needed Mini Fillo Shells', u'aisle': u'Refrigerated;Frozen', u'name': u'fillo shells', u'metaInformation': [u'mini', u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 93817, u'unit': u'servings'}, {u'originalString': u'Little Lemon Juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'servings'}, {u'originalString': u'2 teaspoons Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 Finely Chopped Medium Size Onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium size', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Handful Green peas (Fresh OR Frozen)', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'fresh', u'green', u'frozen', u'( OR )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'Handful'}, {u'originalString': u'As Needed Any Potato curry', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 11362, u'unit': u'servings'}, {u'originalString': u'3 Medium Size Potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'medium size'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'As Needed Red Chili Powder', u'aisle': u'Spices and Seasonings', u'name': u'red chili powder', u'metaInformation': [u'red', u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 2009, u'unit': u'servings'}, {u'originalString': u'As Needed Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'A Pinch Turmeric Powder', u'aisle': u'Spices and Seasonings', u'name': u'turmeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'inch'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.egglesscooking.com/2009/04/08/low-fat-samosas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven for 15 minutes at 350F.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the fillo shells in a cookie sheet and bake it for 7-8 minutes.Take the shells out of the oven and let it cool for at least 2 minutes.  Then spoon in the prepared potato filling in the shells and serve it.  Crispy samosas are ready to be eaten.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'id': 93817, u'name': u'mini filo shells'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Samosa. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 182, u'instructions': u'Preheat the oven for 15 minutes at 350F.Place the fillo shells in a cookie sheet and bake it for 7-8 minutes.Take the shells out of the oven and let it cool for at least 2 minutes.  Then spoon in the prepared potato filling in the shells and serve it.  Crispy samosas are ready to be eaten.', u'spoonacularSourceUrl': u'https://spoonacular.com/low-fat-samosas-246929', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}