{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549388-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 549388, u'veryPopular': True, u'lowFodmap': False, u'title': u'Key Lime Pie Milkshake', u'diets': [], u'preparationMinutes': 2, u'pricePerServing': 375.13, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 Tablespoon Butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoon'}, {u'originalString': u'2 graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1 1/2 cup Heavy Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1-2 Pieces of Key Lime Pie, chopped', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'Pieces'}, {u'originalString': u'1/2 Teaspoon Lime Zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1009159, u'unit': u'Teaspoon'}, {u'originalString': u'*Milk if needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'serving'}, {u'originalString': u'1/3 cup Powdered Sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'2 cups Tillamook Vanilla Bean Ice Cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2013/06/key-lime-pie-milkshake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 111, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Grind the graham crackers into crumbs, and add the butter until just moistened like wet sand. In a large bowl, using a hand mixer, mix the heavy cream until stiff peaks begin to form.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the powdered sugar and mix until sweetened and stiff peaks return.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all of the ingredients into a blender and turn onto low, mixing until just combined.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into a large glass and top with whipped cream and graham cracker crumbs.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 4319, u'instructions': u'Grind the graham crackers into crumbs, and add the butter until just moistened like wet sand. In a large bowl, using a hand mixer, mix the heavy cream until stiff peaks begin to form. Add the powdered sugar and mix until sweetened and stiff peaks return. Place all of the ingredients into a blender and turn onto low, mixing until just combined. Pour into a large glass and top with whipped cream and graham cracker crumbs.', u'spoonacularSourceUrl': u'https://spoonacular.com/key-lime-pie-milkshake-549388', u'dishTypes': [u'dessert', u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 3, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}