{u'recipes': [{u'sourceName': u'The Novice Chef Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/583804-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 583804, u'veryPopular': True, u'lowFodmap': False, u'title': u"Kerri's Tuna Pasta Salad", u'diets': [u'pescatarian'], u'pricePerServing': 127.39, u'creditText': u'The Novice Chef Blog', u'extendedIngredients': [{u'originalString': u'1 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped celery (about 3 stalks)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped', u'( 3 stalks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoon celery salt', u'aisle': u'Spices and Seasonings', u'name': u'celery salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1052047, u'unit': u'teaspoon'}, {u'originalString': u'1 lb (16 oz box) elbow macaroni', u'aisle': u'Pasta and Rice', u'name': u'elbow macaroni', u'metaInformation': [u'(16 oz box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10120499, u'unit': u'lb'}, {u'originalString': u'2 teaspoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1 cup mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 cup sweet peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1/4 cup sweet relish', u'aisle': u'Condiments', u'name': u'pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 11944, u'unit': u'cup'}, {u'originalString': u'2 shallots, minced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1 1/2 tablespoons stone ground dijon mustard', u'aisle': u'Condiments', u'name': u'stone ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'1 can (12 oz) albacore tuna, drained', u'aisle': u'Canned and Jarred', u'name': u'tuna', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 15119, u'unit': u'oz'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.thenovicechefblog.com/2014/06/kerris-tuna-pasta-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large stock pot, cook elbow macaroni according to package directions. While it is cooking, in a large bowl, whisk together mayo, relish, dijon mustard, lemon juice, celery salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'id': 10120499, u'name': u'elbow macaroni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Add in tuna, peas, cheddar cheese, celery and shallots. Once macaroni is cooked, drain it well and stir into the tuna mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [], u'step': u'Mix well.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u"Serve immediately. Kerri serves it warm and I have to agree, it's best that way. But it is also tasty cold leftover the next day. It just might need a little extra dressing of some sort stirred in to refresh it -- since the noodles like to soak up all the dressing.", u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1030, u'instructions': u"In a large stock pot, cook elbow macaroni according to package directions. While it is cooking, in a large bowl, whisk together mayo, relish, dijon mustard, lemon juice, celery salt and pepper. Add in tuna, peas, cheddar cheese, celery and shallots. Once macaroni is cooked, drain it well and stir into the tuna mixture. Mix well. Serve immediately. Kerri serves it warm and I have to agree, it's best that way. But it is also tasty cold leftover the next day. It just might need a little extra dressing of some sort stirred in to refresh it -- since the noodles like to soak up all the dressing.", u'spoonacularSourceUrl': u'https://spoonacular.com/kerris-tuna-pasta-salad-583804', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}