{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/397569-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 315, u'id': 397569, u'veryPopular': False, u'lowFodmap': False, u'title': u'Melt-in-Your-Mouth Meat Loaf', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 32.25, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons dried minced onion', u'aisle': u'Spices and Seasonings', u'name': u'dried onion', u'metaInformation': [u'dried', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11284, u'unit': u'teaspoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon ground mustard', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'3/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon rubbed sage', u'aisle': u'Spices and Seasonings', u'name': u'rubbed sage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2038, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup seasoned bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/melt-in-your-mouth-meat-loaf', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the first six ingredients. Crumble beef over mixture and mix well (mixture will be moist). Shape into a round loaf; place in a 5-qt. slow cooker. Cover and cook on low for 5-6 hours or until no pink remains and a meat thermometer reads 160\xb0.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, whisk the ketchup, brown sugar, mustard and Worcestershire sauce. Spoon over the meat loaf. Cook 15 minutes longer or until heated through.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}, {u'equipment': [], u'step': u'Let stand for 10-15 minutes before slicing.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Meatloaf works really well with Cabernet Sauvignon and Zinfandel. Meatloaf will work with many red wines. We recommend something bold and fruity, like a Cabernet Sauvignon or Zinfandel. You could try PlumpJack Oakville Estate Cabernet Sauvignon. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 55 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'zinfandel'], u'productMatches': [{u'description': u'Unique aromas of fennel, violets, star anise dried sweet herbs, and black bing cherry preserves in the aroma are echoed in the wine in this classically constructed cabernet. As the wine opens, bright acidity counterpoints delicate notes of cedar, sweet black fruit and spices that are enhanced by a background of Baker\'s chocolate and vanilla, culminating in a rich finish.Our 100% estate Cabernet Sauvignon is made entirely from grapes grown in the vineyards immediately adjacent to PlumpJack Winery located on Oakville Cross Road, Oakville Appellation, Napa Valley, California."Wonderful harmony, intensity and concentration, with sweet, juicy currant and blackberry fruit at the center, shaded by cedary oak, which gives off a taste of sage and olive."-Wine Spectator View More', u'title': u'PlumpJack Oakville Estate Cabernet Sauvignon', u'price': u'$54.99', u'id': 438024, u'link': u'https://www.wine.com/product/plumpjack-oakville-estate-cabernet-sauvignon-2000/56559', u'imageUrl': u'https://spoonacular.com/productImages/438024-312x231.jpg'}]}, u'aggregateLikes': 117, u'instructions': u'Directions                                                                                In a large bowl, combine the first six ingredients. Crumble beef over mixture and mix well (mixture will be moist). Shape into a round loaf; place in a 5-qt. slow cooker. Cover and cook on low for 5-6 hours or until no pink remains and a meat thermometer reads 160\xb0.                                                                                           In a small bowl, whisk the ketchup, brown sugar, mustard and Worcestershire sauce. Spoon over the meat loaf. Cook 15 minutes longer or until heated through. Let stand for 10-15 minutes before slicing.                                        Yield: 6 servings.                                                                                                                         Originally published as Melt-In-Your-Mouth Meat Loaf in  Quick CookingSeptember/October 2003, p43                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 346 calories, 17 g fat (7 g saturated fat), 150 mg cholesterol, 800 mg sodium, 18 g carbohydrate, 1 g fiber, 28 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/melt-in-your-mouth-meat-loaf-397569', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 330, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}