{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597357-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 597357, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Fingers', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 239.8, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 1/4 cups crushed cornflake crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'cornflake crumbs', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1008020, u'unit': u'cups'}, {u'originalString': u'2 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'Ketchup (what else?) for dipping', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [u'for dipping', u'(what else?)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'servings'}, {u'originalString': u'Olive oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds organic boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://leitesculinaria.com/50830/recipes-chicken-fingers.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pound the living hell out of your chicken breasts. (Don’t bother continuing with this recipe if you skip this step. It’s by far the most important–for many reasons.)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut the chicken into strips or chunks that closely resemble the size and shape of the chicken fingers or nuggets at your kids’ favorite restaurant.2. Set up your dredging station with a rimmed plate containing the eggs, a plate with a mound of flour (that you’ve salted and peppered), and a plate with the cornflake crumbs.3. Dredge your pounded chicken fingers first in the flour, then in the egg, then in the crumbs. Be sure to jiggle the chicken in between dips and dredges to allow any excess ingredients to fall away.4. In a large skillet over medium-high heat, saut\xe9 the chicken in a tablespoon or so of olive oil for about 2 to 3 minutes each side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes', u'id': 1008020, u'name': u'corn flake crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'id': 1015062, u'name': u'chicken tenders'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve hot–with a great big dollop of ketchup, if you must.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 95, u'instructions': u'1. Pound the living hell out of your chicken breasts. (Don’t bother continuing with this recipe if you skip this step. It’s by far the most important–for many reasons.) Cut the chicken into strips or chunks that closely resemble the size and shape of the chicken fingers or nuggets at your kids’ favorite restaurant.2. Set up your dredging station with a rimmed plate containing the eggs, a plate with a mound of flour (that you’ve salted and peppered), and a plate with the cornflake crumbs.3. Dredge your pounded chicken fingers first in the flour, then in the egg, then in the crumbs. Be sure to jiggle the chicken in between dips and dredges to allow any excess ingredients to fall away.4. In a large skillet over medium-high heat, saut\xe9 the chicken in a tablespoon or so of olive oil for about 2 to 3 minutes each side. Serve hot–with a great big dollop of ketchup, if you must.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-fingers-597357', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}