{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/200488-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 200488, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cook the Book: Fresh Ricotta and Egg Ravioli with Brown Butter', u'diets': [], u'pricePerServing': 209.65, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'6 extra-large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'extra-large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 extra-large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'extra-large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 extra-large farm-fresh eggs for finishing and serving the pasta', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'extra-large', u'for finishing and serving the pasta'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/4 cups all-purpose flour, plus more for dusting', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dusting', u'all-purpose', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 pound fresh ricotta (about 2 cups)', u'aisle': u'Cheese', u'name': u'fresh ricotta', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'cups'}, {u'originalString': u'18 fresh sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'3 tablespoons heavy whipping cream, plus more as needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup freshly grated Parmigiano-Reggiano', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Wedge of Parmigiano- Reggiano, for grating', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'for grating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups (3 sticks) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(3 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/10/fresh-ricotta-and-egg-ravioli-with-brown-butter-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the ricotta and Parmigiano-Reggiano in a medium bowl, and sprinkle with the salt, sugar, and nutmeg. Stir to combine the seasonings with the cheese. Stir in the cream, adding more if necessary to obtain the consistency of soft- serve ice cream. (You can make the filling up to two days in advance.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Transfer it to an airtight container and refrigerate until you are ready to assemble the ravioli.) Scoop up 1/3 cup of the ricotta filling and form it into a disk about 1/2 inch high and 2 1/4 inches in diameter. Set the disk on a plate and repeat, forming the remaining ricotta into a total of 8 disks. Set them aside while you prepare the dough for the ravioli.\xa0', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [], u'step': u'3', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'To make the ravioli, cut eight 4-inch square pieces of parchment and dust two baking sheets with semolina.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the dough out to the third thinnest setting on a pasta sheeter (number 6 using a Kitchen', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Aid attachment), stacking the sheets of dough on one of the parchment-lined baking sheets. When you have rolled out all of the dough, dust a flat work surface with flour and lay one sheet of the\xa0dough on the floured surface.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Place three or four ricotta disks on the dough, leaving 4 inches between each disk and 1 1/2 to 2 inches of dough on all the sides of the outer disks. Use the back of a spoon or your fingers to make a crater deep enough to hold an egg yolk in the center of each disk. Separate one egg, reserving the white and carefully sliding the yolk into one crater. Repeat, filling the remaining 2 or 3 disks in the same way (you don’t need to reserve any more whites).', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'4', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}], u'step': u'Lay a second sheet of dough directly behind the first and use a rolling pastry cutter, starting at the edge of the dough nearest your body and moving in a straight line directly away from you, making one long cut through both sheets of dough between two disks of ricotta. Continue making cuts down the sheet of dough between the disks. Using a pastry brush, brush egg white around each cheese disk. Lift one segment of dough from the back sheet and lay it on top of the corresponding front segment of dough. Without lifting the raviolo, cup both hands around the cheese so that the edges of your pinky fingers press down around the cheese, sealing the raviolo closed. Repeat, covering and sealing the remaining ravioli. Use a 3 \xd7 3 inch fluted cookie cutter or fluted pastry wheel to cut each raviolo, discarding the scraps of dough around it.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place the ravioli on the prepared baking sheet and repeat, assembling the remaining ravioli in the same way. Cover the baking sheet with plastic wrap and refrigerate until you are ready to boil them, or for up to 8 hours.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Fill two wide pots with 6 quarts of water each.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add 6 tablespoons of salt to each pot and bring to a boil over high heat. Have a slotted spatula or slotted spoon and a clean dishtowel handy for lifting the ravioli out of the water.\xa0', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'6', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'While the water is coming to a boil, make the brown butter sauce.', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the butter and sage leaves in a medium saucepan and cook over medium-high heat for 3 to 5 minutes without stirring, swirling the pan occasionally to brown the butter evenly and prevent it from burning, until the bubbles subside and the butter is dark brown with a nutty, toasty smell. Reduce the heat to low to keep the butter warm while you cook the pasta.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [], u'step': u'7', u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the ravioli from the refrigerator and, one at a time, lift the parchment holding each raviolo off the baking sheet and gently drop the raviolo with the paper into the water, adding 4 ravioli to each pot. (The parchment will quickly separate and will be easy to remove from the water.) When you have dropped all the ravioli, remove and discard the parchment paper, partially cover the pots to return the water to a boil quickly, and keep it boiling. Cook the ravioli for 4 minutes. With a clean dishtowel in one hand and a slotted spoon or spatula in the other, lift one raviolo out of the water and onto the dishtowel to blot it dry, and then carefully place it in the center of a dinner plate.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'8', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Repeat with the remaining ravioli.', u'number': 20, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the brown butter over the ravioli, dividing it evenly.', u'number': 21, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microplane.jpg', u'id': 405906, u'name': u'microplane'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404631, u'name': u'grater'}], u'step': u'Place one of the sage leaves on top of each raviolo, discarding the remaining leaves. Use a microplane or another fine grater to grate a light dusting of Parmigiano-Reggiano over each raviolo, and serve.', u'number': 22, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}], u'name': u'To make the Ravioli'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the flour, eggs, and egg yolks in the bowl of a standing mixer fitted with the paddle attachment and mix on low speed until the dough comes together. Turn off the mixer, remove the paddle attachment, and replace it with the dough hook. Scrape down the sides of the bowl and beat the dough with the dough hook on medium speed until it forms a ball, about 5 minutes. Dust a flat work surface with flour. Turn the dough out onto the dusted surface and gently knead it for 20 to 25 minutes, until the ball begins to feel elastic and the surface of the dough feels smooth and silky. Wrap the dough in plastic wrap and refrigerate to rest for at least 45 minutes and up to overnight before sheeting it (any longer and the dough will discolor).', u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'2', u'number': 2, u'ingredients': []}], u'name': u'For the Basic Pasta Dough'}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Selvapiana Chianti Rufina with a 4.3 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses.', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 117, u'instructions': u'Procedures                                                                              1                                                                            For the Basic Pasta Dough: Put the flour, eggs, and egg yolks in the bowl of a standing mixer fitted with the paddle attachment and mix on low speed until the dough comes together. Turn off the mixer, remove the paddle attachment, and replace it with the dough hook. Scrape down the sides of the bowl and beat the dough with the dough hook on medium speed until it forms a ball, about 5 minutes. Dust a flat work surface with flour. Turn the dough out onto the dusted surface and gently knead it for 20 to 25 minutes, until the ball begins to feel elastic and the surface of the dough feels smooth and silky. Wrap the dough in plastic wrap and refrigerate to rest for at least 45 minutes and up to overnight before sheeting it (any longer and the dough will discolor).                                                                                                                            2                                                                            To make the Ravioli: Combine the ricotta and Parmigiano-Reggiano in a medium bowl, and sprinkle with the salt, sugar, and nutmeg. Stir to combine the seasonings with the cheese. Stir in the cream, adding more if necessary to obtain the consistency of soft- serve ice cream. (You can make the filling up to two days in advance. Transfer it to an airtight container and refrigerate until you are ready to assemble the ravioli.) Scoop up 1/3 cup of the ricotta filling and form it into a disk about 1/2 inch high and 2 1/4 inches in diameter. Set the disk on a plate and repeat, forming the remaining ricotta into a total of 8 disks. Set them aside while you prepare the dough for the ravioli.\xa0                                                                                                                            3                                                                            To make the ravioli, cut eight 4-inch square pieces of parchment and dust two baking sheets with semolina. Roll the dough out to the third thinnest setting on a pasta sheeter (number 6 using a KitchenAid attachment), stacking the sheets of dough on one of the parchment-lined baking sheets. When you have rolled out all of the dough, dust a flat work surface with flour and lay one sheet of the\xa0dough on the floured surface. Place three or four ricotta disks on the dough, leaving 4 inches between each disk and 1 1/2 to 2 inches of dough on all the sides of the outer disks. Use the back of a spoon or your fingers to make a crater deep enough to hold an egg yolk in the center of each disk. Separate one egg, reserving the white and carefully sliding the yolk into one crater. Repeat, filling the remaining 2 or 3 disks in the same way (you don’t need to reserve any more whites).                                                                                                                            4                                                                            Lay a second sheet of dough directly behind the first and use a rolling pastry cutter, starting at the edge of the dough nearest your body and moving in a straight line directly away from you, making one long cut through both sheets of dough between two disks of ricotta. Continue making cuts down the sheet of dough between the disks. Using a pastry brush, brush egg white around each cheese disk. Lift one segment of dough from the back sheet and lay it on top of the corresponding front segment of dough. Without lifting the raviolo, cup both hands around the cheese so that the edges of your pinky fingers press down around the cheese, sealing the raviolo closed. Repeat, covering and sealing the remaining ravioli. Use a 3 \xd7 3 inch fluted cookie cutter or fluted pastry wheel to cut each raviolo, discarding the scraps of dough around it. Place the ravioli on the prepared baking sheet and repeat, assembling the remaining ravioli in the same way. Cover the baking sheet with plastic wrap and refrigerate until you are ready to boil them, or for up to 8 hours.                                                                                                                             5                                                                            Fill two wide pots with 6 quarts of water each. Add 6 tablespoons of salt to each pot and bring to a boil over high heat. Have a slotted spatula or slotted spoon and a clean dishtowel handy for lifting the ravioli out of the water.\xa0                                                                                                                            6                                                                            While the water is coming to a boil, make the brown butter sauce. Place the butter and sage leaves in a medium saucepan and cook over medium-high heat for 3 to 5 minutes without stirring, swirling the pan occasionally to brown the butter evenly and prevent it from burning, until the bubbles subside and the butter is dark brown with a nutty, toasty smell. Reduce the heat to low to keep the butter warm while you cook the pasta.                                                                                                                            7                                                                            Remove the ravioli from the refrigerator and, one at a time, lift the parchment holding each raviolo off the baking sheet and gently drop the raviolo with the paper into the water, adding 4 ravioli to each pot. (The parchment will quickly separate and will be easy to remove from the water.) When you have dropped all the ravioli, remove and discard the parchment paper, partially cover the pots to return the water to a boil quickly, and keep it boiling. Cook the ravioli for 4 minutes. With a clean dishtowel in one hand and a slotted spoon or spatula in the other, lift one raviolo out of the water and onto the dishtowel to blot it dry, and then carefully place it in the center of a dinner plate.                                                                                                                            8                                                                            Repeat with the remaining ravioli. Pour the brown butter over the ravioli, dividing it evenly. Place one of the sage leaves on top of each raviolo, discarding the remaining leaves. Use a microplane or another fine grater to grate a light dusting of Parmigiano-Reggiano over each raviolo, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-fresh-ricotta-and-egg-ravioli-with-brown-butter-200488', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}