{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/249785-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 249785, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sunbutter Fudge Ripple Dairy-Free Ice Cream', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 114.83, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1/3 cup dairy-free chocolate chips', u'aisle': u'Health Foods;Baking', u'name': u'dairy-free chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 98848, u'unit': u'cup'}, {u'originalString': u'2 cups full-fat canned coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full-fat coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon guar gum', u'aisle': u'Health Foods', u'name': u'guar gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93765, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups cashew milk or hemp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hemp milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hemp-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 98874, u'unit': u'cups'}, {u'originalString': u'1/2 cup soft pitted medjool dates (soaked first if they are dry)', u'aisle': u'Dried Fruits;Produce', u'name': u'medjool dates', u'metaInformation': [u'dry', u'pitted', u'soft', u'(soaked first if they are )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9421, u'unit': u'cup'}, {u'originalString': u'pinch sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 tablespoon real vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/vegan-sunbutter-fudge-ripple-ice-cream', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the coconut milk in a small saucepan until it just begins to simmer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the hot coconut milk over the chocolate chips in a bowl to melt them.Stir to combine, and set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the coconut milk, and dates to a high power blender or food processor, and puree until creamy and smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}, {u'equipment': [], u'step': u'Add the cashew or hemp milk, SunButter, salt, vanilla, and guar gum, and puree until creamy and smooth.Freeze the mixture for about one hour or refrigerate until cold.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hemp-milk.jpg', u'id': 98874, u'name': u'hemp milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93765, u'name': u'guar gum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour it into your ice cream maker per your manufacturer’s directions.Once the ice cream maker has finished, layer the ice cream with the ganache in a freezer safe bowl.Cover and freeze until hard enough to scoop.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 248, u'instructions': u'Heat the coconut milk in a small saucepan until it just begins to simmer.Pour the hot coconut milk over the chocolate chips in a bowl to melt them.Stir to combine, and set aside.Add the coconut milk, and dates to a high power blender or food processor, and puree until creamy and smooth.Add the cashew or hemp milk, SunButter, salt, vanilla, and guar gum, and puree until creamy and smooth.Freeze the mixture for about one hour or refrigerate until cold.Pour it into your ice cream maker per your manufacturer’s directions.Once the ice cream maker has finished, layer the ice cream with the ganache in a freezer safe bowl.Cover and freeze until hard enough to scoop.', u'spoonacularSourceUrl': u'https://spoonacular.com/sunbutter-fudge-ripple-dairy-free-ice-cream-249785', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}