{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/219767-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 219767, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tofu & asparagus pad Thai', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 185.51, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'10 asparagus spears, trimmed and sliced on the diagonal', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'trimmed', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'handful each coriander leaves and salted peanuts, to serve', u'aisle': u'Spices and Seasonings', u'name': u'dried coriander leaves', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'handful'}, {u'originalString': u'3 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tbsp tamarind paste, or extra lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tbsp'}, {u'originalString': u'2 limes, 1 juiced, one cut into wedges', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'juiced', u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'200g flat rice noodles', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-rice-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20133, u'unit': u'g'}, {u'originalString': u'6 spring onions halved and thinly sliced lengthways', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'halved', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 tbsp vegetable oil or sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp sweet chilli sauce, plus extra for serving', u'aisle': u'Ethnic Foods', u'name': u'sweet chilli sauce', u'metaInformation': [u'sweet', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 98962, u'unit': u'tbsp'}, {u'originalString': u'300g firm tofu, drained, patted dry and cut into cubes', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'dry', u'firm', u'drained', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 16162, u'unit': u'g'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1262640/tofu-and-asparagus-pad-thai', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the noodles following packetinstructions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the lime juice, tamarindand chilli sauce in a small bowl. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat 1 tbsp oil in a non-stick frying panor wok and fry the tofu for 5-8 mins, untilgolden all over. Set aside.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Add the remaining oil and stir-fry theasparagus until tender. Tip in the springonions, beansprouts and garlic. Cook for2 mins more. Stir in the drained noodles,sauce and some salt.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Mix in the tofu andheat through.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Serve with coriander,salted peanuts and lime wedges.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}]}], u'name': u''}], u'aggregateLikes': 88, u'instructions': u'Cook the noodles following packetinstructions. Mix the lime juice, tamarindand chilli sauce in a small bowl. Set aside.Heat 1 tbsp oil in a non-stick frying panor wok and fry the tofu for 5-8 mins, untilgolden all over. Set aside.Add the remaining oil and stir-fry theasparagus until tender. Tip in the springonions, beansprouts and garlic. Cook for2 mins more. Stir in the drained noodles,sauce and some salt. Mix in the tofu andheat through. Serve with coriander,salted peanuts and lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/tofu-asparagus-pad-thai-219767', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}