{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/630763-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 630763, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tuna, rocket and lemon pasta', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 113.36, u'extendedIngredients': [{u'originalString': u'1 lemon, juice and zest', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'3-4 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'300g 10\xbdoz penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'g'}, {u'originalString': u'70g 2\xbcoz rocket leaves, roughly torn', u'aisle': u'Produce', u'name': u'rocket', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 70.0, u'consistency': u'solid', u'id': 11959, u'unit': u'g'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 x 185g 6\xbdoz tin tuna, drained and broken into bite-sized pieces', u'aisle': u'Canned and Jarred', u'name': u'tuna', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 15119, u'unit': u''}], u'healthScore': 69.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.bbc.co.uk/food/recipes/tuna_rocket_and_lemon_95118', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bring a large saucepan of water to the boil and add a generous pinch of salt. Cook the pasta according to packet instructions. Once cooked, drain and transfer to a large serving bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix the olive oil into the cooked pasta and season with salt and pepper. Stir through the tuna and add the zest of the lemon along with the juice of half of the lemon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [], u'step': u'Just before serving toss through the rocket leaves.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Maso Canali Pinot Grigio. It has 4.6 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 439, u'instructions': u'Bring a large saucepan of water to the boil and add a generous pinch of salt. Cook the pasta according to packet instructions. Once cooked, drain and transfer to a large serving bowl.                        Mix the olive oil into the cooked pasta and season with salt and pepper. Stir through the tuna and add the zest of the lemon along with the juice of half of the lemon.                         Just before serving toss through the rocket leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/tuna-rocket-and-lemon-pasta-630763', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}