{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/534179-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 534179, u'veryPopular': False, u'lowFodmap': True, u'title': u'Baked Cheese Risotto', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 160.72, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'1 1/2 cups arborio rice', u'aisle': u'Pasta and Rice', u'name': u'arborio rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020052, u'unit': u'cups'}, {u'originalString': u'1 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'4 1/2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'cooked meat or veg', u'name': u'meat', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1065062, u'unit': u'servings'}, {u'originalString': u'1 cup parmesan or other cheese', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11304, u'unit': u'servings'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.thereciperebel.com/baked-cheese-risotto/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.In a 2.5 quart casserole dish, combine rice and broth. Cover tightly with tin foil and bake for 40-50 minutes (the original recipe says 40, mine needed about 50. Check at 40 and see if it needs extra time -- you want the rice al dente and not mushy).', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and stir in butter and any additional flavours you desire -- I always love peas with my risotto! Be careful not to stir too much or the rice will get mushy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Risotto works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Carpineta Fontalpino Chianti Classico. It has 4.6 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The color is typical of the purity of the Sangiovese, a deep red with traces of violet. An interesting nose of plum, cherry, currant, rose, violet, cinnamon and cocoa. On the palate, this wine is elegant and persistent, with a tannic structure and high acidity. It is well-balanced with aromas of flowers and spices evolving on a long and round finish.', u'title': u'Carpineta Fontalpino Chianti Classico', u'price': u'$19.99', u'id': 446740, u'link': u'https://www.wine.com/product/carpineta-fontalpino-chianti-classico-2009/116281', u'imageUrl': u'https://spoonacular.com/productImages/446740-312x231.jpg'}]}, u'aggregateLikes': 98, u'instructions': u'Preheat oven to 350 degrees F.In a 2.5 quart casserole dish, combine rice and broth. Cover tightly with tin foil and bake for 40-50 minutes (the original recipe says 40, mine needed about 50. Check at 40 and see if it needs extra time -- you want the rice al dente and not mushy).Remove from the oven and stir in butter and any additional flavours you desire -- I always love peas with my risotto! Be careful not to stir too much or the rice will get mushy.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-cheese-risotto-534179', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}