{u'recipes': [{u'sourceName': u'The Gunny Sack', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/713301-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 713301, u'veryPopular': False, u'lowFodmap': False, u'title': u'Red Velvet Hot Chocolate Cookie Cups', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 63.79, u'creditText': u'The Gunny Sack', u'extendedIngredients': [{u'originalString': u'\xbc cup Jet-Puffed Mallow Bits Mini Marshmallows', u'aisle': u'Meat', u'name': u'bacon bits', u'metaInformation': [u'jet-puffed', u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10862, u'unit': u'cup'}, {u'originalString': u'\xbc cup red candy melts', u'aisle': u'Baking', u'name': u'candy melts', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93775, u'unit': u'cup'}, {u'originalString': u'\xbc cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 tbsp hot chocolate mix', u'aisle': u'Beverages', u'name': u'hot chocolate mix', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 14197, u'unit': u'tbsp'}, {u'originalString': u'24 pretzel loops for handles', u'aisle': u'Savory Snacks', u'name': u'pretzel', u'metaInformation': [u'for handles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 19047, u'unit': u''}, {u'originalString': u'1 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'Heart shaped sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1 package Pillsbury Red Velvet Cookie Dough (or 24 tbsp of red velvet cookie dough)', u'aisle': u'Refrigerated', u'name': u'sugar cookie dough', u'metaInformation': [u'red', u'(or 24 tbsp of velvet cookie dough)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cookie-dough.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18205, u'unit': u'package'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.thegunnysack.com/red-velvet-hot-chocolate-cookie-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the cookie dough rounds in half.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Roll them into balls and coat with sugar.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Bake in a greased silicone mini muffin pan at 375 degrees for 11-13 minutes. Allow the cookie cups to cool completely before removing them from the pan.Melt the candy melts in the microwave. Dip the pretzel handles in the melted candy coating and attach to the sides of the cookie cups.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93775, u'name': u'candy melts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Place cookie cups on their sides in the mini muffin pan to harden. (This step is VERY time-consuming. Leave the handles off if you don't have the extra time.)Bring the cream to a boil in the microwave.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the hot chocolate mix and pour in the chocolate chips. Allow them to sit for 3 minutes and then gently stir until smooth. Cool in the fridge for 10 minutes.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 14197, u'name': u'hot cocoa mix'}]}, {u'equipment': [], u'step': u'Pour the chocolate ganache into the cookie cups. Top with mini marshmallows and heart shaped sprinkles.Store in the fridge.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u"Cut the cookie dough rounds in half. Roll them into balls and coat with sugar.Bake in a greased silicone mini muffin pan at 375 degrees for 11-13 minutes. Allow the cookie cups to cool completely before removing them from the pan.Melt the candy melts in the microwave. Dip the pretzel handles in the melted candy coating and attach to the sides of the cookie cups. Place cookie cups on their sides in the mini muffin pan to harden. (This step is VERY time-consuming. Leave the handles off if you don't have the extra time.)Bring the cream to a boil in the microwave. Whisk in the hot chocolate mix and pour in the chocolate chips. Allow them to sit for 3 minutes and then gently stir until smooth. Cool in the fridge for 10 minutes.Pour the chocolate ganache into the cookie cups. Top with mini marshmallows and heart shaped sprinkles.Store in the fridge.", u'spoonacularSourceUrl': u'https://spoonacular.com/red-velvet-hot-chocolate-cookie-cups-713301', u'dishTypes': [], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}