{u'recipes': [{u'sourceName': u'The Novice Chef Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/583887-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 583887, u'veryPopular': True, u'lowFodmap': False, u'title': u'Clementine Bling Muffins', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 89.85, u'creditText': u'The Novice Chef Blog', u'extendedIngredients': [{u'originalString': u'1 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'zest & juice of 1 Clementine', u'aisle': u'Beverages', u'name': u'clementine juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tangerine-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9221, u'unit': u''}, {u'originalString': u'1 tablespoon clementine juice', u'aisle': u'Beverages', u'name': u'clementine juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tangerine-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9221, u'unit': u'tablespoon'}, {u'originalString': u'1 cup confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'zest of 1 clementine', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'1/3 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.thenovicechefblog.com/2012/01/clementine-bling-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Grease muffin tin with butter or non stick spray. In a medium bowl, whisk together flour, sugar, baking powder and salt. Set aside. In a large bowl, whisk together egg, oil, milk, zest and juice of 1 clementine and vanilla extract.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the dry ingredients to the wet ingredients, whisking until just combined. Evenly divide the batter, about 1/4 cup batter per muffing tin.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 14-16 minutes, or until a toothpick inserted in the center comes out clean.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool on rack for about 10 minutes, then turn out onto rack to cool completely.For the glaze: In a small bowl, whisk the confectioners sugar with clementine juice. You want the glaze to be thick enough to thickly coat the back of a metal spoon.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tangerine-juice.jpg', u'id': 9221, u'name': u'clementine juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add more sugar or juice as needed to reach the desired consistency. For the sugared zest: In a small bowl, combine clementine zest and sugar with your fingers, until zest is evenly distributed. When muffins are cooled completely, dip the tops in the glaze and immediately sprinkle with sugared zest.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Serve immediately or store in an airtight container for up to 3 days. Tip: When grating a fruit for zest, be sure to just grate the colored outside layer of the fruit. Do not grate the white layer, the pith, that is under the colored skin. The pith is very bitter and will give your muffins a bitter aftertaste.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1213, u'instructions': u'Preheat oven to 350 degrees. Grease muffin tin with butter or non stick spray. In a medium bowl, whisk together flour, sugar, baking powder and salt. Set aside. In a large bowl, whisk together egg, oil, milk, zest and juice of 1 clementine and vanilla extract. Add the dry ingredients to the wet ingredients, whisking until just combined. Evenly divide the batter, about 1/4 cup batter per muffing tin. Bake for 14-16 minutes, or until a toothpick inserted in the center comes out clean. Let cool on rack for about 10 minutes, then turn out onto rack to cool completely.For the glaze: In a small bowl, whisk the confectioners sugar with clementine juice. You want the glaze to be thick enough to thickly coat the back of a metal spoon. Add more sugar or juice as needed to reach the desired consistency. For the sugared zest: In a small bowl, combine clementine zest and sugar with your fingers, until zest is evenly distributed. When muffins are cooled completely, dip the tops in the glaze and immediately sprinkle with sugared zest. Serve immediately or store in an airtight container for up to 3 days. Tip: When grating a fruit for zest, be sure to just grate the colored outside layer of the fruit. Do not grate the white layer, the pith, that is under the colored skin. The pith is very bitter and will give your muffins a bitter aftertaste.', u'spoonacularSourceUrl': u'https://spoonacular.com/clementine-bling-muffins-583887', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}