{u'recipes': [{u'sourceName': u'From Valeries Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/513029-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 513029, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Covered Cherry Cookies', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 19.93, u'creditText': u'From Valeries Kitchen', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 tablespoons reserved maraschino cherry juice, plus additional as needed', u'aisle': u'Beverages', u'name': u'cherry juice', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 93677, u'unit': u'tablespoons'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'30 maraschino cherries, blotted dry', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 30.0, u'consistency': u'solid', u'id': 9328, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (6 ounces) semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1095, u'unit': u'cup'}, {u'originalString': u'1/2 cup unsweetened baking cocoa', u'aisle': u'Baking', u'name': u'unsweetened baking cocoa', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1-1/2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.fromvalerieskitchen.com/2014/02/chocolate-covered-cherry-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, use an electric mixer to cream together butter and sugars until fluffy; beat in egg and vanilla. In a separate bowl combine the dry ingredients and then add to creamed mixture a little at a time, beating until well combined. Shape into 30 balls, about 1" round, and place on ungreased or parchment paper lined baking sheets. Slightly indent each ball with one of your fingers and then push one cherry into each ball.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 10 to 11 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow cookies to cool on baking sheets for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Transfer cookies to wire racks to cool completely.Meanwhile, melt chocolate chips and sweetened condensed milk in a small, heavy saucepan over low heat, stirring constantly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}]}, {u'equipment': [], u'step': u'Remove from the heat; add 2 tablespoons reserved cherry juice and stir until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-juice.jpg', u'id': 93677, u'name': u'cherry juice'}]}, {u'equipment': [], u'step': u'Add additional cherry juice if necessary to reach desired consistency.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-juice.jpg', u'id': 93677, u'name': u'cherry juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Drizzle frosting over cooled cookies or alternately, transfer the frosting to a pastry bag and pipe over the cookies for a more uniform look.Store cookies in an airtight container.Adapted from Better Homes and Gardens', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 361, u'instructions': u'In a large mixing bowl, use an electric mixer to cream together butter and sugars until fluffy; beat in egg and vanilla. In a separate bowl combine the dry ingredients and then add to creamed mixture a little at a time, beating until well combined. Shape into 30 balls, about 1" round, and place on ungreased or parchment paper lined baking sheets. Slightly indent each ball with one of your fingers and then push one cherry into each ball. Bake at 350\xb0 for 10 to 11 minutes. Remove from oven and allow cookies to cool on baking sheets for about 5 minutes. Transfer cookies to wire racks to cool completely.Meanwhile, melt chocolate chips and sweetened condensed milk in a small, heavy saucepan over low heat, stirring constantly. Remove from the heat; add 2 tablespoons reserved cherry juice and stir until smooth. Add additional cherry juice if necessary to reach desired consistency. Drizzle frosting over cooled cookies or alternately, transfer the frosting to a pastry bag and pipe over the cookies for a more uniform look.Store cookies in an airtight container.Adapted from Better Homes and Gardens', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-covered-cherry-cookies-513029', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}