{u'recipes': [{u'sourceName': u'Table', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/610684-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 610684, u'veryPopular': False, u'lowFodmap': False, u'title': u'Juicy Bacon Burgers with a Sriracha Sauce', u'diets': [], u'preparationMinutes': 80, u'pricePerServing': 653.05, u'creditText': u'Table', u'extendedIngredients': [{u'originalString': u'1 tbsp apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tbsp'}, {u'originalString': u'4 slices bacon, cooked until crispy and chopped (optional)', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crispy', u'cooked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'4 brioche buns', u'aisle': u'Baking', u'name': u'brioche buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10093730, u'unit': u''}, {u'originalString': u'3 tbsp butter, refrigerated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'3 sprigs of fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'2 cloves garlic, grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 jalape\xf1os, diced (optional)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'\xbe cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'1 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'8 slices of pepper jack cheese', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1025, u'unit': u'slices'}, {u'originalString': u'\xbe tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1\xbd lbs sirloin steak', u'aisle': u'Meat', u'name': u'sirloin steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sirloin-raw.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 23625, u'unit': u'lbs'}, {u'originalString': u'1\xbd tbsp Sriracha', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1016168, u'unit': u'tbsp'}, {u'originalString': u'12 strips of thick-cut bacon', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'thick-cut'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 12.0, u'consistency': u'solid', u'id': 10310123, u'unit': u'strips'}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 tbsp white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tbsp'}, {u'originalString': u'1 large yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://table.io/bacon-burgers-sriracha-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 52, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Chop the sirloin into pieces about  inch wide.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sirloin-raw.jpg', u'id': 23625, u'name': u'sirloin steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Spread out onto a baking sheet and cover with plastic wrap. Freeze for 30 minutes, until the pieces start to become firm.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer  of the meat pieces to a food processor or blender.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add 1 tbsp of the cold butter. Pulse until the meat is broken down to pieces slightly larger than rice grains. Then, remove from blender and spread out over the baking sheet. Repeat with remaining two batches of meat and remaining butter.Discard any large pieces of meat, connective tissue, and butter.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add the diced jalapeos and bacon to the ground meat, if desired. Sprinkle the salt and pepper over the meat and lightly toss to combine. Do not overwork the meat. Form the ground meat and butter into 4 equal-sized patties. Using your thumb, make a  inch depression in the center. Cover with plastic wrap and freeze for 30 to 40 minutes, until the burgers are firm.Preheat the grill until hot, then oil the cooking grate. Season the burgers with any additional salt and pepper, then grill for about 5 to 8 minutes per side. The internal temperature should reach 125 degrees Fahrenheit for medium-rare or 130 degrees for medium. During the last few minutes of cooking, add two slices of cheese to each burger.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Remove the burgers from the grill and allow them to rest on a plate while toasting the buns on the grill, about 1 to 2 minutes. Watch the buns carefully to ensure that they don't burn.Assemble the burgers and enjoy!Slice the bacon into strips about  inch wide.", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the bacon and water to a cast iron skillet over medium-low heat. Render the bacon until crispy, about 20 to 25 minutes. Then, place the bacon on paper towels to drain, reserving 2 tbsp of bacon fat in the skillet.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the diced yellow onion to the skillet and cook over low heat until caramelized, about 25 to 30 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10511282, u'name': u'yellow onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a ceramic bowl and add the bacon, white wine vinegar and a few sprigs of thyme. Season with salt and pepper, to taste. Allow to cool to room temperature before storing in the refrigerator.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1002068, u'name': u'white wine vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Remove the sprigs of thyme before warming and serving.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix all of the ingredients together in a small bowl. Refrigerate until ready for use.', u'number': 11, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 333, u'instructions': u"Chop the sirloin into pieces about  inch wide. Spread out onto a baking sheet and cover with plastic wrap. Freeze for 30 minutes, until the pieces start to become firm.Transfer  of the meat pieces to a food processor or blender. Add 1 tbsp of the cold butter. Pulse until the meat is broken down to pieces slightly larger than rice grains. Then, remove from blender and spread out over the baking sheet. Repeat with remaining two batches of meat and remaining butter.Discard any large pieces of meat, connective tissue, and butter. Add the diced jalapeos and bacon to the ground meat, if desired. Sprinkle the salt and pepper over the meat and lightly toss to combine. Do not overwork the meat. Form the ground meat and butter into 4 equal-sized patties. Using your thumb, make a  inch depression in the center. Cover with plastic wrap and freeze for 30 to 40 minutes, until the burgers are firm.Preheat the grill until hot, then oil the cooking grate. Season the burgers with any additional salt and pepper, then grill for about 5 to 8 minutes per side. The internal temperature should reach 125 degrees Fahrenheit for medium-rare or 130 degrees for medium. During the last few minutes of cooking, add two slices of cheese to each burger. Remove the burgers from the grill and allow them to rest on a plate while toasting the buns on the grill, about 1 to 2 minutes. Watch the buns carefully to ensure that they don't burn.Assemble the burgers and enjoy!Slice the bacon into strips about  inch wide. Add the bacon and water to a cast iron skillet over medium-low heat. Render the bacon until crispy, about 20 to 25 minutes. Then, place the bacon on paper towels to drain, reserving 2 tbsp of bacon fat in the skillet.Add the diced yellow onion to the skillet and cook over low heat until caramelized, about 25 to 30 minutes. Transfer to a ceramic bowl and add the bacon, white wine vinegar and a few sprigs of thyme. Season with salt and pepper, to taste. Allow to cool to room temperature before storing in the refrigerator. Remove the sprigs of thyme before warming and serving.Mix all of the ingredients together in a small bowl. Refrigerate until ready for use.", u'spoonacularSourceUrl': u'https://spoonacular.com/juicy-bacon-burgers-with-a-sriracha-sauce-610684', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}