{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478915-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 478915, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pineapple Boat Fruit Salad', u'diets': [u'dairy free'], u'pricePerServing': 265.48, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'1 Banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'\xbd cup Blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'\xbc cup Shredded Coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'\xbc cup Granola', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8212, u'unit': u'cup'}, {u'originalString': u'\xbd cup Cottage Cheese or Sherbet Ice Cream (or Yogurt)', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'(or Yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19095, u'unit': u'cup'}, {u'originalString': u'1 Kiwi Fruit', u'aisle': u'Produce', u'name': u'kiwi fruit', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9148, u'unit': u''}, {u'originalString': u'1 Mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'2 quarters of an Orange', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'\xbd of a Pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'1 cup cut Watermelon', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9326, u'unit': u'cup'}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.couponclippingcook.com/pineapple-boat-fruit-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut a whole pineapple in half lengthwise.  Using a knife about the size of a steak knife, make a cut around the perimeter of the fruit- side of the pineapple about a \xbd inch from the edge.  While cutting, carefully aim your knife at a diagonal towards the inside of the fruit.  When you are cutting around the top of the pineapple by the stalk, leave a slightly wider edge so that the stalk has support and does not fall forward.  Once you’re done cutting, the middle of the pineapple should lift out.  After the middle of the pineapple is removed, use the tip of your knife to carefully hollow out the pineapple so that the inside is in the shape of a bowl or a “boat”. Then spoon out the excess pineapple and juice so that the “boat” is empty.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Cut the pineapple in fairly large chunks.  If the core is on the tough side, cut it off from the pieces of pineapple and discard.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Cut the watermelon in fairly large pieces.Peel the kiwi fruit and cut it in large pieces.  Peel the mango and also cut it up in large pieces.  Then, cut the banana in fairly large pieces.  Rinse the blueberries in a strainer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'id': 9148, u'name': u'kiwi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}, {u'equipment': [], u'step': u'Add the cut fruit and blueberries to a large plate so that you can mix it up before adding it to the pineapple boat.Squeeze the orange juice over the bananas.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Add the fruit into the pineapple boat.  Sprinkle the coconut over the fruit.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Add either the cottage cheese, sherbet ice cream, or yogurt to the top of the fruit.  Top with granola.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'id': 8212, u'name': u'granola'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Sauvignon Blanc, and Gruener Veltliner are my top picks for Fruit Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 102, u'instructions': u'Cut a whole pineapple in half lengthwise.  Using a knife about the size of a steak knife, make a cut around the perimeter of the fruit- side of the pineapple about a \xbd inch from the edge.  While cutting, carefully aim your knife at a diagonal towards the inside of the fruit.  When you are cutting around the top of the pineapple by the stalk, leave a slightly wider edge so that the stalk has support and does not fall forward.  Once you’re done cutting, the middle of the pineapple should lift out.  After the middle of the pineapple is removed, use the tip of your knife to carefully hollow out the pineapple so that the inside is in the shape of a bowl or a “boat”. Then spoon out the excess pineapple and juice so that the “boat” is empty.  Cut the pineapple in fairly large chunks.  If the core is on the tough side, cut it off from the pieces of pineapple and discard.  Cut the watermelon in fairly large pieces.Peel the kiwi fruit and cut it in large pieces.  Peel the mango and also cut it up in large pieces.  Then, cut the banana in fairly large pieces.  Rinse the blueberries in a strainer.  Add the cut fruit and blueberries to a large plate so that you can mix it up before adding it to the pineapple boat.Squeeze the orange juice over the bananas.  Add the fruit into the pineapple boat.  Sprinkle the coconut over the fruit.  Add either the cottage cheese, sherbet ice cream, or yogurt to the top of the fruit.  Top with granola.', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-boat-fruit-salad-478915', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}