{u'recipes': [{u'sourceName': u'Dieters Downfall', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/540444-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 540444, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Maraschino Cherries', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 60, u'pricePerServing': 229.23, u'creditText': u'Dieters Downfall', u'extendedIngredients': [{u'originalString': u'1 pound cherries, pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'pound'}, {u'originalString': u'3 1/2 fluid ounces lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'fluid ounces', u'unitShort': u'fluid ounces', u'amount': 3.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'fluid ounces'}, {u'originalString': u'1 large orange peel, just the peel', u'aisle': u'Produce', u'name': u'orange peel', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1/2 cup pomegranate juice', u'aisle': u'Beverages', u'name': u'pomegranate juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9442, u'unit': u'cup'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://dietersdownfall.com/homemade-maraschino-cherries/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place all ingredients, except the cherries, into a 2 quart saucepan and bring to a boil. Lower the heat until a you reach a low simmer. Stir a few times until the sugar has completely dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the cherries and continue to simmer for ten minutes. Give the sauce a taste-test to see if it has taken on a cherry flavor.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour out cherries and juice into a large bowl and cool to room temperature. To speed up the process, place the bowl in the fridge for 1 hour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [], u'step': u'Transfer into one quart jars or an air-tight container and refrigerate for at least three days to a week before eating.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 4809, u'instructions': u'Place all ingredients, except the cherries, into a 2 quart saucepan and bring to a boil. Lower the heat until a you reach a low simmer. Stir a few times until the sugar has completely dissolved.Add the cherries and continue to simmer for ten minutes. Give the sauce a taste-test to see if it has taken on a cherry flavor.Pour out cherries and juice into a large bowl and cool to room temperature. To speed up the process, place the bowl in the fridge for 1 hour. Transfer into one quart jars or an air-tight container and refrigerate for at least three days to a week before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-maraschino-cherries-540444', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 1440, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}