{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/463435-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 463435, u'veryPopular': False, u'lowFodmap': False, u'title': u'Guinataan Chicken Adobo', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 163.12, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 teaspoon whole black peppercorns, crushed', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'whole', u'black', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'1 (14 ounce) can coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'ounce'}, {u'originalString': u'4 1/2 pounds chicken leg quarters', u'aisle': u'Meat', u'name': u'chicken leg quarters', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.5, u'consistency': u'liquid', u'id': 1005091, u'unit': u'pounds'}, {u'originalString': u'2 cloves garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'3/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 teaspoon white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Guinataan-Chicken-Adobo/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine the chicken, vinegar, water, sugar, soy sauce, bay leaves, crushed peppercorns, onion, and garlic in a large pot; stir and bring the mixture to a boil for 2 minutes. Reduce heat to medium-low and cook at a simmer for 30 minutes.', u'length': {u'number': 32, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the chicken to a large serving platter and set aside. Increase the heat under the pot to medium and cook until the liquid reduces by about one-quarter, about 10 minutes. Season with salt; stir the coconut milk into the mixture. Cover and cook until the coconut milk appears oily, about 10 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the mixture over the chicken to serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try District 7 Estate Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Combine the chicken, vinegar, water, sugar, soy sauce, bay leaves, crushed peppercorns, onion, and garlic in a large pot; stir and bring the mixture to a boil for 2 minutes. Reduce heat to medium-low and cook at a simmer for 30 minutes.                            Remove the chicken to a large serving platter and set aside. Increase the heat under the pot to medium and cook until the liquid reduces by about one-quarter, about 10 minutes. Season with salt; stir the coconut milk into the mixture. Cover and cook until the coconut milk appears oily, about 10 minutes. Pour the mixture over the chicken to serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/guinataan-chicken-adobo-463435', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}