{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/344890-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 344890, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hearty Meatball Stew', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 236.53, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'8 ounces 20-percent-fat ground beef (about 8 ounces)', u'aisle': u'Meat', u'name': u'95 percent lean ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 23557, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 15-ounce can diced tomatoes, drained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 sweet mild Italian sausages, casings removed', u'aisle': u'Meat', u'name': u'sausages', u'metaInformation': [u'sweet', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1017063, u'unit': u''}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon chopped fresh flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces green beans, trimmed, cut into 1-inch-long pieces', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'trimmed', u'cut into 1-inch-long pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11052, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 small onion, sliced (about 1 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 large red bell pepper, cored, seeded and cut into 1/2-inch strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cored', u'large', u'seeded', u'cut into 1/2-inch strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4 teaspoon dried crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'dried', u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 8 to 10-ounce russet potato, peeled, halved lengthwise and sliced into 1/3-inch slices', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'peeled', u'halved lengthwise', u'sliced into 1/3-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11353, u'unit': u'ounce'}, {u'originalString': u'1/2 pound large white mushrooms, quartered', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white', u'large', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}, {u'originalString': u'1 slice white sandwich bread, torn into small pieces', u'aisle': u'Bakery/Bread', u'name': u'white sandwich bread', u'metaInformation': [u'white', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slice'}], u'healthScore': 28.0, u'imageType': u'jpeg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/hearty-meatball-stew-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the bread and 3 tablespoons water into a medium bowl. Mash to a paste with a spatula.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the beef, sausage, egg, parsley, salt and pepper. Blend the mixture thoroughly with your hands or a flexible spatula. Form the mixture into 10 to 16 meatballs. Arrange the meatballs on a parchment paper-lined baking sheet until ready to use.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'For the hearty meatball stew: Sprinkle the meatballs with the flour and turn to coat with any flour still on the foil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large heavy nonstick skillet over medium heat for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add 2 tablespoons of the olive oil. Drop the meatballs into the skillet, spaced apart. Cook until the bottoms are set and brown, about 2 minutes. Using a flexible thin spatula, turn each meatball onto an uncooked side and cook until the bottoms are set and brown, about 2 minutes longer. Turn and cook a third side, until set and brown, about another 2 minutes, so the meatballs are browned and set all over.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Transfer the meatballs to a large plate.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 2 tablespoons oil in the same skillet over medium-high heat.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onions, peppers, 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. Cook until soft, 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the mushrooms and the remaining salt and pepper. Cook, stirring occasionally, until the mushrooms have softened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the potatoes, beans, tomatoes, red pepper flakes and broth. Bring the mixture to a boil. Reduce the heat to a simmer, cover the pan and cook until the potatoes are tender and the meatballs are cooked through, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}]}], u'name': u'For the meatballs'}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are great choices for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. The Ghost Block Oakville Estate Cabernet Sauvignon with a 4.6 out of 5 star rating seems like a good match. It costs about 60 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'Finesse oriented with an elegant balance and structure, supported by bright aromas of roses, tobacco and spice. The attack is full on the palate with blackberries, cherries, cocoa, and cinnamon. The ripe mid palate ties together a long finish of cherries, caramel, spice, cassis and coffee.', u'title': u'Ghost Block Oakville Estate Cabernet Sauvignon', u'price': u'$59.99', u'id': 447663, u'link': u'https://www.wine.com/product/ghost-block-oakville-estate-cabernet-sauvignon-2010/124053', u'imageUrl': u'https://spoonacular.com/productImages/447663-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Watch how to make this recipe.                    For the meatballs: Place the bread and 3 tablespoons water into a medium bowl. Mash to a paste with a spatula. Add the beef, sausage, egg, parsley, salt and pepper. Blend the mixture thoroughly with your hands or a flexible spatula. Form the mixture into 10 to 16 meatballs. Arrange the meatballs on a parchment paper-lined baking sheet until ready to use.                          For the hearty meatball stew: Sprinkle the meatballs with the flour and turn to coat with any flour still on the foil. Heat a large heavy nonstick skillet over medium heat for 1 minute. Add 2 tablespoons of the olive oil. Drop the meatballs into the skillet, spaced apart. Cook until the bottoms are set and brown, about 2 minutes. Using a flexible thin spatula, turn each meatball onto an uncooked side and cook until the bottoms are set and brown, about 2 minutes longer. Turn and cook a third side, until set and brown, about another 2 minutes, so the meatballs are browned and set all over. Transfer the meatballs to a large plate.                          Heat the remaining 2 tablespoons oil in the same skillet over medium-high heat. Add the onions, peppers, 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. Cook until soft, 4 minutes. Add the mushrooms and the remaining salt and pepper. Cook, stirring occasionally, until the mushrooms have softened, about 5 minutes. Add the potatoes, beans, tomatoes, red pepper flakes and broth. Bring the mixture to a boil. Reduce the heat to a simmer, cover the pan and cook until the potatoes are tender and the meatballs are cooked through, about 20 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/hearty-meatball-stew-344890', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}