{u'recipes': [{u'sourceName': u'Lemon Sugar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/579818-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 579818, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tunnel of Fudge Cake', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 93.34, u'creditText': u'Lemon Sugar', u'extendedIngredients': [{u'originalString': u'3/4 cup packed (5 1/4 ounces) brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.25, u'consistency': u'solid', u'id': 19334, u'unit': u'ounces'}, {u'originalString': u'2 cups (8 ounces) confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'ounces'}, {u'originalString': u'1/4 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'3/4 cup (2 1/4 ounces) Dutch-processed cocoa powder', u'aisle': u'Baking', u'name': u'dutch processed cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dutch-process-cocoa-powder.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.25, u'consistency': u'solid', u'id': 10019165, u'unit': u'ounces'}, {u'originalString': u'5 large eggs at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups (10 ounces) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 20081, u'unit': u'ounces'}, {u'originalString': u'1 cup (7 ounces) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounces'}, {u'originalString': u'3/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces semi-sweet chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'20 tablespoons (2 1/2 sticks) unsalted butter at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(2 1/2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 20.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://lemon-sugar.com/2012/12/tunnel-of-fudge-cake.html/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees (F).In a small bowl, combine 2 tablespoons of melted butter with 2 tablespoons cocoa powder.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk or stir until smooth. Use a pastry brush to generously coat the inside of a 12-cup bundt pan.  Set aside.In a small bowl, pour boiling water over chopped chocolate.  Allow to sit for one minute, then stir together to combine.  Set aside.In the bowl of a stand mixer, cream together brown sugar, white sugar and butter until light and fluffy, about 2 minutes.  Scrape the sides of the bowl as needed.Meanwhile, in a medium bowl, whisk together flour, confectioners sugar, cocoa powder and salt.  Set aside.  In a measuring cup, beat eggs lightly, and add vanilla.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add egg mixture to the butter mixture.  Beat on low until just combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add chocolate mixture, and beat until just combined.Scrape bowl, then slowly add the flour mixture.  Beat until just combined, taking care not to over-mix.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}], u'step': u'Pour batter into prepared bundt pan.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 45 minutes, or until cake begins to pull away from sides of pan.Cool on a wire rack for 90 minutes.  Carefully invert on to serving platter.In a small, heavy bottomed saucepan, heat heavy cream and syrup until just bubbling.', u'length': {u'number': 135, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'Remove from heat, and stir in chocolate.  Continue stirring until all of the chocolate is melted, then add vanilla and stir to combine.  Allow to cool for about 30 minutes, then pour over top of cake.  Reserve extra fudge sauce for serving if desired.Stir in an air-tight container for up to three days.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 146, u'instructions': u'Preheat oven to 350 degrees (F).In a small bowl, combine 2 tablespoons of melted butter with 2 tablespoons cocoa powder.  Whisk or stir until smooth. Use a pastry brush to generously coat the inside of a 12-cup bundt pan.  Set aside.In a small bowl, pour boiling water over chopped chocolate.  Allow to sit for one minute, then stir together to combine.  Set aside.In the bowl of a stand mixer, cream together brown sugar, white sugar and butter until light and fluffy, about 2 minutes.  Scrape the sides of the bowl as needed.Meanwhile, in a medium bowl, whisk together flour, confectioners sugar, cocoa powder and salt.  Set aside.  In a measuring cup, beat eggs lightly, and add vanilla.Add egg mixture to the butter mixture.  Beat on low until just combined.Add chocolate mixture, and beat until just combined.Scrape bowl, then slowly add the flour mixture.  Beat until just combined, taking care not to over-mix.  Pour batter into prepared bundt pan.  Bake for 45 minutes, or until cake begins to pull away from sides of pan.Cool on a wire rack for 90 minutes.  Carefully invert on to serving platter.In a small, heavy bottomed saucepan, heat heavy cream and syrup until just bubbling.  Remove from heat, and stir in chocolate.  Continue stirring until all of the chocolate is melted, then add vanilla and stir to combine.  Allow to cool for about 30 minutes, then pour over top of cake.  Reserve extra fudge sauce for serving if desired.Stir in an air-tight container for up to three days.', u'spoonacularSourceUrl': u'https://spoonacular.com/tunnel-of-fudge-cake-579818', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}