{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/219335-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 219335, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crostini with Feta-Chile Spread', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 190.11, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'18 (1/2-inch-thick) baguette slices', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'(1/2-inch-thick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 18.0, u'consistency': u'solid', u'id': 18033, u'unit': u'slices'}, {u'originalString': u'4 ounces feta cheese (about 1/2 cup)', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 tablespoon finely chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoon'}, {u'originalString': u'1 jalape\xf1o chile', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno chile', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 teaspoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup low-fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1179, u'unit': u'cup'}, {u'originalString': u'Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'3 large fresh poblano chiles*', u'aisle': u'Produce', u'name': u'poblano chiles', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Crostini-with-Feta-Chile-Spread-239083', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare barbecue (medium heat). Char poblano and jalape\xf1o chiles until blackened all over. Wrap chiles in paper bag and let stand 15 minutes. Peel, seed, and coarsely chop 2 poblano chiles and jalape\xf1o chile; transfer to processor.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [], u'step': u'Add feta cheese, sour cream, chopped fresh dill, and lemon juice to processor; puree until smooth. Season with salt and pepper. Cover and chill until firm enough to spread, about 2 hours. Peel, seed, and thinly slice remaining poblano chile. DO AHEAD Can be made 1 day ahead. Keep spread chilled. Cover and chill sliced chile.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'fresh dill'}]}, {u'equipment': [], u'step': u'Prepare barbecue (medium-high heat).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush 1 side of baguette slices with extra-virgin olive oil. Grill oiled side of bread until toasted, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [], u'step': u'Transfer toasts to platter. Spoon about 2 teaspoons chile spread over each toast, top with thinly sliced poblano chile, and serve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Billecart-Salmon Brut ros\xe9 ( Magnum). It has 4.7 out of 5 stars and a bottle costs about 170 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Persistent mousse, with fine bubbles rising slowly. Pale salmon pink in color, with a shade of gold. A nose of red fruits and fresh pear. Delicate fruit on the palate, elegant, and showing great finesse.', u'title': u'Billecart-Salmon Brut Rose ( Magnum)', u'price': u'$169.99', u'id': 457927, u'link': u'https://www.wine.com/product/billecart-salmon-brut-rose-15-liter-magnum/57383', u'imageUrl': u'https://spoonacular.com/productImages/457927-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u'Preparation                                                        Prepare barbecue (medium heat). Char poblano and jalape\xf1o chiles until blackened all over. Wrap chiles in paper bag and let stand 15 minutes. Peel, seed, and coarsely chop 2 poblano chiles and jalape\xf1o chile; transfer to processor. Add feta cheese, sour cream, chopped fresh dill, and lemon juice to processor; puree until smooth. Season with salt and pepper. Cover and chill until firm enough to spread, about 2 hours. Peel, seed, and thinly slice remaining poblano chile. DO AHEAD Can be made 1 day ahead. Keep spread chilled. Cover and chill sliced chile.                                                                Prepare barbecue (medium-high heat). Brush 1 side of baguette slices with extra-virgin olive oil. Grill oiled side of bread until toasted, about 2 minutes. Transfer toasts to platter. Spoon about 2 teaspoons chile spread over each toast, top with thinly sliced poblano chile, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/crostini-with-feta-chile-spread-219335', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}