{u'recipes': [{u'sourceName': u'Gluten Free Recipe Box', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/563082-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 563082, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten Free Pasta : Chicken Alfredo', u'diets': [u'gluten free'], u'pricePerServing': 264.75, u'creditText': u'Gluten Free Recipe Box', u'extendedIngredients': [{u'originalString': u"5 oz. Jovial's gluten-free brown rice capellini (angel hair pasta)", u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'gluten-free', u'(angel hair pasta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 20040, u'unit': u'oz'}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'Extra virgin olive oil for grilling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'for grilling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'3/4 cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 cup Parmesan and Romano cheese', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'2 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'2 Tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}, {u'originalString': u'2 Tablespoons filtered water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'filtered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 teaspoon white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2032, u'unit': u'teaspoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://glutenfreerecipebox.com/gluten-free-chicken-capellini-alfredo', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pound chicken breasts with the smooth side of a cooking mallet, bottom of sturdy glass or bottom of a frying pan, until 1/2" thick.Boil a large pan of water; add a little dash of oil to water to prevent the pasta from sticking.While waiting for the water to boil, heat butter, cream, and water on medium heat in a large skillet or frying pan; stir until butter is melted and all is blended; turn off heat and set aside.Preheat grilling or frying pan with additional olive oil for cooking chicken.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pasta to the boiling water. Undercook the pasta, as it will continue to cook once removed from pan and added to the sauce. [Al dente|http://en.wikipedia.org/wiki/Al_dente will be overcooked. You want it a little harder than that. If you overcook the pasta it will turn into mush when you toss it with the sauce. I cannot stress this enough.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken to the frying pan; and cook on each side for about 6 minutes.Strain the pasta; add to the skillet with the cream mixture; and turn the heat to medium.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the egg yolk, cheese and pepper; and toss well; coat the chicken on both sides by wiping it on top of the pasta mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [], u'step': u'Add pasta to a serving plate and top with chicken, serve along side vegetables; serve warm, with additional cheese on top, if desired.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with petite green beans. To make your presentation more attractive, toss the green beans with a little olive oil, and if available, saut\xe9 very lightly with some minced garlic.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'aggregateLikes': 192, u'instructions': u'Pound chicken breasts with the smooth side of a cooking mallet, bottom of sturdy glass or bottom of a frying pan, until 1/2" thick.Boil a large pan of water; add a little dash of oil to water to prevent the pasta from sticking.While waiting for the water to boil, heat butter, cream, and water on medium heat in a large skillet or frying pan; stir until butter is melted and all is blended; turn off heat and set aside.Preheat grilling or frying pan with additional olive oil for cooking chicken.Add the pasta to the boiling water. Undercook the pasta, as it will continue to cook once removed from pan and added to the sauce. [Al dente|http://en.wikipedia.org/wiki/Al_dente will be overcooked. You want it a little harder than that. If you overcook the pasta it will turn into mush when you toss it with the sauce. I cannot stress this enough.Add chicken to the frying pan; and cook on each side for about 6 minutes.Strain the pasta; add to the skillet with the cream mixture; and turn the heat to medium.Add the egg yolk, cheese and pepper; and toss well; coat the chicken on both sides by wiping it on top of the pasta mixture.Add pasta to a serving plate and top with chicken, serve along side vegetables; serve warm, with additional cheese on top, if desired.Serve with petite green beans. To make your presentation more attractive, toss the green beans with a little olive oil, and if available, saut\xe9 very lightly with some minced garlic.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-pasta-chicken-alfredo-563082', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}