{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/247477-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 247477, u'veryPopular': True, u'lowFodmap': False, u'title': u'Balsamic Strawberry and Chicken Pizza with Sweet Onions and Smoked Bacon', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 1202.58, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'4 slices smoked bacon, cut into 1 inch pieces and cooked', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'smoked', u'cooked', u'cut into 1 inch pieces and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1/4 cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'1/4 cup cilantro, torn', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/4 cup parmigiano reggiano (parmesan), grated', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'grated', u'(parmesan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pizza dough', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u''}, {u'originalString': u'1 cup cooked chicken, shredded or cut into bite sized pieces', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked', u'cut into bite sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups mozzarella, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'cups'}, {u'originalString': u'sriracha to taste', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'serving'}, {u'originalString': u'3/4 cup strawberries, sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'1/2 cup strawberry preserves/jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10819297, u'unit': u'cup'}, {u'originalString': u'1/4 cup sweet onion, sliced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11294, u'unit': u'cup'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.closetcooking.com/2012/07/balsamic-strawberry-and-chicken-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 96, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring the balsamic vinegar to a boil in a small sauce pan, reduce the heat and simmer until it reduces by half, about 4-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}]}, {u'equipment': [], u'step': u'Mix in the strawberry preserves and sriracha to taste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 10819297, u'name': u'strawberry preserves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}]}, {u'equipment': [], u'step': u'Mix 2 tablespoons of the balsamic strawberry sauce into the chicken.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u"Roll out the pizza dough and spread the remaining balsamic strawberry sauce onto it.Sprinkle on 3/4's of the cheese, the chicken, bacon and onion followed by the remaining cheese and finally 1/2 cup the strawberries.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 500.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake in a preheated 500F oven until golden brown on top, about 5-10 minutes.Sprinkle the remaining strawberries and the cilantro onto the pizza.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Madsen Family Cellars Sangiovese Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This wine has a pronounced nose with a hint of coffee while your mouth is invaded with spices; clove, licorice, and cinnamon.The palate features cherries and notes of clove which continue on to a smooth, long finish with subtle oak, slight pepper and berry flavors. The tartness of the wine works well with food as Sangiovese is a food wine, but can be enjoyed on its own as well. Columbia Valley AVA from the vineyards of Jordan Reed.', u'title': u'Madsen Family Cellars Sangiovese Wine', u'price': u'$26.0', u'id': 431618, u'link': u'https://www.amazon.com/2009-Madsen-Family-Cellars-Sangiovese/dp/B00I0F3FJA', u'imageUrl': u'https://spoonacular.com/productImages/431618-312x231.jpg'}]}, u'aggregateLikes': 5663, u'instructions': u"Bring the balsamic vinegar to a boil in a small sauce pan, reduce the heat and simmer until it reduces by half, about 4-5 minutes.Mix in the strawberry preserves and sriracha to taste.Mix 2 tablespoons of the balsamic strawberry sauce into the chicken.Roll out the pizza dough and spread the remaining balsamic strawberry sauce onto it.Sprinkle on 3/4's of the cheese, the chicken, bacon and onion followed by the remaining cheese and finally 1/2 cup the strawberries.Bake in a preheated 500F oven until golden brown on top, about 5-10 minutes.Sprinkle the remaining strawberries and the cilantro onto the pizza.", u'spoonacularSourceUrl': u'https://spoonacular.com/balsamic-strawberry-and-chicken-pizza-with-sweet-onions-and-smoked-bacon-247477', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}