{u'recipes': [{u'sourceName': u'Christines Recipes ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/526200-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 526200, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mango Cheesecake', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 36.33, u'creditText': u'Christines Recipes ', u'extendedIngredients': [{u'originalString': u'70 gm butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'gms', u'unitShort': u'gm', u'amount': 70.0, u'consistency': u'solid', u'id': 1001, u'unit': u'gm'}, {u'originalString': u'150 ml thickened cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'ml'}, {u'originalString': u'250 gm cream cheese block, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese block', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'gms', u'unitShort': u'gm', u'amount': 250.0, u'consistency': u'solid', u'id': 1186, u'unit': u'gm'}, {u'originalString': u'2 tsp gelatine powder', u'aisle': u'Baking', u'name': u'gelatine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19177, u'unit': u'tsp'}, {u'originalString': u'2 tsp lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tsp'}, {u'originalString': u'1 mango, peeled and chopped', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'120 gm Marie biscuits', u'aisle': u'Sweet Snacks', u'name': u'marie biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marie-biscuit.jpg', u'unitLong': u'gms', u'unitShort': u'gm', u'amount': 120.0, u'consistency': u'liquid', u'id': 10018173, u'unit': u'gm'}, {u'originalString': u'55 gm caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'gms', u'unitShort': u'gm', u'amount': 55.0, u'consistency': u'solid', u'id': 19335, u'unit': u'gm'}, {u'originalString': u'30 ml hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ml'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://en.christinesrecipes.com/2013/12/mango-cheesecake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Process biscuits in a food processor until finely crushed.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add butter and pulse to combine. Press over the base of the pan. Chill for 15 minutes or until firm.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 116, u'instructions': u'Process biscuits in a food processor until finely crushed. Add butter and pulse to combine. Press over the base of the pan. Chill for 15 minutes or until firm.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-cheesecake-526200', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}