{u'recipes': [{u'sourceName': u'Pocket Change Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/553789-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 553789, u'veryPopular': False, u'lowFodmap': False, u'title': u'Steak & Eggs: Breakfast for Dad', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 588.71, u'creditText': u'Pocket Change Gourmet', u'extendedIngredients': [{u'originalString': u'Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u'servings'}, {u'originalString': u'2 tablespoons oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Sweet peppers finely chopped', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'sweet', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10111333, u'unit': u'servings'}, {u'originalString': u'2 medium red potatoes, sliced thinly', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}, {u'originalString': u'Salt & Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'Steak, thinly sliced', u'aisle': u'Meat', u'name': u'steak', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 23232, u'unit': u'servings'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://pocketchangegourmet.com/steak-eggs-breakfast-for-dad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in skillet and fry potatoes until golden brown', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Just as the potatoes are getting done, add the onions and peppers, cook about 2 minutes or until tender', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the steak and heat through', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a separate skillet, fry eggs and add to top of steak mixture', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are my top picks for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Clos Du Val Merlot. It has 4.1 out of 5 stars and a bottle costs about 30 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"A dense, inky color and rich aromas of intense black currant and blackberry pervade our 2002 Merlot. Hints of herbs, black olives and toast are also present in the nose, leading to a well-structured wine with an abundance of dark red and black fruit flavors, balanced with sweet toast and some spice. The wine's soft tannins, lingering finish, and rich, complex taste make this a delightful accompaniment to roast chicken, pork, or beef. View More", u'title': u'Clos Du Val Merlot', u'price': u'$29.99', u'id': 433037, u'link': u'https://www.wine.com/product/clos-du-val-merlot-2002/83430', u'imageUrl': u'https://spoonacular.com/productImages/433037-312x231.jpg'}]}, u'aggregateLikes': 148, u'instructions': u'Heat oil in skillet and fry potatoes until golden brownJust as the potatoes are getting done, add the onions and peppers, cook about 2 minutes or until tenderAdd the steak and heat throughIn a separate skillet, fry eggs and add to top of steak mixture', u'spoonacularSourceUrl': u'https://spoonacular.com/steak-eggs-breakfast-for-dad-553789', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}