{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/396313-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 396313, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple-Berry Crumb Pie', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 95.71, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (21 ounces) apple pie filling', u'aisle': u'Baking', u'name': u'apple pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-pie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19312, u'unit': u'ounces'}, {u'originalString': u'1/2 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'10 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 10.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 teaspoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1-1/2 cups quick-cooking oats', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8402, u'unit': u'cups'}, {u'originalString': u'Vanilla ice cream, optional', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/apple-berry-crumb-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375\xb0. In a large bowl, combine oats, flour, brown sugar and butter; set aside 3/4 cup for topping. Press remaining mixture onto the bottom and up the sides of a greased 9-in. pie plate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Bake 13-17 minutes or until lightly browned.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In another bowl, combine pie filling, cranberries, lemon juice and cinnamon. Spoon into crust. Sprinkle with reserved oat mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake 25-30 minutes or until topping is lightly browned. Cool on a wire rack.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with ice cream if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Angel Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'Directions                                                                                Preheat oven to 375\xb0. In a large bowl, combine oats, flour, brown sugar and butter; set aside 3/4 cup for topping. Press remaining mixture onto the bottom and up the sides of a greased 9-in. pie plate. Bake 13-17 minutes or until lightly browned.                                                                                           In another bowl, combine pie filling, cranberries, lemon juice and cinnamon. Spoon into crust. Sprinkle with reserved oat mixture.                                                                                            Bake 25-30 minutes or until topping is lightly browned. Cool on a wire rack. Serve with ice cream if desired.                                        Yield: 8 servings.                                                                                                                         Originally published as Apple-Berry Crumb Pie in  Simple & DeliciousNovember/December 2009, p51                                                                                                                                                                                                        Nutritional Facts                                                                             1 piece (calculated without ice cream) equals 400 calories, 15 g fat (9 g saturated fat), 38 mg cholesterol, 140 mg sodium, 65 g carbohydrate, 3 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-berry-crumb-pie-396313', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}