{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/3591-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 3591, u'veryPopular': False, u'lowFodmap': False, u'title': u'Halibut Brochettes Proven\xe7ale', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'pescatarian'], u'pricePerServing': 960.4, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'16 mini bell peppers in assorted colors (from one 5-ounce package) or 1 bell pepper cut into 1-inch squares', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'assorted', u'mini', u'cut into 1-inch squares', u'(from one 5-ounce package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'8 mini plum tomatoes or large cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'mini', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'1/3 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 unpeeled slender eggplant, trimmed, halved lengthwise, cut into eight 1- to 1 1/4-inch pieces', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'trimmed', u'unpeeled', u'halved lengthwise', u'cut into eight 1- to 1 1/4-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'1/2 teaspoon chopped fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2018, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tablespoons minced fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons minced fresh marjoram', u'aisle': u'Produce', u'name': u'fresh marjoram', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022024, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon minced fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon minced fresh sage', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons minced fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'2 garlic cloves, pressed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 1/2 pounds halibut, cut into 1 1/2-inch cubes', u'aisle': u'Seafood', u'name': u'halibut', u'metaInformation': [u'cut into 1 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halibut-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 15036, u'unit': u'pounds'}, {u'originalString': u'1/4 teaspoon finely chopped dried lavender blossoms*', u'aisle': u'Gourmet', u'name': u'lavender', u'metaInformation': [u'dried', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 93811, u'unit': u'teaspoon'}, {u'originalString': u'5 tablespoons fresh lemon juice, divided', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'5 tablespoons extra-virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 small red onion, cut into 4 wedges, each wedge halved crosswise, layers kept intact', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'halved', u'cut into 4 wedges, each wedge  crosswise, layers kept intact'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 1 1/2-inch-diameter zucchini, cut into eight 1/2-inch-thick rounds', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'cut into eight 1/2-inch-thick rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 1.5, u'consistency': u'solid', u'id': 11477, u'unit': u'inch'}, {u'originalString': u'12 metal skewers', u'aisle': u'?', u'name': u'metal skewers', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.bonappetit.com/recipes/2009/08/halibut_brochettes_provencale', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix first 7 ingredients in small bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place zucchini, eggplant, tomatoes, peppers, and onion in large bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Add 1 tablespoon herb mixture and 1 tablespoon oil to vegetables. Sprinkle with salt and pepper; toss to coat. Thread 1 mini pepper, 1 zucchini round, 1 eggplant piece, 1 tomato, 1 onion piece, and 1 more mini pepper onto each of 8 skewers. DO AHEAD Herb mixture and vegetables can be made 4 hours ahead. Cover separately and refrigerate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place fish in medium bowl; sprinkle 2 tablespoons herb mixture over.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add 3 tablespoons oil, 3 tablespoons lemon juice, and garlic; sprinkle with salt and pepper and toss to coat. Cover and chill at least 1 hour and up to 2 hours, tossing occasionally.Simmer wine, remaining 1 tablespoon oil, and remaining 2 tablespoons lemon juice in small saucepan until reduced to 1/3 cup, about 3 minutes. Stir in remaining herb mixture. Season sauce to taste with salt and pepper. Set aside.Spray grill rack with nonstick spray; prepare barbecue (medium-high heat). Divide fish cubes among remaining 4 skewers. Grill vegetable skewers until vegetables are slightly charred and tender, turning occasionally, 10 to 12 minutes. Grill fish skewers until fish is cooked through, turning occasionally, 8 to 10 minutes.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Place 1 fish skewer and 2 vegetable skewers on each plate.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle sauce over.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Tiamo Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 8 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u"Light straw yellow color. Fresh and rich fruity aromas of apple and pear with a hint of citrus fruit that fade into the floral bouquet. Fresh and fruity, very clean and crisp.Tiamo Pinot Grigio pairs well with a wide array of lighter cuisine, especially fish/shellfish, poultry, pastas in cream sauce and softer cheeses. It's also an ideal aperitif.", u'title': u'Tiamo Pinot Grigio', u'price': u'$8.49', u'id': 438682, u'link': u'https://www.wine.com/product/tiamo-pinot-grigio-2008/98091', u'imageUrl': u'https://spoonacular.com/productImages/438682-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Mix first 7 ingredients in small bowl. Place zucchini, eggplant, tomatoes, peppers, and onion in large bowl. Add 1 tablespoon herb mixture and 1 tablespoon oil to vegetables. Sprinkle with salt and pepper; toss to coat. Thread 1 mini pepper, 1 zucchini round, 1 eggplant piece, 1 tomato, 1 onion piece, and 1 more mini pepper onto each of 8 skewers. DO AHEAD Herb mixture and vegetables can be made 4 hours ahead. Cover separately and refrigerate. Place fish in medium bowl; sprinkle 2 tablespoons herb mixture over. Add 3 tablespoons oil, 3 tablespoons lemon juice, and garlic; sprinkle with salt and pepper and toss to coat. Cover and chill at least 1 hour and up to 2 hours, tossing occasionally.Simmer wine, remaining 1 tablespoon oil, and remaining 2 tablespoons lemon juice in small saucepan until reduced to 1/3 cup, about 3 minutes. Stir in remaining herb mixture. Season sauce to taste with salt and pepper. Set aside.Spray grill rack with nonstick spray; prepare barbecue (medium-high heat). Divide fish cubes among remaining 4 skewers. Grill vegetable skewers until vegetables are slightly charred and tender, turning occasionally, 10 to 12 minutes. Grill fish skewers until fish is cooked through, turning occasionally, 8 to 10 minutes. Place 1 fish skewer and 2 vegetable skewers on each plate. Drizzle sauce over.', u'spoonacularSourceUrl': u'https://spoonacular.com/halibut-brochettes-provenale-3591', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}