{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/478901-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 478901, u'veryPopular': False, u'lowFodmap': False, u'title': u'Heidi’s German Potato Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'pricePerServing': 64.18, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'5 tablespoons apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'5 tablespoons canola oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'2 cucumbers', u'aisle': u'Produce', u'name': u'cucumbers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'6 medium to large russet potatoes (for smaller potatoes increase to apprx. 9)', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'medium to large', u'(for smaller potatoes increase to apprx. 9)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1 small yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.couponclippingcook.com/heidis-german-potato-salad/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Peel the potatoes and slice them about 1/4 inch thick.  Boil them in salted water until you can slice them with a knife (about 6 minutes).  Be careful not to cook them too long or they will be soft.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain potatoes and let them cool.Peel the cucumbers in \xbc inch strips staggering the peels so that there is \xbc inch peeled then \xbc inch skin showing.  Save some of the skin, and shred for garnish.  Shred the cucumbers and put into a bowl.  Dice the onion and add to the bowl with the cucumber in it', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Mix 5 tablespoons each of the oil and vinegar.  Once cooled, mix the potatoes, cucumbers, onion and oil and vinegar.  Salt and pepper to taste.The salt really makes this dish pop so as you taste-test the salad consider using more salt if you’re not tasting a tart flavor.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Garnish with leftover shredded cucumber skin.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'German works really well with Dornfelder and Riesling. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Peel the potatoes and slice them about 1/4 inch thick.  Boil them in salted water until you can slice them with a knife (about 6 minutes).  Be careful not to cook them too long or they will be soft.  Drain potatoes and let them cool.Peel the cucumbers in \xbc inch strips staggering the peels so that there is \xbc inch peeled then \xbc inch skin showing.  Save some of the skin, and shred for garnish.  Shred the cucumbers and put into a bowl.  Dice the onion and add to the bowl with the cucumber in itMix 5 tablespoons each of the oil and vinegar.  Once cooled, mix the potatoes, cucumbers, onion and oil and vinegar.  Salt and pepper to taste.The salt really makes this dish pop so as you taste-test the salad consider using more salt if you’re not tasting a tart flavor.  Garnish with leftover shredded cucumber skin.', u'spoonacularSourceUrl': u'https://spoonacular.com/heidis-german-potato-salad-478901', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}