{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/757096-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 757096, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skillet Mexican Zucchini', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'pricePerServing': 114.03, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 tbsp minced fresh cilantro or Garden Gourmet cilantro paste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'1 garlic clove, finely chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 green onion, thinly sliced', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tsp minced pickled jalape\xf1o', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u'tsp'}, {u'originalString': u'fresh lime juice, to taste', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'servings'}, {u'originalString': u'1/2 cup crumbled queso blanco (or queso fresco, cotija or feta)', u'aisle': u'Canned and Jarred', u'name': u'queso dip', u'metaInformation': [u'crumbled', u'(or queso fresco, cotija or feta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheez-whiz.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1188, u'unit': u'cup'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large tomato, cored, seeded and diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced', u'cored', u'large', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 lb zucchini, diced', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'lb'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.skinnytaste.com/skillet-mexican-zucchini/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the garlic in oil in a large skillet over medium heat 1 minute, stirring until sizzling.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add zucchini and cook stirring occasionally, about 3 minutes or until slightly softened.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Add the tomato and green onion and cook about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove skillet from heat and add cilantro paste, jalapeo and lime juice. Season with salt and pepper to taste and top with queso blanco.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Dutton-Goldfield Dutton Ranch Pinot Noir with a 4.4 out of 5 star rating seems like a good match. It costs about 43 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The ripening season was classic Russian River, with warm days and cool nights—and with no major heat spells, the fruit ripening was perfect to give lush tannins, bright berry fruit and bright acidity. The wine shows rich, dense black cherry and blackberry fruit and nuances of strawberry, raspberry, and nutmeg in the nose. In the mouth, the first impression is fresh berry fruit, then the soft, broad tannins carry notes of marionberries, nutmeg and sandalwood through a lingering finish. Thanks partially to the moderate alcohol and bright acidity, the finish lingers with fresh cherry fruit and creamy berry compote.This wine has a broad range of food pairings, whether alone with some well chosen cheeses, richer fish preparations or a good old steak on the barbeque.', u'title': u'Dutton-Goldfield Dutton Ranch Pinot Noir', u'price': u'$42.99', u'id': 438099, u'link': u'https://www.wine.com/product/dutton-goldfield-dutton-ranch-pinot-noir-2014/154141', u'imageUrl': u'https://spoonacular.com/productImages/438099-312x231.jpg'}]}, u'aggregateLikes': 5340, u'instructions': u'Cook the garlic in oil in a large skillet over medium heat 1 minute, stirring until sizzling. Add zucchini and cook stirring occasionally, about 3 minutes or until slightly softened. Add the tomato and green onion and cook about 3 minutes.Remove skillet from heat and add cilantro paste, jalapeo and lime juice. Season with salt and pepper to taste and top with queso blanco. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-mexican-zucchini-757096', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}