{u'recipes': [{u'sourceName': u'Picky Palate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626784-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 626784, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Honey Chicken Vegetable Rice Bowls', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 572.17, u'creditText': u'Picky Palate', u'extendedIngredients': [{u'originalString': u'4 cups cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20041, u'unit': u'cups'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u"1/4 cup Frank's Red Hot Sauce for “wings”", u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'red', u'for “wings”'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6168, u'unit': u'cup'}, {u'originalString': u'8 cups Roasted Vegetables, I used green beans, cauliflower, broccoli and carrots. I use THIS method for roasting most of my vegetables', u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [u'green', u'for roasting most of my vegetables'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cups'}, {u'originalString': u'4 cups cooked shredded chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cups'}], u'healthScore': 50.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://picky-palate.com/2015/01/12/spicy-honey-chicken-vegetable-rice-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place chicken into a large skillet over medium low heat. Stir in hot sauce and honey, stirring to combine. Cook for 5 minutes, until hot.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove and transfer to a large bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place brown rice into a large bowl and place roasted vegetables into a large bowl.Get out 4-5 medium tupperware containers. Layer the bottom with about 1/2 cup of brown rice, 1 cup of cooked chicken and 1 heaping cup of roasted vegetables. Cover with lid and place in refrigerator until ready to heat up for lunch or dinner.Note: To roast vegetables.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place vegetables of your choice onto a large baking sheet. I like to line my baking sheets with either a split liner or tin foil. Lightly drizzle with olive oil and season with pinches of salt and pepper.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 for 15-25 minutes depending on how large your vegetables are. Use a fork to test vegetables after about 15 minutes. If it pierces easily with a fork, they are ready to go!', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Place chicken into a large skillet over medium low heat. Stir in hot sauce and honey, stirring to combine. Cook for 5 minutes, until hot. Remove and transfer to a large bowl. Place brown rice into a large bowl and place roasted vegetables into a large bowl.Get out 4-5 medium tupperware containers. Layer the bottom with about 1/2 cup of brown rice, 1 cup of cooked chicken and 1 heaping cup of roasted vegetables. Cover with lid and place in refrigerator until ready to heat up for lunch or dinner.Note: To roast vegetables.Place vegetables of your choice onto a large baking sheet. I like to line my baking sheets with either a split liner or tin foil. Lightly drizzle with olive oil and season with pinches of salt and pepper. Bake at 375 for 15-25 minutes depending on how large your vegetables are. Use a fork to test vegetables after about 15 minutes. If it pierces easily with a fork, they are ready to go!', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-honey-chicken-vegetable-rice-bowls-626784', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}