{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/577707-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 577707, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shaved Brussels Sprouts and Ginger Potstickers', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 304.86, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'1\xbc cup shredded brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 11098, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh minced cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons fresh minced parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'Juice from 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 tablespoon sesame or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'12-16 potsticker wrappers', u'aisle': u'Ethnic Foods', u'name': u'potsticker wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 10018368, u'unit': u''}, {u'originalString': u'2 teaspoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoons'}, {u'originalString': u'Toasted sesame seeds, for topping', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'serving'}, {u'originalString': u'Tamari or soy sauce, for topping', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'serving'}], u'healthScore': 63.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://naturallyella.com/2013/10/15/shaved-brussels-sprouts-and-ginger-potstickers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat sesame oil in a large skillet with a lid.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [], u'step': u'Add minced onion and cook for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in Brussels Sprouts, lime juice, and ginger; cooking until brussels sprouts are brighter in color and just tender, 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and stir in the parsley and cilantro.Set up an assembling station with a small bowl of water, filling, and wrappers. Working with one skin at a time, place about 1 tablespoon of filling in the middle. Dip your finger in the water and run it along the entire edge of the wrapper. Fold both ends up (or corners if you are using square wrappers) and lightly pinch. Working with one side, pleat and pinch together making sure that once pleated, the potsticker is closed. Repeat with remaining filling.If you want, you may now freeze any potstickers you may not use. Simply place on a tray so that no potsticker is touching another and freeze. Once frozen you may then transfer to a container. When ready to eat, you can cook them frozen- just allow for a little extra time.For cooking potstickers, heat a tablespoon of sesame or olive oil over medium-high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place potstickers in pan so that no potsticker is touching. Cook for 1- 1\xbd minutes until bottom is browned.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in \xbc cup of water, place a tight fitting lid on the pan, and continue to cook for another 3-4 minutes or until the wrappers are tender.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a drizzle of tamari and sprinkle of toasted sesame seeds.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10116124, u'name': u'tamari'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian on the menu? Try pairing with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Pine Ridge Chenin Blanc - Viognier with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'The 2014 release of this intriguing blend delights the nose with a charming bouquet of enticing aromas of fresh Meyer lemon, fuzzy peach, ripe honeydew melon and yellow plum, mingled with touches of citrus blossom and white tea. The clean, vibrant palate enters with juicy pomelo, sweet lychee and honeyedtangerine fruits, balanced by vibrant acidity and hints of yellow apple and key lime pie that last through the crisp and refreshing finish.With its balanced acidity, this versatile wine pairs well with a number of dishes, from light salads to seafood to, most notably, foods with a hint of spiciness - its subtle sweetness provides balance alongside a touch of heat. Try Chenin Blanc + Viognier with a flavorful Thai curry, a sushi dish, such asa spicy tuna roll, or seared halibut. Blend: 80% Chenin Blanc, 20% Viognier', u'title': u'Pine Ridge Chenin Blanc - Viognier', u'price': u'$12.99', u'id': 438881, u'link': u'https://www.wine.com/product/pine-ridge-chenin-blanc-viognier-2014/142668', u'imageUrl': u'https://spoonacular.com/productImages/438881-312x231.jpg'}]}, u'aggregateLikes': 4298, u'instructions': u'Heat sesame oil in a large skillet with a lid. Add minced onion and cook for 2 minutes. Add in Brussels Sprouts, lime juice, and ginger; cooking until brussels sprouts are brighter in color and just tender, 3-4 minutes. Remove from heat and stir in the parsley and cilantro.Set up an assembling station with a small bowl of water, filling, and wrappers. Working with one skin at a time, place about 1 tablespoon of filling in the middle. Dip your finger in the water and run it along the entire edge of the wrapper. Fold both ends up (or corners if you are using square wrappers) and lightly pinch. Working with one side, pleat and pinch together making sure that once pleated, the potsticker is closed. Repeat with remaining filling.If you want, you may now freeze any potstickers you may not use. Simply place on a tray so that no potsticker is touching another and freeze. Once frozen you may then transfer to a container. When ready to eat, you can cook them frozen- just allow for a little extra time.For cooking potstickers, heat a tablespoon of sesame or olive oil over medium-high heat. Place potstickers in pan so that no potsticker is touching. Cook for 1- 1\xbd minutes until bottom is browned. Pour in \xbc cup of water, place a tight fitting lid on the pan, and continue to cook for another 3-4 minutes or until the wrappers are tender.Serve with a drizzle of tamari and sprinkle of toasted sesame seeds.', u'spoonacularSourceUrl': u'https://spoonacular.com/shaved-brussels-sprouts-and-ginger-potstickers-577707', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}