{u'recipes': [{u'sourceName': u'Life Made Simple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/665941-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 665941, u'veryPopular': False, u'lowFodmap': False, u'title': u'Carrot Cake Sheet Cake with Pineapple Cream Cheese Frosting', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 76.63, u'creditText': u'Life Made Simple', u'extendedIngredients': [{u'originalString': u'1/3 c. unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 9019, u'unit': u'c'}, {u'originalString': u'1\xbc tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'\xbe c. brown sugar, packed', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'c'}, {u'originalString': u'3 c. grated carrots (about 3-4 large or 5-6 medium) (see NOTES*)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated', u'medium', u'large', u'( 3-4 or 5-6 )', u'(see NOTES*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u'c'}, {u'originalString': u'8 oz. (1 block) original cream cheese, room temperature for 30 minutes', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'for 30 minutes', u'room temperature', u'(1 block)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'4 large eggs, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1\xbc c. granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'2\xbd tsp. ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'\xbc c. crushed or minced pineapple, drained (see NOTES***)', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'minced', u'crushed', u'drained', u'(see NOTES***)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9266, u'unit': u'c'}, {u'originalString': u'3 c. powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19336, u'unit': u'c'}, {u'originalString': u'\xbe tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd c. (1 stick) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'c'}, {u'originalString': u'1\xbd tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'11/3 c. vegetable oil (see NOTES**)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'(see NOTES**)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.6666666666666665, u'consistency': u'liquid', u'id': 4513, u'unit': u'c'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://lifemadesimplebakes.com/2015/04/carrot-cake-sheet-cake-with-pineapple-cream-cheese-frosting/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 43, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"In a large bowl or the bowl of a stand mixer, combine the sugars, oil, applesauce, vanilla and carrots, mix to combine, then allow to sit.Preheat oven to 350 degrees. Lightly spray or butter/flour a 9x13-inch pan, set aside.In a medium size mixing bowl whisk together the flour, baking powder, baking soda, salt, cinnamon, ginger, nutmeg and cloves.In the large mixing bowl (with the wet ingredients) add eggs one at a time, mixing until incorporated. Slowly add in dry ingredients, go extra slow if using a stand mixer so it doesn't fly out. Scrape the bottom and sides of the bowl just to be sure everything is thoroughly combined.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into the prepared pan and tap on the counter three times to release an trapped air.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place in the oven and bake for 35-45 minutes or until a cake tester (or toothpick) inserted into center of cake comes out with just a few little moist crumbs on it and the top springs back when touched. Make sure not to over-bake the cake or you'll end up with a dry crumb.", u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the oven and allow to cool in the pan on a wire rack for at least 1 hour.Meanwhile to prepare the cream cheese frosting, using the paddle attachment cream the butter, vanilla and salt for 2 minutes or until light and fluffy. With mixing speed on low gradually add the powdered sugar, beat until it forms a thick paste.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cream cheese and mix on the lowest speed possible for 1 minute, add the pineapple and continue for an additional minute, then STOP!', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Spread it over the top of the cooled cake, then cover and place in refrigerator until needed.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Carrot Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u"In a large bowl or the bowl of a stand mixer, combine the sugars, oil, applesauce, vanilla and carrots, mix to combine, then allow to sit.Preheat oven to 350 degrees. Lightly spray or butter/flour a 9x13-inch pan, set aside.In a medium size mixing bowl whisk together the flour, baking powder, baking soda, salt, cinnamon, ginger, nutmeg and cloves.In the large mixing bowl (with the wet ingredients) add eggs one at a time, mixing until incorporated. Slowly add in dry ingredients, go extra slow if using a stand mixer so it doesn't fly out. Scrape the bottom and sides of the bowl just to be sure everything is thoroughly combined. Pour into the prepared pan and tap on the counter three times to release an trapped air.Place in the oven and bake for 35-45 minutes or until a cake tester (or toothpick) inserted into center of cake comes out with just a few little moist crumbs on it and the top springs back when touched. Make sure not to over-bake the cake or you'll end up with a dry crumb. Remove from the oven and allow to cool in the pan on a wire rack for at least 1 hour.Meanwhile to prepare the cream cheese frosting, using the paddle attachment cream the butter, vanilla and salt for 2 minutes or until light and fluffy. With mixing speed on low gradually add the powdered sugar, beat until it forms a thick paste. Add cream cheese and mix on the lowest speed possible for 1 minute, add the pineapple and continue for an additional minute, then STOP! Spread it over the top of the cooled cake, then cover and place in refrigerator until needed.", u'spoonacularSourceUrl': u'https://spoonacular.com/carrot-cake-sheet-cake-with-pineapple-cream-cheese-frosting-665941', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}