{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/696491-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 696491, u'veryPopular': False, u'lowFodmap': False, u'title': u'Frozen Berry Yogurt', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 138.67, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'4 cups fresh or frozen and thawed berries, (raspberries, blackberries and/or blueberries)', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'fresh', u'thawed', u'(raspberries, blackberries and/or blueberries)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'cups'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 cups low-fat plain yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat plain yogurt', u'metaInformation': [u'plain', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1117, u'unit': u'cups'}, {u'originalString': u'1/2 cup frozen orange-juice concentrate', u'aisle': u'Frozen', u'name': u'orange juice concentrate', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9214, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/frozen_berry_yogurt.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Puree berries in a food processor or blender until smooth. Pass through a sieve to remove seeds. (There should be about 2 cups.)Puree banana in the food processor; add the berry puree, brown sugar, orange-juice concentrate and vanilla, then blend.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'id': 1009054, u'name': u'berries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Add yogurt and blend briefly.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to an ice-cream maker and freeze according to manufacturers directions.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Yogurt can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Puree berries in a food processor or blender until smooth. Pass through a sieve to remove seeds. (There should be about 2 cups.)Puree banana in the food processor; add the berry puree, brown sugar, orange-juice concentrate and vanilla, then blend. Add yogurt and blend briefly.Transfer to an ice-cream maker and freeze according to manufacturers directions.', u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-berry-yogurt-696491', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}