{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497477-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497477, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sausage, Egg, and Biscuit Sandwich', u'diets': [u'dairy free'], u'pricePerServing': 161.91, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'5 biscuits, cooked per instructions', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [u'cooked', u'per instructions'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 18009, u'unit': u''}, {u'originalString': u'5 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'5 turkey breakfast sausage patties', u'aisle': u'Meat', u'name': u'turkey sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 7955, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2013/10/sausage-egg-and-biscuit-sandwich.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the biscuits onto a baking sheet and bake, per instructions.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet over medium heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the turkey sausage patties to the pan. Cook, until golden brown on one side then flip. Continue to cook until golden brown. Boil some water in a small saucepan over medium high heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add a few poaching cups to the liquid and spray the cups with cooking spray. Crack an egg into each cup, making sure not to break the yolk. Cover with a lid and cook for 3-4 minutes, or until the egg white is solid but the yolk is still soft.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the poaching cups from the pan of water. Slice the biscuits in half. Layer the bottom half of the biscuit with sausage followed by egg then season egg with Sea salt and freshly cracked pepper, to taste. Butter the top half of the biscuit the place on top of the egg.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve immediately. Enjoy.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 29, u'instructions': u'Preheat the oven to 350. Place the biscuits onto a baking sheet and bake, per instructions.Heat a skillet over medium heat. Add the turkey sausage patties to the pan. Cook, until golden brown on one side then flip. Continue to cook until golden brown. Boil some water in a small saucepan over medium high heat. Add a few poaching cups to the liquid and spray the cups with cooking spray. Crack an egg into each cup, making sure not to break the yolk. Cover with a lid and cook for 3-4 minutes, or until the egg white is solid but the yolk is still soft. Remove the poaching cups from the pan of water. Slice the biscuits in half. Layer the bottom half of the biscuit with sausage followed by egg then season egg with Sea salt and freshly cracked pepper, to taste. Butter the top half of the biscuit the place on top of the egg. Serve immediately. Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/sausage-egg-and-biscuit-sandwich-497477', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}