{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/565039-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 565039, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cream of Portobello Mushroom Soup', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 327.36, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'850ml vegetable/chicken/mushroom stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 850.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'100ml double cream/thickened cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'chopped fresh parsley for garnishing', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'5 fresh sage leaves chopped finely', u'aisle': u'Produce', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh', u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'2 garlic cloves peeled and crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 onion chopped finely', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'650g portobello mushrooms chopped to large chunks', u'aisle': u'Produce', u'name': u'portobello mushrooms', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 650.0, u'consistency': u'solid', u'id': 11265, u'unit': u'g'}, {u'originalString': u'salt and freshly cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'100ml white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.noobcook.com/cream-of-portobello-mushroom-soup/2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt butter in large and deep saucepan. And the onions and garlic, and cook over gentle flame until the onions have just started to caramelised (soft, translucent, shrunken), about 4 minutes.Stir in the flour and cook for one minute more, then gradually stir in the stock.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u"Add the mushrooms and bring to the boil. Don't worry if it seems like a lot of mushrooms, they will shrink considerably when they are cooked.Reduce heat, cover and simmer gently for about 15 minutes, until the mushrooms are tender. Stir in the sage.", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Remove a couple of ladlefuls of the mushrooms, chop them to small pieces and set aside.Process the remaining soup in a food processor or blender until smooth.Return the soup to the saucepan and stir in the wine & cream and season with salt and pepper.Warm through, without boiling. Ladle into bowls and garnish with chopped mushrooms, parsley and a few drops (or swirls) of cream.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve with toast.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 17, u'instructions': u"Melt butter in large and deep saucepan. And the onions and garlic, and cook over gentle flame until the onions have just started to caramelised (soft, translucent, shrunken), about 4 minutes.Stir in the flour and cook for one minute more, then gradually stir in the stock.Add the mushrooms and bring to the boil. Don't worry if it seems like a lot of mushrooms, they will shrink considerably when they are cooked.Reduce heat, cover and simmer gently for about 15 minutes, until the mushrooms are tender. Stir in the sage.Remove a couple of ladlefuls of the mushrooms, chop them to small pieces and set aside.Process the remaining soup in a food processor or blender until smooth.Return the soup to the saucepan and stir in the wine & cream and season with salt and pepper.Warm through, without boiling. Ladle into bowls and garnish with chopped mushrooms, parsley and a few drops (or swirls) of cream. Serve with toast.", u'spoonacularSourceUrl': u'https://spoonacular.com/cream-of-portobello-mushroom-soup-565039', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}