{u'recipes': [{u'sourceName': u'Panning The Globe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542199-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 542199, u'veryPopular': False, u'lowFodmap': False, u'title': u'TOASTED COCONUT QUINOA YOGURT PARFAIT with GINGERED MAPLE SYRUP', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 404.84, u'creditText': u'Panning The Globe', u'extendedIngredients': [{u'originalString': u'\xbd cup sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1 teaspoon peeled, grated ginger root (from a 2-inch piece)', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'grated', u'peeled', u'(from a 2-inch piece)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'Gingered maple syrup (see recipe below)', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'(see recipe below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'servings'}, {u'originalString': u'2-3 cups mixed berries or your favorite fruits, washed and cut into bite-sized pieces', u'aisle': u'Produce', u'name': u'mixed berries', u'metaInformation': [u'mixed', u'washed and cut into bite-sized pieces', u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9054, u'unit': u'cups'}, {u'originalString': u'24 ounces plain yogurt (your favorite)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain yogurt', u'metaInformation': [u'plain', u'your favorite', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'ounces'}, {u'originalString': u'Toasted coconut quinoa (see recipe below)', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'toasted', u'(see recipe below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20035, u'unit': u'servings'}, {u'originalString': u'6 tablespoons unsweetened shredded coconut', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 10012108, u'unit': u'tablespoons'}, {u'originalString': u'Parfait', u'aisle': u'?', u'name': u'parfait', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.panningtheglobe.com/2014/04/08/toasted-coconut-quinoa-yogurt-parfait-gingered-maple-syrup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Make the syrup: In a small saucepan bring maple syrup and ginger to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Add the rinsed quinoa (don't worry if it's damp. The water will evaporate) and cook, stirring and tossing with a spatula, for a minute or so, to evaporate the excess water.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [], u'step': u'Add nuts and coconut. Cook, stirring constantly, for 5-7 minutes more, or until quinoa is a making frequent popping sounds and becomes toasted and golden brown. (lower the heat a bit, if need be, to avoid burning)', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread toasted quinoa mixture out on a plate to cool, sprinkle with salt and toss to mix.Assemble the Parfaits: When the syrup & toasted quinoa have cooled, about 15 minutes, assemble the parfaits: Using bowls or parfait glasses, make alternate layers of yogurt, quinoa, fruit, syrup. Repeat. Top with a light sprinkling of quinoa.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u'Remove from heat and stir. Set aside to cool. (can be kept in an air-tight container in the fridge for up to 3 days)Make the toasted coconut quinoa'}], u'winePairing': {u'pairingText': u"Yogurt Parfait works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u"Make the syrup: In a small saucepan bring maple syrup and ginger to a boil. Remove from heat and stir. Set aside to cool. (can be kept in an air-tight container in the fridge for up to 3 days)Make the toasted coconut quinoa: Heat a large skillet over medium heat. Add the rinsed quinoa (don't worry if it's damp. The water will evaporate) and cook, stirring and tossing with a spatula, for a minute or so, to evaporate the excess water. Add nuts and coconut. Cook, stirring constantly, for 5-7 minutes more, or until quinoa is a making frequent popping sounds and becomes toasted and golden brown. (lower the heat a bit, if need be, to avoid burning) Spread toasted quinoa mixture out on a plate to cool, sprinkle with salt and toss to mix.Assemble the Parfaits: When the syrup & toasted quinoa have cooled, about 15 minutes, assemble the parfaits: Using bowls or parfait glasses, make alternate layers of yogurt, quinoa, fruit, syrup. Repeat. Top with a light sprinkling of quinoa.", u'spoonacularSourceUrl': u'https://spoonacular.com/toasted-coconut-quinoa-yogurt-parfait-with-gingered-maple-syrup-542199', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}