{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596957-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 596957, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Man Sandwich', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 481.22, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 packed cup fresh parsley, dill, mint, basil, or chives, coarsely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'packed', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'12 ounces beef or lamb sausage, such as merguez or spicy Italian', u'aisle': u'Meat', u'name': u'lamb', u'metaInformation': [u'italian', u' such as merguez or spicy '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10017224, u'unit': u'ounces'}, {u'originalString': u'2 to 3 teaspoons freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons mayonnaise, preferably homemade', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/3 cup plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'4 scallions or 2 spring onions, left whole, or 1 red onion, thickly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'whole', u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 multigrain hoagie rolls, split, or 4 slices whole grain or seven grain sandwich bread', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'whole', u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'1 large zucchini, scrubbed and cut lengthwise into slices 1/4-inch thick', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'large', u'scrubbed', u'cut lengthwise into slices 1/'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://leitesculinaria.com/82080/recipes-grilled-sausage-sandwich.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Make the herb mayo1. Blend the herbs, yogurt, mayo, and olive oil in a mini food processor or blender until the mixture is smooth and flecked with green. Pulse in the lemon juice, stopping and tasting as you go, adding just enough juice to give it just the right balance of tartness. Taste and season accordingly with salt and pepper. (You can cover and refrigerate the herb mayo for up to 4 days.)Make the sandwich2. Preheat the grill or a grill pan over medium-high heat until hot.3.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the sausage on the hottest part of the grill or pan and cook until browned and crisp on one side, about 6 minutes. Turn and grill until cooked through, 8 to 10 minutes more.4. Meanwhile, dump the zucchini and onion(s) in a large bowl, drizzle with the olive oil, and season generously with salt and pepper. After you turn the sausage, add the vegetables to the grill. Cook until lightly charred on the outside and mostly tender on the inside, about 4 minutes per side.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Transfer everything to a platter.5.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the hoagie rolls or bread on the grill and toast, turning to brown both sides if using sandwich bread.6.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the herb mayo on the bottom portion of each hoagie roll or on 2 slices of bread. Slice the sausages to fit the rolls or bread. Divvy up the sausages and grilled veggies between the rolls or bread and sandwich them with the remaining naked rolls or bread.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Serve warm with lots of napkins.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 414, u'instructions': u'Make the herb mayo1. Blend the herbs, yogurt, mayo, and olive oil in a mini food processor or blender until the mixture is smooth and flecked with green. Pulse in the lemon juice, stopping and tasting as you go, adding just enough juice to give it just the right balance of tartness. Taste and season accordingly with salt and pepper. (You can cover and refrigerate the herb mayo for up to 4 days.)Make the sandwich2. Preheat the grill or a grill pan over medium-high heat until hot.3. Place the sausage on the hottest part of the grill or pan and cook until browned and crisp on one side, about 6 minutes. Turn and grill until cooked through, 8 to 10 minutes more.4. Meanwhile, dump the zucchini and onion(s) in a large bowl, drizzle with the olive oil, and season generously with salt and pepper. After you turn the sausage, add the vegetables to the grill. Cook until lightly charred on the outside and mostly tender on the inside, about 4 minutes per side. Transfer everything to a platter.5. Place the hoagie rolls or bread on the grill and toast, turning to brown both sides if using sandwich bread.6. Spread the herb mayo on the bottom portion of each hoagie roll or on 2 slices of bread. Slice the sausages to fit the rolls or bread. Divvy up the sausages and grilled veggies between the rolls or bread and sandwich them with the remaining naked rolls or bread. Serve warm with lots of napkins.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-man-sandwich-596957', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}