{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625789-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 625789, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pork Tenderloin Tips with Apricot Sauce', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 121.55, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'\xbd cup good-quality apricot jam (we love Bonne Maman brand)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [u'(we love Bonne Maman brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19719, u'unit': u'cup'}, {u'originalString': u'4 fresh apricots cut in half, pits removed and each half sliced into five slices (they do not need to be totally ripe)', u'aisle': u'Produce', u'name': u'apricots', u'metaInformation': [u'fresh', u'ripe', u'sliced into five slices (they do not need to be totally )', u'cut in half, pits removed and each half '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9021, u'unit': u''}, {u'originalString': u'\xbd teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'1 teaspoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon Herbes De Provence', u'aisle': u'Produce;Spices and Seasonings', u'name': u'herbes de provence', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012042, u'unit': u'teaspoon'}, {u'originalString': u'Juice from one fresh lime, about 2 tablespoons', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 large leek – top removed and cleaned of all sand, sliced into thick half circle pieces (you could just as easily use scallions or onions if leeks are not available)', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'thick', u'large', u'cleaned', u'sliced into  half circle pieces (you could just as easily use scallions or onions if leeks are not available)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2-3 pounds pork tenderloin, cut into 4-5 ounce pieces', u'aisle': u'Meat', u'name': u'pork tenderloin', u'metaInformation': [u'cut into 4-5 ounce pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10218, u'unit': u'pounds'}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.afamilyfeast.com/pork-tenderloin-tips-apricot-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a medium saut pan over medium high heat, heat oil and add leeks, Herbes De Provence, dry mustard and pepper and saut for two minutes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1012042, u'name': u'herbes de provence'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add the lime juice and cook until all liquid has evaporated.Lower heat to medium and add apricots and cinnamon stick and saut for one to two minutes or until apricots are almost tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'id': 9021, u'name': u'apricot'}]}, {u'equipment': [], u'step': u'Add brown sugar, apricot jam and water and simmer on medium until a nice sauce forms and the apricots are tender but not falling apart. (Firm but tender).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'id': 9021, u'name': u'apricot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from heat and set aside.Preheat oven to 425 degrees.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove any excess fat and silver skin from pork and cut into 4-5 ounce pieces. Then coat all sides with the salt and pepper.In a large oven proof saut pan (cast iron works well), heat olive oil to smoking hot over medium high to high heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Place pork pieces in making sure they dont touch and sear on all sides (5-10 minutes total).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place pan in preheated oven and cook for 10-15 minutes or until done. We left ours in for 12 minutes for medium rare. If you like pork cooked further, leave in until your desired doneness.Once out of the oven, transfer to a platter and loosely cover with foil and let rest for 10 minutes.Take any pan juices accumulated in the saut pan and add to the sauce. Slowly heat the sauce to serving temperature, being careful not to overheat.Either serve pork tips whole or sliced to your guests topped with the pan sauce.', u'length': {u'number': 37, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pork Tenderloin on the menu? Try pairing with Malbec, Pinot Noir, and Sangiovese. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. One wine you could try is Terrazas de los Andes Reserva Malbec. It has 4.2 out of 5 stars and a bottle costs about 22 dollars.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'Bright red color with purple shades. Intense floral and fruity notes. Presence of violets, ripe black cherry and plum aromas. ReIts sweet and juicy mouthfeel delivers finesse, delicate tannins and an elegant finish of black fruits. veals a toasty and spicy character of black pepper and chocolate.Pair with Tuna Carpaccio and Red Fruits Vinaigrette, Tenderloin served with MediterraneanRatatouille and Moist Semisweet Chocolate Cake over Mascarpone and Red Fruits Ice Cream.', u'title': u'Terrazas de los Andes Reserva Malbec', u'price': u'$21.99', u'id': 438817, u'link': u'https://www.wine.com/product/terrazas-de-los-andes-reserva-malbec-2014/162923', u'imageUrl': u'https://spoonacular.com/productImages/438817-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'In a medium saut pan over medium high heat, heat oil and add leeks, Herbes De Provence, dry mustard and pepper and saut for two minutes. Add the lime juice and cook until all liquid has evaporated.Lower heat to medium and add apricots and cinnamon stick and saut for one to two minutes or until apricots are almost tender.Add brown sugar, apricot jam and water and simmer on medium until a nice sauce forms and the apricots are tender but not falling apart. (Firm but tender). Remove from heat and set aside.Preheat oven to 425 degrees.Remove any excess fat and silver skin from pork and cut into 4-5 ounce pieces. Then coat all sides with the salt and pepper.In a large oven proof saut pan (cast iron works well), heat olive oil to smoking hot over medium high to high heat.Place pork pieces in making sure they dont touch and sear on all sides (5-10 minutes total).Place pan in preheated oven and cook for 10-15 minutes or until done. We left ours in for 12 minutes for medium rare. If you like pork cooked further, leave in until your desired doneness.Once out of the oven, transfer to a platter and loosely cover with foil and let rest for 10 minutes.Take any pan juices accumulated in the saut pan and add to the sauce. Slowly heat the sauce to serving temperature, being careful not to overheat.Either serve pork tips whole or sliced to your guests topped with the pan sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-tenderloin-tips-with-apricot-sauce-625789', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}