{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205397-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205397, u'veryPopular': False, u'lowFodmap': False, u'title': u"S'mores Sundae", u'diets': [], u'pricePerServing': 107.19, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 tablespoons cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'5 tablespoons light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoons'}, {u'originalString': u'3 ounces dark chocolate (about 65% cocoa solids)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'65%', u'( cocoa solids)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'7 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'Graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 18617, u'unit': u'servings'}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'About 1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'6 ounces marshmallows (about 3 cups mini marshmallows; see note above)', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini', u'( 3 cups marshmallows; see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 19116, u'unit': u'ounces'}, {u'originalString': u'3/4 cup raw (turbinado) sugar (see note above)', u'aisle': u'Health Foods;Baking', u'name': u'raw sugar', u'metaInformation': [u'raw', u'(turbinado)', u'(see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19908, u'unit': u'cup'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/05/smores-sundae-toasted-marshmallow-ice-cream-hot-fudge-sauce-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'For toasted marshmallow ice cream: Preheat broiler to high and adjust rack to 6-inches below element. Evenly distribute marshmallows in a wide broiler-proof baking dish. Broil until tops of marshmallows are toasted brown, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Remove from broiler and stir marshmallows into a paste, making sure to incorporate toasted top into paste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Return to broiler until top is toasted brown, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Remove from broiler and stir paste again to incorporate toasted top. Repeat until marshmallow paste is an even, tan color, 4 to 5 times total.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Remove from broiler and set aside.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a heavy saucepan, whisk together egg yolks and sugar until well combined. Slowly whisk in milk, stirring well to fully incorporate yolk mixture.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in cream.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Using a spatula, transfer toasted marshmallow paste to saucepan and place over medium heat. If paste seizes up, stir frequently with whisk to break up marshmallow chunks. As custard base heats the paste will dissolve.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'5', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Cook until the custard thickens and coats the back of a spoon; a swiped finger on the spoon should leave a clean line.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u"Add vanilla and salt to taste, then strain into an airtight container and chill overnight before churning according to manufacturer's instructions. Chill ice cream in freezer for at least three hours before serving,", u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'6', u'number': 16, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place a heavy saucepan over low heat and melt chocolate and butter together with corn syrup and sugar. When fully combined, whisk in cocoa powder until no lumps remain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in water, salt, and vanilla and cook until sauce just reaches a simmer. Sauce can be served immediately or refrigerated for later. To warm up again, microwave sauce for 30 to 60 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'7', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'To assemble: Scoop ice cream over graham crackers and top with hot fudge sauce.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}], u'name': u'For hot fudge sauce'}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 76, u'instructions': u"Procedures                                                                              1                                                                            For toasted marshmallow ice cream: Preheat broiler to high and adjust rack to 6-inches below element. Evenly distribute marshmallows in a wide broiler-proof baking dish. Broil until tops of marshmallows are toasted brown, about 4 minutes. Remove from broiler and stir marshmallows into a paste, making sure to incorporate toasted top into paste.                                                                                                                             2                                                                            Return to broiler until top is toasted brown, about 2 minutes. Remove from broiler and stir paste again to incorporate toasted top. Repeat until marshmallow paste is an even, tan color, 4 to 5 times total. Remove from broiler and set aside.                                                                                                                            3                                                                            In a heavy saucepan, whisk together egg yolks and sugar until well combined. Slowly whisk in milk, stirring well to fully incorporate yolk mixture. Whisk in cream.                                                                                                                             4                                                                            Using a spatula, transfer toasted marshmallow paste to saucepan and place over medium heat. If paste seizes up, stir frequently with whisk to break up marshmallow chunks. As custard base heats the paste will dissolve.                                                                                                                             5                                                                            Cook until the custard thickens and coats the back of a spoon; a swiped finger on the spoon should leave a clean line. Add vanilla and salt to taste, then strain into an airtight container and chill overnight before churning according to manufacturer's instructions. Chill ice cream in freezer for at least three hours before serving,                                                                                                                            6                                                                            For hot fudge sauce: Place a heavy saucepan over low heat and melt chocolate and butter together with corn syrup and sugar. When fully combined, whisk in cocoa powder until no lumps remain. Whisk in water, salt, and vanilla and cook until sauce just reaches a simmer. Sauce can be served immediately or refrigerated for later. To warm up again, microwave sauce for 30 to 60 seconds.                                                                                                                            7                                                                            To assemble: Scoop ice cream over graham crackers and top with hot fudge sauce.", u'spoonacularSourceUrl': u'https://spoonacular.com/smores-sundae-205397', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}