{u'recipes': [{u'sourceName': u'Saveur', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/4285-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 4285, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon-wrapped Sardines', u'diets': [u'dairy free'], u'pricePerServing': 800.71, u'creditText': u'Saveur', u'extendedIngredients': [{u'originalString': u'3 slices bacon, halved crosswise', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'Canola oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1 tbsp. finely chopped mixed fresh herbssuch as flat-leaf parsley, chives, tarragon,and basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'mixed', u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp. finely chopped mixed fresh herbs', u'aisle': u'Produce', u'name': u'fresh mixed herbs', u'metaInformation': [u'mixed', u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'tbsp'}, {u'originalString': u'6 oil-packed sardines, drained', u'aisle': u'Canned and Jarred', u'name': u'oil packed tuna', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 15119, u'unit': u''}, {u'originalString': u'2 slices white bread, crusts removed', u'aisle': u'Bakery/Bread', u'name': u'white bread', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}], u'healthScore': 76.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.saveur.com/article/Recipes/Bacon-Wrapped-Sardines', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 52, u'analyzedInstructions': [], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Maso Canali Pinot Grigio with a 4.6 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal. View More', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Instructions', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-wrapped-sardines-4285', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}