{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223790-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 223790, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked carrot & sweet potato mash', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 84.62, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'large handful fresh breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'handful'}, {u'originalString': u'500g carrots, cut to the same size as the sweet potato', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11124, u'unit': u'g'}, {u'originalString': u'small pinch cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'pinch'}, {u'originalString': u'6 tbsp double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'tbsp'}, {u'originalString': u'good grating nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'olive oil, for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'800g sweet potatoes, peeled and chopped into 2\xbd cm pieces', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 11507, u'unit': u'g'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2751666/baked-carrot-and-sweet-potato-mash', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the veg in a large pan, cover withwater and bring to the boil, then puta lid on the pan and cook for 15 minsuntil really tender.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and leaveto steam-dry for a few mins. Oncecompletely dry, return to the pan andmash with the cream, nutmeg, cinnamonand plenty of seasoning.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Transfer themash to an ovenproof gratin dish,sprinkle with the breadcrumbs anddrizzle with a little olive oil. Can bemade the day before and chilled.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Bake at 220C/200C fan/gas 7 (when theturkey comes out of the oven) for 35 minsuntil the top is golden and crunchy, andthe mash is piping hot.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 49, u'instructions': u'Put the veg in a large pan, cover withwater and bring to the boil, then puta lid on the pan and cook for 15 minsuntil really tender. Drain and leaveto steam-dry for a few mins. Oncecompletely dry, return to the pan andmash with the cream, nutmeg, cinnamonand plenty of seasoning. Transfer themash to an ovenproof gratin dish,sprinkle with the breadcrumbs anddrizzle with a little olive oil. Can bemade the day before and chilled.Bake at 220C/200C fan/gas 7 (when theturkey comes out of the oven) for 35 minsuntil the top is golden and crunchy, andthe mash is piping hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-carrot-sweet-potato-mash-223790', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}