{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446455-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 446455, u'veryPopular': False, u'lowFodmap': False, u'title': u'Flowers and Vines Cake', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 71.37, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'Jelly beans', u'aisle': u'Sweet Snacks', u'name': u'jelly beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jellybeans.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19108, u'unit': u'servings'}, {u'originalString': u'Red shoestring licorice', u'aisle': u'Sweet Snacks', u'name': u'black licorice', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-licorice-candy.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 98851, u'unit': u'servings'}, {u'originalString': u'Red licorice twists', u'aisle': u'Sweet Snacks', u'name': u'licorice twists', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-licorice-candy.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 99160, u'unit': u'servings'}, {u'originalString': u'Nonpareils', u'aisle': u'Baking', u'name': u'nonpareils', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1 can (16 ounces) vanilla frosting', u'aisle': u'Baking', u'name': u'vanilla frosting', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'ounces'}, {u'originalString': u'1 package white cake mix (regular size)', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white', u'(regular size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'package'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/flowers-and-vines-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Prepare and bake cake according to package directions, using two greased 9-in. round baking pans. Cool for 10 minutes before removing from pans to wire racks to cool completely.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread frosting between layers and over top and sides of cake. Lightly press licorice twists around bottom edge of cake. Lightly press licorice and candies into cake forming flower and vine designs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-licorice-candy.jpg', u'id': 99160, u'name': u'licorice twists'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}], u'name': u''}], u'aggregateLikes': 32, u'instructions': u'Directions                                                                                Prepare and bake cake according to package directions, using two greased 9-in. round baking pans. Cool for 10 minutes before removing from pans to wire racks to cool completely.                                                                                            Spread frosting between layers and over top and sides of cake. Lightly press licorice twists around bottom edge of cake. Lightly press licorice and candies into cake forming flower and vine designs.                                        Yield: 12 servings.                                                                                                                         Originally published as Flowers and Vines Cake in  Simple & DeliciousMarch/April 2010, p54                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/flowers-and-vines-cake-446455', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}