{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/457105-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 457105, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Stuffed Pork Chops', u'diets': [], u'pricePerServing': 49.73, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 cups chopped apples', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u'cups'}, {u'originalString': u'3 cups fresh bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cups'}, {u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'2 teaspoons chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'tablespoon'}, {u'originalString': u'6 (1 1/4 inch) thick pork chops', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 7.5, u'consistency': u'solid', u'id': 10010062, u'unit': u'inch'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Apple-Stuffed-Pork-Chops/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F (175 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet saute onion in butter or margarine until tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the bread crumbs, apples, celery, parsley and salt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix all together.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a large pocket in the side of each pork chop; season inside and out with salt and pepper to taste. Spoon apple mixture loosely into pockets.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In skillet, heat oil to medium high and brown chops on both sides.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place browned chops in an ungreased 9x13 inch baking dish. Cover with aluminum foil and bake in the preheated oven for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Remove cover and bake for 30 minutes longer or until juices run clear.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Riesling are great choices for Pork Chops. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 300, u'instructions': u'Preheat oven to 350 degrees F (175 degrees C).                            In a large skillet saute onion in butter or margarine until tender. Remove from heat. Add the bread crumbs, apples, celery, parsley and salt. Mix all together. Cut a large pocket in the side of each pork chop; season inside and out with salt and pepper to taste. Spoon apple mixture loosely into pockets.                            In skillet, heat oil to medium high and brown chops on both sides. Place browned chops in an ungreased 9x13 inch baking dish. Cover with aluminum foil and bake in the preheated oven for 30 minutes. Remove cover and bake for 30 minutes longer or until juices run clear.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-stuffed-pork-chops-457105', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}