{u'recipes': [{u'sourceName': u'Sugar Dish Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/710822-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 710822, u'veryPopular': False, u'lowFodmap': False, u'title': u'Super Bird Sandwich', u'diets': [], u'preparationMinutes': 2, u'pricePerServing': 300.19, u'creditText': u'Sugar Dish Me', u'extendedIngredients': [{u'originalString': u'4 slices bacon, cooked and excess grease drained on paper towels', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 ounces deli Swiss, very thinly sliced', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 10010151, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons chipotle-based hot sauce (or your favorite)', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'your favorite', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'4 slices sourdough bread', u'aisle': u'Bakery/Bread', u'name': u'sourdough bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sourdough-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10118029, u'unit': u'slices'}, {u'originalString': u'4 slices tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'slices'}, {u'originalString': u'4 ounces Hillshire Farms\xae Naturals Slow Roasted Turkey Breast', u'aisle': u'Meat', u'name': u'turkey breast', u'metaInformation': [u'hillshire farms\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 5696, u'unit': u'ounces'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.sugardishme.com/super-bird-sandwich-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt the butter in a large skillet over medium heat.In a small dish mix the mayo and hot sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread one side of each slice of bread with the sauce, then place the dry side in the skillet to soak up the butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the turkey in the skillet so it will heat and slightly brown while the bread grills and the cheese melts.Lay the cheese slices on top of the sauce -- I like 2 or 3 slices on each side which is why I get it sliced super thin.Lay tomatoes on one side of each sandwich and bacon on the other -- 2 cooked slices per sandwich. Then pile the turkey on one side of each sandwich and carefully use your spatula to put the halves together.At this point both halves should be grilled but I like to gently press so they stick together. Continue cooking until the sandwiches are melty inside and golden toasty on the outside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Cut in half and serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 11, u'instructions': u'Melt the butter in a large skillet over medium heat.In a small dish mix the mayo and hot sauce. Spread one side of each slice of bread with the sauce, then place the dry side in the skillet to soak up the butter. Place the turkey in the skillet so it will heat and slightly brown while the bread grills and the cheese melts.Lay the cheese slices on top of the sauce -- I like 2 or 3 slices on each side which is why I get it sliced super thin.Lay tomatoes on one side of each sandwich and bacon on the other -- 2 cooked slices per sandwich. Then pile the turkey on one side of each sandwich and carefully use your spatula to put the halves together.At this point both halves should be grilled but I like to gently press so they stick together. Continue cooking until the sandwiches are melty inside and golden toasty on the outside. Cut in half and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/super-bird-sandwich-710822', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 7, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}