{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527111-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527111, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta with Goat Cheese, Chicken, Asparagus & Mushrooms', u'diets': [], u'pricePerServing': 654.67, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1 bunch (about 1 lb.) asparagus, ends trimmed then cut into 2" pieces', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed', u'cut into 2" pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'lb'}, {u'originalString': u'16 oz (2 cartons) fresh button or baby bella mushrooms, halved', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'fresh', u'halved', u'(2 cartons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'2 Tbsp. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'8 oz. goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'3 Tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'2/3 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 lb. pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'lb'}, {u'originalString': u'salt and freshly-ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly-ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 shallot, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2-3 boneless, skinless chicken breasts, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 66.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.gimmesomeoven.com/pasta-with-goat-cheese-chicken-asparagus-mushrooms/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare pasta al dente according to package instructions. (I would add the pasta to the boiling water around the time you begin cooking the asparagus and mushrooms.)Season the chicken with salt and freshly-ground black pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Heat 2 Tbsp. olive oil over medium-high heat. When oil is shimmering, add the chicken and cook 5-7 minutes (flipping halfway through) until the outside is lightly golden and the center is no longer pink.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Remove chicken and set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the remaining 1 Tbsp. olive oil, and once it has heated, add the shallot.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Saute for 2 minutes, then add the asparagus and mushrooms. Continue cooking for another 4-6 minutes, stirring occasionally.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove skillet from heat.While the vegetables are cooking, heat the butter in a small saucepan over medium heat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add flour, and whisk quickly to combine, then let cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add 1 cup of the pasta water, goat cheese, Parmesan cheese, and a generous pinch of salt and freshly-ground black pepper, and whisk to combine. Cook for 1 minute, then reduce heat to low until the pasta is ready. If the sauce is too thick, gradually add additional tablespoons of pasta water until you reach the desired consistency.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain the pasta once it has cooked, then immediately toss with the goat cheese sauce, chicken and vegetables.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve garnished with additional Parmesan cheese.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 217, u'instructions': u'Prepare pasta al dente according to package instructions. (I would add the pasta to the boiling water around the time you begin cooking the asparagus and mushrooms.)Season the chicken with salt and freshly-ground black pepper. Heat 2 Tbsp. olive oil over medium-high heat. When oil is shimmering, add the chicken and cook 5-7 minutes (flipping halfway through) until the outside is lightly golden and the center is no longer pink. Remove chicken and set aside. Add the remaining 1 Tbsp. olive oil, and once it has heated, add the shallot. Saute for 2 minutes, then add the asparagus and mushrooms. Continue cooking for another 4-6 minutes, stirring occasionally. Remove skillet from heat.While the vegetables are cooking, heat the butter in a small saucepan over medium heat. Add flour, and whisk quickly to combine, then let cook for 1 minute. Add 1 cup of the pasta water, goat cheese, Parmesan cheese, and a generous pinch of salt and freshly-ground black pepper, and whisk to combine. Cook for 1 minute, then reduce heat to low until the pasta is ready. If the sauce is too thick, gradually add additional tablespoons of pasta water until you reach the desired consistency.Drain the pasta once it has cooked, then immediately toss with the goat cheese sauce, chicken and vegetables. Serve garnished with additional Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-with-goat-cheese-chicken-asparagus-mushrooms-527111', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}