{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/716588-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 716588, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rigatoni with Lemon-Chile Pesto and Grated Egg', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 112.96, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 hard-boiled large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons fresh Meyer lemon juice', u'aisle': u'Produce', u'name': u'meyer lemon', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1009150, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon finely grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon finely grated Meyer lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'\xbd ounce Pecorino, finely grated (about \xbd cup)', u'aisle': u'Cheese', u'name': u'pecorino', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'12 ounces rigatoni or other short pasta', u'aisle': u'Pasta and Rice', u'name': u'rigatoni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rigatoni.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11220420, u'unit': u'ounces'}, {u'originalString': u'8 tablespoons (1 stick) unsalted butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'divided', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.bonappetit.com/recipe/rigatoni-lemon-chile-pesto-grated-egg', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404778, u'name': u'box grater'}], u'step': u'Drain pasta, reserving 1 cups pasta cooking liquid.Meanwhile, finely grate egg yolks on the small holes of a box grater and set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 6 Tbsp. butter in a large skillet over medium-high.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add both kinds of lemon zest and juice and red pepper flakes, swirling pan to incorporate.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [], u'step': u'Add pasta and 1 cup pasta cooking liquid and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened and coats pasta, about 5 minutes. Taste and season with salt and pepper.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add Pecorino and remaining 2 Tbsp. butter to pasta and toss until melted.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve pasta topped with reserved grated egg yolks.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11125, u'instructions': u'Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 cups pasta cooking liquid.Meanwhile, finely grate egg yolks on the small holes of a box grater and set aside.Heat 6 Tbsp. butter in a large skillet over medium-high. Add both kinds of lemon zest and juice and red pepper flakes, swirling pan to incorporate. Add pasta and 1 cup pasta cooking liquid and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened and coats pasta, about 5 minutes. Taste and season with salt and pepper.Add Pecorino and remaining 2 Tbsp. butter to pasta and toss until melted. Serve pasta topped with reserved grated egg yolks.', u'spoonacularSourceUrl': u'https://spoonacular.com/rigatoni-with-lemon-chile-pesto-and-grated-egg-716588', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}