{u'recipes': [{u'sourceName': u'Simple Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/502374-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 502374, u'veryPopular': False, u'lowFodmap': False, u'title': u'How I learned to cook whole fish, Sicilian style (and how you can too)', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 40.06, u'creditText': u'Simple Bites', u'extendedIngredients': [{u'originalString': u'Handful chopped fresh basil leaves', u'aisle': u'Produce', u'name': u'basil leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Handful'}, {u'originalString': u'1 cup breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'Several cloves chopped or crushed garlic', u'aisle': u'Spices and Seasonings', u'name': u'cloves', u'metaInformation': [u'crushed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 1002011, u'unit': u'cloves'}, {u'originalString': u'4 whole white fish (these were mid-sized)', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [u'whole', u'white', u'(these were mid-sized)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10115261, u'unit': u''}, {u'originalString': u'1/2 chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Sea salt and olive oil', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1/4 cup sharp white cheese, grated (mine was pecorino, but any sharp cheese would work)', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'white', u'grated', u'(mine was pecorino, but any sharp cheese would work)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'3 chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.simplebites.net/how-i-learned-to-cook-whole-fish-sicilian-style-and-how-you-can-too/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Warm up olive oil on medium heat in a frying pan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add onions first to soften, then all stuffing ingredients, until warm and well mixed.Meanwhile, wash fish well and pat dry.Stuff open cavities of fish with warm stuffing, and lay in a baking dish. I used parchment paper in my pan to prevent the skin from sticking and to minimize cleanup. First, spread olive oil over the parchment, then lay the fish down head-to-tail so that they fit well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}], u'step': u'Bake at 375 for approximately 10 min. per inch of thickness. This is just a general rule. Set your timer for 10 minutes and start checking in 5 minute intervals from that point forward. Avoiding overcooking is key. Test with a fork to see if the fish flakes when you open it. Another key for me was noticing that the gill area burst open slightly and I could see a little cooked white flesh coming out.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle lightly with extra virgin olive oil and sprinkle with sea salt after removing from the oven.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}], u'name': u''}], u'aggregateLikes': 61, u'instructions': u'Warm up olive oil on medium heat in a frying pan. Add onions first to soften, then all stuffing ingredients, until warm and well mixed.Meanwhile, wash fish well and pat dry.Stuff open cavities of fish with warm stuffing, and lay in a baking dish. I used parchment paper in my pan to prevent the skin from sticking and to minimize cleanup. First, spread olive oil over the parchment, then lay the fish down head-to-tail so that they fit well.Bake at 375 for approximately 10 min. per inch of thickness. This is just a general rule. Set your timer for 10 minutes and start checking in 5 minute intervals from that point forward. Avoiding overcooking is key. Test with a fork to see if the fish flakes when you open it. Another key for me was noticing that the gill area burst open slightly and I could see a little cooked white flesh coming out.Drizzle lightly with extra virgin olive oil and sprinkle with sea salt after removing from the oven.', u'spoonacularSourceUrl': u'https://spoonacular.com/how-i-learned-to-cook-whole-fish-sicilian-style-and-how-you-can-too-502374', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}