{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'asian', u'korean'], u'image': u'https://spoonacular.com/recipeImages/198394-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 198394, u'veryPopular': False, u'lowFodmap': False, u'title': u'Soondubu Jjigae (Korean Soft Tofu Stew)', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 216.27, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/2 cup small dried anchovies (optional, see note above)', u'aisle': u'Canned and Jarred;Seafood', u'name': u'anchovies', u'metaInformation': [u'dried', u'small', u'(optional, see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 15001, u'unit': u'cup'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 cloves garlic, grated on a microplane grater', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 to tablespoons gochujang (see note above)', u'aisle': u'Ethnic Foods', u'name': u'gochujang', u'metaInformation': [u'(see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1016973, u'unit': u''}, {u'originalString': u'1 four-inch-square piece kombu (sea kelp, see note above)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'kombu', u'metaInformation': [u'(sea kelp, see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 11445, u'unit': u''}, {u'originalString': u'1 tablespoon light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tablespoon'}, {u'originalString': u'1/2 pound thinly sliced pork belly or bacon (optional)', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10005, u'unit': u'pound'}, {u'originalString': u'6 scallions, finely sliced, greens and whites reserved separately', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'24 ounces soft silken tofu, roughly broken', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'silken tofu', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 16161, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'2 cups very fermented kimchi with juice (see note above)', u'aisle': u'?', u'name': u'very fermented kimchi', u'metaInformation': [u'with juice (see note above)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpeg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/02/soondubu-jjigae-korean-soft-tofu-stew-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine kombu and anchovies (if using) and cover with 1 quart water. Bring to a simmer and remove from heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'id': 11445, u'name': u'kombu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let stand 5 minutes, then strain. Discard solids and reserve broth. Meanwhile, drain kimchi in a fine mesh strainer set over a small bowl, squeezing to remove as much liquid as possible. Roughly chop kimchi and reserve kimchi and juice separately.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in a 2 to 3 quart stone dolsot or saucepan over medium-high heat until shimmering.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add pork belly and cook, stirring constantly, until just cooked through, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'id': 10005, u'name': u'pork belly'}]}, {u'equipment': [], u'step': u'Add scallion whites, garlic, and chopped kimchi. Cook, stirring constantly, until fragrant, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add kimchi juice, gochujang, and soy sauce. Cook until vegetables are well-coated in even layer of sauce.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'id': 1016973, u'name': u'gochujang'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Add strained broth, kochukaru, and soft. Stir gently and heat until boiling. Season to taste with more kochukaru or soy sauce if desired.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Remove from heat and add eggs. sprinkle with scallion greens.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve immediately while still boiling, gently stirring eggs into the broth.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 243, u'instructions': u'Procedures                                                                              1                                                                            Combine kombu and anchovies (if using) and cover with 1 quart water. Bring to a simmer and remove from heat. Let stand 5 minutes, then strain. Discard solids and reserve broth. Meanwhile, drain kimchi in a fine mesh strainer set over a small bowl, squeezing to remove as much liquid as possible. Roughly chop kimchi and reserve kimchi and juice separately.                                                                                                                            2                                                                            Heat oil in a 2 to 3 quart stone dolsot or saucepan over medium-high heat until shimmering. Add pork belly and cook, stirring constantly, until just cooked through, about 1 minute. Add scallion whites, garlic, and chopped kimchi. Cook, stirring constantly, until fragrant, about 1 minute.                                                                                                                            3                                                                            Add kimchi juice, gochujang, and soy sauce. Cook until vegetables are well-coated in even layer of sauce. Add strained broth, kochukaru, and soft. Stir gently and heat until boiling. Season to taste with more kochukaru or soy sauce if desired. Remove from heat and add eggs. sprinkle with scallion greens. Serve immediately while still boiling, gently stirring eggs into the broth.', u'spoonacularSourceUrl': u'https://spoonacular.com/soondubu-jjigae-korean-soft-tofu-stew-198394', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}