{u'recipes': [{u'sourceName': u'Eat Drink Love', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666578-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 666578, u'veryPopular': False, u'lowFodmap': False, u'title': u'No-Bake Banana Cream Cheesecakes', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 127.41, u'creditText': u'Eat Drink Love', u'extendedIngredients': [{u'originalString': u'3/4 cup graham cracker crumbs (divided; you can also use crushed Nilla Wafers)', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [u'divided', u'crushed', u'canned', u'(; you can also use Nilla Wafers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10018617, u'unit': u'cup'}, {u'originalString': u'1 (3.4-ounce) package fat free sugar free instant pudding', u'aisle': u'Baking', u'name': u'instant lemon pudding', u'metaInformation': [u'fat free', u'sugar free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19332, u'unit': u'ounce'}, {u'originalString': u'1 (8-ounce) tub Lite Cool Whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'ounce'}, {u'originalString': u'1 (8-ounce) package reduced fat cream cheese, softened', u'aisle': u'Cheese', u'name': u'reduced fat cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounce'}, {u'originalString': u'1 1/3 cup skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'3 Tbs. unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbs'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://eat-drink-love.com/2013/04/no-bake-banana-cream-cheesecakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Divide the graham cracker crumbs evenly amongst your individual serving bowls (I used 6). Carefully drizzle the melted butter over the crumbs in each bowl. This will help the crumbs set. Stick the bowls into the freezer.In a medium bowl, whisk together the instant pudding mix and milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Let set for about 5 minutes.In a large mixing bowl, beat together the cream cheese and pudding. Fold in the Cool Whip until well-combined.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowls from the freezer. Spoon or pipe the filling evenly into each serving bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the bowls into an airtight container and refrigerate for at least 2 hours (I like to do mine overnight).', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with extra Cool Whip and any other desired garnishes.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 282, u'instructions': u'<p>Divide the graham cracker crumbs evenly amongst your individual serving bowls (I used 6). Carefully drizzle the melted butter over the crumbs in each bowl. This will help the crumbs set. Stick the bowls into the freezer.</p><p>In a medium bowl, whisk together the instant pudding mix and milk. Let set for about 5 minutes.</p><p>In a large mixing bowl, beat together the cream cheese and pudding. Fold in the Cool Whip until well-combined.</p><p>Remove the bowls from the freezer. Spoon or pipe the filling evenly into each serving bowl. Place the bowls into an airtight container and refrigerate for at least 2 hours (I like to do mine overnight).</p><p>Garnish with extra Cool Whip and any other desired garnishes.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-banana-cream-cheesecakes-666578', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}