{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/527251-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527251, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Best Apple Pie', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 82.44, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'4 large McIntosh apples (about 2 pounds), cored and peeled', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'cored', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u'pounds'}, {u'originalString': u'1 large egg white, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 tablespoons all-purpose flour, plus more for dusting the workspace', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dusting', u'all-purpose', u'plus more  the workspace'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'3 large Granny Smith apples (about 1.5 pounds), cored and peeled', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'cored', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 1029003, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 Tbsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'1 double-crust pie dough, refrigerated (*see below for recipe*)', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'refrigerated', u'for recipe*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.gimmesomeoven.com/the-best-apple-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees. Prepare a 9-inch pie plate with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll out the two pieces of dough on a floured workspace into large circles, until the larger one is at least 12-inches in diameter, and the smaller one is about 10-inches in diameter. Carefully transfer the larger pie dough to the pie plate by and press it in gently to line the entire bottom of the pan, with the dough sticking out at least 1/2-inch above the rim. Cover gently with plastic wrap and refrigerate.While the dough is re-cooling, whisk together the sugar, cinnamon, salt and allspice in a large bowl until mixed. Set aside.Fit your food processor with a slicing disc attachment, and thinly slice all of the apples. (You can also do this by hand with a knife.) Toss the apples with the lemon juice until evenly coated. Then transfer the apples to the large bowl with the flour mixture, and gently toss until all of the apples are fairly evenly coated with the flour mixture.Turn the fruit mixture, including the juices, into the chilled pie shell and mound the apples slightly in the center. Carefully lay the second (10-inch) pie crust on top of the apples so that it is centered around the bottom crust. Trim the edges of the top and bottom crust to 1/2-inch beyond the pie pan lip. Then tuck the rim of dough underneath itself so that the folded edge is flush with the pan lip. Flute the edge or press with the tines of a fork to seal the pie crust.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Cut 4 small slits in the top of the dough.Return pie to the freezer for 10 minutes. Then remove and brush with the egg white, and sprinkle evenly with a few pinches of sugar. Cover the edges of the pie crust lightly with aluminum foil or a pie crust shield.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [], u'step': u'Bake for 40 minutes, then remove pie crust shield.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [], u'step': u'Bake for an additional 20 minutes, or until the crust is a deep golden brown and the juices just barely start to seep out.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer pie to a wire rack and let cool to room temperature before slicing, at least 3 hours.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Chateau Chantal Late Harvest Riesling. It has 4.5 out of 5 stars and a bottle costs about 21 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Preheat oven to 375 degrees. Prepare a 9-inch pie plate with cooking spray.Roll out the two pieces of dough on a floured workspace into large circles, until the larger one is at least 12-inches in diameter, and the smaller one is about 10-inches in diameter. Carefully transfer the larger pie dough to the pie plate by and press it in gently to line the entire bottom of the pan, with the dough sticking out at least 1/2-inch above the rim. Cover gently with plastic wrap and refrigerate.While the dough is re-cooling, whisk together the sugar, cinnamon, salt and allspice in a large bowl until mixed. Set aside.Fit your food processor with a slicing disc attachment, and thinly slice all of the apples. (You can also do this by hand with a knife.) Toss the apples with the lemon juice until evenly coated. Then transfer the apples to the large bowl with the flour mixture, and gently toss until all of the apples are fairly evenly coated with the flour mixture.Turn the fruit mixture, including the juices, into the chilled pie shell and mound the apples slightly in the center. Carefully lay the second (10-inch) pie crust on top of the apples so that it is centered around the bottom crust. Trim the edges of the top and bottom crust to 1/2-inch beyond the pie pan lip. Then tuck the rim of dough underneath itself so that the folded edge is flush with the pan lip. Flute the edge or press with the tines of a fork to seal the pie crust. Cut 4 small slits in the top of the dough.Return pie to the freezer for 10 minutes. Then remove and brush with the egg white, and sprinkle evenly with a few pinches of sugar. Cover the edges of the pie crust lightly with aluminum foil or a pie crust shield. Bake for 40 minutes, then remove pie crust shield. Bake for an additional 20 minutes, or until the crust is a deep golden brown and the juices just barely start to seep out.Transfer pie to a wire rack and let cool to room temperature before slicing, at least 3 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-apple-pie-527251', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}