{u'recipes': [{u'sourceName': u'Crock Pot Ladies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483813-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 483813, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crock-Pot Chicken & Dumplings', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 215.49, u'creditText': u'Crock Pot Ladies', u'extendedIngredients': [{u'originalString': u'3 Cans Of Refrigerated Buttermilk Biscuits, cut into 4ths', u'aisle': u'Refrigerated', u'name': u'buttermilk biscuits', u'metaInformation': [u'refrigerated', u'cut into 4ths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'Cans', u'unitShort': u'Cans', u'amount': 3.0, u'consistency': u'solid', u'id': 18009, u'unit': u'Cans'}, {u'originalString': u'4 Cans Of Chicken Broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'Cans', u'unitShort': u'Cans', u'amount': 4.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'Cans'}, {u'originalString': u'4 Small Cans Of Cooked Chicken', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'small', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'Cans', u'unitShort': u'Cans', u'amount': 4.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'Cans'}, {u'originalString': u'2 Cans Of Cream Of Chicken', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'Cans', u'unitShort': u'Cans', u'amount': 2.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'Cans'}, {u'originalString': u'1 Bag Frozen Peas And Carrots', u'aisle': u'Canned and Jarred;Frozen', u'name': u'peas and carrots', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas-and-carrots.jpg', u'unitLong': u'Bag', u'unitShort': u'Bag', u'amount': 1.0, u'consistency': u'solid', u'id': 11322, u'unit': u'Bag'}], u'healthScore': 29.0, u'imageType': u'png', u'spoonacularScore': 95.0, u'sourceUrl': u'http://crockpotladies.com/recipe-categories/entrees/crock-pot-chicken-dumplings/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix the canned chicken, chicken broth and cream of chicken soup in your crock-pot, stir together well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'id': 6016, u'name': u'cream of chicken soup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Add the biscuits on top, mix slightly till the biscuit pieces are wet.Cook on high for 4 to 6 hours, stirring often while cooking so that biscuits will not stick to the side of the crock-pot.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is CalNaturale Chardonnay Lodi. It has 4.1 out of 5 stars and a bottle costs about 11 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 2040, u'instructions': u'Mix the canned chicken, chicken broth and cream of chicken soup in your crock-pot, stir together well.Add the biscuits on top, mix slightly till the biscuit pieces are wet.Cook on high for 4 to 6 hours, stirring often while cooking so that biscuits will not stick to the side of the crock-pot.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-chicken-dumplings-483813', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}