{u'recipes': [{u'sourceName': u'Fountain Venue Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/482580-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 482580, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cuban Black Bean Soup', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 43.76, u'creditText': u'Fountain Venue Kitchen', u'extendedIngredients': [{u'originalString': u'1 pound dried black beans (not canned)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'dried', u'black', u'canned', u'(not )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16015, u'unit': u'pound'}, {u'originalString': u'3 celery stalks, diced', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1/4 cup dry sherry (the kind you could drink, not cooking sherry; see notes)', u'aisle': u'Alcoholic Beverages', u'name': u'dry sherry', u'metaInformation': [u'dry', u'(the kind you could drink, not cooking sherry; see notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10114106, u'unit': u'cup'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground pepper (I use approximately 1 1/2 teaspoons salt and 1 teaspoon of pepper)', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'Optional garnishes: cooked rice, chopped cilantro, diced peppers, sliced scallions, Greek yogurt or sour cream, chopped hard-boiled eggs, lemon or lime wedges, hot sauce', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'diced', u'sour', u'cooked', u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1 jalape\xf1o pepper, minced (I like to keep the seeds for a little heat, but you may remove; hot sauce or crushed red pepper may be substituted)', u'aisle': u'Produce', u'name': u'red jalapeno pepper', u'metaInformation': [u'red', u'minced', u'crushed', u'for a little heat, but you may remove; hot sauce or   pepper may be substituted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111819, u'unit': u''}, {u'originalString': u'1 ham hock (this is a meaty bone that has been smoked and adds exceptional flavor to the broth)', u'aisle': u'Meat', u'name': u'smoked ham hock', u'metaInformation': [u'smoked', u'(this is a meaty bone that has been and adds exceptional flavor to the broth)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93669, u'unit': u''}, {u'originalString': u'3 tablespoons tomato paste (see notes)', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'(see notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'2 medium onions, diced (no bigger than 8 ounces each; I often use one red, one yellow onion, but use what you have on hand)', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'diced', u'red', u'yellow', u'medium', u'(no bigger than 8 ounces each; I often use one , one onion, but use what you have on hand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://fountainavenuekitchen.com/cuban-black-bean-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Soak the black beans. There are two good options: First, you may place the beans in a bowl and add water to cover by at least two inches. Cover and let stand overnight or up to 24 hours, refrigerating if the kitchen is very warm.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}]}, {u'equipment': [], u'step': u'Drain well and discard the soaking liquid. Alternatively, for a quick soak, pour boiling water over the beans to cover by two inches.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for at least one hour or up to a few hours.', u'number': 3, u'ingredients': []}], u'name': u''}, {u'steps': [], u'name': u'Drain as with the first method.For a slow cooker method'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a tablespoon or two of olive or vegetable oil in a large stockpot over medium heat.  Saut\xe9 the onions, celery, and jalape\xf1o until tender, about 5-7 minutes, adding the garlic in the last 30 seconds.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add 9 cups of water along with the drained beans, ham hock, and tomato paste, and bring to a boil.  Immediately reduce the heat and simmer, partially covered, until the beans are tender, about two hours.  (Test the beans after approximately 1 1/2 hours to check for doneness.)For both versions:  When the beans are tender, remove the ham hock to a plate, and allow to cool for a few minutes. In the meantime, pur\xe9e the bean mixture in a blender or with a handheld immersion blender.  For ease, I like to use an immersion blender and keep the soup a little chunky.  If you are using a blender and prefer not to completely pur\xe9e the soup, blend half of the soup.Discard the ham bone and any fat, and dice or shred the meat. Return the meat to the slow cooker or pot along with the salt, pepper, and sherry.  Cook for a few more minutes to heat through.  At this point, if you prefer the soup to be thicker, you may simmer a few more minutes with the lid off.  The soup will also thicken slightly as it sits.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'id': 93669, u'name': u'ham hock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with toppings of choice.', u'number': 3, u'ingredients': []}], u'name': u'Place the onions, celery, garlic, jalape\xf1o, drained beans, ham hock, tomato paste, and 7 cups of water in the slow cooker.  Do not add the sherry, salt, or pepper at this point.  Cover and cook on low heat for 7-8 hours or until the beans are tender. You may instead cook on high heat for approximately half the time.For a stovetop version'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 41, u'instructions': u'Soak the black beans. There are two good options: First, you may place the beans in a bowl and add water to cover by at least two inches. Cover and let stand overnight or up to 24 hours, refrigerating if the kitchen is very warm. Drain well and discard the soaking liquid. Alternatively, for a quick soak, pour boiling water over the beans to cover by two inches. Let stand for at least one hour or up to a few hours. Drain as with the first method.For a slow cooker method:  Place the onions, celery, garlic, jalape\xf1o, drained beans, ham hock, tomato paste, and 7 cups of water in the slow cooker.  Do not add the sherry, salt, or pepper at this point.  Cover and cook on low heat for 7-8 hours or until the beans are tender. You may instead cook on high heat for approximately half the time.For a stovetop version:  Heat a tablespoon or two of olive or vegetable oil in a large stockpot over medium heat.  Saut\xe9 the onions, celery, and jalape\xf1o until tender, about 5-7 minutes, adding the garlic in the last 30 seconds.  Add 9 cups of water along with the drained beans, ham hock, and tomato paste, and bring to a boil.  Immediately reduce the heat and simmer, partially covered, until the beans are tender, about two hours.  (Test the beans after approximately 1 1/2 hours to check for doneness.)For both versions:  When the beans are tender, remove the ham hock to a plate, and allow to cool for a few minutes. In the meantime, pur\xe9e the bean mixture in a blender or with a handheld immersion blender.  For ease, I like to use an immersion blender and keep the soup a little chunky.  If you are using a blender and prefer not to completely pur\xe9e the soup, blend half of the soup.Discard the ham bone and any fat, and dice or shred the meat. Return the meat to the slow cooker or pot along with the salt, pepper, and sherry.  Cook for a few more minutes to heat through.  At this point, if you prefer the soup to be thicker, you may simmer a few more minutes with the lid off.  The soup will also thicken slightly as it sits.Serve with toppings of choice.', u'spoonacularSourceUrl': u'https://spoonacular.com/cuban-black-bean-soup-482580', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}