{u'recipes': [{u'sourceName': u'Daydreamer Desserts', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/555321-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 555321, u'veryPopular': True, u'lowFodmap': False, u'title': u'Double Stuf Oreo Martini', u'diets': [], u'pricePerServing': 508.56, u'creditText': u'Daydreamer Desserts', u'extendedIngredients': [{u'originalString': u'2 ounces dark creme de cacao', u'aisle': u'Alcoholic Beverages', u'name': u'creme de cacao', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/creme-de-cacao.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 93712, u'unit': u'ounces'}, {u'originalString': u"1 tablespoon Smucker's marshmallow topping", u'aisle': u'Baking', u'name': u'marshmallow', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces Double Stuf Oreo Infused Vodka', u'aisle': u'Sweet Snacks', u'name': u'oreo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u'ounces'}, {u'originalString': u'2 Double Stuf Oreo Cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'2 ounces Tres Leches Liqueur', u'aisle': u'Alcoholic Beverages', u'name': u'pear liqueur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 98988, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://daydreamerdesserts.com/2012/02/double-stuf-oreo-martini.html/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Combine the vodka and ground Double Stuf Oreos into a mason jar or perhaps into an empty bottle of vodka you just happened to have laying around for just this occasion. Make sure the jar or bottle is tightly sealed.Store in a cool dry place and give it a good shake once or twice per day for 7 to 10 days.Once vodka has been infused, strain into a clean mason jar using a fine mesh sieve, cheese cloth, or disposable coffee filter. Store in a cool place or in the freezer until ready to use.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [], u'step': u'Drizzle two martini glasses with marshmallow topping.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Combine infused vodka, dark creme de cacao and Tres Leches liqueur in a cocktail shaker filled halfway with ice. Shake for 30-40 seconds and pour into prepared martini glasses.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/creme-de-cacao.jpg', u'id': 93712, u'name': u'creme de cacao'}]}, {u'equipment': [], u'step': u'Garnish each martini glass with a Double Stuf Oreo Cookie.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 36920, u'instructions': u'Combine the vodka and ground Double Stuf Oreos into a mason jar or perhaps into an empty bottle of vodka you just happened to have laying around for just this occasion. Make sure the jar or bottle is tightly sealed.Store in a cool dry place and give it a good shake once or twice per day for 7 to 10 days.Once vodka has been infused, strain into a clean mason jar using a fine mesh sieve, cheese cloth, or disposable coffee filter. Store in a cool place or in the freezer until ready to use.Drizzle two martini glasses with marshmallow topping.Combine infused vodka, dark creme de cacao and Tres Leches liqueur in a cocktail shaker filled halfway with ice. Shake for 30-40 seconds and pour into prepared martini glasses.Garnish each martini glass with a Double Stuf Oreo Cookie.', u'spoonacularSourceUrl': u'https://spoonacular.com/double-stuf-oreo-martini-555321', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}