{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/394038-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 394038, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spiced Pineapple Cooler', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 37.36, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 cinnamon sticks (3 inches)', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [u'(3 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'Additional cinnamon sticks, optional', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'stick', u'unitShort': u'sticks', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u'sticks'}, {u'originalString': u'1 can (12 ounces) ginger ale, chilled', u'aisle': u'Beverages', u'name': u'ginger ale', u'metaInformation': [u'chilled', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 14136, u'unit': u'ounces'}, {u'originalString': u'Ice cubes', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cube', u'unitShort': u'cubes', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cubes'}, {u'originalString': u'1/2 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9206, u'unit': u'cups'}, {u'originalString': u'1 can (46 ounces) unsweetened pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'unsweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 46.0, u'consistency': u'solid', u'id': 9273, u'unit': u'ounces'}, {u'originalString': u'2/3 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/spiced-pineapple-cooler', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, bring the water, sugar, cinnamon and cloves to a boil. Reduce heat; cover and simmer for 15 minutes. Strain. Cool to room temperature.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Pour into a large pitcher; stir in juices. Refrigerate until chilled. Just before serving, stir in ginger ale.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 14136, u'name': u'ginger ale'}]}, {u'equipment': [], u'step': u'Serve over ice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Garnish with additional cinnamon sticks if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}]}], u'name': u''}], u'aggregateLikes': 52, u'instructions': u'Directions                                                                                In a small saucepan, bring the water, sugar, cinnamon and cloves to a boil. Reduce heat; cover and simmer for 15 minutes. Strain. Cool to room temperature.                                                                                           Pour into a large pitcher; stir in juices. Refrigerate until chilled. Just before serving, stir in ginger ale. Serve over ice. Garnish with additional cinnamon sticks if desired.                                        Yield: 13 servings (3/4 cup each).                                                                                                                         Originally published as Spiced Pineapple Cooler in  Taste of HomeApril/May 2010, p15                                                                                                                                                                                                        Nutritional Facts                                                                             3/4 cup equals 119 calories, trace fat (trace saturated fat), 0 cholesterol, 4 mg sodium, 29 g carbohydrate, trace fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/spiced-pineapple-cooler-394038', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 13, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}