{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/472046-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 472046, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spinach and Spaghetti Squash Quiche', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 54.56, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/3 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 beaten egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1 (12 fluid ounce) can evaporated skim milk', u'aisle': u'Baking', u'name': u'evaporated skim milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'fluid ounces', u'unitShort': u'fluid ounce', u'amount': 12.0, u'consistency': u'liquid', u'id': 1097, u'unit': u'fluid ounce'}, {u'originalString': u'1 cup part-skim-milk mozzarella cheese', u'aisle': u'Cheese', u'name': u'skim milk mozzarella cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-(white).jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 42304, u'unit': u'cup'}, {u'originalString': u'1/2 cup cooked, shredded spaghetti squash', u'aisle': u'Produce', u'name': u'spaghetti squash', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11492, u'unit': u'cup'}, {u'originalString': u'1/2 cup frozen chopped spinach , thawed, drained and squeezed dry', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'frozen', u'dry', u'thawed', u'drained', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Spinach-and-Spaghetti-Squash-Quiche/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F (175 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Pierce squash several times with a fork, and place in a microwave-safe dish. Microwave on high for 10 minutes, turn over, and continue cooking 10 minutes more. Squash flesh should be very tender inside. Set aside to cool.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Cut squash in half lengthwise and scoop out seeds. Shred 1/2 cup of squash and place in a mixing bowl. Stir in egg, egg whites, evaporated milk, mozzarella cheese, and spinach until well combined. Spray a 9 inch pie place or quiche dish with cooking spray.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Spread bread crumbs in the bottom and around the sides to coat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [], u'step': u'Pour egg mixture into prepared dish.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake quiche in the preheated oven for 45 minutes, or until a toothpick inserted in the center comes out clean. Allow to cool for at least 10 minutes before cutting.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm or at room temperature.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 114, u'instructions': u'Preheat oven to 350 degrees F (175 degrees C).                            Pierce squash several times with a fork, and place in a microwave-safe dish. Microwave on high for 10 minutes, turn over, and continue cooking 10 minutes more. Squash flesh should be very tender inside. Set aside to cool.                            Cut squash in half lengthwise and scoop out seeds. Shred 1/2 cup of squash and place in a mixing bowl. Stir in egg, egg whites, evaporated milk, mozzarella cheese, and spinach until well combined. Spray a 9 inch pie place or quiche dish with cooking spray. Spread bread crumbs in the bottom and around the sides to coat. Pour egg mixture into prepared dish.                            Bake quiche in the preheated oven for 45 minutes, or until a toothpick inserted in the center comes out clean. Allow to cool for at least 10 minutes before cutting. Serve warm or at room temperature.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-and-spaghetti-squash-quiche-472046', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}