{u'recipes': [{u'sourceName': u'Cinnamon Spice and Everything Nice', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/492339-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 492339, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pan-Fried Pork Chops Wrapped in Ham', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 210.3, u'creditText': u'Cinnamon Spice and Everything Nice', u'extendedIngredients': [{u'originalString': u'canola oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'4 thin slices deli ham or 8 slices bacon', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10010151, u'unit': u'slices'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'4 pork chops', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'sea salt and fresh black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1/2 cup seasoned bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.cinnamonspiceandeverythingnice.com/pan-fried-pork-chops-wrapped-in-ham/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Season the pork chops with salt and pepper on each side. Wrap the ham or bacon around the pork chop, securing it on the side with a toothpick if desired. Once you dredge them in the egg the ham will stick to the chop.Set up a dredging station by whisking the egg and milk together in a wide, shallow bowl and combining the flour, bread crumbs and Parmesan together in another.In large cast-iron skillet heat 1/2 inch of canola oil over medium-high heat. Dredge the chops one at a time in the egg then the flour mixture, coating evenly all over. Fry in batches of 2, about 6 minutes on each side depending on thickness.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u"Remove to drain on a paper towel lined platter. Allow to rest 5 minutes before serving. Don't forget to remove the toothpicks!", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1864, u'instructions': u"Season the pork chops with salt and pepper on each side. Wrap the ham or bacon around the pork chop, securing it on the side with a toothpick if desired. Once you dredge them in the egg the ham will stick to the chop.Set up a dredging station by whisking the egg and milk together in a wide, shallow bowl and combining the flour, bread crumbs and Parmesan together in another.In large cast-iron skillet heat 1/2 inch of canola oil over medium-high heat. Dredge the chops one at a time in the egg then the flour mixture, coating evenly all over. Fry in batches of 2, about 6 minutes on each side depending on thickness. Remove to drain on a paper towel lined platter. Allow to rest 5 minutes before serving. Don't forget to remove the toothpicks!", u'spoonacularSourceUrl': u'https://spoonacular.com/pan-fried-pork-chops-wrapped-in-ham-492339', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}