{u'recipes': [{u'sourceName': u'A Dash of Compassion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551838-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 551838, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry apple tart', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 197.49, u'creditText': u'A Dash of Compassion', u'extendedIngredients': [{u'originalString': u'1/8 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1/4 cup sunflower or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 tbsp cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tbsp'}, {u'originalString': u'1 pound of strawberries, rinsed and dried', u'aisle': u'Dried Fruits;Produce', u'name': u'dried strawberries', u'metaInformation': [u'dried', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freeze-dried-strawberries.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 98897, u'unit': u'pound'}, {u'originalString': u'2 Granny Smith apples, cored and peeled', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'cored', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'2 tbsp fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 tbsp poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'tbsp'}, {u'originalString': u'1/8 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'3/4 cup unbleached flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020081, u'unit': u'cup'}, {u'originalString': u'1/2 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/3 cup whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}, {u'originalString': u'1/2 cup ground pistachios', u'aisle': u'?', u'name': u'ground pistachios', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.adashofcompassion.com/2011/05/tis-the-season/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Using a stand mixer or hand mixer, combine the unbleached flour, whole wheat flour, pistachios, poppy seeds, baking soda and salt.With the mixer running, add the oil, maple syrup and vanilla extract and continue to mix until combined. The dough should stick together when pressed between two fingers.Press the dough into a flat disk shape and wrap tightly in plastic wrap. Refrigerate for about 30 minutes. While the dough is chilling, proceed with the filling (recipe below).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10020081, u'name': u'unbleached flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Roll out the dough in between 2 pieces of parchment paper, working from the middle out, until it is large enough to fit into an 8-inch tart pan with a removable bottom.Carefully transfer the dough to the tart pan and gently press it down to fit, filling cracks where needed. Be sure the dough is not thicker where the sides and bottom meet. Trim any excess dough on the rim. Refrigerate for 15 minutes.Make small indents in the bottom of the unfilled crust with a fork and prebake it on the bottom rack of the oven for 10 minutes at 400 degrees.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the crust from the oven and evenly spread 1 tsp of coconut oil on the bottom of the crust. Next, spoon the filling into the crust and slip a cookie sheet underneath it (to catch the juices while baking).Return the tart to the bottom rack of the oven and bake at 375 degrees for 30 minutes. If you notice the edges are browning too much during baking, cover with aluminum foil.Reduce the temperature to 350 degrees, move the tart to the middle oven rack and continue to bake for another 15 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the tart from the oven and allow it to sit undisturbed for 2 to 3 hours before serving. Store leftovers at room temperature, covered loosely with plastic wrap.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Cut the apples and strawberries into 1/2-inch pieces and place them in a saucepan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Add the maple syrup and lemon juice and allow to sit for about 20 minutes.Stir in the cornstarch and cook the mixture over medium-low heat until it comes to a boil, and then simmer for about 1 minute, stirring constantly. The mixture should thicken.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Remove from heat and allow to cool until the crust is ready.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Using a stand mixer or hand mixer, combine the unbleached flour, whole wheat flour, pistachios, poppy seeds, baking soda and salt.With the mixer running, add the oil, maple syrup and vanilla extract and continue to mix until combined. The dough should stick together when pressed between two fingers.Press the dough into a flat disk shape and wrap tightly in plastic wrap. Refrigerate for about 30 minutes. While the dough is chilling, proceed with the filling (recipe below).Roll out the dough in between 2 pieces of parchment paper, working from the middle out, until it is large enough to fit into an 8-inch tart pan with a removable bottom.Carefully transfer the dough to the tart pan and gently press it down to fit, filling cracks where needed. Be sure the dough is not thicker where the sides and bottom meet. Trim any excess dough on the rim. Refrigerate for 15 minutes.Make small indents in the bottom of the unfilled crust with a fork and prebake it on the bottom rack of the oven for 10 minutes at 400 degrees.Remove the crust from the oven and evenly spread 1 tsp of coconut oil on the bottom of the crust. Next, spoon the filling into the crust and slip a cookie sheet underneath it (to catch the juices while baking).Return the tart to the bottom rack of the oven and bake at 375 degrees for 30 minutes. If you notice the edges are browning too much during baking, cover with aluminum foil.Reduce the temperature to 350 degrees, move the tart to the middle oven rack and continue to bake for another 15 minutes. Remove the tart from the oven and allow it to sit undisturbed for 2 to 3 hours before serving. Store leftovers at room temperature, covered loosely with plastic wrap.Cut the apples and strawberries into 1/2-inch pieces and place them in a saucepan. Add the maple syrup and lemon juice and allow to sit for about 20 minutes.Stir in the cornstarch and cook the mixture over medium-low heat until it comes to a boil, and then simmer for about 1 minute, stirring constantly. The mixture should thicken. Remove from heat and allow to cool until the crust is ready.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-apple-tart-551838', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}