{u'recipes': [{u'sourceName': u'Spicy Southern Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/606778-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 606778, u'veryPopular': False, u'lowFodmap': False, u'title': u'Burgers with Maple Bacon Onion Jam', u'diets': [], u'pricePerServing': 212.79, u'creditText': u'Spicy Southern Kitchen', u'extendedIngredients': [{u'originalString': u'green leaf lettuce', u'aisle': u'Produce', u'name': u'green leaf lettuce', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frisee.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11253, u'unit': u'leaf'}, {u'originalString': u'1.25 pounds ground chuck', u'aisle': u'Meat', u'name': u'ground chuck', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'4 hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'Maple Bacon Onion Jam (Stonewall Kitchen)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'(Stonewall Kitchen)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19297, u'unit': u'servings'}, {u'originalString': u'4 slices provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://spicysouthernkitchen.com/burgers-maple-bacon-onion-jam/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Season ground beef well with salt and pepper and form into 4 patties.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to medium-high. When hot place burgers on grill and grill 3 to 4 minutes. Flip over and cook until desired degree of doneness, placing a slice of cheese on each burger about 1 minute before removing from grill.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place a leaf of lettuce on each bun, top with burgers.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 1 to 2 tablespoons of bacon jam on burgers and enjoy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger on the menu? Try pairing with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Bodegas Renacer Punto Final Malbec Reserva. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 19 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'A fruity red, displaying moderate plum, floral cherry and licorice notes.', u'title': u'Bodegas Renacer Punto Final Malbec Reserva', u'price': u'$18.98', u'id': 435771, u'link': u'https://www.wine.com/product/bodegas-renacer-punto-final-malbec-reserva-2012/132552', u'imageUrl': u'https://spoonacular.com/productImages/435771-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Season ground beef well with salt and pepper and form into 4 patties.Heat grill to medium-high. When hot place burgers on grill and grill 3 to 4 minutes. Flip over and cook until desired degree of doneness, placing a slice of cheese on each burger about 1 minute before removing from grill.Place a leaf of lettuce on each bun, top with burgers.Spread 1 to 2 tablespoons of bacon jam on burgers and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/burgers-with-maple-bacon-onion-jam-606778', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}