{u'recipes': [{u'sourceName': u'Roxanas Home Baking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547630-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 547630, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate rolls with coffee icing', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 75.51, u'creditText': u'Roxanas Home Baking', u'extendedIngredients': [{u'originalString': u'2 cups (240 grams) all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 240.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'4 tbsp (56 grams) melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'4 tbsp (56 grams) room temperature butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'6 oz (168 grams) chocolate (both chopped and chips)', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'chopped', u'(both and chips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 168.0, u'consistency': u'solid', u'id': 19081, u'unit': u'grams'}, {u'originalString': u'4 oz (113 grams) room temperature cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 113.0, u'consistency': u'solid', u'id': 1017, u'unit': u'grams'}, {u'originalString': u'2 eggs (room temperature)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'room temperature', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp instant coffee powder', u'aisle': u'Tea and Coffee', u'name': u'instant coffee powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tsp'}, {u'originalString': u'1/3 cup (80 ml) lukewarm milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 80.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/3 cup (40 grams) powder sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'1/4 cup (50 grams) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'1 tsp yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://roxanashomebaking.com/chocolate-rolls-with-coffee-icing-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a mixing bowl add the flour. Make a well in the middle and pour the 1/3 cup lukewarm milk in. Sprinkle the yeast on top of it and leave at room temperature until the yeast has dissolved and bubbles start to appear.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the sugar, salt and eggs and, with the dough hook on, start mixing on low speed until the dough starts to come together and rolls around the dough hook.Increase the speed to low-to-medium and slowly pour the melted butter.When all the butter is incorporated increase the speed to maximum (on my mixer that is 12) and mix for 2-3 minutes. (at this point the dough is a sticky mess but, please, do not be tempted to add more flour, it will come together with a little patience)With a spatula clean the sides of the bowl and the hook and start mixing again for 2-3 more minutes.Clean and mix again. Do it for 3-4 more times until the dough starts to pull itself from the sides of the bowl and makes a slapping sound.Clean the sides of the bowl and the dough hook and place the dough into a buttered bowl.Cover with plastic wrap and leave at room temperature to rise until doubled in volume.When the dough is risen and doubled in volume, take it out of the bowl and roll it on a slightly floured surface.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Brush it with the room temperature butter and sprinkle the chocolate all over it and roll, starting with the wide side. With a piece of thread or dental floss (unflavored) cut the roll into 8 rolls.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the rolls into a cast iron pan or a 10" round pan. Cover again with plastic foil and leave to rise for the second time. In the meantime heat the oven to 375F.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake the rolls for 25-30 minutes or until slightly golden-brown on top. When the rolls are baked make the coffee icing. In a small bowl mix the cream cheese with the sugar and coffee powder and add enough milk to make it pour-able.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 14214, u'name': u'instant coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour it over warm rolls and enjoy!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Dessert Roll. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1137, u'instructions': u'In a mixing bowl add the flour. Make a well in the middle and pour the 1/3 cup lukewarm milk in. Sprinkle the yeast on top of it and leave at room temperature until the yeast has dissolved and bubbles start to appear.Add the sugar, salt and eggs and, with the dough hook on, start mixing on low speed until the dough starts to come together and rolls around the dough hook.Increase the speed to low-to-medium and slowly pour the melted butter.When all the butter is incorporated increase the speed to maximum (on my mixer that is 12) and mix for 2-3 minutes. (at this point the dough is a sticky mess but, please, do not be tempted to add more flour, it will come together with a little patience)With a spatula clean the sides of the bowl and the hook and start mixing again for 2-3 more minutes.Clean and mix again. Do it for 3-4 more times until the dough starts to pull itself from the sides of the bowl and makes a slapping sound.Clean the sides of the bowl and the dough hook and place the dough into a buttered bowl.Cover with plastic wrap and leave at room temperature to rise until doubled in volume.When the dough is risen and doubled in volume, take it out of the bowl and roll it on a slightly floured surface. Brush it with the room temperature butter and sprinkle the chocolate all over it and roll, starting with the wide side. With a piece of thread or dental floss (unflavored) cut the roll into 8 rolls. Place the rolls into a cast iron pan or a 10" round pan. Cover again with plastic foil and leave to rise for the second time. In the meantime heat the oven to 375F. Bake the rolls for 25-30 minutes or until slightly golden-brown on top. When the rolls are baked make the coffee icing. In a small bowl mix the cream cheese with the sugar and coffee powder and add enough milk to make it pour-able. Pour it over warm rolls and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-rolls-with-coffee-icing-547630', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}