{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597443-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 597443, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salad with Caramelized Pumpkin Seeds, Pears, and Pomegranate', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 160.6, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 large Bosc pears, sliced', u'aisle': u'Produce', u'name': u'bosc pears', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons fresh mint (optional)', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'1 large clove garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 teaspoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'4 ounces pecorino cheese, sliced', u'aisle': u'Cheese', u'name': u'pecorino cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1038, u'unit': u'ounces'}, {u'originalString': u'1 small pomegranate', u'aisle': u'Produce', u'name': u'pomegranate', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009286, u'unit': u''}, {u'originalString': u'2 tablespoons pomegranate juice concentrate', u'aisle': u'Beverages', u'name': u'pomegranate juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9442, u'unit': u'tablespoons'}, {u'originalString': u'1 cup raw pumpkin seeds', u'aisle': u'Savory Snacks', u'name': u'raw pumpkin seeds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10012014, u'unit': u'cup'}, {u'originalString': u'1 large head Romaine lettuce, washed and dried', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'dried', u'washed and ', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'head'}, {u'originalString': u'1 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2 small shallots, thinly sliced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://leitesculinaria.com/23313/recipes-salad-caramelized-pumpkinseeds-pears-pomegranate.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the 1 teaspoon olive oil over high heat for 1 minute in a medium nonstick skillet.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pumpkin seeds and toss in the pan until the seeds are popping and browning, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and add the brown sugar, tossing continuously until seeds are coated with melted sugar (careful—it will burn easily). Quickly mix in chili powder, cumin, cinnamon, and salt, then spread the mixture on a plate to cool.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Let cool completely and store in an air-tight container for up to 1 week until ready to use.2. In a food processor, mince the garlic and mint (if using).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Add the pomegranate juice concentrate, lemon juice, honey, and the remaining 1/2 teaspoon salt and pulse to mix. With the machine running, gradually drizzle in pumpkin seed or olive oil. Set the dressing aside.3.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut through the skin of the pomegranate from stem to tip, dividing the fruit in quarters. Hold it over a bowl and pull apart the sections, then tear apart the pieces, gently freeing the seeds. Slice across the Romaine leaves into 1/2-inch-wide strips. Arrange the greens on plates or in a large bowl. Top with the shallots, pears, and cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'id': 1009286, u'name': u'pomegranate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [], u'step': u'Drizzle the dressing over the salad and top with pomegranate seeds and pumpkin seeds.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 50, u'instructions': u'1. Heat the 1 teaspoon olive oil over high heat for 1 minute in a medium nonstick skillet. Add the pumpkin seeds and toss in the pan until the seeds are popping and browning, about 3 minutes. Remove the pan from the heat and add the brown sugar, tossing continuously until seeds are coated with melted sugar (careful—it will burn easily). Quickly mix in chili powder, cumin, cinnamon, and salt, then spread the mixture on a plate to cool. Let cool completely and store in an air-tight container for up to 1 week until ready to use.2. In a food processor, mince the garlic and mint (if using). Add the pomegranate juice concentrate, lemon juice, honey, and the remaining 1/2 teaspoon salt and pulse to mix. With the machine running, gradually drizzle in pumpkin seed or olive oil. Set the dressing aside.3. Cut through the skin of the pomegranate from stem to tip, dividing the fruit in quarters. Hold it over a bowl and pull apart the sections, then tear apart the pieces, gently freeing the seeds. Slice across the Romaine leaves into 1/2-inch-wide strips. Arrange the greens on plates or in a large bowl. Top with the shallots, pears, and cheese. Drizzle the dressing over the salad and top with pomegranate seeds and pumpkin seeds. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/salad-with-caramelized-pumpkin-seeds-pears-and-pomegranate-597443', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}