{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/317212-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 317212, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shabu Shabu', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 2138.58, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'8 ounces (225 grams) sirloin beef, sliced thinly', u'aisle': u'Meat', u'name': u'beef top sirloin steak', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/top-sirloin-steak.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'liquid', u'id': 23584, u'unit': u'grams'}, {u'originalString': u'1 cup dried bonito flakes, optional*', u'aisle': u'Ethnic Foods', u'name': u'bonito flakes', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bonito-fish-flakes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98898, u'unit': u'cup'}, {u'originalString': u'4 ounces (115 grams) enoki mushrooms, stalks removed', u'aisle': u'Produce', u'name': u'enoki mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/enoki-mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 115.0, u'consistency': u'solid', u'id': 11950, u'unit': u'grams'}, {u'originalString': u"3 ounces (85 grams) dried 'kombu' seaweed*", u'aisle': u'Ethnic Foods;Health Foods', u'name': u'kombu', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'liquid', u'id': 11445, u'unit': u'grams'}, {u'originalString': u'1 jar ponzu-joyu dipping sauce*', u'aisle': u'Ethnic Foods', u'name': u'ponzu sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 93729, u'unit': u'jar'}, {u'originalString': u'4 ounces (115 grams) shiitake mushrooms', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 115.0, u'consistency': u'solid', u'id': 11238, u'unit': u'grams'}, {u'originalString': u'Cooked sticky white rice', u'aisle': u'Pasta and Rice', u'name': u'sticky rice', u'metaInformation': [u'white', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-jasmine-cooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10120054, u'unit': u'servings'}, {u'originalString': u'4 ounces (115 grams) tofu, cut into chunks', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 115.0, u'consistency': u'solid', u'id': 16162, u'unit': u'grams'}, {u'originalString': u'1 bunch watercress, trimmed', u'aisle': u'Produce', u'name': u'trimmed watercress', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11591, u'unit': u'bunch'}, {u'originalString': u'2 cups (1 pint) cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold', u'(1 pint)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 55.0, u'imageType': u'jpeg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/jamie-oliver/shabu-shabu-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the water in a pan and add the dried seaweed. Simmer over a medium heat for about 10 minutes. Pull out the kombu when the water starts to boil. To enhance the flavour you can add some dried bonito flakes 5 minutes before taking the kombu out. It is important not to let the water and kombu boil. Strain the broth, discarding the kombu and bonito flakes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bonito-fish-flakes.jpg', u'id': 98898, u'name': u'bonito flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'id': 11445, u'name': u'seaweed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'id': 11445, u'name': u'kombu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place the beef between 2 sheets of cling film and bash with the back of a knife until it is very thin. Slice the beef into thin strips and place on a serving plate.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bring the broth to the boil.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shiitake mushrooms, followed by the enoki mushrooms, then the tofu and finally the watercress.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'id': 11238, u'name': u'shiitake mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/enoki-mushrooms.jpg', u'id': 11950, u'name': u'enoki mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'id': 11591, u'name': u'watercress'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chopsticks.jpg', u'id': 405596, u'name': u'chopsticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve this pan of boiling broth at the table immediately and get your guests to cook their beef by dipping it in the broth with chopsticks.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Give each guest a bowl of rice and a bowl for their broth, and a small dish of the ponzu dipping sauce. Don't forget the sake or Japanese beer.", u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u"Put the water in a pan and add the dried seaweed. Simmer over a medium heat for about 10 minutes. Pull out the kombu when the water starts to boil. To enhance the flavour you can add some dried bonito flakes 5 minutes before taking the kombu out. It is important not to let the water and kombu boil. Strain the broth, discarding the kombu and bonito flakes.                          Place the beef between 2 sheets of cling film and bash with the back of a knife until it is very thin. Slice the beef into thin strips and place on a serving plate.                          Bring the broth to the boil. Add the shiitake mushrooms, followed by the enoki mushrooms, then the tofu and finally the watercress. Serve this pan of boiling broth at the table immediately and get your guests to cook their beef by dipping it in the broth with chopsticks.                          Give each guest a bowl of rice and a bowl for their broth, and a small dish of the ponzu dipping sauce. Don't forget the sake or Japanese beer.", u'spoonacularSourceUrl': u'https://spoonacular.com/shabu-shabu-317212', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}