{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/421592-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 421592, u'veryPopular': True, u'lowFodmap': False, u'title': u'French Canadian Tourtiere', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 25, u'pricePerServing': 75.48, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon dried thyme, crushed', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/8 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 pound lean ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10219, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon ground sage', u'aisle': u'Spices and Seasonings', u'name': u'ground sage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002038, u'unit': u'teaspoon'}, {u'originalString': u'1/2 pound lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://allrecipes.com/Recipe/French-Canadian-Tourtiere/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees F (220 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a saucepan, combine pork, beef, onion, garlic, water, salt, thyme, sage, black pepper and cloves.  Cook over medium heat until mixture boils; stirring occasionally.  Reduce heat to low and simmer until meat is cooked, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Spoon the meat mixture into the pie crust.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place top crust on top of pie and pinch edges to seal.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Cut slits in top crust so steam can escape.  Cover edges of pie with strips of aluminum foil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 20 minutes, remove foil and return to oven.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for an additional 15 to 20 minutes  until golden brown.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool 10 minutes before slicing.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 968, u'instructions': u'Preheat oven to 425 degrees F (220 degrees C).                            In a saucepan, combine pork, beef, onion, garlic, water, salt, thyme, sage, black pepper and cloves.  Cook over medium heat until mixture boils; stirring occasionally.  Reduce heat to low and simmer until meat is cooked, about 5 minutes.                            Spoon the meat mixture into the pie crust.  Place top crust on top of pie and pinch edges to seal.  Cut slits in top crust so steam can escape.  Cover edges of pie with strips of aluminum foil.                            Bake in preheated oven for 20 minutes, remove foil and return to oven.  Bake for an additional 15 to 20 minutes  until golden brown.  Let cool 10 minutes before slicing.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/french-canadian-tourtiere-421592', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}