{u'recipes': [{u'sourceName': u'Rachel Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/676013-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 676013, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Portobella Mushrooms with Spinach and Cheese', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 198.24, u'creditText': u'Rachel Cooks', u'extendedIngredients': [{u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 cup grated extra sharp cheddar cheese (about 4 ounces)', u'aisle': u'Cheese', u'name': u'extra sharp cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1021009, u'unit': u'ounces'}, {u'originalString': u'1 clove garlic, grated or finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'4-ounces reduced-fat cream cheese, softened', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'softened', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'3 portabello mushroom caps', u'aisle': u'Produce', u'name': u'portabello mushroom caps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11265, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 cups firmly packed fresh spinach, finely chopped', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'packed', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.rachelcooks.com/2015/09/04/grilled-portobella-mushrooms-with-spinach-and-cheese/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat the grill to medium heat.Wipe the mushrooms with a damp paper towel to clean off any dirt. Dry well. Do not rinse under water. Using a spoon, take out the black gills of the mushrooms. Also remove the stems. Using your hands, rub oil onto the outside of the mushrooms.In a mixing bowl, mix together softened cream cheese, sharp cheddar, garlic and spinach. Taste and add salt and pepper to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Mix until combined. Divide cheese mixture between three prepared mushroom caps (I used my hands for this!). Put on the grill, cover and cook until cheese is melted and mushroom is cooked, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Transfer to a serving dish and serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 190, u'instructions': u'Preheat the grill to medium heat.Wipe the mushrooms with a damp paper towel to clean off any dirt. Dry well. Do not rinse under water. Using a spoon, take out the black gills of the mushrooms. Also remove the stems. Using your hands, rub oil onto the outside of the mushrooms.In a mixing bowl, mix together softened cream cheese, sharp cheddar, garlic and spinach. Taste and add salt and pepper to taste. Mix until combined. Divide cheese mixture between three prepared mushroom caps (I used my hands for this!). Put on the grill, cover and cook until cheese is melted and mushroom is cooked, about 10 minutes. Transfer to a serving dish and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-portobella-mushrooms-with-spinach-and-cheese-676013', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}