{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'mediterranean', u'european', u'italian'], u'cheap': False, u'gaps': u'no', u'id': 690261, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pappa al Pomodoro', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 110.05, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'4 sprigs basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2044, u'unit': u'sprigs'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 loaf country-style bread, crust removed, torn into 2" pieces (about 1 1/2 cups), divided', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'country-style', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 18064, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2018, u'unit': u'teaspoon'}, {u'originalString': u'2 garlic cloves, smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'6 tablespoons olive oil, divided, plus more', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided', u'plus more'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds tomatoes, cored, quartered', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'cored', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'pounds'}], u'healthScore': 16.0, u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/pappa-al-pomodoro-51242040', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 450. Toss tomatoes, garlic, fennel seeds, and 3 tablespoons oil in a large baking dish; season with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Roast, stirring occasionally, until the tomatoes are browned and the juices thicken, 3035 minutes.', u'length': {u'number': 3035, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Transfer tomato mixture to a large saucepan; add basil, 1 cup torn bread, and 4 cups water. Bring to a boil, reduce heat, and simmer, stirring occasionally and breaking up bread and tomatoes a little, until bread is softened and soup has thickened slightly, 810 minutes; season with salt and pepper.', u'length': {u'number': 810, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Meanwhile, tear remaining 1/2 cup bread into smaller pieces; toss on a baking sheet with 3 tablespoons oil; season with salt. Toast, tossing often, until crisp, 58 minutes.', u'length': {u'number': 58, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve soup topped with toasted bread and drizzled with more oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'calories 298 fat 22 g fiber 4 gNutritional analysis provided by Bon Apptit', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Cecchi Chianti Classico Riserva di Famiglia with a 4.1 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Chianti Classico Riserva di Famiglia is certainly the most representative wine of Cecchi. Produced only in years in which the grapes reach the quality desired it comes from the area of Castellina in Chianti. The color of excellent limpidity is of an intense ruby red. The aroma reveals broad and ethereal notes of ripe fruit and spices. The structure is elegant. View More', u'title': u'Cecchi Chianti Classico Riserva di Famiglia', u'price': u'$26.99', u'id': 459422, u'link': u'https://www.wine.com/product/cecchi-chianti-classico-riserva-di-famiglia-2014/240545', u'imageUrl': u'https://spoonacular.com/productImages/459422-312x231.jpg'}]}, u'aggregateLikes': 231, u'instructions': u'<p>Preparation                                        Preheat oven to 450. Toss tomatoes, garlic, fennel seeds, and 3 tablespoons oil in a large baking dish; season with salt and pepper.</p><p>                                                                            Roast, stirring occasionally, until the tomatoes are browned and the juices thicken, 3035 minutes.</p><p>                                                                            Transfer tomato mixture to a large saucepan; add basil, 1 cup torn bread, and 4 cups water. Bring to a boil, reduce heat, and simmer, stirring occasionally and breaking up bread and tomatoes a little, until bread is softened and soup has thickened slightly, 810 minutes; season with salt and pepper.</p><p>                                                                            Meanwhile, tear remaining 1/2 cup bread into smaller pieces; toss on a baking sheet with 3 tablespoons oil; season with salt. Toast, tossing often, until crisp, 58 minutes.</p><p>                                                                            Serve soup topped with toasted bread and drizzled with more oil.</p><p>                                    calories 298 fat 22 g fiber 4 g</p><p>Nutritional analysis provided by Bon Apptit</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/pappa-al-pomodoro-690261', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}