{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/750324-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 750324, u'veryPopular': True, u'lowFodmap': False, u'title': u'Butternut Squash Chili', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 342.67, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 avocado, halved, pitted and cut into 1/2-inch cubes', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'pitted', u'halved', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'3 cups butternut squash cubes, in 1-inch pieces', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'1 14-ounce can whole tomatoes with juice, chopped into 1/2-inch pieces', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'with juice, chopped into 1/2-inch pieces', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon cayenne pepper (optional)', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14097, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, very finely chopped or pressed through a garlic press', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed', u'very finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'Plain reduced-fat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'servings'}, {u'originalString': u'1 red bell pepper, seeded and finely chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 cup store-bought salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'store-bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'2 teaspoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 cups cooked white beans, such as Great Northern (rinsed, if canned)', u'aisle': u'Pasta and Rice;Canned and Jarred;Produce', u'name': u'white beans', u'metaInformation': [u'white', u' such as great northern (rinsed, if canned)', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10516050, u'unit': u'cups'}, {u'originalString': u'1 medium yellow onion, finely chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 64.0, u'imageType': u'jpeg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/melissa-darabian/butternut-squash-chili.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat the olive oil in a large soup pot over medium heat, 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the bell pepper and onion and cook, stirring occasionally, until the onion is soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Stir in the garlic and cook until fragrant, about 1 more minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour in the wine and let bubble 1 minute, stirring and scraping any browned bits from the bottom of the pot.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the butternut squash, beans, tomatoes and their juice, salsa, 1 cup water, the chili powder, cumin, cocoa, cinnamon and cayenne, if using. Bring the chili to a simmer, then reduce the heat to medium low and cook, stirring occasionally, until the squash is tender and the chili begins to thicken, about 1 hour. (If the soup looks too thick while cooking, add up to 1 cup more water.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Serve topped with a dollop of Greek yogurt and some avocado cubes.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 1029037, u'name': u'avocado cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u"Cook's Note: If you're using dried beans, soak in water overnight, then simmer until just tender, 1 to 1 1/2 hours (or cook 4 to 5 hours in a slow cooker on high).", u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Photograph by Antonis Achilleos', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Codorniu Anna de Codorniu Cava Brut ros\xe9. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u"This Cava combines glamour, innovation and modernity with the experience and history of what is probably Codorniu's most iconic offering, Anna de Codorniu. Elegance and subtlety, which to a large extent come from a blend with approximately 70% of the most prestigious varietal for making rose cavas: Pinot Noir. Delicate cherry color with strawberry tones. Fine and persistent bubbles. Aromas of red fruit, strawberries, cherries and woodland fruits with hints of green apple. Elegant and light on the palate. Well balanced between acid and sweetness with a refreshing finish.", u'title': u'Codorniu Anna de Codorniu Cava Brut Rose', u'price': u'$12.99', u'id': 451641, u'link': u'https://www.wine.com/product/codorniu-anna-de-codorniu-cava-brut-rose/109416', u'imageUrl': u'https://spoonacular.com/productImages/451641-312x231.jpg'}]}, u'aggregateLikes': 544, u'instructions': u"Heat the olive oil in a large soup pot over medium heat, 1 minute. Add the bell pepper and onion and cook, stirring occasionally, until the onion is soft, about 5 minutes.                          Stir in the garlic and cook until fragrant, about 1 more minute. Pour in the wine and let bubble 1 minute, stirring and scraping any browned bits from the bottom of the pot.                          Add the butternut squash, beans, tomatoes and their juice, salsa, 1 cup water, the chili powder, cumin, cocoa, cinnamon and cayenne, if using. Bring the chili to a simmer, then reduce the heat to medium low and cook, stirring occasionally, until the squash is tender and the chili begins to thicken, about 1 hour. (If the soup looks too thick while cooking, add up to 1 cup more water.) Serve topped with a dollop of Greek yogurt and some avocado cubes.                          Cook's Note: If you're using dried beans, soak in water overnight, then simmer until just tender, 1 to 1 1/2 hours (or cook 4 to 5 hours in a slow cooker on high).                          Photograph by Antonis Achilleos", u'spoonacularSourceUrl': u'https://spoonacular.com/butternut-squash-chili-750324', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}