{u'recipes': [{u'sourceName': u'Happy Food Healthy Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/669305-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 669305, u'veryPopular': False, u'lowFodmap': True, u'title': u'Sugar-Free Vegan Whipped Cream aka Aquafaba Whipped Cream', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'vegan'], u'pricePerServing': 7.34, u'creditText': u'Happy Food Healthy Life', u'extendedIngredients': [{u'originalString': u'1 Tablespoon arrowroot powder', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20003, u'unit': u'Tablespoon'}, {u'originalString': u'2 teaspoons stevia', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93628, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'water from 1 can white beans (garbanzo or great northern beans), chilled', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'white', u'chilled', u'(garbanzo or great northern beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'can'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://happyfoodhealthylife.com/2015/08/04/sugar-free-vegan-whipped-cream-aquafaba-whipped-cream/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Combine all ingredients in a mixing bowl, and using the whisk attachment, mix on high for about 14-16 minutes.For the first while, it will appear that nothing is happening, until about 10 minutes in. Then you will see that it's starting to thicken. You can taste it at this point to adjust vanilla and sweetener levels according to your taste.", u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 234, u'instructions': u"Combine all ingredients in a mixing bowl, and using the whisk attachment, mix on high for about 14-16 minutes.For the first while, it will appear that nothing is happening, until about 10 minutes in. Then you will see that it's starting to thicken. You can taste it at this point to adjust vanilla and sweetener levels according to your taste.", u'spoonacularSourceUrl': u'https://spoonacular.com/sugar-free-vegan-whipped-cream-aka-aquafaba-whipped-cream-669305', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}