{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/415041-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 375, u'id': 415041, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baby Back Ribs', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 208.29, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2-1/2 pounds pork baby back ribs, cut into eight pieces', u'aisle': u'Meat', u'name': u'baby back pork ribs', u'metaInformation': [u'cut into eight pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-back-ribs.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10010204, u'unit': u'pounds'}, {u'originalString': u'1/2 cup barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'2 celery ribs, cut in half', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'2 teaspoons minced garlic, divided', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'divided', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 medium onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Dash hot pepper sauce', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'Dash'}, {u'originalString': u'1/4 cup plum sauce', u'aisle': u'Ethnic Foods', u'name': u'plum sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-sauce.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6151, u'unit': u'cup'}, {u'originalString': u'5 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 teaspoon whole peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'whole peppercorns', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/baby-back-ribs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the ribs in a 5-qt. slow cooker.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the water, onion, celery, 1 teaspoon garlic and peppercorns. Cover and cook on low for 6 hours or until meat is tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, combine the barbecue sauce, plum sauce, hot pepper sauce and remaining garlic. Cook and stir over medium heat for 5 minutes or until heated through.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-sauce.png', u'id': 6151, u'name': u'plum sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Remove ribs. Discard cooking juices and vegetables.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Moisten a paper towel with cooking oil; using long-handled tongs, lightly coat the grill rack.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush ribs with sauce. Grill, covered, over medium-low heat for 8-10 minutes or until browned, turning and basting occasionally with remaining sauce.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 84, u'instructions': u'Directions                                                                                Place the ribs in a 5-qt. slow cooker. Add the water, onion, celery, 1 teaspoon garlic and peppercorns. Cover and cook on low for 6 hours or until meat is tender.                                                                                            In a small saucepan, combine the barbecue sauce, plum sauce, hot pepper sauce and remaining garlic. Cook and stir over medium heat for 5 minutes or until heated through. Remove ribs. Discard cooking juices and vegetables.                                                                                           Moisten a paper towel with cooking oil; using long-handled tongs, lightly coat the grill rack. Brush ribs with sauce. Grill, covered, over medium-low heat for 8-10 minutes or until browned, turning and basting occasionally with remaining sauce.                                        Yield: 4 servings.                                                                                                                         Originally published as Baby Back Ribs in  Weeknight Cooking Made EasyAnnual 2005, p183                                                                                                                                                                                                       Nutritional Facts                                                                             1 serving equals 555 calories, 39 g fat (14 g saturated fat), 153 mg cholesterol, 500 mg sodium, 15 g carbohydrate, 1 g fiber, 33 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/baby-back-ribs-415041', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 380, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}