{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/310766-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 310766, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Burger', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 442.52, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 slices beefsteak tomatoes', u'aisle': u'Produce', u'name': u'beefsteak tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beefsteak-tomato.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10011529, u'unit': u'slices'}, {u'originalString': u'4 seeded burger buns', u'aisle': u'Bakery/Bread', u'name': u'burger buns', u'metaInformation': [u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'Butter lettuce', u'aisle': u'Produce', u'name': u'butter lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Butter-or-Boston-Bibb-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11250, u'unit': u'servings'}, {u'originalString': u'1 8-ounce can water chestnuts, drained and coarsely chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'canned water chestnuts', u'metaInformation': [u'drained', u'coarsely chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11590, u'unit': u'ounce'}, {u'originalString': u'4 slices Cheddar', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'slices'}, {u'originalString': u'1/2 bunch fresh cilantro leaves, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'1-inch piece fresh ginger, peeled and grated', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'2 cloves garlic, smashed and finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'smashed', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 pounds ground turkey', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 5662, u'unit': u'pounds'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/4 cup mayo mixed with 2 teaspoons sambal oelek', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [u'mixed', u'with 2 teaspoons sambal oelek'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 onion, cut into 1/4-inch dice', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'cut into 1/4-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 slices raw red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'raw', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'slices'}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1 tablespoon sambal oelek, optional', u'aisle': u'?', u'name': u'sambal oelek', u'metaInformation': [], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tablespoon'}], u'healthScore': 27.0, u'imageType': u'jpeg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/anne-burrell/turkey-burger-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 200 degrees F to keep the first batch of burgers warm.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the burgers: Coat a large saute pan with olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions, season with salt and bring to a medium-high heat. Cook the onions until they are soft and very aromatic, 7 to 8 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for 1 to 2 minutes. Turn off the heat and let cool.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large mixing bowl, combine the turkey, soy sauce, sambal oelek, ginger, water chestnuts, cilantro and the cooked onions and garlic. (Reserve the onion pan to cook the burgers in later.)', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'id': 11590, u'name': u'water chestnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add one-quarter to one-half cup water; this will help the burgers stay nice and moist. Using your hands, squish everything together until they are really well combined.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Make and cook a little tester patty to be sure that the turkey is really well seasoned. Re-season if needed. If the burger is missing salt add more soy or just give a little sprinkey dink of salt.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'When the burger mix is seasoned appropriately, form the mix into 4 equal size patties.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Coat the saute pan with new olive oil and bring to a medium-high heat.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the burgers in the pan. Be sure not to crowd the pan, if you need to work in batches go ahead! Cook the burgers for 5 to 6 minutes on each side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Place the cheese, if using, on the burger and cook for 1 more minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}], u'step': u"Toast the buns in a broiler or toaster. Schmear each side of the bun lightly with the sambaal mayo. Put a burger on each of the bottom buns and top each burger with tomato, onion and lettuce. Close up each burger, give each one a little squish and eat em' up!", u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Turkey Burgers. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Belasco de Baquedano Swinto Malbec. It has 4.2 out of 5 stars and a bottle costs about 23 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Swinto shows an attractive deep purple color. Complex and powerful in the nose, this exuberant wine boasts an intense aromatic range of ripe black fruits and jams perfectly assembled sith spicy notes provided by the oak ageing. Flavorful, dense and generous, Swinto deliveres an outstanding balance between structure and fruitiness that adds character, power, elegance and a great length to this terrific wine. View More', u'title': u'Belasco de Baquedano Swinto Malbec', u'price': u'$22.99', u'id': 448016, u'link': u'https://www.wine.com/product/belasco-de-baquedano-swinto-malbec-2008/108093', u'imageUrl': u'https://spoonacular.com/productImages/448016-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u"Watch how to make this recipe.                    Preheat the oven to 200 degrees F to keep the first batch of burgers warm.                          For the burgers: Coat a large saute pan with olive oil. Add the onions, season with salt and bring to a medium-high heat. Cook the onions until they are soft and very aromatic, 7 to 8 minutes. Add the garlic and cook for 1 to 2 minutes. Turn off the heat and let cool.                          In a large mixing bowl, combine the turkey, soy sauce, sambal oelek, ginger, water chestnuts, cilantro and the cooked onions and garlic. (Reserve the onion pan to cook the burgers in later.) Add one-quarter to one-half cup water; this will help the burgers stay nice and moist. Using your hands, squish everything together until they are really well combined.                          Make and cook a little tester patty to be sure that the turkey is really well seasoned. Re-season if needed. If the burger is missing salt add more soy or just give a little sprinkey dink of salt.                          When the burger mix is seasoned appropriately, form the mix into 4 equal size patties.                          Coat the saute pan with new olive oil and bring to a medium-high heat. Place the burgers in the pan. Be sure not to crowd the pan, if you need to work in batches go ahead! Cook the burgers for 5 to 6 minutes on each side. Place the cheese, if using, on the burger and cook for 1 more minute.                          Toast the buns in a broiler or toaster. Schmear each side of the bun lightly with the sambaal mayo. Put a burger on each of the bottom buns and top each burger with tomato, onion and lettuce. Close up each burger, give each one a little squish and eat em' up!", u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-burger-310766', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}