{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/367752-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 210, u'id': 367752, u'veryPopular': False, u'lowFodmap': False, u'title': u'Zesty Beef Stew', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 123.66, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 teaspoons beef bouillon granules', u'aisle': u'Canned and Jarred', u'name': u'beef bouillon granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1006076, u'unit': u'teaspoons'}, {u'originalString': u'1 pound beef stew meat, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'beef stew meat', u'metaInformation': [u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'pound'}, {u'originalString': u'1 can (15 ounces) pinto beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned pinto beans', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16044, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon dried minced onion', u'aisle': u'Spices and Seasonings', u'name': u'dried onion', u'metaInformation': [u'dried', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11284, u'unit': u'tablespoon'}, {u'originalString': u'1 package (16 ounces) frozen mixed vegetables, thawed', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'mixed', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11583, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons medium pearl barley', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'pearl barley', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20005, u'unit': u'tablespoons'}, {u'originalString': u'1 can (8 ounces) pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 47.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/zesty-beef-stew', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a 3-qt. slow cooker, combine all ingredients. Cover and cook on low for 3-1/2 to 4-1/2 hours or until meat is tender.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Beef Stew on the menu? Try pairing with Cabernet Sauvignon, Malbec, and Shiraz. These full-bodied red wines are the perfect accompaniment for hearty beef stew. You could try Groth Cabernet Sauvignon. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 59 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'The 2006 Cabernet Sauvignon is big and lush with huge gobs of fruit in the aroma and flavor. The texture of the wine is soft and supple, typical of Cabernet Sauvignons grown in our area of the Oakville AVA. Patience during bottle aging will reward the "steward" with an outstanding bottle over the next 10 to 15 years.Try this Cabernet with a lamb loin marinated in olive oil and garden herbs with lemon mashed Yukon Gold potatoes and Swiss chard.', u'title': u'Groth Cabernet Sauvignon', u'price': u'$58.99', u'id': 442462, u'link': u'https://www.wine.com/product/groth-cabernet-sauvignon-2006/98801', u'imageUrl': u'https://spoonacular.com/productImages/442462-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Directions                                                                                In a 3-qt. slow cooker, combine all ingredients. Cover and cook on low for 3-1/2 to 4-1/2 hours or until meat is tender.                                        Yield: 6 servings.                                                                                                                         Originally published as Zesty Beef Stew in  Simple & DeliciousMarch/April 2007, p46                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 251 calories, 6 g fat (2 g saturated fat), 47 mg cholesterol, 526 mg sodium, 28 g carbohydrate, 8 g fiber, 21 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/zesty-beef-stew-367752', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 220, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}