{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/491113-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 491113, u'veryPopular': True, u'lowFodmap': False, u'title': u'Candy Cane Pudding Parfaits', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 123.48, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'3/4 c. Candy Cane Oreo crumbs', u'aisle': u'Sweet Snacks', u'name': u'candy cane', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93759, u'unit': u'c'}, {u'originalString': u'2 Tbsp. crushed candy cane pieces', u'aisle': u'Sweet Snacks', u'name': u'candy cane', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93759, u'unit': u'Tbsp'}, {u'originalString': u'1 pkg. cream cheese, softened (8 oz.)', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 box Jello candy cane instant pudding mix (3.4 oz)', u'aisle': u'Baking', u'name': u'instant lemon pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19332, u'unit': u'oz'}, {u'originalString': u'2 Tbsp. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tbsp'}, {u'originalString': u'1/4 c. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'2 c. vanilla Cool Whip frosting', u'aisle': u'Baking', u'name': u'vanilla frosting', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'c'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://insidebrucrewlife.com/2012/12/candy-cane-pudding-parfaits-and-a-nambe-giveaway/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a mixing bowl, beat the cream cheese and sugar until creamy. Stir in the milk. Fold in 1 1/2 c. cool whip frosting and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the pudding mix and milk.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let set for 5 minutes in the fridge.Layer the crumbs, cream cheese mix, and pudding in parfait glasses. Top with the extra cool whip and sprinkle with candy cane pieces.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 93759, u'name': u'candy cane'}]}, {u'equipment': [], u'step': u'Serve within an hour of making. They will keep in the refrigerator, but the layers will start to run together.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Parfait. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 14200, u'instructions': u'In a mixing bowl, beat the cream cheese and sugar until creamy. Stir in the milk. Fold in 1 1/2 c. cool whip frosting and set aside. Whisk together the pudding mix and milk. Let set for 5 minutes in the fridge.Layer the crumbs, cream cheese mix, and pudding in parfait glasses. Top with the extra cool whip and sprinkle with candy cane pieces. Serve within an hour of making. They will keep in the refrigerator, but the layers will start to run together.', u'spoonacularSourceUrl': u'https://spoonacular.com/candy-cane-pudding-parfaits-491113', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}