{u'recipes': [{u'sourceName': u'Your Homebased Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485841-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 485841, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peppermint Ice Cream', u'diets': [u'gluten free'], u'pricePerServing': 329.18, u'creditText': u'Your Homebased Mom', u'extendedIngredients': [{u'originalString': u'1 1/2 C half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1049, u'unit': u'C'}, {u'originalString': u'1 C crushed peppermint candy', u'aisle': u'Sweet Snacks', u'name': u'peppermint candy', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98859, u'unit': u'C'}, {u'originalString': u'1 1/2 tsp peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1022050, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 1/4 C sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'C'}, {u'originalString': u'1 Tbsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'Tbsp'}, {u'originalString': u'2 C whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'C'}, {u'originalString': u'1 1/2 C whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'C'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.yourhomebasedmom.com/peppermint-ice-cream/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 102, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix together milks.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add in sugar, salt, vanilla and peppermint', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Stir until sugar is dissolved', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u'Pour into ice cream maker and add in crushed candy cane.Process', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are my top picks for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 8354, u'instructions': u'Mix together milks.  Add in sugar, salt, vanilla and peppermintStir until sugar is dissolvedPour into ice cream maker and add in crushed candy cane.Process', u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-ice-cream-485841', u'dishTypes': [], u'occasions': [u'christmas', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}