{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/208445-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 208445, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sunday Brunch: Toast with Kumquat Marmalade and Goat Cheese', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 152.94, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon black peppercorns, coarsely crushed', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon finely chopped fresh rosemary, plus 1 small sprig', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'6 tablespoons soft goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1159, u'unit': u'tablespoons'}, {u'originalString': u'12 ounces kumquats, rinsed, cut into 1/4-inch rounds, and seeds removed', u'aisle': u'Produce', u'name': u'kumquats', u'metaInformation': [u'seeds removed', u'rinsed', u'cut into 1/4-inch rounds, and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kumquat.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9149, u'unit': u'ounces'}, {u'originalString': u'4 slices multigrain bread', u'aisle': u'Bakery/Bread', u'name': u'multigrain bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18075, u'unit': u'slices'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2010/01/sunday-brunch-toast-with-kumquat-marmalade-and-goat-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a saucepan over medium-low heat, combine the water and sugar and stir occasionally until the sugar has dissolved.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the kumquats, peppercorns, and fresh rosemary sprig. Stir to mix, making sure to bury the rosemary in the fruit.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2063, u'name': u'fresh rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kumquat.jpg', u'id': 9149, u'name': u'kumquat'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bring to a simmer and cook for 10 to 15 minutes, until the kumquats are translucent and the liquid has reduced to the consistency of a thin syrup.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kumquat.jpg', u'id': 9149, u'name': u'kumquat'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat and discard the sprig of rosemary (and any needles that may have separated).', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chopped rosemary and set aside to cool.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Lightly toast the bread. Evenly spread the goat cheese on each slice of bread and top with a generous amount of kumquat marmalade. Leftover marmalade keeps well in the refrigerator for several weeks.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kumquat.jpg', u'id': 9149, u'name': u'kumquat'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 23, u'instructions': u'Procedures                                                                              1                                                                            In a saucepan over medium-low heat, combine the water and sugar and stir occasionally until the sugar has dissolved. Add the kumquats, peppercorns, and fresh rosemary sprig. Stir to mix, making sure to bury the rosemary in the fruit.                                                                                                                             2                                                                            Bring to a simmer and cook for 10 to 15 minutes, until the kumquats are translucent and the liquid has reduced to the consistency of a thin syrup.                                                                                                                             3                                                                            Remove from the heat and discard the sprig of rosemary (and any needles that may have separated). Add the chopped rosemary and set aside to cool.                                                                                                                             4                                                                            Lightly toast the bread. Evenly spread the goat cheese on each slice of bread and top with a generous amount of kumquat marmalade. Leftover marmalade keeps well in the refrigerator for several weeks.', u'spoonacularSourceUrl': u'https://spoonacular.com/sunday-brunch-toast-with-kumquat-marmalade-and-goat-cheese-208445', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}