{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/520607-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 520607, u'veryPopular': True, u'lowFodmap': True, u'title': u'Lightened Up Cheesy Quinoa Lasagna Bake', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 93.11, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'2 tablespoons fresh or dried basil, divided', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups dry, uncooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'dry', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20035, u'unit': u'cups'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8 ounces shredded cheese (use your favorite cheese blend; lite/reduced fat/vegan cheese okay), divided', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded', u'divided', u'your favorite', u'(use cheese blend; lite/reduced fat/vegan cheese okay)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'ounces'}, {u'originalString': u'2 cups marina sauce (storebought or homemade)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'homemade', u'(storebought or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cups'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.averiecooks.com/2014/02/lightened-up-cheesy-quinoa-lasagna-bake.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a medium saucepan, combine quinoa with water, and heat uncovered over high heat until mixture comes to a boil. Turn stove to low or simmer, cover, and cook until all the water has evaporated and quinoa has cooked through, about 12 to 15 minutes. Fluff with a fork and test a bite. While quinoa is cooking, preheat oven to 375F and spray a medium/large baking pan with cooking spray; set aside. I used\xa0this pan\xa0and recommend a 9x9-inch pan for thicker lasagna, or 9x13-inch pan for thinner.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Transfer cooked quinoa to a large mixing bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the marinara sauce, about two-thirds of the cheese (reserve remainder to be sprinkled on before baking), 1 tablespoon basil (reserve remainder), olive oil, salt and pepper to taste. Turn mixture out into prepared baking dish, smoothing it lightly with a spatula and pressing it down gently. Evenly sprinkle with reserved cheese and reserved basil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Bake for about 40 to 45 minutes, or until cheese on top is golden and edges are slightly set. Baking times will vary based on the exact dimensions of your baking pan and personal preference.\xa0', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately. Extra portion will keep airtight in the refrigerator for up to 5 days, or in the freezer for up to 6 months.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Montepulciano, Sangiovese, and Chianti are my top picks for Lasagne. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. You could try Buccicatino Montepulciano d. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'Dark chocolate and raspberries, harmonious, great palate authority', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 14755, u'instructions': u'In a medium saucepan, combine quinoa with water, and heat uncovered over high heat until mixture comes to a boil. Turn stove to low or simmer, cover, and cook until all the water has evaporated and quinoa has cooked through, about 12 to 15 minutes. Fluff with a fork and test a bite. While quinoa is cooking, preheat oven to 375F and spray a medium/large baking pan with cooking spray; set aside. I used\xa0this pan\xa0and recommend a 9x9-inch pan for thicker lasagna, or 9x13-inch pan for thinner. Transfer cooked quinoa to a large mixing bowl. Add the marinara sauce, about two-thirds of the cheese (reserve remainder to be sprinkled on before baking), 1 tablespoon basil (reserve remainder), olive oil, salt and pepper to taste. Turn mixture out into prepared baking dish, smoothing it lightly with a spatula and pressing it down gently. Evenly sprinkle with reserved cheese and reserved basil. Bake for about 40 to 45 minutes, or until cheese on top is golden and edges are slightly set. Baking times will vary based on the exact dimensions of your baking pan and personal preference.\xa0Serve immediately. Extra portion will keep airtight in the refrigerator for up to 5 days, or in the freezer for up to 6 months.', u'spoonacularSourceUrl': u'https://spoonacular.com/lightened-up-cheesy-quinoa-lasagna-bake-520607', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}