{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/21721-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 21721, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Potato Burrito Smothered in Avocado Salsa Verde', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 218.3, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'2 ripe avocados from Mexico', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'2 cups cooked black beans or 1 can black beans, rinsed and drained', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'rinsed', u'cooked', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16015, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon cayenne', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup packed cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 garlic cloves, roughly chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 to 2 teaspoons fresh jalape\xf1o, deseeded and roughly chopped, optional', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'fresh', u'deseeded', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u'teaspoons'}, {u'originalString': u'Finely chopped jalape\xf1o, optional', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11979, u'unit': u'servings'}, {u'originalString': u'1 lime, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1\xbd to 2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 small red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 roasted red peppers (I used jarred)', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'red', u'jarred', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11916, u'unit': u''}, {u'originalString': u'1\xbd cups chopped romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'1 cup mild salsa verde, jarred', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa verde', u'metaInformation': [u'jarred'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 27028, u'unit': u'cup'}, {u'originalString': u'Sea salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'Sea salt and black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon smoked hot paprika (or chipotle powder)', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked', u'hot', u'(or chipotle powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'Sour cream, optional', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'2 medium sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'4 to 6 whole wheat tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'Up to 2 tablespoons water, to thin as necessary', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://cookieandkate.com/2012/sweet-potato-burrito-smothered-in-avocado-salsa-verde/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees Fahrenheit. Scrub and peel the sweet potatoes. Chop them into large, bite-sized chunks, about 1 to 1-inches wide/long and -inch deep. Toss the sweet potatoes with the olive oil, cumin, smoked hot paprika, cayenne pepper and salt and pepper. Make sure they are lightly coated in oil on all sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour the sweet potatoes onto a large baking sheet lined with parchment paper. Arrange the sweet potatoes evenly in a single layer. Do not overcrowd.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Bake for about 45 minutes, flipping the sweet potato chunks halfway, until they are golden and caramelized around the edges.Make the avocado sauce: in a food processor or a good blender, combine the avocado flesh, salsa verde, garlic, jalapeo (skip this if your salsa is spicy) and lime juice. Blend.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the cilantro and blend again.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Add water to thin out the sauce if desired; the sauce should glop easily off a spoon. Taste and blend in some sea salt or add another squeeze of lime if necessary. This sauce should taste like a real kick in the mouth; you'll know you're done when you can't stop going in for another spoonful of the stuff.Make sure the oven is still on at 450 degrees Fahrenheit.*", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place your tortillas on a baking sheet lined with parchment paper. In the middle of each tortilla, put down a couple strips of roasted red pepper, then pour  cup black beans down the center and top it all with  cup roasted sweet potato chunks. Sprinkle  cup or more of jack cheese on top. Pull one edge of the tortilla over to the center of the burrito, then pull the opposite edge over to overlap a bit. Gently roll the burrito over. Repeat with remaining burritos.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11916, u'name': u'roasted red peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u"Bake your burritos for about 5 minutes on the middle rack, until the cheese is melted and the tortillas are lightly crisp.Carefully transfer each burrito to a plate. Smother it in avocado sauce, sprinkle with ample romaine lettuce, some chopped red onion, jalapeo if you'd like and a dollop of sour cream. Go at it with a fork.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Sparkling ros\xe9, and Riesling are my top picks for Burrito. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Parducci Small Lot Pinot Noir New Label Wine. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'pinot noir', u'sparkling rose', u'riesling'], u'productMatches': [{u'description': u'strawberry , raspberry , cedar', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 277, u'instructions': u"Preheat the oven to 450 degrees Fahrenheit. Scrub and peel the sweet potatoes. Chop them into large, bite-sized chunks, about 1 to 1-inches wide/long and -inch deep. Toss the sweet potatoes with the olive oil, cumin, smoked hot paprika, cayenne pepper and salt and pepper. Make sure they are lightly coated in oil on all sides. Pour the sweet potatoes onto a large baking sheet lined with parchment paper. Arrange the sweet potatoes evenly in a single layer. Do not overcrowd. Bake for about 45 minutes, flipping the sweet potato chunks halfway, until they are golden and caramelized around the edges.Make the avocado sauce: in a food processor or a good blender, combine the avocado flesh, salsa verde, garlic, jalapeo (skip this if your salsa is spicy) and lime juice. Blend. Add the cilantro and blend again. Add water to thin out the sauce if desired; the sauce should glop easily off a spoon. Taste and blend in some sea salt or add another squeeze of lime if necessary. This sauce should taste like a real kick in the mouth; you'll know you're done when you can't stop going in for another spoonful of the stuff.Make sure the oven is still on at 450 degrees Fahrenheit.* Place your tortillas on a baking sheet lined with parchment paper. In the middle of each tortilla, put down a couple strips of roasted red pepper, then pour  cup black beans down the center and top it all with  cup roasted sweet potato chunks. Sprinkle  cup or more of jack cheese on top. Pull one edge of the tortilla over to the center of the burrito, then pull the opposite edge over to overlap a bit. Gently roll the burrito over. Repeat with remaining burritos. Bake your burritos for about 5 minutes on the middle rack, until the cheese is melted and the tortillas are lightly crisp.Carefully transfer each burrito to a plate. Smother it in avocado sauce, sprinkle with ample romaine lettuce, some chopped red onion, jalapeo if you'd like and a dollop of sour cream. Go at it with a fork.", u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-burrito-smothered-in-avocado-salsa-verde-21721', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}