{u'recipes': [{u'sourceName': u'Kitchen Nostalgia', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/789662-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 789662, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thai Vermicelli Noodle Salad with Prawns', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 224.63, u'creditText': u'Kitchen Nostalgia', u'extendedIngredients': [{u'originalString': u'1 carrot, julienned', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'4 cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'1 cup coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 cucumber, julienned', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'\xbd tsp fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6179, u'unit': u'tsp'}, {u'originalString': u'juice from 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1/3 cup peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'100 g cooked prawns', u'aisle': u'Seafood', u'name': u'prawns', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'g'}, {u'originalString': u'\xbd purple onion, julienned', u'aisle': u'Produce', u'name': u'purple onion', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'60 g (2 oz) rice vermicelli noodles', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 20133, u'unit': u'oz'}, {u'originalString': u'2 tsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tsp'}, {u'originalString': u'4 tsp sriracha sauce', u'aisle': u'Condiments', u'name': u'sriracha sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'tsp'}, {u'originalString': u'\xbc yellow bell pepper, julienned', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.kitchennostalgia.com/pasta/thai-vermicelli-noodle-salad-with-prawns.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook vermicelli noodles according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool.DRESSING: Blend coconut milk with peanut butter, sesame oil, sriracha sauce, lime juice and fish sauce. Season with salt to taste.In a large bowl, toss vermicelli noodles with prawns, carrot, cucumber, bell pepper, onion, tomatoes and peanut dressing.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve garnished with chopped peanuts and cilantro (optional).', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try NV Mindbender Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Cook vermicelli noodles according to package directions. Let cool.DRESSING: Blend coconut milk with peanut butter, sesame oil, sriracha sauce, lime juice and fish sauce. Season with salt to taste.In a large bowl, toss vermicelli noodles with prawns, carrot, cucumber, bell pepper, onion, tomatoes and peanut dressing. Serve garnished with chopped peanuts and cilantro (optional).', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-vermicelli-noodle-salad-with-prawns-789662', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}