{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/601457-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 601457, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole Wheat Roasted Veggie Lasagna', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 122.4, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 jar spaghetti or marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'jar'}, {u'originalString': u'6 cups fresh sturdy vegetables, chopped (red or yellow peppers, cauliflower, broccoli, carrots, etc.)', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'fresh', u'red', u'yellow', u'chopped', u'( or peppers, cauliflower, broccoli, carrots, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11583, u'unit': u'cups'}, {u'originalString': u'1\xbd tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 teaspoons salt (more to taste)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'(more )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'\xbe cup shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'10 ounces whole wheat lasagna noodles', u'aisle': u'Pasta and Rice', u'name': u'whole wheat lasagna noodles', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10120124, u'unit': u'ounces'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://pinchofyum.com/whole-wheat-roasted-veggie-lasagna', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees. Toss the chopped vegetables with 1 tablespoon olive oil and 1 teaspoon of the salt and arrange on a baking sheet. Roast for 30 minutes or longer, until soft and lightly browned.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to cool.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Saute the onion and garlic in \xbd tablespoon olive oil and add to the roasted vegetable mixture. Stir the beaten egg in with the ricotta cheese and remaining 1 teaspoon salt.In a glass 9x9 baking dish, pour a few spoonfuls of sauce into the pan and spread it around to prevent the noodles from sticking. Layer ingredients: noodles, ricotta, vegetables, sauce. Repeat until the pan is full (for me, this was 2 layers). End with a layer of noodles and cover them with another few tablespoons of sauce. Sprinkle the shredded cheese over the top.Cover with well-oiled aluminum foil so the cheese doesn't stick to the foil.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1011026, u'name': u'shredded cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'id': 11583, u'name': u'vegetable'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake at 400 degrees for about 30 minutes, or until the entire pan is bubbling and the cheese is melted. If you want, remove the foil during the last 10 minutes of baking to help the cheese melt or brown.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for at least 15 minutes so that the individual pieces hold together.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into 9 slices and serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Lasagne on the menu? Try pairing with Montepulciano, Sangiovese, and Chianti. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'Dark chocolate and raspberries, harmonious, great palate authority', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u"Preheat the oven to 400 degrees. Toss the chopped vegetables with 1 tablespoon olive oil and 1 teaspoon of the salt and arrange on a baking sheet. Roast for 30 minutes or longer, until soft and lightly browned. Remove from oven and allow to cool.Saute the onion and garlic in \xbd tablespoon olive oil and add to the roasted vegetable mixture. Stir the beaten egg in with the ricotta cheese and remaining 1 teaspoon salt.In a glass 9x9 baking dish, pour a few spoonfuls of sauce into the pan and spread it around to prevent the noodles from sticking. Layer ingredients: noodles, ricotta, vegetables, sauce. Repeat until the pan is full (for me, this was 2 layers). End with a layer of noodles and cover them with another few tablespoons of sauce. Sprinkle the shredded cheese over the top.Cover with well-oiled aluminum foil so the cheese doesn't stick to the foil. Bake at 400 degrees for about 30 minutes, or until the entire pan is bubbling and the cheese is melted. If you want, remove the foil during the last 10 minutes of baking to help the cheese melt or brown. Let stand for at least 15 minutes so that the individual pieces hold together. Cut into 9 slices and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/whole-wheat-roasted-veggie-lasagna-601457', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}