{u'recipes': [{u'sourceName': u'Good Life Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537472-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 537472, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Fool', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 74.98, u'creditText': u'Good Life Eats', u'extendedIngredients': [{u'originalString': u'1 cup heavy cream, chilled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 cups fresh (or frozen) strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'frozen', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'3 strawberries, sliced, for garnish', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'1-2 Tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.goodlifeeats.com/2014/02/strawberry-fool-an-easy-valentines-dessert.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Place chilled heavy cream in a large mixing bowl, or the bowl of a stand mixer. Beat until light and fluffy, being careful not to overheat. Set aside or chill until ready to use. (You might need to whisk it or beat it again for a few seconds if you don't use it right away and it separates.)", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place strawberries in a medium bowl. Sprinkle with sugar and add vanilla extract. Mash the strawberries, leaving some larger pieces.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Let stand for a few minutes.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula.jpg', u'id': 404717, u'name': u'baking spatula'}], u'step': u'Add about half of the mashed strawberries to the whipped cream, folding with a large silicone spatula. Reserve the remaining strawberries to use when serving.To serve: Spoon some of the cream into four serving glasses or dishes, top with some of the remaining mashed strawberries, and another spoonful or two of the cream and a few sliced strawberries.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve immediately, or place in fridge to chill until ready to serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 84, u'instructions': u"Place chilled heavy cream in a large mixing bowl, or the bowl of a stand mixer. Beat until light and fluffy, being careful not to overheat. Set aside or chill until ready to use. (You might need to whisk it or beat it again for a few seconds if you don't use it right away and it separates.)Place strawberries in a medium bowl. Sprinkle with sugar and add vanilla extract. Mash the strawberries, leaving some larger pieces. Let stand for a few minutes.Add about half of the mashed strawberries to the whipped cream, folding with a large silicone spatula. Reserve the remaining strawberries to use when serving.To serve: Spoon some of the cream into four serving glasses or dishes, top with some of the remaining mashed strawberries, and another spoonful or two of the cream and a few sliced strawberries. Serve immediately, or place in fridge to chill until ready to serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-fool-537472', u'dishTypes': [u'side dish'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}