{u'recipes': [{u'sourceName': u'Roxanas Home Baking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547681-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 7, u'id': 547681, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate strawberry roll cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 47.22, u'creditText': u'Roxanas Home Baking', u'extendedIngredients': [{u'originalString': u'1 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 oz (28 grams) grated dark chocolate ( I used 99% scharffen berger chocolate)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'99%', u'grated', u'( I used scharffen berger chocolate)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 28.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'grams'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup (60 grams) all-purpose flour ( I used Pillsbury)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'( I used Pillsbury)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'1 cup cold heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'3/4 to 1 cup diced fresh strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'2 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u"1/4 cup (20 grams) unsweetened cocoa powder ( I used Hershey's)", u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u"( I used Hershey's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 19165, u'unit': u'grams'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://roxanashomebaking.com/chocolate-strawberry-roll-cake-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oven to 400F. Line a 15X11" jelly roll pan with parchment paper. Grease the top with bakers  spray. Set aside. In a mixing bowl add the eggs and the sugar. Start on low speed and slowly increase to the highest speed and keep mixing for 3-4 minutes on high or until the eggs thicken and are pale in color. With a spatula fold in the flour, cocoa, baking powder and grated chocolate.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread the batter evenly in the prepared baking pan and bake for 6-7 minutes. Turn off the oven and let the pan cool for 1 minute. In the meantime sprinkle powder sugar all over a clean tea towel. Invert cake onto the clean towel and gently remove the parchment paper.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Roll up the cake with towel starting from the short side. Cool completely. When the cake is cold, whip the heavy cream until soft peaks.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'Add the 2 tbsp of sugar and continue whipping until firm peaks. Unroll the cake.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Spread the cream evenly all over the cake. Sprinkle with the diced strawberries.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Roll the cake again, this time without the towel. Chill in the refrigerator for a couple of hours. When ready to serve, sprinkle some powder sugar on top and cut in thin slices. Enjoy!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Dessert Roll. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 3955, u'instructions': u'Heat the oven to 400F. Line a 15X11" jelly roll pan with parchment paper. Grease the top with bakers  spray. Set aside. In a mixing bowl add the eggs and the sugar. Start on low speed and slowly increase to the highest speed and keep mixing for 3-4 minutes on high or until the eggs thicken and are pale in color. With a spatula fold in the flour, cocoa, baking powder and grated chocolate. Spread the batter evenly in the prepared baking pan and bake for 6-7 minutes. Turn off the oven and let the pan cool for 1 minute. In the meantime sprinkle powder sugar all over a clean tea towel. Invert cake onto the clean towel and gently remove the parchment paper. Roll up the cake with towel starting from the short side. Cool completely. When the cake is cold, whip the heavy cream until soft peaks. Add the 2 tbsp of sugar and continue whipping until firm peaks. Unroll the cake. Spread the cream evenly all over the cake. Sprinkle with the diced strawberries. Roll the cake again, this time without the towel. Chill in the refrigerator for a couple of hours. When ready to serve, sprinkle some powder sugar on top and cut in thin slices. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-strawberry-roll-cake-547681', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}