{u'recipes': [{u'sourceName': u'Perrys Plate', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/556906-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 556906, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vanilla Bean Ice Cream (French custard style)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 487.47, u'creditText': u'Perrys Plate', u'extendedIngredients': [{u'originalString': u'6 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/4 c sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'1 vanilla bean, split in half lengthwise', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'3/4 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 c whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.perrysplate.com/2009/08/vanilla-bean-ice-cream.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 54, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium sauce pan, warm the milk, sugar, 1 c cream, and salt over medium-low heat. Scrape the seeds from the vanilla bean into the warmed mixture and add the bean also. Cover; remove from heat and allow to steep at room temperature for about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the remaining 1 c cream into a large bowl and set a mesh strainer on top. In a separate medium bowl, whisk together the egg yolks. Slowly pour the warm mixture into the egg yolks, whisking constantly, then put the warmed egg mixture back into the saucepan. (You might be thinking, "why don\'t you just pour the eggs into the saucepan to save yourself the trouble?" There\'s a reason why its done like this. I\'m not sure about details, but I think it has something to do with your yolks scrambling.)Return the saucepan to medium heat and stir constantly with a heatproof spatula, scraping the bottom as you stir, until the mixture thickens and coats the spatula.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the custard through the strainer into the bowl with the remaining cream.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u"Put the vanilla bean into the custard, add the vanilla extract, and stir until cool over an ice bath. (I had 3 ice cubes at the time, which wasn't enough to cool much of anything. I just let it sit on the counter until it had cooled down quite a bit.)Chill the mixture thoroughly in the fridge. When you're ready to churn, remove the vanilla bean, and then freeze mixture in your ice cream maker according to the manufacturer's directions. When it's finished, transfer immediately to a freezer-safe container and chill for several hours (preferably overnight).", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}]}], u'name': u''}], u'aggregateLikes': 14, u'instructions': u'In a medium sauce pan, warm the milk, sugar, 1 c cream, and salt over medium-low heat. Scrape the seeds from the vanilla bean into the warmed mixture and add the bean also. Cover; remove from heat and allow to steep at room temperature for about 30 minutes.Pour the remaining 1 c cream into a large bowl and set a mesh strainer on top. In a separate medium bowl, whisk together the egg yolks. Slowly pour the warm mixture into the egg yolks, whisking constantly, then put the warmed egg mixture back into the saucepan. (You might be thinking, "why don\'t you just pour the eggs into the saucepan to save yourself the trouble?" There\'s a reason why its done like this. I\'m not sure about details, but I think it has something to do with your yolks scrambling.)Return the saucepan to medium heat and stir constantly with a heatproof spatula, scraping the bottom as you stir, until the mixture thickens and coats the spatula. Pour the custard through the strainer into the bowl with the remaining cream. Put the vanilla bean into the custard, add the vanilla extract, and stir until cool over an ice bath. (I had 3 ice cubes at the time, which wasn\'t enough to cool much of anything. I just let it sit on the counter until it had cooled down quite a bit.)Chill the mixture thoroughly in the fridge. When you\'re ready to churn, remove the vanilla bean, and then freeze mixture in your ice cream maker according to the manufacturer\'s directions. When it\'s finished, transfer immediately to a freezer-safe container and chill for several hours (preferably overnight).', u'spoonacularSourceUrl': u'https://spoonacular.com/vanilla-bean-ice-cream-french-custard-style-556906', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}