{u'recipes': [{u'sourceName': u'Cookie Madness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/711536-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 14, u'id': 711536, u'veryPopular': False, u'lowFodmap': False, u'title': u'Valrhona Caraibe Chocolate Chunk Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 58.88, u'creditText': u'Cookie Madness', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons sour cream or cr\xe8me fra\xeeche', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'creme fraiche', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001056, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 3/4 cups all-purpose flour (425 grams)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 425.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'1 \xbd cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'2/3 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'14 ounces Valrhona Caraibe 66 percent chocolate, chopped or in small pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'10 ounces (2 \xbd sticks) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(2 \xbd sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon vanilla (original called for \xbd)', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u'for \xbd)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.cookiemadness.net/2016/01/valrhona-caraibe-chocolate-chunk-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F. Line three baking sheets with parchment paper.Sift together the flour, baking soda and salt and set aside.In a mixing bowl (preferably a stand mixer with a paddle attached), beat the butter and both sugars on medium speed until light and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the egg.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula.jpg', u'id': 404717, u'name': u'baking spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the vanilla, honey and crme frache and mix well, then add the dry ingredients and mix just until incorporated. With a silicone spatula, fold in the chocolate.Using a #30 scoop or 2 heaping tablespoons, shape the dough into 30 mounds. At this point you can bake the mounds or chill them and bake as needed.To bake, arrange on baking sheets spacing about 3 inches apart.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Bake for 10 to 14 minutes (mine took 14) or until lightly browned around the edges.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Remove from the oven and transfer to wire racks and let cool completely. If you've used the fancy chocolate, they'll be be melt-y at this point. I personally like to let them cool completely before serving, but if you like melt-y, hot, cookies then serve immediately.", u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u"Preheat the oven to 350 degrees F. Line three baking sheets with parchment paper.Sift together the flour, baking soda and salt and set aside.In a mixing bowl (preferably a stand mixer with a paddle attached), beat the butter and both sugars on medium speed until light and fluffy. Add the egg. Add the vanilla, honey and crme frache and mix well, then add the dry ingredients and mix just until incorporated. With a silicone spatula, fold in the chocolate.Using a #30 scoop or 2 heaping tablespoons, shape the dough into 30 mounds. At this point you can bake the mounds or chill them and bake as needed.To bake, arrange on baking sheets spacing about 3 inches apart. Bake for 10 to 14 minutes (mine took 14) or until lightly browned around the edges. Remove from the oven and transfer to wire racks and let cool completely. If you've used the fancy chocolate, they'll be be melt-y at this point. I personally like to let them cool completely before serving, but if you like melt-y, hot, cookies then serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/valrhona-caraibe-chocolate-chunk-cookies-711536', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 24, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}