{u'recipes': [{u'sourceName': u'Norecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/196103-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 196103, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coq Au Vin', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 392.99, u'creditText': u'Norecipes', u'extendedIngredients': [{u'originalString': u'1bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u'leaf'}, {u'originalString': u'8ouncesbutton mushrooms trimmed and halved', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'trimmed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'2cupschicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'8chicken thighs with skin and bone', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'with skin and bone'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 5091, u'unit': u'servings'}, {u'originalString': u'1tablespoonCognac Bourbon will do in a pinch', u'aisle': u'Alcoholic Beverages', u'name': u'cognac', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10414037, u'unit': u'tablespoon'}, {u'originalString': u'4clovesgarlic minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'parsley chopped for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'8ouncescipollini onions or pearl onions, trimmed and peeled', u'aisle': u'Produce', u'name': u'pearl onions', u'metaInformation': [u'trimmed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10111282, u'unit': u'ounces'}, {u'originalString': u'2cupsred wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cups'}, {u'originalString': u'3tablespoonstomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://norecipes.com/coq-au-vin-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"In a large chef’s pan or dutch oven, fry the lardons over medium heat until most of the fat has rendered out (but not until it's crisp).", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the lardons to a bowl with a slotted spoon.Generously salt and pepper the chicken thighs and place in the hot pan, skin side down. Leave undisturbed for 6-7 minutes or until skin is golden brown, then flip the chicken over, allowing it to brown lightly on the second side.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the chicken to the bowl with the lardons.You should no have a nice thick coating of brown "fond". This is what gives the dish much of it\'s depth.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove 2 tablespoons of fat from the pan and set it aside in a small bowl.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chopped onion, celery and garlic and saut\xe9 until soft, scrapping the fond off the bottom of the pan so it doesn’t burn. Hit the pan with a generous splash of Cognac to deglaze the pan. Allow most of the liquid to evaporate, then add the red wine, chicken stock, bay leaf, thyme, and tomato paste. Return the lardons and chicken to the pan and turn several times to make sure each piece is well coated and submerged in the liquid. Cover with the lid slightly askew (so steam can escape) and simmer over medium low heat until the chicken is tender 35-45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'id': 10414037, u'name': u'cognac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add the flour to the fat you’ve reserved and stir until there are no lumps. When the chicken is tender, transfer to a plate and tent with foil.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the mushrooms and cipollini onions to the pan and turn up the heat to medium, simmering uncovered for about 15 minutes or until the onions are cooked and the sauce has reduced a bit.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10311282, u'name': u'cipollini onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add a few tablespoons of sauce to the fat/flour mixture and stir to make a slurry.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the slurry to the sauce in the pan one spoonful at a time, mixing well after each addition to make sure there are no lumps. I don’t like my sauce too thick, so I stopped about 2/3 of the way through, but if you like a very thick sauce, you can add all the roux. Salt and pepper to taste, then return the chicken to to pot to reheat and coat with the sauce.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with the parsley, and then serve the coq au vin over mashed potatoes, egg noodles, or as a stew with a crusty baguette. I also like to sprinkle a little finishing salt like Fleur de Sel on top.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Coq Au Vin can be paired with Beaujolais, Pinot Noir, and Red Burgundy. The red Burgundy is most traditional, but Beaujolais is grown nearby and usually less expensive. Really any dry French red will do! One wine you could try is Louis Jadot Beaujolais Villages. It has 4.3 out of 5 stars and a bottle costs about 14 dollars.', u'pairedWines': [u'beaujolais', u'pinot noir', u'red burgundy'], u'productMatches': [{u'description': u'This crisp, fruit-forward, juicy wine has expressive aromas and flavors of ripe red berries, with nice weight and typically high acidity in the mouth and mineral and spice notes underlying the fruit. View More', u'title': u'Louis Jadot Beaujolais Villages', u'price': u'$13.99', u'id': 435360, u'link': u'https://www.wine.com/product/louis-jadot-beaujolais-villages-2011/119527', u'imageUrl': u'https://spoonacular.com/productImages/435360-312x231.jpg'}]}, u'aggregateLikes': 128, u'instructions': u'In a large chef’s pan or dutch oven, fry the lardons over medium heat until most of the fat has rendered out (but not until it\'s crisp). Transfer the lardons to a bowl with a slotted spoon.Generously salt and pepper the chicken thighs and place in the hot pan, skin side down. Leave undisturbed for 6-7 minutes or until skin is golden brown, then flip the chicken over, allowing it to brown lightly on the second side. Transfer the chicken to the bowl with the lardons.You should no have a nice thick coating of brown "fond". This is what gives the dish much of it\'s depth. Remove 2 tablespoons of fat from the pan and set it aside in a small bowl. Add the chopped onion, celery and garlic and saut\xe9 until soft, scrapping the fond off the bottom of the pan so it doesn’t burn. Hit the pan with a generous splash of Cognac to deglaze the pan. Allow most of the liquid to evaporate, then add the red wine, chicken stock, bay leaf, thyme, and tomato paste. Return the lardons and chicken to the pan and turn several times to make sure each piece is well coated and submerged in the liquid. Cover with the lid slightly askew (so steam can escape) and simmer over medium low heat until the chicken is tender 35-45 minutes.Add the flour to the fat you’ve reserved and stir until there are no lumps. When the chicken is tender, transfer to a plate and tent with foil. Add the mushrooms and cipollini onions to the pan and turn up the heat to medium, simmering uncovered for about 15 minutes or until the onions are cooked and the sauce has reduced a bit. Add a few tablespoons of sauce to the fat/flour mixture and stir to make a slurry. Add the slurry to the sauce in the pan one spoonful at a time, mixing well after each addition to make sure there are no lumps. I don’t like my sauce too thick, so I stopped about 2/3 of the way through, but if you like a very thick sauce, you can add all the roux. Salt and pepper to taste, then return the chicken to to pot to reheat and coat with the sauce.Garnish with the parsley, and then serve the coq au vin over mashed potatoes, egg noodles, or as a stew with a crusty baguette. I also like to sprinkle a little finishing salt like Fleur de Sel on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/coq-au-vin-196103', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}