{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619995-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 619995, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tagliatelle paglia e fieno - Straw and hay tagliatelle', u'diets': [u'dairy free'], u'preparationMinutes': 1, u'pricePerServing': 566.95, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'4 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stalk of celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 kg of lean shoulder of Cinta Senese, cut into 1 cm cubes', u'aisle': u'Meat', u'name': u'deer shoulder', u'metaInformation': [u'lean', u'cut into 1 cm cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/venison-shoulder.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'liquid', u'id': 17346, u'unit': u'kg'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'3 crushed juniper berries', u'aisle': u'Spices and Seasonings', u'name': u'juniper berries', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/juniper-berries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 93613, u'unit': u''}, {u'originalString': u'3 fresh pork sausages', u'aisle': u'Meat', u'name': u'pork sausages', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 1007063, u'unit': u''}, {u'originalString': u'1 small red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'150 g of semolina flour', u'aisle': u'Health Foods;Baking', u'name': u'semolina flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 10020066, u'unit': u'g'}, {u'originalString': u'80 g of cooked spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 80.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'g'}, {u'originalString': u'1 l of tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'solid', u'id': 11549, u'unit': u'l'}, {u'originalString': u'150 g of tender wheat flour', u'aisle': u'Baking', u'name': u'wheat flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 glass of Chianti red wine', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'glas', u'unitShort': u'glass', u'amount': 1.0, u'consistency': u'liquid', u'id': 14084, u'unit': u'glass'}], u'healthScore': 63.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://en.julskitchen.com/tuscany/cinta-senese-meat-sauce', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Sift the tender wheat flour with the semolina flour, pour them on a wooden board or a large working surface and make a well in the middle.Break in the eggs and add a good pinch of salt and a tablespoon of olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10020066, u'name': u'semolina flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix the flour and the eggs with a fork until crumbly, then knead the dough, adding cold water if needed. Keep on kneading until the dough will be smooth, velvety and no longer sticky.Wrap it in plastic film and let it stand for 30 minutes at room temperature.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pasta-machine.jpg', u'id': 406908, u'name': u'pasta machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Drain, squeeze and chop the spinach, then blend it in a food processor with flour until you get a green and smooth flour.Then follow the procedure used for the yellow tagliatelle. Use only one egg, as the flour is already humid and wet for the spinach.Keep on kneading until the dough will be smooth, velvety and no longer sticky. Wrap it in plastic film and let it stand for 30 minutes at room temperature.Now roll the dough. The most important thing, whether youre using a classic long rolling pin or a pasta machine, is to roll it over and over again, rolling and stretching it as much as you can. Make a paper thin wide sheet of pasta.Leave the pasta sheets for 10 - 15 minutes on a tablecloth dusted with semolina flour, or over some well cleaned traditional bamboo reeds, as we would make in my family.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10020066, u'name': u'semolina flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pasta-machine.jpg', u'id': 406908, u'name': u'pasta machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut the pasta sheets with the pasta machine or wrap them on themselves and cut them with a sharp knife in 1 cm thick tagliatelle. Dust with semolina flour, mix green and yellow tagliatelle and form many little nests, ready to be cooked in boiling salted water for a few minutes.Make the battuto, the starting point of many dishes. Chop finely onion, celery and carrot. Cook it on low flame with a tablespoon of olive oil until it soft and golden.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10020066, u'name': u'semolina flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the meat, cut into cubes, and brown it over high heat until it has absorbed all the cooking liquid. Now add the crumbled sausage, bay leaf, crushed juniper berries, salt and pepper. Stir and cook just enough to brown the sausage.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/juniper-berries.jpg', u'id': 93613, u'name': u'juniper berries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Pour in the red wine.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the wine slowly, let it reduce before adding more wine.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14084, u'name': u'wine'}]}, {u'equipment': [], u'step': u'Add the tomato puree, cook on low flame, covered, for about an hour and a half - two hours, until the sauce is thick, tasty, with small droplets of olive oil on the surface, which has taken now a warm, bright red colour.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 105, u'instructions': u'Sift the tender wheat flour with the semolina flour, pour them on a wooden board or a large working surface and make a well in the middle.Break in the eggs and add a good pinch of salt and a tablespoon of olive oil.Mix the flour and the eggs with a fork until crumbly, then knead the dough, adding cold water if needed. Keep on kneading until the dough will be smooth, velvety and no longer sticky.Wrap it in plastic film and let it stand for 30 minutes at room temperature.Drain, squeeze and chop the spinach, then blend it in a food processor with flour until you get a green and smooth flour.Then follow the procedure used for the yellow tagliatelle. Use only one egg, as the flour is already humid and wet for the spinach.Keep on kneading until the dough will be smooth, velvety and no longer sticky. Wrap it in plastic film and let it stand for 30 minutes at room temperature.Now roll the dough. The most important thing, whether youre using a classic long rolling pin or a pasta machine, is to roll it over and over again, rolling and stretching it as much as you can. Make a paper thin wide sheet of pasta.Leave the pasta sheets for 10 - 15 minutes on a tablecloth dusted with semolina flour, or over some well cleaned traditional bamboo reeds, as we would make in my family.Cut the pasta sheets with the pasta machine or wrap them on themselves and cut them with a sharp knife in 1 cm thick tagliatelle. Dust with semolina flour, mix green and yellow tagliatelle and form many little nests, ready to be cooked in boiling salted water for a few minutes.Make the battuto, the starting point of many dishes. Chop finely onion, celery and carrot. Cook it on low flame with a tablespoon of olive oil until it soft and golden.Add the meat, cut into cubes, and brown it over high heat until it has absorbed all the cooking liquid. Now add the crumbled sausage, bay leaf, crushed juniper berries, salt and pepper. Stir and cook just enough to brown the sausage.Pour in the red wine. Add the wine slowly, let it reduce before adding more wine.Add the tomato puree, cook on low flame, covered, for about an hour and a half - two hours, until the sauce is thick, tasty, with small droplets of olive oil on the surface, which has taken now a warm, bright red colour.', u'spoonacularSourceUrl': u'https://spoonacular.com/tagliatelle-paglia-e-fieno-straw-and-hay-tagliatelle-619995', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 3, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}