{u'recipes': [{u'sourceName': u'The Culinary Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575357-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 7, u'id': 575357, u'veryPopular': True, u'lowFodmap': True, u'title': u'Spicy-Warm Gluten Free Gingerbread Men', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 30, u'pricePerServing': 35.69, u'creditText': u'The Culinary Life', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2015, u'unit': u'teaspoon'}, {u'originalString': u'2 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1\xbd cups gluten free flour mix', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten free flour mix', u'metaInformation': [u'gluten free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10093620, u'unit': u'cups'}, {u'originalString': u'\xbd cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup + 2 tablespoons sweet rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'rice flour', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20061, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon xanthan gum', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'xanthan gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93626, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.theculinarylife.com/2010/gingerbread-men-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'With a stand mixer or electric hand beater, beat shortening, sugar, xanthan gum, and guar gum until well mixed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93626, u'name': u'xanthan gum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in egg yolks and beat for 1 minute, then add vanilla and molasses and mix until well incorporated.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add gluten free flour mix, sweet rice flour, baking soda, cinnamon, ginger, cloves, curry powder, and salt. Beat until you’ve got a smooth dough.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 10093620, u'name': u'gluten free flour mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 10020061, u'name': u'sweet rice flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Roll dough out between two pieces of parchment until it is \xbd-inch thick and refrigerate for 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Remove dough from fridge and cut with cookie cutters.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the excess dough from between the shapes and cut the parchment around the cookies with a pair of scissors. Gently move the cookies with their attached parchment to a cookie sheet and place the baking sheet in the refrigerator to keep the cookies chilled. Repeat until you’ve used up all the dough.Once all the dough has been cut with cookie cutters and the shapes are arranged on a baking sheet, place the baking sheets in the refrigerator for 30 minutes. Preheat the oven to 350\xb0 while they are chilling.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake cookies for 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven and allow to cool on pan for 5 minutes before moving the cookies, with their attached piece of parchment, to a cooling rack. Allow to cool fully before decorating.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Gingerbread Men works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 366, u'instructions': u'With a stand mixer or electric hand beater, beat shortening, sugar, xanthan gum, and guar gum until well mixed. Add in egg yolks and beat for 1 minute, then add vanilla and molasses and mix until well incorporated.Add gluten free flour mix, sweet rice flour, baking soda, cinnamon, ginger, cloves, curry powder, and salt. Beat until you’ve got a smooth dough. Roll dough out between two pieces of parchment until it is \xbd-inch thick and refrigerate for 1 hour.Remove dough from fridge and cut with cookie cutters. Remove the excess dough from between the shapes and cut the parchment around the cookies with a pair of scissors. Gently move the cookies with their attached parchment to a cookie sheet and place the baking sheet in the refrigerator to keep the cookies chilled. Repeat until you’ve used up all the dough.Once all the dough has been cut with cookie cutters and the shapes are arranged on a baking sheet, place the baking sheets in the refrigerator for 30 minutes. Preheat the oven to 350\xb0 while they are chilling.Bake cookies for 7 minutes. Remove from oven and allow to cool on pan for 5 minutes before moving the cookies, with their attached piece of parchment, to a cooling rack. Allow to cool fully before decorating.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-warm-gluten-free-gingerbread-men-575357', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 37, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}