{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758408-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758408, u'veryPopular': True, u'lowFodmap': False, u'title': u'Nutella Cookies', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 17.64, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbd tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'\xbe cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 \xbe cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'36 whole blanched hazelnuts, for garnish', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'whole', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 36.0, u'consistency': u'solid', u'id': 12120, u'unit': u''}, {u'originalString': u'1 cup Nutella, plus more for frosting cookies', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [u'plus more for frosting cookies'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19125, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. hazelnut extract, optional', u'aisle': u'Baking', u'name': u'hazelnut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 12120, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'4 oz. (1 stick) unsalted butter or margarine, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'oz'}, {u'originalString': u'\xbc cup unsweetened cocoa', u'aisle': u'Baking', u'name': u'unsweetened cocoa', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/nutella-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Sift together flour, cocoa, baking soda, and salt in bowl. 2. Beat Nutella and butter with electric mixer until smooth and combined. Beat in brown sugar, then egg and hazelnut extract, if using. Beat in flour mixture with mixer on low speed until dough forms.  3.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer dough to large sheet of plastic wrap or wax paper. Shape dough into 2-inch-diameter log with plastic wrap. Wrap tightly, and chill 2 hours, or overnight. 4. Preheat oven to 350\xbaF. Slice dough log into 1/4-inch-thick slices, rolling log 90 degrees between slices to keep edges round.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer slices to greased or parchment paper–lined baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 9 to 11 minutes, or until cookies are firm and dry.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer to wire rack to cool. 5. Frost each cookie with 1/2 tsp. Nutella, and garnish with 1 hazelnut.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 792, u'instructions': u'1. Sift together flour, cocoa, baking soda, and salt in bowl. 2. Beat Nutella and butter with electric mixer until smooth and combined. Beat in brown sugar, then egg and hazelnut extract, if using. Beat in flour mixture with mixer on low speed until dough forms.  3. Transfer dough to large sheet of plastic wrap or wax paper. Shape dough into 2-inch-diameter log with plastic wrap. Wrap tightly, and chill 2 hours, or overnight. 4. Preheat oven to 350\xbaF. Slice dough log into 1/4-inch-thick slices, rolling log 90 degrees between slices to keep edges round. Transfer slices to greased or parchment paper–lined baking sheet. Bake 9 to 11 minutes, or until cookies are firm and dry. Transfer to wire rack to cool. 5. Frost each cookie with 1/2 tsp. Nutella, and garnish with 1 hazelnut.', u'spoonacularSourceUrl': u'https://spoonacular.com/nutella-cookies-758408', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}