{u'recipes': [{u'sourceName': u'Kiss My Whisk', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/677725-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 677725, u'veryPopular': False, u'lowFodmap': False, u'title': u'Soy Glazed Cod Baked in Parchment Paper', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 295.89, u'creditText': u'Kiss My Whisk', u'extendedIngredients': [{u'originalString': u'2 fillets of Cod', u'aisle': u'Seafood', u'name': u'cod', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'unitLong': u'fillets', u'unitShort': u'fillets', u'amount': 2.0, u'consistency': u'solid', u'id': 15015, u'unit': u'fillets'}, {u'originalString': u'1-2 tablespoons fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 inch of fresh ginger, peeled and chopped', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 bunch of green onions, sliced into 1 inch pieces', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced into 1 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}, {u'originalString': u'1-2 tablespoons low sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sriracha sauce', u'aisle': u'Condiments', u'name': u'sriracha sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'teaspoon'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.kissmywhisk.com/home/2011/8/16/soy-glazed-cod-baked-in-parchment-paper.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine soy sauce, sriracha, vegetable oil, garlic, cilantro, and ginger.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place fish fillets in middle of their own parchment sheets, season each with salt, and then brush soy sauce mixture generously over fish. Throw sliced green onions into packet. Fold over parchment paper and roll sides to seal parchment packet.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place side by side on a baking sheet and cook for about 15 minutes, or until fish is opaque. If you have a thicker fillet, you may have to cook a little longer.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Cut open packet and serve in parchment paper.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Attems Ramato Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif.', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 35, u'instructions': u'<p>Preheat oven to 350 degrees.</p><p>Combine soy sauce, sriracha, vegetable oil, garlic, cilantro, and ginger. Place fish fillets in middle of their own parchment sheets, season each with salt, and then brush soy sauce mixture generously over fish. Throw sliced green onions into packet. Fold over parchment paper and roll sides to seal parchment packet.</p><p>Place side by side on a baking sheet and cook for about 15 minutes, or until fish is opaque. If you have a thicker fillet, you may have to cook a little longer. Cut open packet and serve in parchment paper.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/soy-glazed-cod-baked-in-parchment-paper-677725', u'license': u'CC BY-SA 3.0', u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}