{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557475-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 557475, u'veryPopular': True, u'lowFodmap': False, u'title': u'Almond Poppy Seed Muffins', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 89.65, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'1 tsp almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002050, u'unit': u'tsp'}, {u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'milk to thin', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'servings'}, {u'originalString': u'heaping 1/4 cup poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2033, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u"3/4 cup confectioner's sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup unsalted butter, melted and slightly cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups plain yogurt or sour cream (I used full fat Greek yogurt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'plain', u'sour', u'(I used full fat Greek yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1116, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2013/10/almond-poppy-seed-muffins.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Set the oven to 375F', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk the dry ingredients, including poppy seeds, together thoroughly, you don't want lumps of baking soda in your muffins.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the eggs and yogurt together and blend well.  Stir in the melted butter and the almond extract.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u"Add the wet ingredients to the dry ingredients, and mix until just combined.  Don't over mix or your muffins may be tough.  Fill muffin cups with batter.  This makes 12 large muffins, so high sided muffin liners, will help contain the batter.  If you use regular muffin liners this recipe will make a few more muffins.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for about 25 to 30 minutes, until the tops are just starting to get a little golden around the edges and a toothpick inserted in the center comes out without wet batter clinging to it.Cool slightly on a rack before glazing.To make the glaze, mix the sugar, almond extract, and milk until you get a smooth, glossy glaze.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1016, u'instructions': u"Set the oven to 375FWhisk the dry ingredients, including poppy seeds, together thoroughly, you don't want lumps of baking soda in your muffins.Whisk the eggs and yogurt together and blend well.  Stir in the melted butter and the almond extract.Add the wet ingredients to the dry ingredients, and mix until just combined.  Don't over mix or your muffins may be tough.  Fill muffin cups with batter.  This makes 12 large muffins, so high sided muffin liners, will help contain the batter.  If you use regular muffin liners this recipe will make a few more muffins. Bake for about 25 to 30 minutes, until the tops are just starting to get a little golden around the edges and a toothpick inserted in the center comes out without wet batter clinging to it.Cool slightly on a rack before glazing.To make the glaze, mix the sugar, almond extract, and milk until you get a smooth, glossy glaze.", u'spoonacularSourceUrl': u'https://spoonacular.com/almond-poppy-seed-muffins-557475', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}