{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/198056-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 198056, u'veryPopular': False, u'lowFodmap': True, u'title': u"Cocktail: The Dark 'n' Stormy", u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'pricePerServing': 84.47, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'8 ounces ginger beer (I used Reeds brand, and experimented with all flavor permutations--original, premium, and extra ginger. Go with extra ginger.)', u'aisle': u'Beverages', u'name': u'ginger beer', u'metaInformation': [u'with all flavor permutations--original, premium, and extra ginger. go with extra ginger.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10014136, u'unit': u'ounces'}, {u'originalString': u'lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'serving'}, {u'originalString': u"2 shots rum (Go for Goslings, the classic Bermudan brand, used in this and the island's fish chowder. A 750mL bottle is about $18.)", u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [u"for goslings, the classic bermudan brand, used in this and the island's fish chowder. a 750ml bottle is $18.)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 14037, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2007/07/cocktails-the-dark-and-stormy.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour two shots of rum over ice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u'Add the ginger beer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 10014136, u'name': u'ginger beer'}]}, {u'equipment': [], u'step': u"Add the juice of half of the lime. Stir well.  If you're really daring, attempt a lime curlicue garnish--slice off the lime's skin in one peel, then roll it up like a cinnamon roll.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Cut about a centimeter apart, untwist, and add to drink.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 28, u'instructions': u"Procedures                                                                              1                                                                            Pour two shots of rum over ice. Add the ginger beer. Add the juice of half of the lime. Stir well.  If you're really daring, attempt a lime curlicue garnish--slice off the lime's skin in one peel, then roll it up like a cinnamon roll. Cut about a centimeter apart, untwist, and add to drink.", u'spoonacularSourceUrl': u'https://spoonacular.com/cocktail-the-dark-n-stormy-198056', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}