{u'recipes': [{u'sourceName': u'A Zesty Bite', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/623374-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 623374, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked pear and apple fries', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 57.05, u'creditText': u'A Zesty Bite', u'extendedIngredients': [{u'originalString': u'1 apple, sliced into fry pieces', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'sliced into fry pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 tablespoon Pompeian Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'teaspoon'}, {u'originalString': u'1 pear, sliced into fry pieces', u'aisle': u'Produce', u'name': u'pear', u'metaInformation': [u'sliced into fry pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.azestybite.com/baked-pear-apple-fries/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the apple and pear into fry pieces.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add them to a bowl along with the olive oil and vanilla. Throughly coat the fries. In a small bowl mix together the sugars, cinnamon and nutmeg. Sprinkle over the fries and then mix with a spoon until will coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place in an iron skillet and bake for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and allow to cool for 5 minutes.Top with ice cream and caramel.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 66, u'instructions': u'Preheat oven to 350 degrees F.Cut the apple and pear into fry pieces. Add them to a bowl along with the olive oil and vanilla. Throughly coat the fries. In a small bowl mix together the sugars, cinnamon and nutmeg. Sprinkle over the fries and then mix with a spoon until will coated.Place in an iron skillet and bake for 20 minutes. Remove and allow to cool for 5 minutes.Top with ice cream and caramel.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-pear-and-apple-fries-623374', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}