{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/215259-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 215259, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potato curry with lime & cucumber raita', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 344.82, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tbsp brown or black mustard seeds', u'aisle': u'Spices and Seasonings', u'name': u'black mustard seeds', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'tbsp'}, {u'originalString': u'400g can coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'g'}, {u'originalString': u'3 long dried red Indian chillies', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'\xbd cucumber, deseeded and coarsely grated', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'grated', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'12-15 curry leaves', u'aisle': u'Ethnic Foods', u'name': u'curry leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 93604, u'unit': u''}, {u'originalString': u'small handful coriander leaves, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander leaves', u'metaInformation': [u'small', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'2 tsp garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93663, u'unit': u'tsp'}, {u'originalString': u'2 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'zest and juice 1 lime', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'chapatis, rotis or naan bread, to serve', u'aisle': u'Bakery/Bread;Ethnic Foods', u'name': u'naan bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/naan.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 93723, u'unit': u'servings'}, {u'originalString': u'150g pot natural yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'natural yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'g'}, {u'originalString': u'2 onions, sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'800g potatoes, peeled and cut into very large chunks', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'large', u'peeled', u'cut into very  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'2 tbsp vegetable or sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'500g tomatoes, quartered', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11529, u'unit': u'g'}, {u'originalString': u'2 tsp turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}], u'healthScore': 60.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1759650/potato-curry-with-lime-and-cucumber-raita', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large pan and fry the mustard seeds, chillies and curry leaves until the seeds start to pop.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'id': 93604, u'name': u'curry leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [], u'step': u'Add the onions and fry until softened and starting to brown. stir in the spices, add the tomatoes and fry for 5 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the potatoes and stir to coat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Pour in the coconut milk with 200ml water. Bring to the boil and simmer for 20-25 mins, stirring occasionally, until the potatoes are just tender.To make the raita, mix all the ingredients together with some seasoning. If the curry looks a little too saucy, scoop out the potatoes with a slotted spoon into another dish, then boil the sauce until reduced a little. stir the potatoes back in to heat through, and season well (this curry needs a good sprinkling of salt). serve with warmed Indian bread and a dollop of raita.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raita-or-tzaziki.png', u'id': 1001116, u'name': u'raita'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The L'Ecole 41 Chenin Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'Heat the oil in a large pan and fry the mustard seeds, chillies and curry leaves until the seeds start to pop. Add the onions and fry until softened and starting to brown. stir in the spices, add the tomatoes and fry for 5 mins. Add the potatoes and stir to coat. Pour in the coconut milk with 200ml water. Bring to the boil and simmer for 20-25 mins, stirring occasionally, until the potatoes are just tender.To make the raita, mix all the ingredients together with some seasoning. If the curry looks a little too saucy, scoop out the potatoes with a slotted spoon into another dish, then boil the sauce until reduced a little. stir the potatoes back in to heat through, and season well (this curry needs a good sprinkling of salt). serve with warmed Indian bread and a dollop of raita.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-curry-with-lime-cucumber-raita-215259', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}