{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556432-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 556432, u'veryPopular': True, u'lowFodmap': True, u'title': u'Pork sirloin with herbs', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 73.14, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'5 black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1022030, u'unit': u''}, {u'originalString': u'1 knob of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u''}, {u'originalString': u'2 teaspoons of coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon of dried tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried tarragon', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'teaspoon'}, {u'originalString': u'125 ml dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 125.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}, {u'originalString': u'5 tablespoons of extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'3 juniper berries', u'aisle': u'Spices and Seasonings', u'name': u'juniper berries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/juniper-berries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 93613, u'unit': u''}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon of dried calamint', u'aisle': u'?', u'name': u'calamint', u'metaInformation': [u'dried'], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://en.julskitchen.com/main/meat/roast-pork-sirloin-with-herbs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Crush in a mortar the dried herbs with black pepper, juniper berries and coarse salt, until you get a fine powder.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/juniper-berries.jpg', u'id': 93613, u'name': u'juniper berries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'coarse salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut with a sharp knife the meat at a centimetre from the top surface, so that you can almost open your piece of meat like a book (check the photos to see how I made the incision).Fill generously the incision with the pesto of herbs, spices and salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Drizzle with a tablespoon of extra virgin olive oil.Tie the pork with a long stretch of butcher's twine, to prevent the meat from opening and to have a more compact piece of meat, allowing an easier and evenly cooking.Rub the meat with ground black pepper and salt.In a cast iron pot pour the remaining 4 tablespoons of extra virgin olive oil and add a knob of butter.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Heat the olive oil over medium flame and when the butter has melted place the meat into the hot olive oil. Brown the pork for about 2 minutes on each side or until golden brown.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the white wine over the meat and after a few seconds cover the pot with a lid.Cook the meat for 25 minutes with the lid over medium heat, checking from time to time to prevent it from sticking to the bottom.When the gravy is thick, remove the meat from the heat and let it stand covered or wrapped in aluminum foil for about ten minutes before serving. Another way to check whether the meat is ready is to check the internal temperature: in the case of pork meat it should reach about 72\xb0C at the core.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove the meat when it is about 70\xb0C and let it rest wrapped in aluminium foil.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the pork loin, cut into thick slices, with a side of roasted potatoes, flavored with the same herbs you used for the meat or with the herbs you prefer.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sirloin Steak can be paired with Pinot Noir, Cabernet Sauvignon, and Merlot. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Argyle Reserve Pinot Noir with a 4.3 out of 5 star rating seems like a good match. It costs about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'cabernet sauvignon', u'merlot'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 416, u'instructions': u"Crush in a mortar the dried herbs with black pepper, juniper berries and coarse salt, until you get a fine powder.Cut with a sharp knife the meat at a centimetre from the top surface, so that you can almost open your piece of meat like a book (check the photos to see how I made the incision).Fill generously the incision with the pesto of herbs, spices and salt. Drizzle with a tablespoon of extra virgin olive oil.Tie the pork with a long stretch of butcher's twine, to prevent the meat from opening and to have a more compact piece of meat, allowing an easier and evenly cooking.Rub the meat with ground black pepper and salt.In a cast iron pot pour the remaining 4 tablespoons of extra virgin olive oil and add a knob of butter. Heat the olive oil over medium flame and when the butter has melted place the meat into the hot olive oil. Brown the pork for about 2 minutes on each side or until golden brown.Pour the white wine over the meat and after a few seconds cover the pot with a lid.Cook the meat for 25 minutes with the lid over medium heat, checking from time to time to prevent it from sticking to the bottom.When the gravy is thick, remove the meat from the heat and let it stand covered or wrapped in aluminum foil for about ten minutes before serving. Another way to check whether the meat is ready is to check the internal temperature: in the case of pork meat it should reach about 72\xb0C at the core. Remove the meat when it is about 70\xb0C and let it rest wrapped in aluminium foil.Serve the pork loin, cut into thick slices, with a side of roasted potatoes, flavored with the same herbs you used for the meat or with the herbs you prefer.", u'spoonacularSourceUrl': u'https://spoonacular.com/pork-sirloin-with-herbs-556432', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}