{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/215459-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 215459, u'veryPopular': False, u'lowFodmap': False, u'title': u'Open lasagne of mushrooms & olives', u'diets': [], u'pricePerServing': 262.51, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tbsp balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tbsp'}, {u'originalString': u'200g flat cap mushrooms, thickly sliced', u'aisle': u'Produce', u'name': u'brown cap mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11266, u'unit': u'g'}, {u'originalString': u'6 sprigs fresh oregano or marjoram, leaves picked and roughly chopped', u'aisle': u'Produce', u'name': u'fresh marjoram', u'metaInformation': [u'fresh', u'leaves picked', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 6.0, u'consistency': u'solid', u'id': 1022024, u'unit': u'sprigs'}, {u'originalString': u'1 handful parsley leaves, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'2 handfuls green olives, stoned and halved', u'aisle': u'Canned and Jarred', u'name': u'green olives', u'metaInformation': [u'green', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-olives---sliced.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 1029195, u'unit': u'handfuls'}, {u'originalString': u'8 sheets fresh lasagne', u'aisle': u'Pasta and Rice', u'name': u'lasagne pasta', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 8.0, u'consistency': u'solid', u'id': 10620420, u'unit': u'sheets'}, {u'originalString': u'200g mixed wild mushrooms, trimmed', u'aisle': u'Produce', u'name': u'mixed mushrooms', u'metaInformation': [u'wild', u'mixed', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-mushrooms.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10011238, u'unit': u'g'}, {u'originalString': u'100ml extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'ml'}, {u'originalString': u'50g freshly grated parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'1 dried red chilli, finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'dried', u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}], u'healthScore': 47.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1829/open-lasagne-of-mushrooms-and-olives', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'To make the dressing, gently heat the balsamic vinegar, olive oil and chilli together with 1 tbsp of water. Once warm, add the olives and the herbs, remove from the heat and set aside.Bring a large pot of water to the boil, add the lasagne sheets and salt if you wish, then simmer for 3 mins. Meanwhile, heat the sunflower oil in a large frying pan until very hot.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4584, u'name': u'sunflower oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Add the flat cap mushrooms and fry for 1 min until they start to colour.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add mixed mushrooms and fry for 2-3 mins more. Season if you want to and set aside.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-mushrooms.png', u'id': 10011238, u'name': u'mixed mushrooms'}]}, {u'equipment': [], u'step': u'Drain the lasagne sheets and put one on the base of each of four large plates. Scatter the mushroom mixture over and put a second sheet on top. Spoon over the dressing, sprinkle over the parmesan and serve immediately.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Montepulciano, Sangiovese, and Chianti are great choices for Lasagne. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'plum , dark chocolate , rich', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 35, u'instructions': u'To make the dressing, gently heat the balsamic vinegar, olive oil and chilli together with 1 tbsp of water. Once warm, add the olives and the herbs, remove from the heat and set aside.Bring a large pot of water to the boil, add the lasagne sheets and salt if you wish, then simmer for 3 mins. Meanwhile, heat the sunflower oil in a large frying pan until very hot. Add the flat cap mushrooms and fry for 1 min until they start to colour. Add mixed mushrooms and fry for 2-3 mins more. Season if you want to and set aside.Drain the lasagne sheets and put one on the base of each of four large plates. Scatter the mushroom mixture over and put a second sheet on top. Spoon over the dressing, sprinkle over the parmesan and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/open-lasagne-of-mushrooms-olives-215459', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}