{u'recipes': [{u'sourceName': u'Garnish with Lemon', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/610717-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 610717, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Baked Chicken Chimichangas', u'diets': [u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 122.22, u'creditText': u'Garnish with Lemon', u'extendedIngredients': [{u'originalString': u'\xbc cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'\xbc cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'4 ounces cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'6 Flour Tortillas (8-10 inch)', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'(8-10 inch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'10 inchs', u'unitShort': u'10 inch', u'amount': 6.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'10 inch'}, {u'originalString': u'Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'2 cups rotisserie chicken, cubed', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'16 ounces Green Chile Salsa (Salsa Verde)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'green', u'(Salsa Verde)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'ounces'}, {u'originalString': u'1\xbc cups shredded cheese (I used Mexican Blend)', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded', u'(I used Mexican Blend)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1011026, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.garnishwithlemon.com/easy-baked-chicken-chimichangas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.In a medium sauce pan, combine salsa and chicken broth. Bring to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Add cream cheese and stir until melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add cumin and cilantro and stir until mixed. Gently stir in chicken and remove from heat.Set out 6 tortillas and put  cup filling in the middle of each. Divide cheese equally between tortillas. Fold tortilla up by first folding each side in and then roll in thirds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place seam side down on baking sheet and lightly spray with olive oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Bake for 15-20 minutes or until browned.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with pico de gallo, sour cream, and guacamole if desired.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chimichanga works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Trombetta Gap's Crown Vineyard Pinot Noir. It has 4.1 out of 5 stars and a bottle costs about 59 dollars.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Rich garnet color. Aromas of vanilla, clove and cooking spiceswith hints of ripe berry, pomegranate and toast. Soft entry,balanced tannin and berry fruit mingled with pleasant acidityand lingering finish. View More', u'title': u"Trombetta Gap's Crown Vineyard Pinot Noir", u'price': u'$58.99', u'id': 439275, u'link': u'https://www.wine.com/product/trombetta-gaps-crown-vineyard-pinot-noir-2012/138834', u'imageUrl': u'https://spoonacular.com/productImages/439275-312x231.jpg'}]}, u'aggregateLikes': 430, u'instructions': u'Preheat oven to 375 degrees.In a medium sauce pan, combine salsa and chicken broth. Bring to a boil. Add cream cheese and stir until melted. Add cumin and cilantro and stir until mixed. Gently stir in chicken and remove from heat.Set out 6 tortillas and put  cup filling in the middle of each. Divide cheese equally between tortillas. Fold tortilla up by first folding each side in and then roll in thirds. Place seam side down on baking sheet and lightly spray with olive oil. Bake for 15-20 minutes or until browned.Serve with pico de gallo, sour cream, and guacamole if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-baked-chicken-chimichangas-610717', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}