{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/754248-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 754248, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prosciutto and Arugula Pizza', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 510.1, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 cup arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'Olive oil, for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'serving'}, {u'originalString': u'8 ounces prepared pizza dough, formed into a circle', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93610, u'unit': u'ounces'}, {u'originalString': u'8 slices prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}, {u'originalString': u'1/4 cup ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'1/4 cup shredded mozzarella', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/katie-lee/prosciutto-and-arugula-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat a grill to medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the pizza dough on the grill.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Let cook for 1 minute, and then flip with tongs. Move to a cooler spot on the grill (about medium heat) until the dough begins to pull away from the grill, about 1 minute.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove the dough from the grill.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Spread the dough with the ricotta and scatter with mozzarella. Return to the grill, cover and cook until the cheese melts, about 3 minutes. Top with the prosciutto and arugula and drizzle with olive oil.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Selvapiana Chianti Rufina. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 14 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses.', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 87, u'instructions': u'Watch how to make this recipe.                    Preheat a grill to medium-high heat.                          Place the pizza dough on the grill. Let cook for 1 minute, and then flip with tongs. Move to a cooler spot on the grill (about medium heat) until the dough begins to pull away from the grill, about 1 minute. Remove the dough from the grill.                          Spread the dough with the ricotta and scatter with mozzarella. Return to the grill, cover and cook until the cheese melts, about 3 minutes. Top with the prosciutto and arugula and drizzle with olive oil.', u'spoonacularSourceUrl': u'https://spoonacular.com/prosciutto-and-arugula-pizza-754248', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}