{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/754401-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 754401, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Pop Cupcakes', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 114.75, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup canned pumpkin puree', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'2 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'1 teaspoon pure maple extract', u'aisle': u'Baking', u'name': u'maple extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 12111111, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'2 1/2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 stick unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}, {u'originalString': u'2 sticks unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'sticks'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/pumpkin-pop-cupcakes-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 325 degrees F.', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Brush tops of cupcakes evenly/generously with maple syrup. Allow cupcakes to absorb syrup. Generously frost each cupcake with a pastry bag and cut 1/2-inch off the tip.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Roll sides of frosting in graham cracker crumbs. Lastly drizzle maple syrup on top as desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}], u'name': u'To assemble'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Melt butter in microwave in small glass bowl. In small bowl mix graham cracker crumbs and sugar together. Stir in melted butter to graham cracker crumbs and press together by hand.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add a pinch of cinnamon for spiced flavor if desired. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Sift the flour, baking powder, baking soda, salt, cinnamon, nutmeg, and ginger into a medium bowl and set aside. In a large bowl, using an electric mixer on low-medium speed, beat the butter, sugar and pumpkin until smoothly blended.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in the eggs. On low speed, mix in the flour mixture until it is incorporated. The batter will be thick.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Line 12 cup cupcake or muffin pan. Fill bottom layer of papers with graham cracker mix to form crust. Fill remainder of papers 3/4-full with batter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake until the cupcakes are puffed and a toothpick inserted into the center comes out clean, about 20 minutes. Cool the cupcakes completely.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u'Graham cracker mix'}, {u'steps': [{u'equipment': [], u'step': u'Cream butter and sugar 1-2 minutes or until fluffy.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add salt and milk until creamy. Scrape mixing bowl walls with rubber spatula and add maple extract.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 12111111, u'name': u'maple extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix until creamy consistency.', u'number': 3, u'ingredients': []}], u'name': u'Maple Butter Cream Frosting'}], u'winePairing': {u'pairingText': u"Cupcakes can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 284, u'instructions': u'Preheat the oven to 325 degrees F.                          Graham cracker mix:                          Melt butter in microwave in small glass bowl. In small bowl mix graham cracker crumbs and sugar together. Stir in melted butter to graham cracker crumbs and press together by hand. Add a pinch of cinnamon for spiced flavor if desired. Set aside.                          Sift the flour, baking powder, baking soda, salt, cinnamon, nutmeg, and ginger into a medium bowl and set aside. In a large bowl, using an electric mixer on low-medium speed, beat the butter, sugar and pumpkin until smoothly blended. Mix in the eggs. On low speed, mix in the flour mixture until it is incorporated. The batter will be thick.                          Line 12 cup cupcake or muffin pan. Fill bottom layer of papers with graham cracker mix to form crust. Fill remainder of papers 3/4-full with batter. Bake until the cupcakes are puffed and a toothpick inserted into the center comes out clean, about 20 minutes. Cool the cupcakes completely.                          Maple Butter Cream Frosting:                          Cream butter and sugar 1-2 minutes or until fluffy. Add salt and milk until creamy. Scrape mixing bowl walls with rubber spatula and add maple extract. Mix until creamy consistency.                          To assemble:                          Brush tops of cupcakes evenly/generously with maple syrup. Allow cupcakes to absorb syrup. Generously frost each cupcake with a pastry bag and cut 1/2-inch off the tip. Roll sides of frosting in graham cracker crumbs. Lastly drizzle maple syrup on top as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-pop-cupcakes-754401', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}