{u'recipes': [{u'sourceName': u'Bakerette', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/586271-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 586271, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy No-Bake White Chocolate Cheesecake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 149.65, u'creditText': u'Bakerette', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'6 ounces white chocolate bark (or 1 1/2 cups white chocolate chips)', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'white', u'(or 1 1/2 cups chocolate chips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 19081, u'unit': u'ounces'}, {u'originalString': u'1 9-inch chocolate pie crumb crust', u'aisle': u'Baking', u'name': u'chocolate crumb crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'9-inch', u'unitShort': u'9-inch', u'amount': 1.0, u'consistency': u'solid', u'id': 28111, u'unit': u'9-inch'}, {u'originalString': u'Chocolate syrup', u'aisle': u'Frozen;Baking;Condiments', u'name': u'chocolate syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-syrup.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 14181, u'unit': u'servings'}, {u'originalString': u'1 cup sifted confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'11 ounces Philadelphia cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'6 ounces Cool Whip topping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1200, u'unit': u'ounces'}, {u'originalString': u'1/2 pint strawberries, sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 0.5, u'consistency': u'solid', u'id': 9316, u'unit': u'pint'}, {u'originalString': u'2 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://bakerette.com/easy-no-bake-white-chocolate-cheesecake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large mixing bowl, beat together cream cheese, confectioners sugar, vanilla, and butter until smooth and creamy. Set aside.In a small sauce pan, melt chocolate bark until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Remove from heat and gradually add melted chocolate to cream cheese mixture beating on low speed until blended. Fold in Cool Whip until well combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [], u'step': u'Place sliced strawberries over the entire pie crust surface and pour Cool Whip mixture over the top and distribute evenly.Cover and refrigerate for 5 hours or overnight.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Drizzle with chocolate syrup and top with remaining strawberry slices and serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-syrup.jpg', u'id': 14181, u'name': u'chocolate syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'In a large mixing bowl, beat together cream cheese, confectioners sugar, vanilla, and butter until smooth and creamy. Set aside.In a small sauce pan, melt chocolate bark until smooth. Remove from heat and gradually add melted chocolate to cream cheese mixture beating on low speed until blended. Fold in Cool Whip until well combined.Place sliced strawberries over the entire pie crust surface and pour Cool Whip mixture over the top and distribute evenly.Cover and refrigerate for 5 hours or overnight. Drizzle with chocolate syrup and top with remaining strawberry slices and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-no-bake-white-chocolate-cheesecake-586271', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}