{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/626998-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 626998, u'veryPopular': False, u'lowFodmap': False, u'title': u'One-Skillet Ham and Cheese Gnocchi', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 279.81, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'2 cups ham, diced', u'aisle': u'Meat', u'name': u'diced ham', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/diced-ham.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 99186, u'unit': u'cups'}, {u'originalString': u'1 (16 oz) package gnocchi', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'gnocchi', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 98853, u'unit': u'oz'}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd cup sharp cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1 cup mozzarella, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'1\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.jocooks.com/main-courses/pork-main-courses/one-skillet-ham-cheese-gnocchi/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large skillet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onions and cook until tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add ham to skillet and cook until ham starts browning.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add peas to skillet and stir. It's ok if peas are frozen.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add gnocchi to skillet, then water and heavy cream. Stir and let cook for about 5 minutes until gnocchi is tender and sauce has thickened. Season with salt and pepper.Sprinkle with cheese on top and place skillet under the broiler for 2 to 3 minutes until cheese melts and start slightly browning.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'id': 98853, u'name': u'gnocchi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Verdicchio, Trebbiano, and Chianti are my top picks for Gnocchi. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Sartarelli Verdicchio Classico. Reviewers quite like it with a 3.2 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'verdicchio', u'trebbiano', u'chianti'], u'productMatches': [{u'description': u'Vinification: sourced from 3 vineyards, soft pressing and temperature controlled fermentation in stainless steel lasting 3-4 weeks, partial malolactic.Aging: 6 months in stainless steel before bottling.TASTING NOTES: Nutty, discrete aromas of pit fruits, smoke and minerals, rich and dry, intensely flavored; finishes with floral and herbal notes.', u'title': u'Sartarelli Verdicchio Classico', u'price': u'$12.99', u'id': 434907, u'link': u'https://www.wine.com/product/sartarelli-verdicchio-classico-2000/52251', u'imageUrl': u'https://spoonacular.com/productImages/434907-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u"Heat the olive oil in a large skillet. Add onions and cook until tender. Add ham to skillet and cook until ham starts browning.Add peas to skillet and stir. It's ok if peas are frozen. Add gnocchi to skillet, then water and heavy cream. Stir and let cook for about 5 minutes until gnocchi is tender and sauce has thickened. Season with salt and pepper.Sprinkle with cheese on top and place skillet under the broiler for 2 to 3 minutes until cheese melts and start slightly browning.", u'spoonacularSourceUrl': u'https://spoonacular.com/one-skillet-ham-and-cheese-gnocchi-626998', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}