{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523269-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 523269, u'veryPopular': False, u'lowFodmap': False, u'title': u'Healthy Whole Wheat Carrot Cake with Maple-Cinnamon Frosting', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 64.54, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'28g (2 Tbs) Almond Oil (or any other neutral oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'almond oil', u'metaInformation': [u'or any other neutral oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4529, u'unit': u'Tbs'}, {u'originalString': u'1 tsp Apple Cider Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tsp'}, {u'originalString': u'123g (1/2 cup) Unsweetened Applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'32g (1/4 cup) Arrowroot Starch', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20003, u'unit': u'cup'}, {u'originalString': u'1/2 tsp Baking Soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'2 tsp Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'14g (1 Tbs) Coconut Oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tbs'}, {u'originalString': u'48g (1/4 cup) Organic Evaporated Cane Juice', u'aisle': u'Health Foods;Baking', u'name': u'evaporated cane juice', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-cane-juice.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93625, u'unit': u'cup'}, {u'originalString': u'12g (1 Tbs) Organic Evaporated Cane Juice', u'aisle': u'Health Foods;Baking', u'name': u'evaporated cane juice', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-cane-juice.png', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 93625, u'unit': u'Tbs'}, {u'originalString': u'170g (2/5 package) Extra Firm Tofu (drained and rinsed)', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'drained and rinsed)', u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'packages', u'unitShort': u'pkg', u'amount': 0.4, u'consistency': u'solid', u'id': 10016162, u'unit': u'package'}, {u'originalString': u'170g (2/5 package) Extra Firm Organic Tofu (drained)', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'organic', u'firm', u'drained', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'packages', u'unitShort': u'pkg', u'amount': 0.4, u'consistency': u'solid', u'id': 10016162, u'unit': u'package'}, {u'originalString': u'1/2 tsp Lemon Flavor', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u'tsp'}, {u'originalString': u'1 tsp Maple Flavor', u'aisle': u'Baking', u'name': u'maple flavor', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11111111, u'unit': u'tsp'}, {u'originalString': u'42g (2 Tbs) Molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'Tbs'}, {u'originalString': u'112g (1/2 cup) Plain, Nonfat Greek Yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'1/4 tsp Nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1/2 cup Orange Juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/2 cup Raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1/4 tsp Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tsp Stevia Extract', u'aisle': u'Baking', u'name': u'stevia extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'50 drops Stevia Extract', u'aisle': u'Baking', u'name': u'stevia extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 50.0, u'consistency': u'solid', u'id': 93628, u'unit': u'drops'}, {u'originalString': u'2 tsp Vanilla Extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'30g (1 scoop) Unflavored Whey Protein Isolate', u'aisle': u'Health Foods', u'name': u'whey protein', u'metaInformation': [u'unflavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 1001223, u'unit': u'scoop'}, {u'originalString': u'31g (1 scoop) Vanilla Whey Protein Powder', u'aisle': u'Health Foods', u'name': u'whey protein powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 1001223, u'unit': u'scoop'}, {u'originalString': u'240g (2 cups) Whole Wheat Pastry Flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'cups'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://dessertswithbenefits.com/carrot-cake-with-maple-cinnamon-frosting/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 325 degrees Fahrenheit and spray two 9" cake pans with cooking spray.In a large mixing bowl, whisk together the dry ingredients.In a blender, add all the wet ingredients and blend until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over the dry ingredients and fold gently.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the carrots and raisins and fold again (do not overmix)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Pour batter into the two cakes and bake for ~33 minutes, or until the surface of the cake has browned, a toothpick comes out clean and the top of the cake springs back when touched.Flip cakes onto wire cooling racks.  When cooled, wrap in plastic wrap and refrigerate overnight (be careful, the cakes are very soft).  Frost the next day.In a food processor, add the first four ingredients and puree.', u'length': {u'number': 33, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the last three ingredients and puree again.Put one layer of the cake down, and scoop a spoonful or two of frosting onto it, spreading out to the edges and sides.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place the next cake layer onto the bottom cake and scoop the rest of the frosting onto the cake, spreading it out overtop and to the sides.  Slice and serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Carrot Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 32, u'instructions': u'Preheat the oven to 325 degrees Fahrenheit and spray two 9" cake pans with cooking spray.In a large mixing bowl, whisk together the dry ingredients.In a blender, add all the wet ingredients and blend until smooth.  Pour over the dry ingredients and fold gently.  Add the carrots and raisins and fold again (do not overmix)Pour batter into the two cakes and bake for ~33 minutes, or until the surface of the cake has browned, a toothpick comes out clean and the top of the cake springs back when touched.Flip cakes onto wire cooling racks.  When cooled, wrap in plastic wrap and refrigerate overnight (be careful, the cakes are very soft).  Frost the next day.In a food processor, add the first four ingredients and puree.Add the last three ingredients and puree again.Put one layer of the cake down, and scoop a spoonful or two of frosting onto it, spreading out to the edges and sides.Place the next cake layer onto the bottom cake and scoop the rest of the frosting onto the cake, spreading it out overtop and to the sides.  Slice and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-whole-wheat-carrot-cake-with-maple-cinnamon-frosting-523269', u'dishTypes': [u'dessert'], u'occasions': [u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}