{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/620643-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 620643, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mac and Cheese in a Mug', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 86.9, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1/3 cup elbow macaroni', u'aisle': u'Pasta and Rice', u'name': u'elbow macaroni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10120499, u'unit': u'cup'}, {u'originalString': u'2 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'Freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'serving'}, {u'originalString': u'1/2 cup shredded cheddar (the finely shredded version works best)', u'aisle': u'Cheese', u'name': u'shredded cheddar', u'metaInformation': [u'shredded', u'finely', u'(the version works best)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'png', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.framedcooks.com/2014/11/mac-cheese-mug.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add water and macaroni to a large mug.  Microwave for 2 minutes and then stir.  Repeat twice for a total of 6 minutes.  If the pasta has absorbed all the water after the 2 minute and 4 minute mark, add another couple of tablespoons of water.2. At the end of 6 minutes, the macaroni should be cooked.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add cheese, butter and milk and stir until cheese is melted.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Garnish with pepper and extra cheese and enjoy!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Lambrusco, and Riesling are my top picks for Macaroni and Cheese. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. You could try Mulderbosch Chenin Blanc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 185, u'instructions': u'1. Add water and macaroni to a large mug.  Microwave for 2 minutes and then stir.  Repeat twice for a total of 6 minutes.  If the pasta has absorbed all the water after the 2 minute and 4 minute mark, add another couple of tablespoons of water.2. At the end of 6 minutes, the macaroni should be cooked.  Add cheese, butter and milk and stir until cheese is melted.3. Garnish with pepper and extra cheese and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/mac-and-cheese-in-a-mug-620643', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}