{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 859956, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Beef with Shrimp & Bok Choy', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 0, u'pricePerServing': 226.54, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 pound bok choy, preferably baby bok choy, trimmed and sliced into 1-inch pieces', u'aisle': u'Produce', u'name': u'bok choy', u'metaInformation': [u'trimmed', u'sliced into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11116, u'unit': u'pound'}, {u'originalString': u'4 teaspoons canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'\xbc- \xbd teaspoon crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u''}, {u'originalString': u'1\xbd tablespoons oyster-flavored sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 6176, u'unit': u'tablespoons'}, {u'originalString': u'10 raw shrimp, (21-25 per pound), peeled, deveined and chopped', u'aisle': u'Seafood', u'name': u'raw shrimp', u'metaInformation': [u'raw', u'deveined', u'peeled', u'chopped', u'per pound), ,  and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'\xbc cup Shao Hsing rice wine, (see Ingredient note)', u'aisle': u'Alcoholic Beverages', u'name': u'rice wine', u'metaInformation': [u'(see Ingredient note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 43479, u'unit': u'cup'}, {u'originalString': u'\xbe pound sirloin steak, trimmed of fat, cut in half lengthwise and thinly sliced', u'aisle': u'Meat', u'name': u'sirloin steak', u'metaInformation': [u'trimmed of fat', u'thinly sliced', u'cut in half lengthwise and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sirloin-raw.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 23625, u'unit': u'pound'}], u'healthScore': 25.0, u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.eatingwell.com/recipe/251807/spicy-beef-with-shrimp-bok-choy/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk rice wine, oyster sauce and cornstarch in a small bowl until the cornstarch is dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'id': 6176, u'name': u'oyster sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 43479, u'name': u'rice wine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat 2 teaspoons oil in a large nonstick skillet or wok over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add beef and crushed red pepper to taste; cook, stirring, until the beef begins to brown, 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}]}, {u'equipment': [], u'step': u'Add shrimp and continue to cook, stirring, until the shrimp is opaque and pink, 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Transfer the beef, shrimp and any juices to a plate.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 2 teaspoons oil over medium-high heat in the same pan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add bok choy and cook, stirring, until it begins to wilt, 2 to 4 minutes. Stir in the cornstarch mixture. Return the beef-shrimp mixture to the pan and cook, stirring, until heated through and the sauce has thickened slightly, about 1 minute.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 11116, u'name': u'bok choy'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 76, u'instructions': u'Whisk rice wine, oyster sauce and cornstarch in a small bowl until the cornstarch is dissolved.                        Heat 2 teaspoons oil in a large nonstick skillet or wok over medium-high heat. Add beef and crushed red pepper to taste; cook, stirring, until the beef begins to brown, 1 to 2 minutes. Add shrimp and continue to cook, stirring, until the shrimp is opaque and pink, 1 to 2 minutes. Transfer the beef, shrimp and any juices to a plate.                        Heat the remaining 2 teaspoons oil over medium-high heat in the same pan. Add bok choy and cook, stirring, until it begins to wilt, 2 to 4 minutes. Stir in the cornstarch mixture. Return the beef-shrimp mixture to the pan and cook, stirring, until heated through and the sauce has thickened slightly, about 1 minute.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-beef-with-shrimp-bok-choy-859956', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}