{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/225423-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 225423, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin risotto', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 224.05, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 small pumpkin or butternut squash- after peeling and scraping out the seeds, you need about 400g 14oz', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'small handful coriander, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'small', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'2 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tbsp olive oil, plus a drizzle for the pumpkin', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for the pumpkin', u'plus a drizzle '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'50g grated parmesan (or vegetarian alternative)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated', u'(or vegetarian alternative)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'200g risotto rice', u'aisle': u'Pasta and Rice', u'name': u'risotto rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10020052, u'unit': u'g'}, {u'originalString': u'8 spring onions', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1l hot vegetable stock, plus extr1 tablespoon if needed', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'l'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2556635/pumpkin-risotto', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4. Chop up the pumpkinor squash into 1.5cm cubes(kids- ask for help if it’s slippery). Put iton a baking tray, drizzle over someoil, then roast for 30 mins.While the pumpkin isroasting, you can makethe risotto.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Put the garlicin a sandwich bag, then bashlightly with a rolling pin untilit’s crushed.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u'Cut up the spring onionswith your scissors.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tbsp oil with thebutter in your pan over amedium heat – not too hot.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the spring onions and garlic.Once the onions are soft but notgetting brown, add the rice andcumin. Stir well to coat in thebuttery mix for about 1 min.Now add half a cup of thestock, and stir every nowand then until it has alldisappeared into the rice. Carryon adding and stirring in a largesplash of stock at a time, untilyou have used up all the stock– this will take about 20 mins.Check the rice is cooked.If it isn’t, add a splashmore stock, and carry oncooking for a bit.Once the rice is soft enoughto eat, gently stir in the gratedcheese, chopped coriander androasted pumpkin.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Risotto. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Tiamo Chianti. It has 4.3 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Intense ruby red with garnet tones. Intense, fruity with persistent aromas of spices and licorice. Full with good acidity and balanced tannins.Tiamo is bottled at Chianti DOCG, and certified as made with 100% organic grapes.', u'title': u'Tiamo Chianti', u'price': u'$9.95', u'id': 441645, u'link': u'https://www.wine.com/product/tiamo-chianti-2009/107710', u'imageUrl': u'https://spoonacular.com/productImages/441645-312x231.jpg'}]}, u'aggregateLikes': 155, u'instructions': u'Heat oven to 180C/160C fan/gas 4. Chop up the pumpkinor squash into 1.5cm cubes(kids- ask for help if it’s slippery). Put iton a baking tray, drizzle over someoil, then roast for 30 mins.While the pumpkin isroasting, you can makethe risotto. Put the garlicin a sandwich bag, then bashlightly with a rolling pin untilit’s crushed.Cut up the spring onionswith your scissors.Heat 1 tbsp oil with thebutter in your pan over amedium heat – not too hot.Add the spring onions and garlic.Once the onions are soft but notgetting brown, add the rice andcumin. Stir well to coat in thebuttery mix for about 1 min.Now add half a cup of thestock, and stir every nowand then until it has alldisappeared into the rice. Carryon adding and stirring in a largesplash of stock at a time, untilyou have used up all the stock– this will take about 20 mins.Check the rice is cooked.If it isn’t, add a splashmore stock, and carry oncooking for a bit.Once the rice is soft enoughto eat, gently stir in the gratedcheese, chopped coriander androasted pumpkin.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-risotto-225423', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}