{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570578-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 570578, u'veryPopular': True, u'lowFodmap': False, u'title': u'Reese’s Pieces Peanut Butter Cookies', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 34.29, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup firmly packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbe cup crunchy natural peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'crunchy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10016098, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1\xbc cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u"1 package mini Reese's Pieces baking bits", u'aisle': u'Sweet Snacks', u'name': u'reese pieces', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/reeses-pieces-or-peanut-butter-candies.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10019151, u'unit': u'package'}, {u'originalString': u'\xbd cup of salted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001001, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup of white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/reeses-peanut-butter-cookies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Kick the tires and light the fires to 350 degrees F.At first glance you might see that the word “salt” leaps out at you twice with this recipe. You actually need the extra salt in the butter because you lose salt that would usually be in a normal peanut butter. You are replacing one salted product with another. Just as you can’t really control the salt amount in your peanut butter you can’t control it in your butter, but knowing that it is good to the “taste”, you can safely use it.To make, beat the butter, granulated sugar, brown sugar, peanut butter, egg and vanilla in large bowl until fluffy.Sift the flour, baking soda, baking powder and salt; gradually add to butter mixture, beating until well blended. Stir in the Reese’s Pieces.Drop by tablespoonfuls onto an ungreased cookie sheet if you want a cookie sized for ice cream sandwiches, otherwise heaping teaspoons for smaller cookies.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake 10 to 12 minutes or until edges are lightly browned and then remove from the oven. You will need to cook these for a good 5 minutes, then you need to remove them from the sheet and onto a wire rack. Peanut butter cookies are infamous for falling apart when you transfer them too soon!Cool and enjoy!', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1020, u'instructions': u'Kick the tires and light the fires to 350 degrees F.At first glance you might see that the word “salt” leaps out at you twice with this recipe. You actually need the extra salt in the butter because you lose salt that would usually be in a normal peanut butter. You are replacing one salted product with another. Just as you can’t really control the salt amount in your peanut butter you can’t control it in your butter, but knowing that it is good to the “taste”, you can safely use it.To make, beat the butter, granulated sugar, brown sugar, peanut butter, egg and vanilla in large bowl until fluffy.Sift the flour, baking soda, baking powder and salt; gradually add to butter mixture, beating until well blended. Stir in the Reese’s Pieces.Drop by tablespoonfuls onto an ungreased cookie sheet if you want a cookie sized for ice cream sandwiches, otherwise heaping teaspoons for smaller cookies.Bake 10 to 12 minutes or until edges are lightly browned and then remove from the oven. You will need to cook these for a good 5 minutes, then you need to remove them from the sheet and onto a wire rack. Peanut butter cookies are infamous for falling apart when you transfer them too soon!Cool and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/reeses-pieces-peanut-butter-cookies-570578', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}