{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/601266-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 601266, u'veryPopular': False, u'lowFodmap': False, u'title': u'Berry BBQ Sauce', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 32.98, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 cup frozen Marion berries or other Blackberries (or 1/2 pint fresh, rinsed, and drained)', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'fresh', u'frozen', u'rinsed', u'drained', u'(or 1/2 pint , , and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons light or dark corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'dark', u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoons'}, {u'originalString': u'3 cloves Garlic –peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 teaspoon coarsely ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1/4 cup light or dark brown sugar (not packed)', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'dark', u'light', u'packed', u'(not )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon Pimenton de la Vera (see note)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'pimenton de la vera', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1042009, u'unit': u'teaspoon'}, {u'originalString': u'1 pinch crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.copykat.com/2009/05/19/berry-bbq-sauce/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Puree all the ingredients in a food processor.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Transfer to a small saucepan and simmer for one hour, or until the sauce has thickened slightly.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool and store in a covered jar in the refrigerator for up to one month.Note: Pimenton de la Vera is smoked Spanish paprika. Find it at markets that carry a wide selection of gourmet foods. Also, look in the “Mexican foods” section of your local supermarket for a fine substitute, just look for “pimenton” on the paprika pack. Thanks to lotusfather for sharing this recipe.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1042009, u'name': u'pimenton de la vera'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 6, u'instructions': u'<p>Puree all the ingredients in a food processor. Transfer to a small saucepan and simmer for one hour, or until the sauce has thickened slightly. Let cool and store in a covered jar in the refrigerator for up to one month.Note: Pimenton de la Vera is smoked Spanish paprika. Find it at markets that carry a wide selection of gourmet foods. Also, look in the “Mexican foods” section of your local supermarket for a fine substitute, just look for “pimenton” on the paprika pack. Thanks to lotusfather for sharing this recipe.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/berry-bbq-sauce-601266', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}