{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478924-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 478924, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marsala Pot Roast Dinner', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 601.98, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'2 cups small Cut Carrots', u'aisle': u'Produce', u'name': u'baby cut carrots', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11960, u'unit': u'cups'}, {u'originalString': u'1 whole Beef Chuck Pot Roast (2 pounds)', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 13786, u'unit': u'pounds'}, {u'originalString': u'15 Brussel Sprouts', u'aisle': u'Produce', u'name': u'brussel sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 11098, u'unit': u''}, {u'originalString': u'4 cloves Garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 dashes of ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'dashes'}, {u'originalString': u'1 \xbd cup Marsala Wine', u'aisle': u'Alcoholic Beverages', u'name': u'marsala wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14057, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbd of a whole Onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 sprigs Fresh Oregano (or 1 teaspoon dried oregano)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried', u'fresh', u'(or 1 teaspoon oregano)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2027, u'unit': u'sprigs'}, {u'originalString': u'1 teaspoon Red Pepper Flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'5 small Russet Potatoes', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'3 dashes of Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dashes'}, {u'originalString': u'2 cups Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 69.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.couponclippingcook.com/marsala-pot-roast-dinner/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet on medium heat and add the olive oil.  Brown each side of the roast (about 5 minutes).  In a large roaster pan, add the Marsala wine and the roast.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14057, u'name': u'marsala'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the leaves from the sprigs of oregano and sprinkle them over the roast.  Lift up the roast a bit and add some leaves under the roast.  Sprinkle pepper and the salt on top of the roast (lift up the roast with a fork and add some of the salt and pepper to the bottom of the pan).Slice the garlic and add it to the top of the roast (and put some under the roast in the bottom of the pan).  Sprinkle the red hot pepper flakes on top of the roast.Slice the onion and add it on the top and around the sides of the roast.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the carrots, and the brussel sprouts to the pan.  Peel the potatoes and add them to the pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the water to the pan around the edges of the roast.Then add a few dashes of ground black pepper and salt over the veggies.  Cover the roaster pan with a lid.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for about 2 \xbd hours or until tender.  Shred the meat with two forks and serve with the veggies.  Top the meat and veggies with the juice from the pan.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 109, u'instructions': u'Preheat oven to 350 degrees F. Heat a large skillet on medium heat and add the olive oil.  Brown each side of the roast (about 5 minutes).  In a large roaster pan, add the Marsala wine and the roast.Remove the leaves from the sprigs of oregano and sprinkle them over the roast.  Lift up the roast a bit and add some leaves under the roast.  Sprinkle pepper and the salt on top of the roast (lift up the roast with a fork and add some of the salt and pepper to the bottom of the pan).Slice the garlic and add it to the top of the roast (and put some under the roast in the bottom of the pan).  Sprinkle the red hot pepper flakes on top of the roast.Slice the onion and add it on the top and around the sides of the roast.  Add the carrots, and the brussel sprouts to the pan.  Peel the potatoes and add them to the pan.  Add the water to the pan around the edges of the roast.Then add a few dashes of ground black pepper and salt over the veggies.  Cover the roaster pan with a lid.  Bake for about 2 \xbd hours or until tender.  Shred the meat with two forks and serve with the veggies.  Top the meat and veggies with the juice from the pan.', u'spoonacularSourceUrl': u'https://spoonacular.com/marsala-pot-roast-dinner-478924', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}