{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590211-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590211, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Molten Chocolate Cakes', u'diets': [], u'pricePerServing': 93.51, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'5 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 tsp. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tsp'}, {u'originalString': u'\xbc cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 6 oz. container raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 9302, u'unit': u'oz'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'8 ounces semisweet chocolate chips, or bars cut into bite-size chunks', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [u'cut into bite-size chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup unsalted butter or unsalted margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2010/10/mini-molten-chocolate-cakes.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Melt butter and chocolate in a medium heat-proof bowl over a saucepan of simmering water, or in the microwave for about 1:30.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk eggs, sugar and salt in a medium bowl until sugar dissolves. Beat egg mixture into chocolate until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Mix in flour until just combined. (Batter can be made a day ahead; return to room temperature an hour or so before baking.) Put \xbc cup powdered sugar into a small bowl and set aside.Adjust oven rack to middle position.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 450 degrees. Line a standard-size muffin tin (1/2 cup capacity) with muffin papers. Fill each cup to the top with the chocolate mixture.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until batter puffs but center is not set, 8 to 10 minutes. Carefully lift cakes from tin, pull papers away from cakes and transfer cakes to dessert plates.Sift powdered sugar lightly over each plate. Top each cake with a few berries and serve immediately (I recommend a side of vanilla ice cream!).Enjoy!', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Molten Chocolate Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 269, u'instructions': u'Melt butter and chocolate in a medium heat-proof bowl over a saucepan of simmering water, or in the microwave for about 1:30. Remove from heat. Whisk eggs, sugar and salt in a medium bowl until sugar dissolves. Beat egg mixture into chocolate until smooth. Mix in flour until just combined. (Batter can be made a day ahead; return to room temperature an hour or so before baking.) Put \xbc cup powdered sugar into a small bowl and set aside.Adjust oven rack to middle position. Heat oven to 450 degrees. Line a standard-size muffin tin (1/2 cup capacity) with muffin papers. Fill each cup to the top with the chocolate mixture.Bake until batter puffs but center is not set, 8 to 10 minutes. Carefully lift cakes from tin, pull papers away from cakes and transfer cakes to dessert plates.Sift powdered sugar lightly over each plate. Top each cake with a few berries and serve immediately (I recommend a side of vanilla ice cream!).Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-molten-chocolate-cakes-590211', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}