{u'recipes': [{u'sourceName': u'Sugar Dish Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518194-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 518194, u'veryPopular': True, u'lowFodmap': False, u'title': u'Apple Cider Sangria', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 287.4, u'creditText': u'Sugar Dish Me', u'extendedIngredients': [{u'originalString': u'1 apple, halved and thinly sliced', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'halved', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'4 cups apple juice (or cider)', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [u'(or cider)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 9016, u'unit': u'cups'}, {u'originalString': u'more sliced apples to garnish', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9003, u'unit': u'servings'}, {u'originalString': u'4 cinnamon sticks', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'\xbc teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'2 cups sparkling wine (I used Barefoot Refresh Crisp White California)', u'aisle': u'Alcoholic Beverages', u'name': u'sparkling wine', u'metaInformation': [u'white', u'crisp', u'(I used Barefoot Refresh California)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 43155, u'unit': u'cups'}, {u'originalString': u'1\xbd teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.sugardishme.com/2013/11/08/apple-cider-sangria/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour the apple juice into a medium saucepan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 9016, u'name': u'apple juice'}]}, {u'equipment': [], u'step': u'Add the cinnamon sticks, cloves, nutmeg, vanilla, and honey. Bring it to a boil, and then reduce the heat to a simmer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Let it simmer lightly and steep for about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Pour in the wine once its cooled to drinking temperature (you don't want to cook the wine!).", u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the additional sliced apples to each glass(I use the fresh apples in the glasses for the crisp color and texture) -- enough slices to make it look pretty (I used 4-5).', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a cinnamon stick out of the pan in each glass.Divide the liquid evenly between the glasses.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1303, u'instructions': u"Pour the apple juice into a medium saucepan. Add the cinnamon sticks, cloves, nutmeg, vanilla, and honey. Bring it to a boil, and then reduce the heat to a simmer.Let it simmer lightly and steep for about 10 minutes. Remove from the heat.Pour in the wine once its cooled to drinking temperature (you don't want to cook the wine!).Add the additional sliced apples to each glass(I use the fresh apples in the glasses for the crisp color and texture) -- enough slices to make it look pretty (I used 4-5). Place a cinnamon stick out of the pan in each glass.Divide the liquid evenly between the glasses. Serve warm.", u'spoonacularSourceUrl': u'https://spoonacular.com/apple-cider-sangria-518194', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}