{u'recipes': [{u'sourceName': u'Girl Versus Dough', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/608346-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 608346, u'veryPopular': True, u'lowFodmap': False, u'title': u'buttermilk ranch biscuits (+ an eCookbook sale!)', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 14.02, u'creditText': u'Girl Versus Dough', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2\xbc cups all-purpose flour, plus more for dusting and shaping', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dusting', u'all-purpose', u'plus more  and shaping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'4 tablespoons ranch dressing, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4639, u'unit': u'tablespoons'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 tablespoon unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.girlversusdough.com/2014/08/04/buttermilk-ranch-biscuits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 375 degrees F. Line a baking sheet with parchment paper; spray with cooking spray.In a large bowl, whisk flour, baking powder, baking soda and salt until well combined. Using a pastry cutter or your fingers, cut in cold butter until mixture resembles coarse crumbs.Make a well in the center and pour in buttermilk and 3 tablespoons ranch dressing. Stir until just combined.Turn dough out onto a well-floured surface. Pat dough into a \xbd-inch tall circle. Use a 3-inch biscuit or round cookie cutter to cut dough into biscuits.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place biscuits on prepared baking sheet about 2 inches apart. Re-pat dough scraps once into a circle to cut more biscuits.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake biscuits 10 minutes. Meanwhile, combine remaining 1 tablespoon ranch dressing and melted butter.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}]}, {u'equipment': [], u'step': u'Brush tops of biscuits with butter-ranch mixture.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake another 3 to 4 minutes until golden brown.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Chateau Ste. Michelle Dry Riesling with a 4.5 out of 5 star rating seems like a good match. It costs about 10 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters.', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 840, u'instructions': u'Heat oven to 375 degrees F. Line a baking sheet with parchment paper; spray with cooking spray.In a large bowl, whisk flour, baking powder, baking soda and salt until well combined. Using a pastry cutter or your fingers, cut in cold butter until mixture resembles coarse crumbs.Make a well in the center and pour in buttermilk and 3 tablespoons ranch dressing. Stir until just combined.Turn dough out onto a well-floured surface. Pat dough into a \xbd-inch tall circle. Use a 3-inch biscuit or round cookie cutter to cut dough into biscuits. Place biscuits on prepared baking sheet about 2 inches apart. Re-pat dough scraps once into a circle to cut more biscuits.Bake biscuits 10 minutes. Meanwhile, combine remaining 1 tablespoon ranch dressing and melted butter.Brush tops of biscuits with butter-ranch mixture. Bake another 3 to 4 minutes until golden brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/buttermilk-ranch-biscuits-+-an-ecookbook-sale-608346', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}