{u'recipes': [{u'sourceName': u'The Culinary Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575081-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 575081, u'veryPopular': False, u'lowFodmap': False, u'title': u'Girl Hunter’s Putach', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 105.02, u'creditText': u'The Culinary Life', u'extendedIngredients': [{u'originalString': u'Freshly-ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly-ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1\xbd pounds bone-in chicken thighs, cut in half with a meat cleaver', u'aisle': u'Meat', u'name': u'bone-in chicken thighs', u'metaInformation': [u'bone-in', u'with a meat cleaver', u'cut in half '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 1005091, u'unit': u'pounds'}, {u'originalString': u'2 sprigs fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprigs'}, {u'originalString': u'5 garlic cloves, skin on', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 large onion, roughly cut', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.theculinarylife.com/2013/putach-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat the oil in a heavy bottomed pot over low heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion and sprinkle with a little salt. Sweat the onions until they are translucent, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the chicken and garlic cloves, browning slowly for about 10 minutes. Season liberally with salt and pepper.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add vinegar, water, and rosemary. Cover the pot with foil and cook slowly over low heat for 2 hours. When the meat is tender and falling off the bone, the dish is done. Season with more salt and pepper to taste.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve with a nice loaf of crusty bread or over rice.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 126, u'instructions': u'Heat the oil in a heavy bottomed pot over low heat. Add the onion and sprinkle with a little salt. Sweat the onions until they are translucent, about 15 minutes.Add the chicken and garlic cloves, browning slowly for about 10 minutes. Season liberally with salt and pepper.Add vinegar, water, and rosemary. Cover the pot with foil and cook slowly over low heat for 2 hours. When the meat is tender and falling off the bone, the dish is done. Season with more salt and pepper to taste. Serve with a nice loaf of crusty bread or over rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/girl-hunters-putach-575081', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}