{u'recipes': [{u'sourceName': u'Blogging Over Thyme', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478956-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 478956, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Acorn Squash and Sweet Potato Soup', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 202.62, u'creditText': u'Blogging Over Thyme', u'extendedIngredients': [{u'originalString': u'2 -3 lb acorn squash, sliced lengthwise in half and seeds removed', u'aisle': u'Produce', u'name': u'acorn squash', u'metaInformation': [u'seeds removed', u'sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11482, u'unit': u'lb'}, {u'originalString': u'2-3 tablespoons extra virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93663, u'unit': u'teaspoon'}, {u'originalString': u'\xbe teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup light coconut milk', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 99009, u'unit': u'cup'}, {u'originalString': u'1 medium onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 small sweet potatoes ( - 1 lb)', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u'lb'}, {u'originalString': u'3 \xbd cups vegetable broth (or chicken broth)', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'(or chicken broth)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bloggingoverthyme.com/2013/10/29/roasted-acorn-squash-and-sweet-potato-soup/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees (Fahrenheit). Slice the acorn squash in half (lengthwise) and remove the seeds and guts--place cut side up on a large baking sheet, drizzle with 1-2 tablespoons of olive oil and season with salt and pepper. Slice the sweet potatoes in half lengthwise, drizzle and rub the cut side with olive oil and season with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'id': 11482, u'name': u'acorn squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place cut side down on the baking sheet along with the acorn squash.Roast for 45 minutes to an hour, or until both the potato and acorn squash are fork tender and very soft.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'id': 11482, u'name': u'acorn squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove from oven and when cool enough to handle, remove the squash from the skin and set aside in a large bowl. Discard the skin.Meanwhile, heat the remaining tablespoon of olive oil in medium-sized soup pot.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion and saute over low heat until soft and completely translucent.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the ground ginger and garam masala and cook for an additional minute or two, stirring constantly, until fragrant.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 2021, u'name': u'ginger powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 93663, u'name': u'garam masala'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the vegetable broth, roasted squash, and sweet potato.Bring to low simmer, cover, and cook for an additional for 10-15 minutes.Puree in a blender (in batches, if necessary) and return to heat.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Add the coconut milk and stir until well combined. Season with salt and pepper to taste (at this point, you can also add an additional pinch of ginger or garam masala, if you so desire).', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 93663, u'name': u'garam masala'}]}, {u'equipment': [], u'step': u'Serve hot and drizzle with a spoonful of coconut milk and touch of extra virgin olive oil.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 405, u'instructions': u'Preheat oven to 400 degrees (Fahrenheit). Slice the acorn squash in half (lengthwise) and remove the seeds and guts--place cut side up on a large baking sheet, drizzle with 1-2 tablespoons of olive oil and season with salt and pepper. Slice the sweet potatoes in half lengthwise, drizzle and rub the cut side with olive oil and season with salt and pepper. Place cut side down on the baking sheet along with the acorn squash.Roast for 45 minutes to an hour, or until both the potato and acorn squash are fork tender and very soft. Remove from oven and when cool enough to handle, remove the squash from the skin and set aside in a large bowl. Discard the skin.Meanwhile, heat the remaining tablespoon of olive oil in medium-sized soup pot. Add the onion and saute over low heat until soft and completely translucent.Add the ground ginger and garam masala and cook for an additional minute or two, stirring constantly, until fragrant. Add the vegetable broth, roasted squash, and sweet potato.Bring to low simmer, cover, and cook for an additional for 10-15 minutes.Puree in a blender (in batches, if necessary) and return to heat. Add the coconut milk and stir until well combined. Season with salt and pepper to taste (at this point, you can also add an additional pinch of ginger or garam masala, if you so desire).Serve hot and drizzle with a spoonful of coconut milk and touch of extra virgin olive oil.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-acorn-squash-and-sweet-potato-soup-478956', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}