{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719220-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 719220, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Cuban Coconut Balls with Melted Chocolate (Coquito Acaramelado)', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 82.92, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'8 ounces chocolate, melted', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 19081, u'unit': u'ounces'}, {u'originalString': u'1 (14 ounce) can sweetened condensed milk or homemade coconut milk (see recipe below)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'sweetened', u'homemade', u'canned', u'(see recipe below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'ounce'}, {u'originalString': u'1/4 cup granulated sugar or coconut sugar (I use coconut sugar)', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [u'(I use coconut sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'2 cans full-fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full-fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cans'}, {u'originalString': u'1/2 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'3 cups shredded or grated coconut (I like to used unsweetened)*', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened', u'grated', u'(I like to used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10012108, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.halfbakedharvest.com/sweet-cuban-coconut-balls-with-melted-chocolate-coquito-acaramelado/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium size pot, combine the sweetened condensed milk and coconut. Set the pot over medium heat and cook 8-10 minutes or until the mixture has thickened, being careful not to let the mixture burn.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Remove from the heat and stir in the the vanilla.Line a baking sheet with parchment paper.Once the coconut mixture is cool enough to handle, roll it into tablespoon size balls and place on the prepared baking sheet. If desired, insert a toothpick into the center of each ball.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Place in the freezer for 20-30 minutes to cool.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add the honey to a small sauce pan and bring to a boil. Boil for 2-3 minutes then remove from the heat. DO NOT cook the honey longer than 5 minutes or it will harden on the coconut balls. Carefully dip each ball into the honey, allowing any excess to drip off.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place back onto the parchment lined baking sheet and repeat with the remaining balls. Alternately you can just spoon the honey over each coconut ball.Allow the balls cool.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Serve with melted chocolate.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 245, u'instructions': u'InstructionsIn a medium size pot, combine the sweetened condensed milk and coconut. Set the pot over medium heat and cook 8-10 minutes or until the mixture has thickened, being careful not to let the mixture burn. Remove from the heat and stir in the the vanilla.Line a baking sheet with parchment paper.Once the coconut mixture is cool enough to handle, roll it into tablespoon size balls and place on the prepared baking sheet. If desired, insert a toothpick into the center of each ball. Place in the freezer for 20-30 minutes to cool.Add the honey to a small sauce pan and bring to a boil. Boil for 2-3 minutes then remove from the heat. DO NOT cook the honey longer than 5 minutes or it will harden on the coconut balls. Carefully dip each ball into the honey, allowing any excess to drip off. Place back onto the parchment lined baking sheet and repeat with the remaining balls. Alternately you can just spoon the honey over each coconut ball.Allow the balls cool. Serve with melted chocolate.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-cuban-coconut-balls-with-melted-chocolate-coquito-acaramelado-719220', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}