{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/476554-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 476554, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lion House Rolls', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 7.0, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons butter, melted, plus softened butter for brushing on top after the rolls are baked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'softened', u'for brushing on top after the rolls are baked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'5-5 1/2 cups flour (you can use all-purpose or bread flour)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'canned', u'(you can use or bread flour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2/3 cup nonfat instant dry milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 cups warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.tasteandtellblog.com/lion-house-rolls-and-sweet-potato-buttermilk-dinner-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of a stand mixer, combine the water and the milk powder and stir to dissolve the milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add in the yeast and a tablespoon or so of the sugar and allow the yeast to bloom for 5-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Add in the remaining sugar, salt, butter, egg and 2 cups of the flour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix on low speed until all of the ingredients are wet, then mix on medium for 2 minutes.  Stop the mixer and add 2 more cups of flour, mix on low until combined, then on medium for 2 minutes.  The dough will be getting stiffer at this point.  Continue adding flour, 1/2 cup at a time, until the dough is soft and tacky, but not sticky.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the dough in a greased bowl and turn to coat.  Cover with plastic wrap and allow to rise in a warm spot until doubled in size.Sprinkle a work surface lightly with flour.  Divide the dough in half.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Roll out one half of the dough into an 11x14-inch rectangle.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}], u'step': u'Brush the top of the dough with half of the melted butter.  Using a pizza cutter, cut the dough in half horizontally right down the center.  Slice the dough into rectangles about 2x4" big.  If you hold your hand out so that your hand forms an "L" shape, it can help to be your guide for sizing.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Roll or flip the rectangles, buttered side in, and place on a greased baking pan with the end resting on the baking sheet.  Repeat with the second half of the dough.Cover with a towel or plastic wrap and allow to rise until doubled.Preheat the oven to 375F.  Uncover the rolls and bake until they are browned and cooked through, 15-20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Brush with softened or melted butter while they are still hot.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 5826, u'instructions': u'In the bowl of a stand mixer, combine the water and the milk powder and stir to dissolve the milk.  Add in the yeast and a tablespoon or so of the sugar and allow the yeast to bloom for 5-10 minutes.  Add in the remaining sugar, salt, butter, egg and 2 cups of the flour.  Mix on low speed until all of the ingredients are wet, then mix on medium for 2 minutes.  Stop the mixer and add 2 more cups of flour, mix on low until combined, then on medium for 2 minutes.  The dough will be getting stiffer at this point.  Continue adding flour, 1/2 cup at a time, until the dough is soft and tacky, but not sticky.  Place the dough in a greased bowl and turn to coat.  Cover with plastic wrap and allow to rise in a warm spot until doubled in size.Sprinkle a work surface lightly with flour.  Divide the dough in half.  Roll out one half of the dough into an 11x14-inch rectangle.  Brush the top of the dough with half of the melted butter.  Using a pizza cutter, cut the dough in half horizontally right down the center.  Slice the dough into rectangles about 2x4" big.  If you hold your hand out so that your hand forms an "L" shape, it can help to be your guide for sizing.  Roll or flip the rectangles, buttered side in, and place on a greased baking pan with the end resting on the baking sheet.  Repeat with the second half of the dough.Cover with a towel or plastic wrap and allow to rise until doubled.Preheat the oven to 375F.  Uncover the rolls and bake until they are browned and cooked through, 15-20 minutes.  Brush with softened or melted butter while they are still hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/lion-house-rolls-476554', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 170, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}