{u'recipes': [{u'sourceName': u'Food52', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/727595-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 727595, u'veryPopular': True, u'lowFodmap': True, u'title': u'Buckwheat Granola', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'pricePerServing': 215.94, u'creditText': u'Food52', u'extendedIngredients': [{u'originalString': u'1 ripe banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2 cups raw buckwheat groats', u'aisle': u'Health Foods', u'name': u'buckwheat', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-buckwheat.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20008, u'unit': u'cups'}, {u'originalString': u'1 cup coconut flakes', u'aisle': u'Baking', u'name': u'coconut flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups mixed seeds and nuts (I use pumpkin seeds and almonds)', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'mixed', u'(I use pumpkin seeds and almonds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12135, u'unit': u'cups'}, {u'originalString': u'2 tablespoons olive oil (or coconut oil or almond butter)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'(or coconut oil or almond butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}], u'healthScore': 48.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://food52.com/recipes/27291-buckwheat-granola', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 170.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat oven to 170 C or 350 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, stir the buckwheat groats together with seeds, nuts, coconut, and spices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-buckwheat.jpg', u'id': 20008, u'name': u'buckwheat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a separate small bowl, smash the banana with a fork and add to the groats mixture, along with olive oil and maple syrup. Stir until everything is nicely coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread across a baking sheet (lining it makes for easier clean-up) and bake for 20 to 30 minutes, stirring once halfway through, until fragrant and golden.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool before storing in a glass container.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 782, u'instructions': u'Preheat oven to 170 C or 350 F.                                   In a bowl, stir the buckwheat groats together with seeds, nuts, coconut, and spices.                                  In a separate small bowl, smash the banana with a fork and add to the groats mixture, along with olive oil and maple syrup. Stir until everything is nicely coated. Spread across a baking sheet (lining it makes for easier clean-up) and bake for 20 to 30 minutes, stirring once halfway through, until fragrant and golden. Let cool before storing in a glass container.', u'spoonacularSourceUrl': u'https://spoonacular.com/buckwheat-granola-727595', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}