{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/471799-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 471799, u'veryPopular': False, u'lowFodmap': False, u'title': u'Deviled Eggs With Crispy Shallots and Chilies', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30'], u'pricePerServing': 23.41, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'6 hard boiled or hard steamed eggs, peeled and halved lengthwise', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'hard', u'boiled', u'steamed', u'peeled', u'halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 tablespoons finely diced jalape\xf1o or 1 teaspoon minced Thai bird chilies, plus more for garnish', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'minced', u'plus more for garnish', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11979, u'unit': u'tablespoons'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon fresh lemon juice from 1 lemon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup fried shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/05/deviled-eggs-crispy-shallots-chilies-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add mayonnaise, jalape\xf1o or Thai bird chilies, lemon juice, and half of fried shallots. Using a stiff whisk, mash until thoroughly combined. Season to taste with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap).', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with remaining fried shallots and jalape\xf1o.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 20, u'instructions': u'Procedures                                                                              1                                                                            Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add mayonnaise, jalape\xf1o or Thai bird chilies, lemon juice, and half of fried shallots. Using a stiff whisk, mash until thoroughly combined. Season to taste with salt and pepper.                                                                                                                            2                                                                            Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish with remaining fried shallots and jalape\xf1o. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/deviled-eggs-with-crispy-shallots-and-chilies-471799', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}