{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/736866-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 736866, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chai Toddy', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 334.62, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 oz. DeKuyper Buttershots liqueur or butterscotch schnapps', u'aisle': u'Frozen;Condiments', u'name': u'butterscotch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 19085, u'unit': u'oz'}, {u'originalString': u'1 30ml chai tea concentrate', u'aisle': u'Tea and Coffee', u'name': u'chai tea', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 14355, u'unit': u'ml'}, {u'originalString': u'1 oz. cognac/brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'oz'}, {u'originalString': u'1/2 graham cracker, crushed and powdered', u'aisle': u'Sweet Snacks', u'name': u'graham cracker', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1 30ml whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'1 star anise', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpeg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/chai-toddy-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Bring chai tea concentrate and milk to a simmer over medium-low heat. Stir in star anise to flavor.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'chai'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from heat. In a mug add brandy and butterscotch liqueur.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19085, u'name': u'butterscotch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}]}, {u'equipment': [], u'step': u'Pour chai tea mixture into mug. Stir slightly and dust with crushed graham cracker.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'chai'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 603, u'instructions': u'Watch how to make this recipe.                    Bring chai tea concentrate and milk to a simmer over medium-low heat. Stir in star anise to flavor. Remove from heat. In a mug add brandy and butterscotch liqueur. Pour chai tea mixture into mug. Stir slightly and dust with crushed graham cracker.', u'spoonacularSourceUrl': u'https://spoonacular.com/chai-toddy-736866', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}