{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522814-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 522814, u'veryPopular': False, u'lowFodmap': False, u'title': u'Arugula and alfalfa sprouts salad with honey, mustard and ginger dressing', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 643.18, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'a small handful of alfalfa sprouts', u'aisle': u'Produce', u'name': u'alfalfa sprouts', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 10111001, u'unit': u'handful'}, {u'originalString': u'a good handful of baby arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'handful'}, {u'originalString': u'crisp bacon (whole, diced or crumbled — your choice)', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced', u'whole', u'crumbled', u'crisp', u'(, or — your choice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'servings'}, {u'originalString': u'your favorite cheese, shaved', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'shaved', u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'servings'}, {u'originalString': u'a cup of herbed croutons', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 18139, u'unit': u'cup'}, {u'originalString': u'2 tbsps. of Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tbsps'}, {u'originalString': u'1/4 tsp. of finely grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'2 tbsps. of honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsps'}, {u'originalString': u'juice from a quarter of a lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'a good handful of torn lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u'handful'}, {u'originalString': u'2 tbsps. of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsps'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://casaveneracion.com/arugula-and-alfalfa-sprouts-salad-with-honey-mustard-and-ginger-dressing/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 85, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse and dry the lettuce, arugula and alfalfa sprouts.Click here for instructions on making herbed croutons.Stir together all the ingredients for the salad dressing.Assemble your salad. Make the lettuce, arugula and alfalfa sprouts as the base. Scatter the herbed croutons on top and around them.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'id': 10111001, u'name': u'alfalfa sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}]}, {u'equipment': [], u'step': u'Add the bacon and cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Drizzle the honey, mustard and ginger dressing over everything and enjoy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 64, u'instructions': u'InstructionsRinse and dry the lettuce, arugula and alfalfa sprouts.Click here for instructions on making herbed croutons.Stir together all the ingredients for the salad dressing.Assemble your salad. Make the lettuce, arugula and alfalfa sprouts as the base. Scatter the herbed croutons on top and around them. Add the bacon and cheese. Drizzle the honey, mustard and ginger dressing over everything and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/arugula-and-alfalfa-sprouts-salad-with-honey-mustard-and-ginger-dressing-522814', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}