{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/760321-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760321, u'veryPopular': False, u'lowFodmap': False, u'title': u'Angel Biscuits', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 11.35, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 tsp. active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}, {u'originalString': u'\xbe cup buttermilk, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 Tbs. granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbs'}, {u'originalString': u'\xbe tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'4 Tbs. unsalted butter or margarine, cut into small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbs'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/angel-biscuits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Stir yeast into buttermilk until dissolved.2.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine flour, sugar and salt in large bowl. Using fingers, two knives or pastry blender, blend butter into flour mixture until it resembles coarse meal.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Pour buttermilk mixture into flour mixture, and stir until soft dough forms. If necessary, add more buttermilk to make dough hold together.3. Lightly flour work surface and rolling pin. Knead dough 8 or 9 times, or until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll dough to 1/2-inch thickness, and cut into 3-inch circles.4. Coat baking sheet with cooking spray.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer biscuits to it, cover with clean kitchen towel and let rise 20 minutes. Preheat oven to 400F.5.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 12 to 14 minutes, or until biscuits are pale brown.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern on the menu? Try pairing with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Ghost Pines Sonoma County San Joaquin County Zinfandel with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'peppery , jammy , berry', u'title': u'Ghost Pines Sonoma County San Joaquin County Zinfandel', u'price': u'$26.65', u'id': 428933, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Joaquin-Zinfandel/dp/B01A8WOUNC', u'imageUrl': u'https://spoonacular.com/productImages/428933-312x231.jpg'}]}, u'aggregateLikes': 67, u'instructions': u'1. Stir yeast into buttermilk until dissolved.2. Combine flour, sugar and salt in large bowl. Using fingers, two knives or pastry blender, blend butter into flour mixture until it resembles coarse meal. Pour buttermilk mixture into flour mixture, and stir until soft dough forms. If necessary, add more buttermilk to make dough hold together.3. Lightly flour work surface and rolling pin. Knead dough 8 or 9 times, or until smooth. Roll dough to 1/2-inch thickness, and cut into 3-inch circles.4. Coat baking sheet with cooking spray. Transfer biscuits to it, cover with clean kitchen towel and let rise 20 minutes. Preheat oven to 400F.5. Bake 12 to 14 minutes, or until biscuits are pale brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/angel-biscuits-760321', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}