{u'recipes': [{u'sourceName': u'Back to the Cutting Board', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/484321-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 484321, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Bean and Corn Tamale Pies', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 144.31, u'creditText': u'Back to the Cutting Board', u'extendedIngredients': [{u'originalString': u'1 can (15.5 oz.) black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'2 cans (15.5 oz. each) pinto beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned pinto beans', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 31.0, u'consistency': u'solid', u'id': 16044, u'unit': u'oz'}, {u'originalString': u'1 can (14.5 oz.) diced tomatoes*', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1 tbsp. safflower or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1 packed cup fresh cilantro leaves, coarsely chopped, plus more for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh', u'packed', u'plus more for garnish', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 cup frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 tsp. (or more to taste) hot sauce (like Tabasco)', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'to taste', u'( )', u'(like Tabasco)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6168, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups (6 oz.) shredded pepper Jack cheese', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1025, u'unit': u'oz'}, {u'originalString': u'1 tube (16 oz.) prepared plain polenta, patted dry and sliced into 8 equal rounds**', u'aisle': u'Pasta and Rice;Ethnic Foods;Baking', u'name': u'polenta', u'metaInformation': [u'plain', u'dry', u'prepared', u'sliced into 8 equal rounds**'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10035137, u'unit': u'oz'}, {u'originalString': u'Course salt and ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 bunches scallions, trimmed white and green parts separated and thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'white', u'green', u'separated', u'trimmed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunches', u'unitShort': u'bunches', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunches'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://backtothecuttingboard.com/dinner/mini-bean-and-corn-tamale-pies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees (F).In a large saucepan, heat oil over medium.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Add white parts of the scallions and the garlic; season with salt and pepper. Cook until softened, stirring constantly, about 2-3 minutes.Tip: You can use the back of a spoon to mash the beans, but I found a potato masher got the job done much easier and faster.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Add beans, tomatoes, corn and water. Mash a quarter of the beans. Bring to a boil. Reduce to a simmer and cook until the mixture has thickened, 10-15 minutes.Meanwhile, spray or brush eight 6 ounce ramekins with oil.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Place a polenta round in each dish.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10035137, u'name': u'polenta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Remove bean mixture from heat and stir in the green parts of the scallions, cilantro (reserve some scallions and cilantro for garish if you want) and hot sauce. Season with salt and pepper.Spoon the mixture into the ramekins (pile it up above the rim if necessary) and sprinkle with cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place all the ramekins on a baking sheet for easier transfer to and from the oven.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 15 to 20 minutes or until the cheese is melted and the filling is bubbly.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with extra cilantro and/or scallions.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Serve with salsa and sour cream.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 72, u'instructions': u'Preheat oven to 400 degrees (F).In a large saucepan, heat oil over medium. Add white parts of the scallions and the garlic; season with salt and pepper. Cook until softened, stirring constantly, about 2-3 minutes.Tip: You can use the back of a spoon to mash the beans, but I found a potato masher got the job done much easier and faster. Add beans, tomatoes, corn and water. Mash a quarter of the beans. Bring to a boil. Reduce to a simmer and cook until the mixture has thickened, 10-15 minutes.Meanwhile, spray or brush eight 6 ounce ramekins with oil. Place a polenta round in each dish.Remove bean mixture from heat and stir in the green parts of the scallions, cilantro (reserve some scallions and cilantro for garish if you want) and hot sauce. Season with salt and pepper.Spoon the mixture into the ramekins (pile it up above the rim if necessary) and sprinkle with cheese. Place all the ramekins on a baking sheet for easier transfer to and from the oven. Bake 15 to 20 minutes or until the cheese is melted and the filling is bubbly. Let stand 10 minutes before serving. Garnish with extra cilantro and/or scallions. Serve with salsa and sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-bean-and-corn-tamale-pies-484321', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}