{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/464671-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 464671, u'veryPopular': True, u'lowFodmap': False, u'title': u"Dad's Hamburger Gravy", u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 211.3, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chicken bouillon granules', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1006080, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground sage', u'aisle': u'Spices and Seasonings', u'name': u'ground sage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002038, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pounds'}, {u'originalString': u'5 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/2 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Dads-Hamburger-Gravy/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Crumble the ground beef into a large deep skillet over medium-high heat. Cook and stir until evenly browned.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain most of the grease, leaving just enough to coat the pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onions, and cook for a few more minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour 4 cups of  the milk into the pan, and stir to scrape up any bits of food that could burn on the bottom of the pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Mix in the bouillon, butter, sage, salt and pepper. Bring to a boil, and cook for 5 minutes, stirring frequently.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix the flour into the last cup of milk until smooth. Slowly pour into the skillet, stirring constantly. Simmer for a few minutes to thicken. If the gravy is too thick, thin with a little bit of milk. If it is too thin, simmer longer, or add more flour. Taste and adjust seasonings before serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 806, u'instructions': u'Crumble the ground beef into a large deep skillet over medium-high heat. Cook and stir until evenly browned. Drain most of the grease, leaving just enough to coat the pan. Add the onions, and cook for a few more minutes.                            Pour 4 cups of  the milk into the pan, and stir to scrape up any bits of food that could burn on the bottom of the pan. Mix in the bouillon, butter, sage, salt and pepper. Bring to a boil, and cook for 5 minutes, stirring frequently.                            Mix the flour into the last cup of milk until smooth. Slowly pour into the skillet, stirring constantly. Simmer for a few minutes to thicken. If the gravy is too thick, thin with a little bit of milk. If it is too thin, simmer longer, or add more flour. Taste and adjust seasonings before serving.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/dads-hamburger-gravy-464671', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}