{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/363421-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 363421, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sausage, Peppers and Onions', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 209.52, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 (15-ounce) can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1/2 cup chopped fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'4 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 pound sweet Italian turkey sausage', u'aisle': u'Meat', u'name': u'italian turkey sausage', u'metaInformation': [u'sweet', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7927, u'unit': u'pound'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Marsala wine', u'aisle': u'Alcoholic Beverages', u'name': u'marsala wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14057, u'unit': u'cup'}, {u'originalString': u'1/4 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'2 red bell peppers, sliced', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4 teaspoon red pepper flakes, optional', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'4 to 6 fresh Italian sandwich rolls, optional', u'aisle': u'Bakery/Bread', u'name': u'sandwich rolls', u'metaInformation': [u'fresh', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18353, u'unit': u''}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'2 yellow onions, sliced', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 29.0, u'imageType': u'jpeg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/sausage-peppers-and-onions-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a heavy large skillet over medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sausages and cook until brown on both sides, about 7 to 10 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the pan and drain.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Keeping the pan over medium heat, add the peppers, onions, salt, and pepper and cook until golden brown, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the oregano, basil, and garlic and cook 2 more minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Add the tomato paste and stir.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the Marsala wine, tomatoes, and chili flakes, if using. Stir to combine, scraping the bottom of the pan with a wooden spoon to release all the browned bits. Bring to a simmer.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14057, u'name': u'marsala'}]}, {u'equipment': [], u'step': u'Cut the sausages into 4 to 6 pieces each, about 1-inch cubes.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the sausage back to the pan and stir to combine. Cook until the sauce has thickened, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve in bowls. Or, if serving as a sandwich, split the rolls in half lengthwise. Hollow out the bread from the bottom side of each roll, being careful not to puncture the crust. Fill the bottom half of the roll with sausage mixture. Top and serve sandwiches immediately.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 152, u'instructions': u'Watch how to make this recipe.                    Heat the oil in a heavy large skillet over medium heat. Add the sausages and cook until brown on both sides, about 7 to 10 minutes. Remove from the pan and drain.                          Keeping the pan over medium heat, add the peppers, onions, salt, and pepper and cook until golden brown, about 5 minutes. Add the oregano, basil, and garlic and cook 2 more minutes.                          Add the tomato paste and stir. Add the Marsala wine, tomatoes, and chili flakes, if using. Stir to combine, scraping the bottom of the pan with a wooden spoon to release all the browned bits. Bring to a simmer.                          Cut the sausages into 4 to 6 pieces each, about 1-inch cubes. Add the sausage back to the pan and stir to combine. Cook until the sauce has thickened, about 20 minutes.                          Serve in bowls. Or, if serving as a sandwich, split the rolls in half lengthwise. Hollow out the bread from the bottom side of each roll, being careful not to puncture the crust. Fill the bottom half of the roll with sausage mixture. Top and serve sandwiches immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/sausage-peppers-and-onions-363421', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}