{u'recipes': [{u'sourceName': u'The Naptime Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/605884-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 605884, u'veryPopular': False, u'lowFodmap': False, u'title': u'Summer Dinner: Havarti & Ham Tart', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 142.3, u'creditText': u'The Naptime Chef', u'extendedIngredients': [{u'originalString': u'2 tablespoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 ounces Arla Dofino Creamy Havarti, thinly sliced', u'aisle': u'Cheese', u'name': u'havarti', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taleggio-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 93838, u'unit': u'ounces'}, {u'originalString': u'2 sheets puff pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 2.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheets'}, {u'originalString': u'4 ounces sliced smoked ham', u'aisle': u'Meat', u'name': u'smoked ham', u'metaInformation': [u'smoked', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/diced-ham.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 7216, u'unit': u'ounces'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.thenaptimechef.com/2014/07/summer-dinner-havarti-ham-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Line a rimmed baking sheet with parchment paper.On a lightly floured surface roll out the puff pastry sheets to 12x10.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Brush one of the pastry sheets with the mustard, leaving a 1-inch border at the edges. Line up the Havarti slices on top of the mustard so they are touching, but not overlapping. Line the slices of ham on top of the cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taleggio-cheese.jpg', u'id': 93838, u'name': u'havarti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the second sheet of puff pastry on top of the ham and pinch the edges to seal. In a small bowl whisk the egg with 1 tablespoon of water to make the egg wash.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Brush it on top of the puff pastry so that it is evenly covered. Slice two or three large slits in the puff pastry to allow the steam to escape.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Bake the pastry for 20 to 25 minutes, or until it is completely puffed up and golden brown.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the oven and allow the pastry to cool for a minute. Then slice with a sharp knife or pizza cutter and serve warm.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Preheat the oven to 400 degrees F. Line a rimmed baking sheet with parchment paper.On a lightly floured surface roll out the puff pastry sheets to 12x10. Brush one of the pastry sheets with the mustard, leaving a 1-inch border at the edges. Line up the Havarti slices on top of the mustard so they are touching, but not overlapping. Line the slices of ham on top of the cheese. Place the second sheet of puff pastry on top of the ham and pinch the edges to seal. In a small bowl whisk the egg with 1 tablespoon of water to make the egg wash. Brush it on top of the puff pastry so that it is evenly covered. Slice two or three large slits in the puff pastry to allow the steam to escape. Bake the pastry for 20 to 25 minutes, or until it is completely puffed up and golden brown.Remove the pan from the oven and allow the pastry to cool for a minute. Then slice with a sharp knife or pizza cutter and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/summer-dinner-havarti-ham-tart-605884', u'dishTypes': [], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}