{u'recipes': [{u'sourceName': u'Your Cup of Cake', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/592575-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 592575, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cake Batter Brownies', u'diets': [], u'pricePerServing': 25.38, u'creditText': u'Your Cup of Cake', u'extendedIngredients': [{u'originalString': u'1 box brownie mix (I like Betty Crocker)', u'aisle': u'Baking', u'name': u'brownie mix', u'metaInformation': [u'(I like Betty Crocker)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18632, u'unit': u'box'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 C. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'C'}, {u'originalString': u'2 Tbsp. oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp. sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93645, u'unit': u'Tbsp'}, {u'originalString': u'1 2/3 C. yellow or while cake mix (approx. 1/2 a box of cake mix)', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'yellow', u'(approx. 1/2 a box of cake mix)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'solid', u'id': 18137, u'unit': u'C'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.yourcupofcake.com/2013/06/cake-batter-brownies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine all ingredients and pour into prepared pan.', u'number': 1, u'ingredients': []}], u'name': u'Preheat oven to 350 degrees. Line a 9 X 13 inch pan with foil and leave some hanging over the sides to help remove brownies later (see photo) and grease the exposed glass not covered in foil.2. Brownies'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Combine all ingredients until smooth.4. Take spoonfuls of batter and drop it onto the brownie layer (see photo). Continue until batter is all used.5. Use a knife to cut through the batter in the brownie mix to make a swirl or marbleized pattern. 6.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'id': 18632, u'name': u'brownie mix'}]}, {u'equipment': [], u'step': u'Pour the remaining sprinkles over the brownies for decoration.7.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake for 28-35 minutes depending on how gooey or cakey you want your brownies to be. Put on a lower rack of your oven and check half way through, if the cake part on top looks done, cover with foil so that the cake doesn't get too brown8.", u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool in pan, then lift up on foil to remove from pan, cut with a warm knife.', u'number': 4, u'ingredients': []}], u'name': u'Spread our evenly.3. Cake Batter Swirl'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 9683, u'instructions': u"1. Preheat oven to 350 degrees. Line a 9 X 13 inch pan with foil and leave some hanging over the sides to help remove brownies later (see photo) and grease the exposed glass not covered in foil.2. Brownies: Combine all ingredients and pour into prepared pan.  Spread our evenly.3. Cake Batter Swirl: Combine all ingredients until smooth.4. Take spoonfuls of batter and drop it onto the brownie layer (see photo). Continue until batter is all used.5. Use a knife to cut through the batter in the brownie mix to make a swirl or marbleized pattern. 6. Pour the remaining sprinkles over the brownies for decoration.7. Bake for 28-35 minutes depending on how gooey or cakey you want your brownies to be. Put on a lower rack of your oven and check half way through, if the cake part on top looks done, cover with foil so that the cake doesn't get too brown8. Let cool in pan, then lift up on foil to remove from pan, cut with a warm knife.", u'spoonacularSourceUrl': u'https://spoonacular.com/cake-batter-brownies-592575', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}