{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/222339-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 222339, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prawn bruschetta skewers', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 67.79, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'\xbc ciabatta, focaccia or a baguette loaf, cut into cubes', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'handful parsley leaves, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, finely sliced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'200g cooked large prawns (you want about 16), defrosted if frozen', u'aisle': u'Seafood', u'name': u'prawns', u'metaInformation': [u'frozen', u'large', u'cooked', u'(you want 16)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1511686/prawn-bruschetta-skewers', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'If using wooden skewers, soak them inwater for 1 hr before using. If the skewersare really long, use kitchen scissors tohalve. On each skewer, thread the tailof the prawn, then a cube of bread,then the top of the prawn so the prawnloops the bread. If the prawns aren’t bigenough, just alternate prawns and bread,so each skewer has 2 of each.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Drizzlewith olive oil and scatter with garlic.The skewers can now be kept in thefridge for several hrs.Cook over the hot coals until the breadis toasted. While still on the barbecue,squeeze over the lemon. Then remove,season, drizzle with a bit more oil andscatter with parsley. Arrange on a plateor in a small jar sticking up, with a glassof something light, cold and very fizzy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Casa Catelli Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'If using wooden skewers, soak them inwater for 1 hr before using. If the skewersare really long, use kitchen scissors tohalve. On each skewer, thread the tailof the prawn, then a cube of bread,then the top of the prawn so the prawnloops the bread. If the prawns aren’t bigenough, just alternate prawns and bread,so each skewer has 2 of each. Drizzlewith olive oil and scatter with garlic.The skewers can now be kept in thefridge for several hrs.Cook over the hot coals until the breadis toasted. While still on the barbecue,squeeze over the lemon. Then remove,season, drizzle with a bit more oil andscatter with parsley. Arrange on a plateor in a small jar sticking up, with a glassof something light, cold and very fizzy.', u'spoonacularSourceUrl': u'https://spoonacular.com/prawn-bruschetta-skewers-222339', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}