{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/744233-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 744233, u'veryPopular': False, u'lowFodmap': True, u'title': u'Grilled Local Anchovies', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'fodmap friendly', u'whole 30', u'pescatarian', u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 328.13, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 cup Italian flat-leaf parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 pound fresh anchovies', u'aisle': u'Seafood', u'name': u'fresh anchovies', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15001, u'unit': u'pound'}, {u'originalString': u'2 lemons', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'4 ounces extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'ounces'}, {u'originalString': u'1/2 cup pitted olives', u'aisle': u'Canned and Jarred', u'name': u'olives', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9195, u'unit': u'cup'}, {u'originalString': u'Sea salt and fresh ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 28.0, u'imageType': u'jpeg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/grilled-local-anchovies-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat charcoal grill.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scale.jpg', u'id': 404705, u'name': u'kitchen scale'}], u'step': u'Under cold running water, scale and gut the anchovies, removing the gills, but leaving the head and tail intact.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}]}, {u'equipment': [], u'step': u"Remove the fins. Open the body cavity, and using your thumbnail, loosen the meat of the fish from the spine. Gently remove the spine by twisting or cutting it off a the base of the anchovy's head and tail.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill the anchovies over a hot charcoal fire, skin side down for about 2 minutes, or until the flesh of the fish becomes white.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}]}, {u'equipment': [], u'step': u'Transfer to a large serving platter, arranging the anchovies skin side up on the platter. Squeeze a little lemon juice over the fish.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}]}, {u'equipment': [], u'step': u'Drizzle with olive oil and season with sea salt and pepper. Sprinkle the parsley and olives over the anchovies and serve immediately.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Attems Ramato Pinot Grigio. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif.', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u"Heat charcoal grill.                          Under cold running water, scale and gut the anchovies, removing the gills, but leaving the head and tail intact. Remove the fins. Open the body cavity, and using your thumbnail, loosen the meat of the fish from the spine. Gently remove the spine by twisting or cutting it off a the base of the anchovy's head and tail.                          Grill the anchovies over a hot charcoal fire, skin side down for about 2 minutes, or until the flesh of the fish becomes white. Transfer to a large serving platter, arranging the anchovies skin side up on the platter. Squeeze a little lemon juice over the fish. Drizzle with olive oil and season with sea salt and pepper. Sprinkle the parsley and olives over the anchovies and serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-local-anchovies-744233', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}