{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/771475-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 771475, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spaghetti Carbonara', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 138.89, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons extra-virgin olive oil, plus more for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces pancetta, chopped', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'ounces'}, {u'originalString': u'1/2 cup grated Parmesan, plus more for garnish', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pound spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'pound'}], u'healthScore': 9.0, u'imageType': u'jpeg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/spaghetti-carbonara.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of salted water to a boil. Cook the spaghetti according to the package instructions while you start the sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium-high heat and add the oil and pancetta. Cook until the pancetta gets brown and crispy, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, whisk the eggs with the cheese and some salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'When the spaghetti is done, drain it, reserving some of the cooking water, and add the pasta to the hot pancetta skillet. Toss to coat the pasta with the oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Remove the skillet from the heat and pour over the egg mixture, tossing quickly so the eggs don't scramble.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add some of the hot cooking water to thin it out and form a sauce. Toss in the parsley.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve immediately with some extra cheese and a drizzle of olive oil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Spaghetti Carbonara works really well with Frascati, Chablis, and Pinot Grigio. A crisp dry white wine balances out the richness of a creamy carbonara. Frascati is a Roman wine, which makes it an especially fitting choice to the Roman dish.', u'pairedWines': [u'frascati', u'chablis', u'pinot grigio'], u'productMatches': [{u'description': u"Luna Mater Frascati sets a new standard for Rome's most renowned white wine. As mystifying and enigmatic as its namesake, Mother Moon, it reflects the wine's close ties to nature. A blend of indigenous white varietals, it is a tribute to the tradition of the region, yet crafted with contemporary winemaking technique. The label, designed by Roman artist Domenico Bianchi, graphically conveys the unique beauty and mystery of this wine.Bright yellow in color. The bouquet is intense with exotic-fruit aromas. Dry, full flavored, soft and savory, with a lingering ripe-pear and bitter-almond finish.  This wine is ideal with seafood, white meats and pasta dishes. View More", u'title': u'Fontana Candida Luna Mater Frascati Superiore Secco', u'price': u'$21.99', u'id': 440860, u'link': u'https://www.wine.com/product/fontana-candida-luna-mater-frascati-superiore-secco-2014/354323', u'imageUrl': u'https://spoonacular.com/productImages/440860-312x231.jpg'}]}, u'aggregateLikes': 2439, u'instructions': u"Bring a large pot of salted water to a boil. Cook the spaghetti according to the package instructions while you start the sauce.                          Heat a large skillet over medium-high heat and add the oil and pancetta. Cook until the pancetta gets brown and crispy, 3 to 4 minutes.                          In a bowl, whisk the eggs with the cheese and some salt and pepper.                          When the spaghetti is done, drain it, reserving some of the cooking water, and add the pasta to the hot pancetta skillet. Toss to coat the pasta with the oil. Remove the skillet from the heat and pour over the egg mixture, tossing quickly so the eggs don't scramble. Add some of the hot cooking water to thin it out and form a sauce. Toss in the parsley. Serve immediately with some extra cheese and a drizzle of olive oil.", u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-carbonara-771475', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}