{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/476315-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 476315, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peanut Butter and Milk Chocolate Chip Cookie Pie', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 129.43, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'sweetened whipped cream or ice cream, optional', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}, {u'originalString': u'1 cup milk chocolate chips', u'aisle': u'Baking', u'name': u'milk chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1 cup peanut butter chips', u'aisle': u'Baking', u'name': u'peanut butter chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93762, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 unbaked (9-inch) pie crust', u'aisle': u'Refrigerated', u'name': u'unbaked pie crust', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'9-inch', u'unitShort': u'9-inch', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u'9-inch'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1 cup chopped pecans or walnuts, optional', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.tasteandtellblog.com/peanut-butter-and-milk-chocolate-chip-cookie-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350F.  Prepare the pie crust by laying in a pie dish.  Set aside.In a bowl, beat the butter.  Beat in the eggs and vanilla.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add in the sugar, flour and salt and beatu until combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add in the chocolate chips, peanut butter chips and nuts.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 93762, u'name': u'peanut butter chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}]}, {u'equipment': [], u'step': u'Pour into the unbaked pie crust.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'unbaked pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the preheated oven for 45-55 minutes, or until golden brown.  Cool for 1 hour.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Serve warm with whipped cream or ice cream if desired.--------------------------slightly adapted from Hershey's Chocolate Cookbook", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Vineyards Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 364, u'instructions': u"Preheat the oven to 350F.  Prepare the pie crust by laying in a pie dish.  Set aside.In a bowl, beat the butter.  Beat in the eggs and vanilla.  Add in the sugar, flour and salt and beatu until combined.  Add in the chocolate chips, peanut butter chips and nuts.  Pour into the unbaked pie crust.Bake in the preheated oven for 45-55 minutes, or until golden brown.  Cool for 1 hour.  Serve warm with whipped cream or ice cream if desired.--------------------------slightly adapted from Hershey's Chocolate Cookbook", u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-and-milk-chocolate-chip-cookie-pie-476315', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}