{u'recipes': [{u'sourceName': u'A Moms Take', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528387-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 528387, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Apple Strudel', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 71.57, u'creditText': u'A Moms Take', u'extendedIngredients': [{u'originalString': u'1 to 2 Tablespoons of soft butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'2 tsp. cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 Tablespoon Cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tablespoon'}, {u'originalString': u'sprinkle of nutmeg (if you like it)', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'(if you like it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'Pre-made, store bought Pie crust', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'pre-cooked farro', u'metaInformation': [u'store bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10020006, u'unit': u'servings'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.amomstake.com/2014/01/easy-apple-strudel-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'With a box shredder, shred your apple. You do not have to peel it first or core it. Just shred it down to the core.All all the dry ingredients together in a dish, mix well then add to the apple mixture.Open up a pre-made pie crust onto a cookie sheet, spread with butter, then apple filling.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Roll evenly from both sides toward the middle. pinch ends to help keep filling from running out while baking.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for about a half hour, or until it is as brown and bubbly as you like it.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let this set to cool for about 5 min. So you don’t get burned while trying to eat it while it is too hot.Enjoy.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 6, u'instructions': u'With a box shredder, shred your apple. You do not have to peel it first or core it. Just shred it down to the core.All all the dry ingredients together in a dish, mix well then add to the apple mixture.Open up a pre-made pie crust onto a cookie sheet, spread with butter, then apple filling. Roll evenly from both sides toward the middle. pinch ends to help keep filling from running out while baking.Bake for about a half hour, or until it is as brown and bubbly as you like it.Let this set to cool for about 5 min. So you don’t get burned while trying to eat it while it is too hot.Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-apple-strudel-528387', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}