{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223389-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 223389, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pirate ship and treasure island cake', u'diets': [], u'preparationMinutes': 150, u'pricePerServing': 463.39, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'150g sieved apricot jam, warmed', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 19719, u'unit': u'g'}, {u'originalString': u'\xbe tsp baking powder Baking powder bay-king pow-dah Baking powder is a raising agent that is commonly used in cake-making. It is made from an alkali…', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'\xbe tsp bicarbonate of soda Bicarbonate of soda Bicarbonate of soda, or baking soda, is an alkali which is used to raise soda breads and full-…', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'blue food colouring', u'aisle': u'Baking', u'name': u'blue food colouring', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'200g butter, cubed Butter butt-err Butter is made when lactic-acid producing bacteria are added to cream and churned to make an…', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 chocolate stick (we used Mikado) (optional)', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'(we used Mikado)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19081, u'unit': u''}, {u'originalString': u'8 mini chocolate finger', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 19081, u'unit': u''}, {u'originalString': u'300g dark plain chocolate, broken into pieces', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'dark', u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 19081, u'unit': u'g'}, {u'originalString': u'6 chocolate caramels (we used Rolos)', u'aisle': u'Sweet Snacks', u'name': u'chocolate covered caramels', u'metaInformation': [u'(we used Rolos)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolo.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 19152, u'unit': u''}, {u'originalString': u'gold covered chocolate coins', u'aisle': u'Sweet Snacks', u'name': u'chocolate covered raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-covered-raisins.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 19127, u'unit': u'servings'}, {u'originalString': u'6 malt chocolate balls', u'aisle': u'Tea and Coffee', u'name': u'chocolate malt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 14317, u'unit': u''}, {u'originalString': u'3 egg Egg egg The ultimate convenience food, eggs are powerhouses of nutrition, packed with protein and a…', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with protein and a…', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'650g brown ready-to-roll icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 650.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'g'}, {u'originalString': u'250g royal icing made from packet royal icing sugar (use 250g sugar)', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'30cm square cake board (preferably blue)', u'aisle': u'Bakery/Bread', u'name': u'lb cake', u'metaInformation': [u'blue', u'(preferably )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'square', u'unitShort': u'square', u'amount': 1.0, u'consistency': u'liquid', u'id': 18133, u'unit': u'square'}, {u'originalString': u'30 x 20cm cake tin', u'aisle': u'Bakery/Bread', u'name': u'lb cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 30.0, u'consistency': u'liquid', u'id': 18133, u'unit': u''}, {u'originalString': u'250g light muscovado sugar, plus extra for decoration', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light', u'for decoration'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u"100g white marzipan Marzipan mah-zuh-pan One of mankind's oldest sources of sweet pleasure, marzipan needs to contain only ground…", u'aisle': u'Baking', u'name': u'marzipan', u'metaInformation': [u'sweet', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93704, u'unit': u'g'}, {u'originalString': u'200g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'2 sheets black, white or blue paper', u'aisle': u'Ethnic Foods', u'name': u'rice paper', u'metaInformation': [u'white', u'black', u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 2.0, u'consistency': u'solid', u'id': 10118368, u'unit': u'sheets'}, {u'originalString': u'2 sandwich flags', u'aisle': u'Bakery/Bread', u'name': u'sandwich bun', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18353, u'unit': u''}, {u'originalString': u'200g soured cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soured cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1056, u'unit': u'g'}, {u'originalString': u'1\xbd tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 drinking straws', u'aisle': u'?', u'name': u'drinking straws', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'unit': u''}, {u'originalString': u'18 mini Toblerones', u'aisle': u'?', u'name': u'toblerones', u'metaInformation': [u'mini'], u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/pirate-ship-and-buried-treasure-island-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 87, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat the oven to 160C/140C fan/gas 3. Grease and line a 30x20cm cake tin with baking parchment.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the butter and 200g of the chocolate into a saucepan and heat gently until melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the heat. Sieve the flour, baking powder and bicarbonate of soda into a large bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Mix in the sugar. Beat together the eggs, soured cream and vanilla extract.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour the chocolate and egg mixtures into the flour and sugar and beat well until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour into the prepared tin and bake in the oven for about 40 minutes. Leave until completely cold before cutting and shaping.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the cake in half lengthways.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Place one complete half on the 30cm cake board.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the remaining half into 3 rectangles, 13x10cm, 7x10cm and 10x10cm. Attach the 10x10cm piece to one end of the base cake using a little warm jam.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a V shape to represent the prow of the ship.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Place the 13x10 piece at the other end of the base cake, attaching with jam. Using jam again attach the 7x10 piece on top of the 13x10 piece to make the upper deck. Slice the back of the ship at a very slight angle.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the whole cake with jam.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Roll out about 550g of the ready-to-roll icing and cover the cake. Trim the edges at the base and keep any trimmings.Melt the remaining 100g chocolate in the microwave or in a heatproof bowl over a saucepan of barely simmering water. Use melted chocolate to stick the mini Toblerones to the edges of the two decks and to the V shape of the prow. Trim any to fit exactly. Use the chocolate to stick on the chocolate balls for canon balls, finger biscuits stacked up as canons and chocolate caramels for port holes. Using a little of the marzipan, roll out and cut four windows. Make window frames from brown icing trimmings, rolling out to thin sausages to form a cross and sticking with chocolate. Attach to the sides of the ship with chocolate. Poke the chocolate stick out of the front of the prow, if using.Arrange the chocolate coins in a little pile on the cake board, reserving 3 or 4 coins for the top.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'id': 93704, u'name': u'marzipan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [], u'step': u'Roll out the remaining brown icing and cover the coins completely.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Brush with melted chocolate and sprinkle with muscovado sugar. Push 3 or 4 coins into the sand along with the chocolate skull if using.Put a little of the royal icing in a bowl. Colour the remainder blue.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [], u'step': u'Spread the icing on the cake board around the ship and the island. Use the white icing to make surf around the edge of the island.Using the remaining marzipan and brown icing, make three barrels.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'id': 93704, u'name': u'marzipan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [], u'step': u'Place one on the deck of the ship and the others in the sea.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Cut out sails from the paper and make holes in them so you can push the straws through. Attach the sails to the ship and poke sandwich flags out of the top to finish.', u'number': 18, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 47, u'instructions': u'Heat the oven to 160C/140C fan/gas 3. Grease and line a 30x20cm cake tin with baking parchment.Put the butter and 200g of the chocolate into a saucepan and heat gently until melted. Remove from the heat. Sieve the flour, baking powder and bicarbonate of soda into a large bowl. Mix in the sugar. Beat together the eggs, soured cream and vanilla extract. Pour the chocolate and egg mixtures into the flour and sugar and beat well until smooth. Pour into the prepared tin and bake in the oven for about 40 minutes. Leave until completely cold before cutting and shaping.Cut the cake in half lengthways. Place one complete half on the 30cm cake board. Cut the remaining half into 3 rectangles, 13x10cm, 7x10cm and 10x10cm. Attach the 10x10cm piece to one end of the base cake using a little warm jam. Cut a V shape to represent the prow of the ship. Place the 13x10 piece at the other end of the base cake, attaching with jam. Using jam again attach the 7x10 piece on top of the 13x10 piece to make the upper deck. Slice the back of the ship at a very slight angle.Brush the whole cake with jam. Roll out about 550g of the ready-to-roll icing and cover the cake. Trim the edges at the base and keep any trimmings.Melt the remaining 100g chocolate in the microwave or in a heatproof bowl over a saucepan of barely simmering water. Use melted chocolate to stick the mini Toblerones to the edges of the two decks and to the V shape of the prow. Trim any to fit exactly. Use the chocolate to stick on the chocolate balls for canon balls, finger biscuits stacked up as canons and chocolate caramels for port holes. Using a little of the marzipan, roll out and cut four windows. Make window frames from brown icing trimmings, rolling out to thin sausages to form a cross and sticking with chocolate. Attach to the sides of the ship with chocolate. Poke the chocolate stick out of the front of the prow, if using.Arrange the chocolate coins in a little pile on the cake board, reserving 3 or 4 coins for the top. Roll out the remaining brown icing and cover the coins completely. Brush with melted chocolate and sprinkle with muscovado sugar. Push 3 or 4 coins into the sand along with the chocolate skull if using.Put a little of the royal icing in a bowl. Colour the remainder blue. Spread the icing on the cake board around the ship and the island. Use the white icing to make surf around the edge of the island.Using the remaining marzipan and brown icing, make three barrels. Place one on the deck of the ship and the others in the sea. Cut out sails from the paper and make holes in them so you can push the straws through. Attach the sails to the ship and poke sandwich flags out of the top to finish.', u'spoonacularSourceUrl': u'https://spoonacular.com/pirate-ship-and-treasure-island-cake-223389', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 195, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}