{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/721145-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 721145, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Pull-Apart Garlic Rolls', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 20.99, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'12 dinner rolls (homemade or store-bought)', u'aisle': u'Bakery/Bread;Frozen', u'name': u'dinner yeast rolls', u'metaInformation': [u'homemade', u'store-bought', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dinner-yeast-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18347, u'unit': u''}, {u'originalString': u'1 tablespoon minced fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbe teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.browneyedbaker.com/pull-apart-garlic-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Line a 9x13-inch baking pan with a large piece of aluminum foil so that there is at six inches of overhang on both sides.2.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a cross-hatch pattern into the tops of the dinner rolls, about 1-inch apart, stopping about -inch from the bottom of the roll so that you do not cut the entire way through.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place the rolls into the prepared pan (it's okay if you have to smush them in there!)3. In a small bowl, mix together the melted butter, garlic, salt and parsley. Pry open the slits and drizzle some of the melted butter mixture in between, trying to divide it evenly between all of the rolls; then, sprinkle the Parmesan cheese into all of the slits. 4. Pull the foil overhangs up and seal it closed.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake for 15 minutes, then open the foil and bake for an additional 5 minutes, until the tops of the rolls are lightly browned and the Parmesan cheese has melted.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 415, u'instructions': u"1. Preheat oven to 350 degrees F. Line a 9x13-inch baking pan with a large piece of aluminum foil so that there is at six inches of overhang on both sides.2. Cut a cross-hatch pattern into the tops of the dinner rolls, about 1-inch apart, stopping about -inch from the bottom of the roll so that you do not cut the entire way through. Place the rolls into the prepared pan (it's okay if you have to smush them in there!)3. In a small bowl, mix together the melted butter, garlic, salt and parsley. Pry open the slits and drizzle some of the melted butter mixture in between, trying to divide it evenly between all of the rolls; then, sprinkle the Parmesan cheese into all of the slits. 4. Pull the foil overhangs up and seal it closed. Bake for 15 minutes, then open the foil and bake for an additional 5 minutes, until the tops of the rolls are lightly browned and the Parmesan cheese has melted. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/easy-pull-apart-garlic-rolls-721145', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}