{u'recipes': [{u'sourceName': u'She Wears Many Hats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/537276-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 537276, u'veryPopular': False, u'lowFodmap': True, u'title': u'Bruschetta Topping', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'whole 30'], u'pricePerServing': 21.2, u'creditText': u'She Wears Many Hats', u'extendedIngredients': [{u'originalString': u'1 tablespoon balsamic vingear', u'aisle': u'Condiments', u'name': u'balsamic glaze', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 98998, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons fresh basil, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'extra salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2\xbd cups tomato, diced (about 4-5 medium sized tomatoes)', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced', u'medium sized', u'( 4-5 tomatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 11529, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://shewearsmanyhats.com/2010/07/bruschetta-topping-stuff/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium sized bowl add the diced tomatoes and basil, along with\xa0the balsamic vinegar, olive oil, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Mix all ingredients together well.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add additional salt and pepper to taste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve right away, or cover and refrigerate until needed.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bollinger Brut Special Cuvee with a 4.3 out of 5 star rating seems like a good match. It costs about 60 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'A golden color, distinctive of black grape varieties. Very fine bubbles. On the nose, it has a beautiful aromatic complexity, ripe fruit and spicy aromas, with hints of roasted apples, apple compote and peaches.  On the palate, there is a subtle combination of structure, length and vivacity. The bubbles are like velvet. Flavors of pear, brioche and spicy aromas, notes of fresh walnut.Pair with all fish, especially sushi and sashimi, shellfish such as shrimp, prawns, crayfish and grilled lobster, poultry and white meat, cashews, parmesan or prosciutto. View More', u'title': u'Bollinger Brut Special Cuvee', u'price': u'$59.99', u'id': 433020, u'link': u'https://www.wine.com/product/bollinger-brut-special-cuvee/513', u'imageUrl': u'https://spoonacular.com/productImages/433020-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'In a medium sized bowl add the diced tomatoes and basil, along with\xa0the balsamic vinegar, olive oil, salt and pepper.Mix all ingredients together well.Add additional salt and pepper to taste.Serve right away, or cover and refrigerate until needed.', u'spoonacularSourceUrl': u'https://spoonacular.com/bruschetta-topping-537276', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}