{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/891841-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 891841, u'veryPopular': True, u'lowFodmap': False, u'title': u'Guacamole Deviled Eggs', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'pricePerServing': 22.69, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'pinch chile powder (for garnish)', u'aisle': u'Spices and Seasonings', u'name': u'chile powder', u'metaInformation': [u'(for garnish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'pinch'}, {u'originalString': u'6 large eggs, hard boiled (recipe here)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'hard', u'boiled', u'large', u'(recipe here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tbsp fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'1 medium haas avocado (about 5 oz)', u'aisle': u'Produce', u'name': u'haas avocado', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 9037, u'unit': u'oz'}, {u'originalString': u'1 tbsp minced jalapeno', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u'tbsp'}, {u'originalString': u'kosher salt and fresh ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2-3 tsp fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tsp'}, {u'originalString': u'1 tsp red onion, minced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tsp'}, {u'originalString': u'1 tbsp diced tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.skinnytaste.com/guacamole-deviled-eggs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Peel the cooled hard boiled eggs.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the eggs in half horizontally, and set the yolks aside. In a bowl, mash the avocado and 2 whole egg yolks; discard the rest.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix in lime juice, red onion, jalapeo, cilantro, salt and pepper and adjust to taste. Gently fold in tomato. Scoop heaping spoonfuls of the guacamole into the 12 halved eggs. Sprinkle with a little chile powder for color and arrange on a platter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 3354, u'instructions': u'Peel the cooled hard boiled eggs. Cut the eggs in half horizontally, and set the yolks aside. In a bowl, mash the avocado and 2 whole egg yolks; discard the rest. Mix in lime juice, red onion, jalapeo, cilantro, salt and pepper and adjust to taste. Gently fold in tomato. Scoop heaping spoonfuls of the guacamole into the 12 halved eggs. Sprinkle with a little chile powder for color and arrange on a platter.', u'spoonacularSourceUrl': u'https://spoonacular.com/guacamole-deviled-eggs-891841', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}