{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/278495-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 278495, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick & Easy Lemon Chicken & Rice', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 210.18, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 cup small broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cup'}, {u'originalString': u'1 cup thinly sliced carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'2 cups instant brown rice, uncooked', u'aisle': u'Pasta and Rice', u'name': u'instant brown rice', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020048, u'unit': u'cups'}, {u'originalString': u'1 tsp. lemon pepper seasoning', u'aisle': u'Spices and Seasonings', u'name': u'lemon pepper seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012030, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp. KRAFT Grated Parmesan Cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tbsp'}, {u'originalString': u'1 red pepper, cut into strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 lb. boneless skinless chicken breasts, cut into strips', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'1/2 cup KRAFT Tuscan House Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [u'italian', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 43016, u'unit': u'cup'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/quick-easy-lemon-chicken-rice-75191.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat dressing in large skillet on medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add chicken; cook and stir 1 min.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add broth, broccoli, red pepper and carrots.  Bring to boil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Stir in rice.  Return to boil.  Reduce heat to low; cover.  Simmer 5 min.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 5 min.  Stir in lemon pepper seasoning; sprinkle with cheese.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'id': 1012030, u'name': u'lemon pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Heat dressing in large skillet on medium-high heat.  Add chicken; cook and stir 1 min.                                            Add broth, broccoli, red pepper and carrots.  Bring to boil.                                            Stir in rice.  Return to boil.  Reduce heat to low; cover.  Simmer 5 min.  Remove from heat.  Let stand 5 min.  Stir in lemon pepper seasoning; sprinkle with cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-easy-lemon-chicken-rice-278495', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}