{u'recipes': [{u'sourceName': u'Texanerin', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/621009-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 21, u'id': 621009, u'veryPopular': False, u'lowFodmap': True, u'title': u'Grain-free and Gluten-free Mini Caramel Pecan Tarts', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 73.71, u'creditText': u'Texanerin', u'extendedIngredients': [{u'originalString': u'1\xbc cups (125 grams) almond flour or almond meal', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 93740, u'unit': u'grams'}, {u'originalString': u'\xbc cup (50 grams) coconut sugar or brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'\xbe cup (180 grams) tightly packed dark brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 180.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'4 teaspoons (12 grams) coconut flour, sifted if lumpy', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 12.0, u'consistency': u'solid', u'id': 93747, u'unit': u'grams'}, {u'originalString': u'2\xbd cups (275 grams) chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 275.0, u'consistency': u'solid', u'id': 12142, u'unit': u'grams'}, {u'originalString': u'3/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.375, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'7 tablespoons (98 grams) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 98.0, u'consistency': u'solid', u'id': 1145, u'unit': u'grams'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.texanerin.com/2014/11/mini-caramel-pecan-tarts.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375F (190C). Line two muffin pans with 18 muffin liners.Prepare the crust.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place all the crust ingredients in the bowl of a food processor fitted with the S-blade and pulse for 15 seconds or until there are no large chunks of nuts left. The nuts should be " or smaller in size.Press 20 grams, about a rounded tablespoon, of dough onto the bottom of the each liner. Try to press it in the nooks and crannies of the muffin liner.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 7 minutes or until golden brown.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u"Let cool for at least 20 minutes while preparing the rest of the recipe. Don't skimp on the cooling time or the caramel may leak through.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the chopped pecans on a baking sheet and roast for 4-6 minutes or until starting to smell toasty. They burn quickly so keep a close eye on them.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven.Prepare the caramel.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the sugar, cream, butter, vanilla and salt in a heavy bottom saucepan (do not use non-stick) over medium heat. Stir until combined and then simmer for 8 minutes. Do not stir. If needed, tilt the pan to redistribute the mixture.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat. The caramel will be quite thin at this point.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Let it cool for 20 minutes or until considerably thickened and just barely pourable. Stir in the nuts and then spoon about 2 tablespoons of caramel pecan mixture onto the top of each baked crust.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Place the pans in the refrigerator for 2-3 hours or until the caramel has firmed up.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Serve cold or at room temperature. These can be left at room temperature for 8 hours.Refrigerate in an airtight container for up to 4 days.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tart can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 126, u'instructions': u'Preheat the oven to 375F (190C). Line two muffin pans with 18 muffin liners.Prepare the crust. Place all the crust ingredients in the bowl of a food processor fitted with the S-blade and pulse for 15 seconds or until there are no large chunks of nuts left. The nuts should be " or smaller in size.Press 20 grams, about a rounded tablespoon, of dough onto the bottom of the each liner. Try to press it in the nooks and crannies of the muffin liner.Bake for 7 minutes or until golden brown. Let cool for at least 20 minutes while preparing the rest of the recipe. Don\'t skimp on the cooling time or the caramel may leak through.Place the chopped pecans on a baking sheet and roast for 4-6 minutes or until starting to smell toasty. They burn quickly so keep a close eye on them. Remove from the oven.Prepare the caramel. Heat the sugar, cream, butter, vanilla and salt in a heavy bottom saucepan (do not use non-stick) over medium heat. Stir until combined and then simmer for 8 minutes. Do not stir. If needed, tilt the pan to redistribute the mixture.Remove from the heat. The caramel will be quite thin at this point. Let it cool for 20 minutes or until considerably thickened and just barely pourable. Stir in the nuts and then spoon about 2 tablespoons of caramel pecan mixture onto the top of each baked crust.Place the pans in the refrigerator for 2-3 hours or until the caramel has firmed up.Serve cold or at room temperature. These can be left at room temperature for 8 hours.Refrigerate in an airtight container for up to 4 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/grain-free-and-gluten-free-mini-caramel-pecan-tarts-621009', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}