{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/224548-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 224548, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rack of lamb with lentils & Jack-by-the-hedge sauce', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 124.02, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'knob of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 carrot, finely chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 celery stick, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'500ml/ 18fl oz chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'50g/ 2oz Jack-by-the-hedge, picked and washed or wild garlic leaves', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'wild', u'washed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'leaves'}, {u'originalString': u'juice \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 racks of lamb (about 320g 11\xbdoz each), trimmed', u'aisle': u'Meat', u'name': u'lean racks of lamb', u'metaInformation': [u'racks of', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/racks-of-lamb.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10017032, u'unit': u''}, {u'originalString': u'200g/ 7oz puy lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 16069, u'unit': u'oz'}, {u'originalString': u'1 tsp English mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'tsp'}, {u'originalString': u'150ml/ \xbc pint olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'ml'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 thyme sprig', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'1 tbsp rapeseed or vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2137637/rack-of-lamb-with-lentils-and-jackbythehedge-sauce', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the oil in a saucepan.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add thecarrot, onion, celery, thyme and bay leaf,and cook over a medium heat for 10 minsto soften.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add the lentils and fry gentlyfor 1-2 mins.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Add the stock, bring to theboil and cook, uncovered, for 20-25 minsuntil the lentils are cooked through andmost of the stock has been absorbed.Meanwhile, cook the lamb.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Heat ovento 200C/180C fan/gas 6.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place the lambin a roasting tin, season well and roastfor 15-20 mins for rare to medium,25 mins for well done. Leave to restfor 5 mins before carving into chops.While the lamb is resting, make thesauce.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put the Jack-by-the-hedge ina food processor and blitz while slowlytrickling in the oil until it forms a pestoconsistency.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the lemon juiceto taste, then season.Stir the butter, mustard and any juicesfrom the lamb into the lentils and seasonto taste. Divide the lentils betweenwarmed plates, top with the chopsand drizzle with the sauce.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 38, u'instructions': u'Heat the oil in a saucepan. Add thecarrot, onion, celery, thyme and bay leaf,and cook over a medium heat for 10 minsto soften. Add the lentils and fry gentlyfor 1-2 mins. Add the stock, bring to theboil and cook, uncovered, for 20-25 minsuntil the lentils are cooked through andmost of the stock has been absorbed.Meanwhile, cook the lamb. Heat ovento 200C/180C fan/gas 6. Place the lambin a roasting tin, season well and roastfor 15-20 mins for rare to medium,25 mins for well done. Leave to restfor 5 mins before carving into chops.While the lamb is resting, make thesauce. Put the Jack-by-the-hedge ina food processor and blitz while slowlytrickling in the oil until it forms a pestoconsistency. Add the lemon juiceto taste, then season.Stir the butter, mustard and any juicesfrom the lamb into the lentils and seasonto taste. Divide the lentils betweenwarmed plates, top with the chopsand drizzle with the sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/rack-of-lamb-with-lentils-jack-by-the-hedge-sauce-224548', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}