{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225528-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 225528, u'veryPopular': True, u'lowFodmap': False, u'title': u'Little frosty Christmas cakes', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 471.45, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tbsp apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19719, u'unit': u'tbsp'}, {u'originalString': u'butter, for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'16 fresh cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 9078, u'unit': u''}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1 quantity Easy apple fruit cake, uncooked (see link below)', u'aisle': u'Produce;Baking', u'name': u'fruit cake mix', u'metaInformation': [u'uncooked', u'(see link below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-fruit-cake-mix.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 98925, u'unit': u''}, {u'originalString': u'500g pack ready-to-roll white icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'g'}, {u'originalString': u'50g icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'500g pack natural marzipan', u'aisle': u'Baking', u'name': u'marzipan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 93704, u'unit': u'g'}, {u'originalString': u'bunch rosemary, broken into small fronds', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'bunch'}, {u'originalString': u'50g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'approx 1m gold ribbon', u'aisle': u'Produce', u'name': u'yukon gold', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2562/little-frosty-christmas-cakes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/fan 160C/gas 4. Butter eight 150ml ramekins and line the bottoms with circles of non-stick baking paper. Divide the cake mix between the ramekins, transfer to a baking sheet and slide into the oven.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake for 30 mins until springy and dark golden brown. Leave until cool enough to handle, then run a round-edged knife around the edge of the each cake. Turn out and cool completely on a rack.If the cakes have risen into peaks, make flat by slicing the tops off with a serrated knife. Melt the jam with 1 tbsp water and brush over the top of the cakes. Lightly knead the marzipan and shape eight golf ball-sized balls. (You will have some left over – wrap up well for another time.) Using a rolling pin, gently roll the balls into flat circles, approx 1cm thick and the same diameter as the cakes. Sit the marzipan on the jammy side of the cakes. Do the same with the icing, brushing the marzipan with a little cooled, boiled water to help it stick. Beat the egg white until just frothy and broken up.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'id': 93704, u'name': u'marzipan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [], u'step': u'Spread the caster sugar over a plate. Dip the cranberries and rosemary in the egg white, shake off the excess and roll in the caster sugar to create a frosty effect. Leave to dry for 15 mins. Tip away all but 2 tsp of the egg white and mix with the icing sugar to create a thick paste. Use to fix two cranberries and a sprig of rosemary to the top of each cake. Decorate with gold ribbon. The cakes will keep in an airtight container for up to a week.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 490, u'instructions': u'Heat oven to 180C/fan 160C/gas 4. Butter eight 150ml ramekins and line the bottoms with circles of non-stick baking paper. Divide the cake mix between the ramekins, transfer to a baking sheet and slide into the oven. Bake for 30 mins until springy and dark golden brown. Leave until cool enough to handle, then run a round-edged knife around the edge of the each cake. Turn out and cool completely on a rack.If the cakes have risen into peaks, make flat by slicing the tops off with a serrated knife. Melt the jam with 1 tbsp water and brush over the top of the cakes. Lightly knead the marzipan and shape eight golf ball-sized balls. (You will have some left over – wrap up well for another time.) Using a rolling pin, gently roll the balls into flat circles, approx 1cm thick and the same diameter as the cakes. Sit the marzipan on the jammy side of the cakes. Do the same with the icing, brushing the marzipan with a little cooled, boiled water to help it stick. Beat the egg white until just frothy and broken up. Spread the caster sugar over a plate. Dip the cranberries and rosemary in the egg white, shake off the excess and roll in the caster sugar to create a frosty effect. Leave to dry for 15 mins. Tip away all but 2 tsp of the egg white and mix with the icing sugar to create a thick paste. Use to fix two cranberries and a sprig of rosemary to the top of each cake. Decorate with gold ribbon. The cakes will keep in an airtight container for up to a week.', u'spoonacularSourceUrl': u'https://spoonacular.com/little-frosty-christmas-cakes-225528', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}