{u'recipes': [{u'sourceName': u'Running on Real Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/835625-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 835625, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oatmeal Chocolate Chip Cookie Dough Balls', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 36.97, u'creditText': u'Running on Real Food', u'extendedIngredients': [{u'originalString': u'\xbd tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 cup (150 g) cashews (sub with almonds)', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'with almonds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 12087, u'unit': u'g'}, {u'originalString': u'\xbd cup (85 g) dairy-free chocolate chips or chopped dark chocolate', u'aisle': u'Health Foods;Baking', u'name': u'dairy-free chocolate chips', u'metaInformation': [u'dark', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 98848, u'unit': u'g'}, {u'originalString': u'\xbd cup (100 g) packed, pitted dates (soak first if dry)', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'dry', u'packed', u'pitted', u'(soak first if )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9087, u'unit': u'g'}, {u'originalString': u'3 tbsp pure maple syrup (sub with agave)', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'with agave)', u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tbsp'}, {u'originalString': u'1 cup (120 g) oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 120.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'\xbd tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://runningonrealfood.com/oatmeal-chocolate-chip-cookie-dough-balls/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the nuts in a food processor or high-powered blender until broken down.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rest of the ingredients and mix until it forms a dough.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chocolate and pulse a few times to combine.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll into balls.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Place the nuts in a food processor or high-powered blender until broken down.Add the rest of the ingredients and mix until it forms a dough.Add the chocolate and pulse a few times to combine.Roll into balls.', u'spoonacularSourceUrl': u'https://spoonacular.com/oatmeal-chocolate-chip-cookie-dough-balls-835625', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}