{u'recipes': [{u'sourceName': u'Slender Kitchen', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/510465-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 510465, u'veryPopular': False, u'lowFodmap': False, u'title': u'Acai Bowl', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 114.86, u'creditText': u'Slender Kitchen', u'extendedIngredients': [{u'originalString': u'1 frozen acai smoothie packets', u'aisle': u'Beverages', u'name': u'acai juice', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acai-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 98896, u'unit': u''}, {u'originalString': u'1 banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2 tbsp. granola or high fiber cereal', u'aisle': u'Cereal', u'name': u'cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bran-flakes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 8029, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp. shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'tsp'}, {u'originalString': u'1/2 cup nonfat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.slenderkitchen.com/acai-bowl/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender or food processor, combine the acai smoothie pack, 1/2 the banana, and yogurt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Add a touch of water if needed. Lately I have been freezing this mixture for about 30 minutes before eating so it is close to a sorbet consistency, but that isn’t necessary.Top with remaining banana, coconut, granola, and any other toppings you enjoy. Chia seeds, fresh berries, flax seeds, and nuts would all be great additions.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Essay Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier View More", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 57, u'instructions': u'In a blender or food processor, combine the acai smoothie pack, 1/2 the banana, and yogurt. Add a touch of water if needed. Lately I have been freezing this mixture for about 30 minutes before eating so it is close to a sorbet consistency, but that isn’t necessary.Top with remaining banana, coconut, granola, and any other toppings you enjoy. Chia seeds, fresh berries, flax seeds, and nuts would all be great additions.', u'spoonacularSourceUrl': u'https://spoonacular.com/acai-bowl-510465', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}