{u'recipes': [{u'sourceName': u'Baked In', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/594563-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 594563, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican Stuffed Peppers', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 186.2, u'creditText': u'Baked In', u'extendedIngredients': [{u'originalString': u'6 medium bell peppers', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 can black beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 16018, u'unit': u'can'}, {u'originalString': u'1 15 oz can tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'2 tsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'Garnishes: sour cream, salsa, avocado, additional cheese', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'servings'}, {u'originalString': u'1 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 cup fresh or frozen corn, thawed', u'aisle': u'Produce', u'name': u'fresh corn', u'metaInformation': [u'fresh', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11167, u'unit': u'cup'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 jalapeno pepper, minced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 small onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup reduced-fat shredded cheese (Mexican blend or cheddar work well)', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded', u'reduced-fat', u'well', u'(Mexican blend or cheddar work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'cup'}, {u'originalString': u'1 cup long grain white rice', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'long grain', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.baked-in.com/2012/05/07/mexican-stuffed-peppers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Cut the top off of each pepper and remove the seeds. Replace the tops of the peppers.Fill a large stockpot with about an inch of water and place peppers upright in a steamer rack (if you don't have one, directly in the water is fine). Cover and steam for 8-10 minutes.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove lid.While the peppers are steaming, heat olive oil in a saucepan over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onions and jalapeno and cook until onion is slightly softened and transparent, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, chili powder, cumin and oregano and cook for about a minute, stirring constantly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Pour in rice and stir until coated.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add tomato sauce and water/stock and bring to a boil. Reduce heat to low, cover, and cook for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove from heat and add black beans, corn, cilantro and cheese. Season with salt and pepper.Fill peppers, cover each with the top of the pepper, and place back in the steaming pot. Steam for another 3-5 minutes until heated through.Top with any garnishes - cheese, sour cream, avocado, or salsa - and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Beaux Freres The Beaux Freres Vineyard Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 56 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Shows dark plum/garnet with some amber and orange at the edge. The nose shows roasted herbs and meatiness with some background notes of sweet cherry, truffle and vegetal qualities. This is a distinctive Pinot Noir with aromatics that are very old-world. In the mouth the wine has always had a certain austerity but a bit of a gap in the middle. The wine has held up nicely over time but has never really developed the sweetness and charm that we would expect of our best Pinot Noirs. View More', u'title': u'Beaux Freres The Beaux Freres Vineyard Pinot Noir', u'price': u'$55.99', u'id': 445451, u'link': u'https://www.wine.com/product/beaux-freres-the-beaux-freres-vineyard-pinot-noir-1996/126352', u'imageUrl': u'https://spoonacular.com/productImages/445451-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u"Cut the top off of each pepper and remove the seeds. Replace the tops of the peppers.Fill a large stockpot with about an inch of water and place peppers upright in a steamer rack (if you don't have one, directly in the water is fine). Cover and steam for 8-10 minutes. Remove lid.While the peppers are steaming, heat olive oil in a saucepan over medium heat. Add onions and jalapeno and cook until onion is slightly softened and transparent, about 5 minutes.Add garlic, chili powder, cumin and oregano and cook for about a minute, stirring constantly.Pour in rice and stir until coated. Add tomato sauce and water/stock and bring to a boil. Reduce heat to low, cover, and cook for 20 minutes.Remove from heat and add black beans, corn, cilantro and cheese. Season with salt and pepper.Fill peppers, cover each with the top of the pepper, and place back in the steaming pot. Steam for another 3-5 minutes until heated through.Top with any garnishes - cheese, sour cream, avocado, or salsa - and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-stuffed-peppers-594563', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}