{u'recipes': [{u'sourceName': u'Life Made Simple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/838730-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 838730, u'veryPopular': False, u'lowFodmap': False, u'title': u'30 Minute Toasted Tortellini with Pesto', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 176.88, u'creditText': u'Life Made Simple', u'extendedIngredients': [{u'originalString': u'1 (20 oz.) package three cheese tortellini', u'aisle': u'Refrigerated', u'name': u'cheese tortellini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 10093727, u'unit': u'oz'}, {u'originalString': u'12 oz. cremini mushrooms, sliced', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'\xbc c. julienned fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'c'}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbc tsp. ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1/3 c. freshly grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1033, u'unit': u'c'}, {u'originalString': u'\xbc c. prepared pesto with basil', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'with basil', u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93698, u'unit': u'c'}, {u'originalString': u'3 tbsp. salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://lifemadesimplebakes.com/2017/01/30-minute-toasted-tortellini-with-pesto/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"In a large pot of boiling water, cook the tortellini according to package's directions.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and set aside.Meanwhile, as the tortellini is cooking, melt the butter in a large skillet set over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the mushrooms and saut for 4-5 minutes or until browned.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the drained tortellini and cook until lightly toasted and browned around the edges.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}]}, {u'equipment': [], u'step': u'Add the garlic and cook just until fragrant.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Remove from the heat and stir in the pesto, basil and parmesan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 37, u'instructions': u"In a large pot of boiling water, cook the tortellini according to package's directions. Drain and set aside.Meanwhile, as the tortellini is cooking, melt the butter in a large skillet set over medium-high heat. Add the mushrooms and saut for 4-5 minutes or until browned. Add the drained tortellini and cook until lightly toasted and browned around the edges. Add the garlic and cook just until fragrant.Remove from the heat and stir in the pesto, basil and parmesan. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/30-minute-toasted-tortellini-with-pesto-838730', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}