{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/490625-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 28, u'id': 490625, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coconut Fudge Poke Cake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 42.78, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'3 cups shredded coconut, divided', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cups'}, {u'originalString': u'1 can Cream of Coconut (15 oz.)', u'aisle': u'Alcoholic Beverages;Ethnic Foods;Baking', u'name': u'cream of coconut', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-coconut.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 93745, u'unit': u'oz'}, {u'originalString': u'1 cup hot fudge topping', u'aisle': u'Frozen', u'name': u'fudge topping', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019348, u'unit': u'cup'}, {u'originalString': u'1 container Cool Whip (8 oz.)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'1 can sweetened condensed milk (14 oz.)', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'1 white cake mix (I use Pillsbury)', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white', u'(I use Pillsbury)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://insidebrucrewlife.com/2013/05/coconut-fudge-poke-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place 1/2 cup shredded coconut on a baking sheet.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place in oven at 350* for 10 minutes. Toss coconut a few times while baking, so it doesn't burn.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Let cool.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake cake according to package directions for a 9x13 pan, adding 1 cup shredded coconut to the batter before baking. As soon as the cake comes out of the oven, use a fork to poke the cake all over. Make sure the cake is completely covered in holes.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Mix the 2 cans of milk and pour slowly over the entire cake, making sure to fill the holes. Cool completely.Microwave the hot fudge for about 30 seconds, or until spreadable. Cover the cake with the hot fudge. Top with the Cool Whip and the remaining coconut. Sprinkle the top with the toasted coconut for some color.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Cut into 24 squares.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 23396, u'instructions': u"Place 1/2 cup shredded coconut on a baking sheet. Place in oven at 350* for 10 minutes. Toss coconut a few times while baking, so it doesn't burn. Let cool.Bake cake according to package directions for a 9x13 pan, adding 1 cup shredded coconut to the batter before baking. As soon as the cake comes out of the oven, use a fork to poke the cake all over. Make sure the cake is completely covered in holes. Mix the 2 cans of milk and pour slowly over the entire cake, making sure to fill the holes. Cool completely.Microwave the hot fudge for about 30 seconds, or until spreadable. Cover the cake with the hot fudge. Top with the Cool Whip and the remaining coconut. Sprinkle the top with the toasted coconut for some color. Cut into 24 squares.", u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-fudge-poke-cake-490625', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 48, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}