{u'recipes': [{u'sourceName': u'Grumpys Honey Bunch', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/549768-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 549768, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Pie Martini', u'diets': [u'dairy free'], u'pricePerServing': 31.35, u'creditText': u'Grumpys Honey Bunch', u'extendedIngredients': [{u'originalString': u'1 teaspoon Canned Pumpkin', u'aisle': u'Baking', u'name': u'canned pumpkin', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'teaspoon'}, {u'originalString': u'1/2 shot Cream de Cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u''}, {u'originalString': u'1 Graham Cracker, crushed into crumbs', u'aisle': u'Sweet Snacks', u'name': u'graham cracker', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1/2 shot Irish Cream Liquor', u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93764, u'unit': u''}, {u'originalString': u'1/2 shot Pumpkin Spice Creamer', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u''}, {u'originalString': u'1/2 shot Vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 14051, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.grumpyshoneybunch.com/2013/10/pumpkin-pie-martini.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rim glass with graham cracker crumbs by dipping the lip of glass in some pumpkin spice creamer.  Set glass aside.  Fill drink shaker with ice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}, {u'equipment': [], u'step': u'Pour in liquids and Pumpkin.  Sprinkle in about 1/8 teaspoon pumpkin pie spice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}]}, {u'equipment': [], u'step': u'Place cover on shaker and shake well,', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour drink into glass and serve!', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 23, u'instructions': u'Rim glass with graham cracker crumbs by dipping the lip of glass in some pumpkin spice creamer.  Set glass aside.  Fill drink shaker with ice.  Pour in liquids and Pumpkin.  Sprinkle in about 1/8 teaspoon pumpkin pie spice.  Place cover on shaker and shake well,  Pour drink into glass and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-pie-martini-549768', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}