{u'recipes': [{u'sourceName': u'Pineapple and Coconut', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/588677-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 588677, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coconut Butter Poached Lobster with Pineapple Green Curry Sauce', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'preparationMinutes': 45, u'pricePerServing': 928.15, u'creditText': u'Pineapple and Coconut', u'extendedIngredients': [{u'originalString': u'Baby Bok Choy, washed and leaves separated', u'aisle': u'Produce', u'name': u'baby bok choy', u'metaInformation': [u'washed and leaves separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 93636, u'unit': u'servings'}, {u'originalString': u'1 \xbd sticks butter (12 tbsp)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 \xbd cans organic coconut milk (20 ounces)', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'organic', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'ounces'}, {u'originalString': u'\xbd c- \xbe c coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 12118, u'unit': u''}, {u'originalString': u'2 tsp coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tsp'}, {u'originalString': u'1 1” knob of peeled ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u''}, {u'originalString': u'2 1 \xbd lb live Atlantic lobsters with claws', u'aisle': u'Seafood', u'name': u'live lobsters', u'metaInformation': [u'with claws'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 15147, u'unit': u'lb'}, {u'originalString': u"1 cup pineapple, sliced thin into \xbc' thick matchsticks ( about 2” long)", u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'thick', u'sliced', u'thin', u'( 2” long)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'cup'}, {u'originalString': u'2 lengths of pineapple cores', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'Hawaiian sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2-3 Okinawan Purple sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'2 -3 tsp canned Thai green curry paste, or to taste (I use Maesri brand found in Asian markets)', u'aisle': u'Ethnic Foods', u'name': u'thai red curry paste', u'metaInformation': [u'green', u'canned', u'to taste', u'(I use Maesri brand found in Asian markets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93605, u'unit': u'tsp'}, {u'originalString': u'1 tbsp water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.pineappleandcoconut.com/recipes/coconut-butter-poached-lobster-with-pineapple-green-curry-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 74, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare the sweet potatoes. Peel and chop into large chunks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place in a steamer pot over boiling water and steam until very fork tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Transfer to a food processor and process until smooth adding in coconut milk slowly until you reach desired consistency. Season to taste with salt and set aside', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Prepare the lobsters. In a large stock pot, bring water to a boil, place lobsters one at a time head first into the water and poach for 4 minutes. Immediately remove and place into another large pot filled with ice water.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let rest in ice bath for 20 minutes. Repeat with other lobster. The lobsters can sit in ice bath in same pot if your pot has enough room. After 20 minutes take lobsters out of pot, drain out excess water and set on a cutting board', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a saucepan over medium low heat, combine the coconut milk and ginger and heat until warm, make sure it doesn’t come to a boil. This can be heating while you prepare the butter. In a deep sauce pan over medium heat, heat the tablespoon of water, and add in the butter one tablespoon at a time, whisking until it its melted before adding the next. Slowly add in the coconut milk and ginger, whisking well to combine and turn off heat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let sit 15 min for flavors to infuse. While the poaching liquid rests prepare the lobster. Carefully twist the tails of the body and clean under running water. Using scissors carefully cut the shell and remove the tail. Curl up the tail and stick a toothpick through it to hold its shape. Using scissors again carefully remove the claw meat and knuckle meat. You can also remove the leg meat if desired.Turn the heat back on under the poaching liquid and once hot place the tails in the pot, after 4 minutes add in the claws and then the knuckle and leg meat last once two minutes are remaining for a total of 8 minutes of poaching.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove immediately and set aside.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add in 1-2 tsp of the green curry paste to the poaching liquid and whisk to combine, taste and add salt if needed.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-curry-paste.png', u'id': 10093605, u'name': u'green curry paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add in the pineapple matchsticks and the two pieces of core and bring to a simmer. Simmer on low for about 5 minutes.Prepare the bok choy. In a small saut\xe9 pan heat the coconut oil and saut\xe9 the baby bok choy leaves 1-2 min or until the greens start to slightly wilt.Prepare your plate.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 93636, u'name': u'baby bok choy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Place about \xbe c of the purple sweet potato puree in the middle ( I used a biscut cutter to make the round shape, place baby bok choy leaves on top and then the lobster tail on top of that (', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 93636, u'name': u'baby bok choy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster-tails.jpg', u'id': 10015147, u'name': u'lobster tails'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Remove the toothpick)', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Place the claw meat on one side and half of the leg and knuckle meat on the other . Spoon a few tablespoons of the curry sauce over the top of the lobster tail, and another 1-2 tbsp of the sauce with the pineapple matchsticks over the leg and knuckle meat.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster-tails.jpg', u'id': 10015147, u'name': u'lobster tails'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Serve hot.Makes 2 servings', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'If you want to make the lobster ahead of time, after the 20 min ice bath, place the lobsters in freezer bags and either refrigerate up to 48 hours or freeze 3 days up to 3 weeks. If frozen thaw in refrigerator for 24 hours before complete cooking. Bring to room temp before poaching.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chablis and Chardonnay are my top picks for Lobster. Chablis is perfect with lobster, but a chardonny from other regions is bound to hit the spot too. One wine you could try is Louis Jadot Chablis. It has 4.4 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chablis', u'chardonnay'], u'productMatches': [{u'description': u'The Louis Jadot Chablis has a very nice golden yellow color. It is a lipid, bright and fresh wine, which taste and bouquet develop relatively quickly.It should be served chilled, and can be served with oysters, charcuterie and fried fish. It also goes very well with goats cheese.', u'title': u'Louis Jadot Chablis', u'price': u'$19.99', u'id': 441116, u'link': u'https://www.wine.com/product/louis-jadot-chablis-2009/106717', u'imageUrl': u'https://spoonacular.com/productImages/441116-312x231.jpg'}]}, u'aggregateLikes': 234, u'instructions': u'Prepare the sweet potatoes. Peel and chop into large chunks. Place in a steamer pot over boiling water and steam until very fork tender. Transfer to a food processor and process until smooth adding in coconut milk slowly until you reach desired consistency. Season to taste with salt and set asidePrepare the lobsters. In a large stock pot, bring water to a boil, place lobsters one at a time head first into the water and poach for 4 minutes. Immediately remove and place into another large pot filled with ice water. Let rest in ice bath for 20 minutes. Repeat with other lobster. The lobsters can sit in ice bath in same pot if your pot has enough room. After 20 minutes take lobsters out of pot, drain out excess water and set on a cutting boardIn a saucepan over medium low heat, combine the coconut milk and ginger and heat until warm, make sure it doesn’t come to a boil. This can be heating while you prepare the butter. In a deep sauce pan over medium heat, heat the tablespoon of water, and add in the butter one tablespoon at a time, whisking until it its melted before adding the next. Slowly add in the coconut milk and ginger, whisking well to combine and turn off heat. Let sit 15 min for flavors to infuse. While the poaching liquid rests prepare the lobster. Carefully twist the tails of the body and clean under running water. Using scissors carefully cut the shell and remove the tail. Curl up the tail and stick a toothpick through it to hold its shape. Using scissors again carefully remove the claw meat and knuckle meat. You can also remove the leg meat if desired.Turn the heat back on under the poaching liquid and once hot place the tails in the pot, after 4 minutes add in the claws and then the knuckle and leg meat last once two minutes are remaining for a total of 8 minutes of poaching. Remove immediately and set aside.Add in 1-2 tsp of the green curry paste to the poaching liquid and whisk to combine, taste and add salt if needed. Add in the pineapple matchsticks and the two pieces of core and bring to a simmer. Simmer on low for about 5 minutes.Prepare the bok choy. In a small saut\xe9 pan heat the coconut oil and saut\xe9 the baby bok choy leaves 1-2 min or until the greens start to slightly wilt.Prepare your plate. Place about \xbe c of the purple sweet potato puree in the middle ( I used a biscut cutter to make the round shape, place baby bok choy leaves on top and then the lobster tail on top of that ( Remove the toothpick) Place the claw meat on one side and half of the leg and knuckle meat on the other . Spoon a few tablespoons of the curry sauce over the top of the lobster tail, and another 1-2 tbsp of the sauce with the pineapple matchsticks over the leg and knuckle meat. Serve hot.Makes 2 servingsIf you want to make the lobster ahead of time, after the 20 min ice bath, place the lobsters in freezer bags and either refrigerate up to 48 hours or freeze 3 days up to 3 weeks. If frozen thaw in refrigerator for 24 hours before complete cooking. Bring to room temp before poaching.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-butter-poached-lobster-with-pineapple-green-curry-sauce-588677', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 53, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}