{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/367720-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 367720, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Bean-Sweet Potato Skillet', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 110.28, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 cans (15 ounces each) black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon minced chipotle pepper in adobo sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper in adobo', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u'teaspoon'}, {u'originalString': u'1-1/4 cups uncooked couscous', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'couscous', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20028, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 medium sweet potatoes, peeled and finely chopped', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'medium', u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 can (14-1/2 ounces) vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ounces'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/black-bean-sweet-potato-skillet', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, saute onion in oil until tender.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the beans, sweet potatoes, broth, chipotle, pepper and cinnamon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Bring to a boil. Reduce heat; cover and simmer for 25 minutes. Uncover and simmer 5-10 minutes longer or until potatoes are very tender and mixture is thickened, stirring occasionally.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Meanwhile, cook couscous according to package directions.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}]}, {u'equipment': [], u'step': u'Serve with black bean mixture.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                In a large skillet, saute onion in oil until tender. Add the beans, sweet potatoes, broth, chipotle, pepper and cinnamon.                                                                                           Bring to a boil. Reduce heat; cover and simmer for 25 minutes. Uncover and simmer 5-10 minutes longer or until potatoes are very tender and mixture is thickened, stirring occasionally.                                                                                           Meanwhile, cook couscous according to package directions. Serve with black bean mixture.                                        Yield: 5 servings.                                                                                                                         Originally published as Black Bean-Sweet Potato Skillet in  Country WomanOctober/November 2010, p40                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup black bean mixture with 1/2 cup couscous equals 294 calories, 3 g fat (trace saturated fat), 0 cholesterol, 727 mg sodium, 54 g carbohydrate, 10 g fiber, 12 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-sweet-potato-skillet-367720', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}