{u'recipes': [{u'sourceName': u'Damn Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610202-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 610202, u'veryPopular': True, u'lowFodmap': False, u'title': u'Garlic Mushroom Kabobs', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 25, u'pricePerServing': 66.81, u'creditText': u'Damn Delicious', u'extendedIngredients': [{u'originalString': u'1/4 cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'1 pound cremini mushrooms', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons chopped fresh parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'3 cloves garlic, pressed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://damndelicious.net/2014/08/29/mushroom-kabobs/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees F. Lightly oil a baking sheet or coat with nonstick spray. In a large bowl, whisk together balsamic vinegar, olive oil, garlic, oregano and basil; season with salt and pepper, to taste. Stir in mushrooms and let sit for 10-15 minutes. Thread mushrooms onto skewers and place onto prepared baking sheet.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into oven and roast until tender, about 15-20 minutes.*', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, garnished with parsley, if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 523, u'instructions': u'Preheat oven to 425 degrees F. Lightly oil a baking sheet or coat with nonstick spray. In a large bowl, whisk together balsamic vinegar, olive oil, garlic, oregano and basil; season with salt and pepper, to taste. Stir in mushrooms and let sit for 10-15 minutes. Thread mushrooms onto skewers and place onto prepared baking sheet. Place into oven and roast until tender, about 15-20 minutes.* Serve immediately, garnished with parsley, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-mushroom-kabobs-610202', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}