{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497514-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 497514, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Baked Frittata with Ham, Jalapeno, Sharp Cheddar, Tomatoes, and Cilantro', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 281.74, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 slice of Canadian bacon ham, diced', u'aisle': u'Meat', u'name': u'canadian bacon', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canadian-bacon.png', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 10130, u'unit': u'slice'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 tbsp fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'2 grape tomatoes, sliced', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111529, u'unit': u''}, {u'originalString': u'3 slices of pickled jalapeno, diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'solid', u'id': 11979, u'unit': u'slices'}, {u'originalString': u'1-2 tsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tsp'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'serving'}, {u'originalString': u'1 small slice of sharp cheddar, diced', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'slice'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2012/11/mini-baked-frittata-with-ham-jalapeno-sharp-cheddar-tomatoes-and-cilantro.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.  Coat a mini baking dish with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the eggs with the milk until well combined then season with sea salt and freshly cracked pepper, to taste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place a few pieces of ham, jalapeno, sharp cheddar, tomatoes, and cilantro into the mini baking dish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour the egg mixture into the baking dish then place the remaining ham, jalapeno, sharp cheddar, tomatoes, and cilantro on top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into the oven and bake for 25-30 minutes, or until a tester inserted into the center comes out clean.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and serve immediately.  Enjoy.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frittatan on the menu? Try pairing with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Mionetto Cuvee Sergio Prosecco with a 4.1 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'A cuvee that successfully introduces emotions and the special unmistakable flavor of wine skillfully produced to enhance the characteristics of the native grape varieties of a unique area, at the foot of the Pre-alps of Veneto, where Mionetto has been based since 1887. These flavors and aromas have disappeared over the years but now Mionetto are reintroducing them in this excellent cuv\xe9e.A delicate pale yellow color, with a characteristic aroma that blends with hints of honey and crab apples. It is dry and pleasantly slightly bitter on the palate. Lean due to the right level of acidity, it is moderately full-bodied with a fine and intense perlage.A balanced, smooth and refreshing sparkling wine that is ideal for any occasion, thanks to its moderate alcohol content and versatility. It is best served with simple light fish or vegetable dishes. It is an excellent aperitif accompanied by savory tarts or more delicate finger food such as shrimp vol-au-vent.', u'title': u'Mionetto Cuvee Sergio Prosecco', u'price': u'$17.99', u'id': 454770, u'link': u'https://www.wine.com/product/mionetto-cuvee-sergio-prosecco/58520', u'imageUrl': u'https://spoonacular.com/productImages/454770-312x231.jpg'}]}, u'aggregateLikes': 234, u'instructions': u'Preheat the oven to 350 degrees.  Coat a mini baking dish with cooking spray.Mix the eggs with the milk until well combined then season with sea salt and freshly cracked pepper, to taste.  Place a few pieces of ham, jalapeno, sharp cheddar, tomatoes, and cilantro into the mini baking dish.Pour the egg mixture into the baking dish then place the remaining ham, jalapeno, sharp cheddar, tomatoes, and cilantro on top.Place into the oven and bake for 25-30 minutes, or until a tester inserted into the center comes out clean.  Remove from the oven and serve immediately.  Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-baked-frittata-with-ham-jalapeno-sharp-cheddar-tomatoes-and-cilantro-497514', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}