{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601219-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 601219, u'veryPopular': False, u'lowFodmap': False, u'title': u'Snickerdoodle cookies have a spicy and sweet taste', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 40.73, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 teaspoon Baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Butter - softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoons'}, {u'originalString': u'2 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 3/4 cups Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 tablespoon ground Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.copykat.com/2009/06/16/snickerdoodle-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix butter, sugar and eggs thoroughly with a mixer. Sift dry ingredients together and stir into first mixture. Chill dough, form in balls, roll in cinnamon and sugar mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake at 400 degrees for 8-10 minutes on greased cookie sheet. They will flatten out as they bake.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Preheat oven to 400 degrees.  Mix butter, sugar and eggs thoroughly with a mixer. Sift dry ingredients together and stir into first mixture. Chill dough, form in balls, roll in cinnamon and sugar mixture. Bake at 400 degrees for 8-10 minutes on greased cookie sheet. They will flatten out as they bake.', u'spoonacularSourceUrl': u'https://spoonacular.com/snickerdoodle-cookies-have-a-spicy-and-sweet-taste-601219', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}