{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217643-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 217643, u'veryPopular': True, u'lowFodmap': False, u'title': u'Simple gingerbread house', u'diets': [], u'pricePerServing': 1549.1, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g bag flaked almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 12061, u'unit': u'g'}, {u'originalString': u'2 tsp bicarbonate of soda', u'aisle': u'Baking', u'name': u'bicarbonate of soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 mini chocolate roll or a dipped chocolate flake', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19081, u'unit': u''}, {u'originalString': u'125g pack mini chocolate fingers', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 19081, u'unit': u'g'}, {u'originalString': u'7 tbsp golden syrup', u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 93829, u'unit': u'tbsp'}, {u'originalString': u'200g dark muscovado sugar', u'aisle': u'Baking', u'name': u'dark muscovado sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'g'}, {u'originalString': u'2 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'generous selcetion sweets, choose your own colour theme', u'aisle': u'Online', u'name': u'ez sweets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dropper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10119868, u'unit': u'serving'}, {u'originalString': u'4 tsp ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'500g icing sugar, plus extra to dust', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'few edible silver balls', u'aisle': u'Meat', u'name': u'meat balls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'unitLong': u'balls', u'unitShort': u'balls', u'amount': 3.0, u'consistency': u'solid', u'id': 10110219, u'unit': u'balls'}, {u'originalString': u'600g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'250g unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}], u'healthScore': 66.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/4900/simple-gingerbread-house', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 420, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oven to 200C/fan 180C/gas 6. Melt the butter, sugar and syrup in a pan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the flour, bicarbonate of soda and ground ginger into a large bowl, then stir in the butter mixture to make a stiff dough. If it won’t quite come together, add a tiny splash of water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 2021, u'name': u'ginger powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Cut out the template (see below to download). Put a sheet of baking paper on your work surface and roll about one quarter of the dough to the thickness of two \xa31 coins.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Cut out one of the sections, then slide the gingerbread, still on its baking paper, onto a baking sheet. Repeat with remaining dough, re-rolling the trimmings, until you have two side walls, a front and back wall and two roof panels. Any leftover dough can be cut into Christmas trees, if you like.Pick out the most intact flaked almonds and gently poke them into the roof sections, pointy-end first, to look like roof tiles.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Bake all the sections for 12 mins or until firm and just a little darker at the edges. Leave to cool for a few mins to firm up, then trim around the templates again to give clean, sharp edges. Leave to cool completely.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the egg whites in a large bowl, sift in the icing sugar, then stir to make a thick, smooth icing. Spoon into a piping bag with a medium nozzle. Pipe generous snakes of icing along the wall edges, one by one, to join the walls together. Use a small bowl to support the walls from the inside, then allow to dry, ideally for a few hours.Once dry, remove the supports and fix the roof panels on. The angle is steep so you may need to hold these on firmly for a few mins until the icing starts to dry. Dry completely, ideally overnight. To decorate, pipe a little icing along the length of 20 mini chocolate fingers and stick these lengthways onto the side walls of the house. Use three, upright, for the door.Using the icing, stick sweets around the door and on the front of the house. To make the icicles, start with the nozzle at a 90-degree angle to the roof and squeeze out a pea-sized blob of icing. Keeping the pressure on, pull the nozzle down and then off – the icing will pull away, leaving a pointy trail. Repeat all around the front of the house.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [], u'step': u'Cut the chocolate mini roll or dipped Flake on an angle, then fix with icing to make a chimney. Pipe a little icing around the top. If you’ve made gingerbread trees, decorate these now, too, topping each with a silver ball, if using. Dust the roof with icing sugar for a snowy effect. Lay a winding path of sweets, and fix gingerbread trees around and about using blobs of icing. Your gingerbread house will be edible for about a week but will last a lot longer.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Gingerbread. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1895, u'instructions': u'Heat oven to 200C/fan 180C/gas 6. Melt the butter, sugar and syrup in a pan. Mix the flour, bicarbonate of soda and ground ginger into a large bowl, then stir in the butter mixture to make a stiff dough. If it won’t quite come together, add a tiny splash of water.Cut out the template (see below to download). Put a sheet of baking paper on your work surface and roll about one quarter of the dough to the thickness of two \xa31 coins. Cut out one of the sections, then slide the gingerbread, still on its baking paper, onto a baking sheet. Repeat with remaining dough, re-rolling the trimmings, until you have two side walls, a front and back wall and two roof panels. Any leftover dough can be cut into Christmas trees, if you like.Pick out the most intact flaked almonds and gently poke them into the roof sections, pointy-end first, to look like roof tiles. Bake all the sections for 12 mins or until firm and just a little darker at the edges. Leave to cool for a few mins to firm up, then trim around the templates again to give clean, sharp edges. Leave to cool completely.Put the egg whites in a large bowl, sift in the icing sugar, then stir to make a thick, smooth icing. Spoon into a piping bag with a medium nozzle. Pipe generous snakes of icing along the wall edges, one by one, to join the walls together. Use a small bowl to support the walls from the inside, then allow to dry, ideally for a few hours.Once dry, remove the supports and fix the roof panels on. The angle is steep so you may need to hold these on firmly for a few mins until the icing starts to dry. Dry completely, ideally overnight. To decorate, pipe a little icing along the length of 20 mini chocolate fingers and stick these lengthways onto the side walls of the house. Use three, upright, for the door.Using the icing, stick sweets around the door and on the front of the house. To make the icicles, start with the nozzle at a 90-degree angle to the roof and squeeze out a pea-sized blob of icing. Keeping the pressure on, pull the nozzle down and then off – the icing will pull away, leaving a pointy trail. Repeat all around the front of the house. Cut the chocolate mini roll or dipped Flake on an angle, then fix with icing to make a chimney. Pipe a little icing around the top. If you’ve made gingerbread trees, decorate these now, too, topping each with a silver ball, if using. Dust the roof with icing sugar for a snowy effect. Lay a winding path of sweets, and fix gingerbread trees around and about using blobs of icing. Your gingerbread house will be edible for about a week but will last a lot longer.', u'spoonacularSourceUrl': u'https://spoonacular.com/simple-gingerbread-house-217643', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 72, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}