{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/448120-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 448120, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Chicken with Herbed Stuffing', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 176.34, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup soft bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'5 teaspoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'1/8 teaspoon dried marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried marjoram', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2023, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 teaspoon grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup finely chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 boneless skinless chicken breast halves (6 ounces each)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast halves', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 1045062, u'unit': u'ounces'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/grilled-chicken-with-herbed-stuffing', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a small nonstick skillet coated with cooking spray, heat 2 teaspoons butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onion and garlic; cook and stir until tender. Stir in bread crumbs, parsley, 1/8 teaspoon salt, marjoram and thyme.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'id': 2023, u'name': u'marjoram'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Cut a pocket in the thickest part of each chicken breast. Fill with bread crumb mixture; secure with toothpicks. Sprinkle chicken with remaining salt. In a microwave, melt remaining butter; stir in lemon peel.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Moisten a paper towel with cooking oil; using long-handled tongs, rub on grill rack to coat lightly. Grill chicken over medium heat 6-9 minutes on each side or until chicken is no longer pink, brushing occasionally with butter mixture during the last 5 minutes of cooking. Discard toothpicks before serving.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Directions                                                                                In a small nonstick skillet coated with cooking spray, heat 2 teaspoons butter. Add onion and garlic; cook and stir until tender. Stir in bread crumbs, parsley, 1/8 teaspoon salt, marjoram and thyme.                                                                                            Cut a pocket in the thickest part of each chicken breast. Fill with bread crumb mixture; secure with toothpicks. Sprinkle chicken with remaining salt. In a microwave, melt remaining butter; stir in lemon peel.                                                                                           Moisten a paper towel with cooking oil; using long-handled tongs, rub on grill rack to coat lightly. Grill chicken over medium heat 6-9 minutes on each side or until chicken is no longer pink, brushing occasionally with butter mixture during the last 5 minutes of cooking. Discard toothpicks before serving.                                        Yield: 4 servings.                                                                                                                         Originally published as Grilled Chicken with Herbed Stuffing in  Simple & DeliciousAugust/September 2013, p18                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-chicken-with-herbed-stuffing-448120', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'thanksgiving', u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}