{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511756-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 511756, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mushroom Duxelles & Asparagus Grilled Cheese #SundaySupper', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 444.93, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'12 medium asparagus spears, ends trimmed; cut crosswise in half', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'medium', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'12 ounces button mushrooms, wiped clean with a damp towel; halved', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'with a damp towel; halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'8 slices crusty bread', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'slices'}, {u'originalString': u'2 garlic cloves, peeled', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'8 ounces Gruyere cheese, thinly sliced', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1023, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoon'}, {u'originalString': u'Kosher salt and ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons Gallo Family Vineyards Pinot Grigio', u'aisle': u'Alcoholic Beverages', u'name': u'pinot grigio', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14113, u'unit': u'tablespoons'}, {u'originalString': u'2 shallots, peeled and halved', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'peeled', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://foxeslovelemons.com/mushroom-duxelles-asparagus-grilled-cheese-sundaysupper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place garlic, shallots and mushrooms in food processor and pulse until everything is very finely chopped. In medium skillet, melt butter over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add mushroom mixture; season with salt and pepper. Cook 20 to 22 minutes or until mixture is browned and all moisture is evaporated; stirring frequently. Stir in wine and cream; cook 2 minutes.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Remove from heat and let cool slightly. Meanwhile, place asparagus on rimmed baking pan and lightly spray with cooking spray.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to oven and roast 5 minutes or until just barely tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Spread 4 slices of bread with mushroom mixture. Divide asparagus and cheese over mushroom mixture; top with remaining bread slices. Lightly spray large nonstick skillet or griddle with cooking spray; place sandwiches in cold skillet. Turn on stove for medium heat. Cook 6 minutes or until toasted; flip sandwiches and cook an additional 4 minutes or until both sides are toasted and cheese is melted.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2125, u'instructions': u'Preheat oven to 400 degrees F. Place garlic, shallots and mushrooms in food processor and pulse until everything is very finely chopped. In medium skillet, melt butter over medium heat. Add mushroom mixture; season with salt and pepper. Cook 20 to 22 minutes or until mixture is browned and all moisture is evaporated; stirring frequently. Stir in wine and cream; cook 2 minutes. Remove from heat and let cool slightly. Meanwhile, place asparagus on rimmed baking pan and lightly spray with cooking spray. Transfer to oven and roast 5 minutes or until just barely tender. Spread 4 slices of bread with mushroom mixture. Divide asparagus and cheese over mushroom mixture; top with remaining bread slices. Lightly spray large nonstick skillet or griddle with cooking spray; place sandwiches in cold skillet. Turn on stove for medium heat. Cook 6 minutes or until toasted; flip sandwiches and cook an additional 4 minutes or until both sides are toasted and cheese is melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-duxelles-asparagus-grilled-cheese-sundaysupper-511756', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}