{u'recipes': [{u'sourceName': u'The Lemon Bowl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/779510-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 779510, u'veryPopular': True, u'lowFodmap': False, u'title': u'5-Ingredient Sesame Ginger Green Beans', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 86.26, u'creditText': u'The Lemon Bowl', u'extendedIngredients': [{u'originalString': u'toasted almond slices - optional garnish', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'slices'}, {u'originalString': u'chili garlic paste - optional', u'aisle': u'Ethnic Foods', u'name': u'chili paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6973, u'unit': u'servings'}, {u'originalString': u'1 garlic clove - grated', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon grated ginger root', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup low sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'2 teaspoons toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoons'}, {u'originalString': u'4 cups green beans (about 1 pound) - stems trimmed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16033, u'unit': u'pound'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://thelemonbowl.com/2016/06/5-ingredient-sesame-ginger-green-beans.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/steamer.jpg', u'id': 404767, u'name': u'steamer basket'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a steamer basket inside a large sauce pot and fill with 3 inches of water. Bring to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add green beans to the pot and cover with lid. Steam until green beans are bright green and crisp-tender, about 7-9 minutes; remove from heat.In a large bowl, whisk together soy sauce, sesame oil, ginger, garlic and chili paste (if using).', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'id': 6973, u'name': u'chili paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add steamed green beans to the bowl and toss to coat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with toasted almond slices.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 579, u'instructions': u'Place a steamer basket inside a large sauce pot and fill with 3 inches of water. Bring to a boil.Add green beans to the pot and cover with lid. Steam until green beans are bright green and crisp-tender, about 7-9 minutes; remove from heat.In a large bowl, whisk together soy sauce, sesame oil, ginger, garlic and chili paste (if using). Add steamed green beans to the bowl and toss to coat. Serve with toasted almond slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/5-ingredient-sesame-ginger-green-beans-779510', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}