{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/304624-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 304624, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Lady and Sons Peach Cobbler', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 71.24, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 cup (1 stick) butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'Cinnamon, for sprinkling, optional', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'for sprinkling, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 2010, u'unit': u'servings'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 (28-ounce) can sliced peaches in heavy syrup, un-drained (use fresh peaches if available; see note*)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'sliced', u'canned', u'(use peaches if available; see note*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 9236, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups self-rising flour', u'aisle': u'Baking', u'name': u'self-rising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20129, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'Vanilla ice cream or fresh whipped cream, for serving', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/paula-deen/the-lady-and-sons-peach-cobbler-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Put butter in a 13 by 9 by 2-inch baking dish and place in the oven to melt. Stir sugar and flour together and mix well. Slowly add milk and continue stirring to prevent the batter from lumping.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Being careful not to burn yourself, remove hot baking dish containing melted butter from oven; pour batter directly over butter in baking dish. Do not stir.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spoon fruit on top of batter, then gently pour syrup on top. Do not stir. Sprinkle cinnamon on top of batter, if using. (The most important part of this dish is not stirring the mixture at this point in the recipe.)', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Bake for 30 to 45 minutes or until golden brown. Your batter will rise above your fruit, producing the most wonderful of crusts.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm with vanilla ice cream or fresh whipped cream.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cobbler works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port', u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Preheat oven to 350 degrees F.                          Put butter in a 13 by 9 by 2-inch baking dish and place in the oven to melt. Stir sugar and flour together and mix well. Slowly add milk and continue stirring to prevent the batter from lumping.                          Being careful not to burn yourself, remove hot baking dish containing melted butter from oven; pour batter directly over butter in baking dish. Do not stir.                          Spoon fruit on top of batter, then gently pour syrup on top. Do not stir. Sprinkle cinnamon on top of batter, if using. (The most important part of this dish is not stirring the mixture at this point in the recipe.)                          Bake for 30 to 45 minutes or until golden brown. Your batter will rise above your fruit, producing the most wonderful of crusts. Serve warm with vanilla ice cream or fresh whipped cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-lady-and-sons-peach-cobbler-304624', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}