{u'recipes': [{u'sourceName': u'Not Enough Cinnamon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542252-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 542252, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Marbella', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 480, u'pricePerServing': 257.43, u'creditText': u'Not Enough Cinnamon', u'extendedIngredients': [{u'originalString': u'2 tbsp balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp brown sugar (honey for paleo)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'for paleo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp capers, with brine', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'with brine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tbsp'}, {u'originalString': u'6 large chicken drumsticks', u'aisle': u'Meat', u'name': u'chicken drumsticks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5066, u'unit': u''}, {u'originalString': u'1 tbsp fresh parsley, chopped - to serve (optional)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1/2 tbsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tbsp'}, {u'originalString': u'3/4 cup pimiento stuffed olives, halved', u'aisle': u'Canned and Jarred', u'name': u'pimento stuffed olives', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-stuffed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1049195, u'unit': u'cup'}, {u'originalString': u'3/4 cup prunes, halved', u'aisle': u'Dried Fruits;Produce', u'name': u'prunes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9291, u'unit': u'cup'}, {u'originalString': u'1/4 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://notenoughcinnamon.com/2014/01/15/chicken-marbella/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 380.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'The night before, prepare the marinade. In a large ziplock bag, combine all marinade ingredients (chicken, prunes, olives, capers, garlic, olive oil, balsamic vinegar, oregano), shake well to make sure the chicken is well coated and all the ingredients are equally distributed. Marinate overnight.  Preheat oven to 380F. Arrange chicken in a baking dish and cover with marinade.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'id': 9291, u'name': u'prunes'}]}, {u'equipment': [], u'step': u'Pour wine around chicken and sprinkle with sugar (or honey if using).', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake between one hour and one hour and a half (depending on your oven) or until chicken is cooked through (it took me 1:20 to get it done)', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Chehalem INOX Chardonnay. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'The night before, prepare the marinade. In a large ziplock bag, combine all marinade ingredients (chicken, prunes, olives, capers, garlic, olive oil, balsamic vinegar, oregano), shake well to make sure the chicken is well coated and all the ingredients are equally distributed. Marinate overnight.  Preheat oven to 380F. Arrange chicken in a baking dish and cover with marinade. Pour wine around chicken and sprinkle with sugar (or honey if using). Bake between one hour and one hour and a half (depending on your oven) or until chicken is cooked through (it took me 1:20 to get it done)', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-marbella-542252', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 570, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}