{u'recipes': [{u'sourceName': u'Running with Spoons', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/832822-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 832822, u'veryPopular': False, u'lowFodmap': False, u'title': u'iced gingerbread greek yogurt pancakes', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 171.07, u'creditText': u'Running with Spoons', u'extendedIngredients': [{u'originalString': u'small amount of unsweetened almond milk (I used about 1/2 Tbsp)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 93607, u'unit': u'Tbsp'}, {u'originalString': u'1-2 Tbsp (15-30 ml) unsweetened almond milk**', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 15.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'ml'}, {u'originalString': u'1/2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 tsp coconut palm sugar', u'aisle': u'Baking', u'name': u'coconut palm sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'tsp'}, {u'originalString': u'2 large egg whites OR 1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/4 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'2-3 tsp molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tsp'}, {u'originalString': u'1/4 cup (60 g) plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'g'}, {u'originalString': u'1/2 cup (40 g) rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'1/2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 - 2 Tbsp (7 - 14 g) vanilla protein powder', u'aisle': u'Health Foods', u'name': u'vanilla protein powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 99076, u'unit': u'g'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.runningwithspoons.com/2016/12/04/iced-gingerbread-greek-yogurt-pancakes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Preheat a skillet over medium heat and generously coat it with cooking spray or oil. You want to make sure it's nice and hot before you start cooking your pancakes.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add all the pancake ingredients to a blender in the order listed and blend on high until the oats have fully broken down and the batter is smooth and frothy. Allow the batter to sit for a few minutes so that it has a chance to thicken up while you make the icing - simply mix both ingredients together in a small bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour the batter straight from the blender onto the skillet until desired size of pancakes is reached. Cook the pancakes until the edges have set and bubbles begin to form on the tops. Using a spatula, flip and cook for another 1-2 minutes.** Repeat until all the batter is gone, making sure to coat your skillet again with oil between each batch. Finally, top with icing or toppings of choice and enjoy!', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Greek Yogurt. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 117, u'instructions': u"Preheat a skillet over medium heat and generously coat it with cooking spray or oil. You want to make sure it's nice and hot before you start cooking your pancakes.Add all the pancake ingredients to a blender in the order listed and blend on high until the oats have fully broken down and the batter is smooth and frothy. Allow the batter to sit for a few minutes so that it has a chance to thicken up while you make the icing - simply mix both ingredients together in a small bowl.Pour the batter straight from the blender onto the skillet until desired size of pancakes is reached. Cook the pancakes until the edges have set and bubbles begin to form on the tops. Using a spatula, flip and cook for another 1-2 minutes.** Repeat until all the batter is gone, making sure to coat your skillet again with oil between each batch. Finally, top with icing or toppings of choice and enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/iced-gingerbread-greek-yogurt-pancakes-832822', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}