{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212973-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 212973, u'veryPopular': False, u'lowFodmap': True, u'title': u'Griddled langoustines with hazelnut butter', u'diets': [u'gluten free', u'primal', u'fodmap friendly', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 50.1, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 tsp hazelnuts, toasted', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12120, u'unit': u'tsp'}, {u'originalString': u'10 Scottish langoustines, heads removed, shelled, and tails left on', u'aisle': u'Seafood', u'name': u'langoustines', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/langoustine-or-prawns.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10015243, u'unit': u''}, {u'originalString': u'1 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'few parsley leaves, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaves'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/7770/griddled-langoustines-with-hazelnut-butter', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Thread the langoustines carefully onto  the skewers and chill for up to a day. For the butter, finely grate or chop half the hazelnuts (grating gives the nuttiest flavour), then roughly chop the rest. Tip into a small saucepan with the butter, parsley and  a little seasoning, then set aside. When ready to serve, melt the hazelnut butter in the pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/langoustine-or-prawns.jpg', u'id': 10015243, u'name': u'langoustines'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a griddle pan or barbecue, then brush the langoustines with the oil. Griddle each skewer for 1-2 mins, turning, until pink and just cooked. Pile on a platter, pour half the hazelnut butter over the langoustines, then serve the rest in a small bowl for dipping.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/langoustine-or-prawns.jpg', u'id': 10015243, u'name': u'langoustines'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish. View More', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Thread the langoustines carefully onto  the skewers and chill for up to a day. For the butter, finely grate or chop half the hazelnuts (grating gives the nuttiest flavour), then roughly chop the rest. Tip into a small saucepan with the butter, parsley and  a little seasoning, then set aside. When ready to serve, melt the hazelnut butter in the pan. Heat a griddle pan or barbecue, then brush the langoustines with the oil. Griddle each skewer for 1-2 mins, turning, until pink and just cooked. Pile on a platter, pour half the hazelnut butter over the langoustines, then serve the rest in a small bowl for dipping.', u'spoonacularSourceUrl': u'https://spoonacular.com/griddled-langoustines-with-hazelnut-butter-212973', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}