{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/839777-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 839777, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Sausages, Peppers, and Onions on Rolls', u'diets': [u'dairy free'], u'pricePerServing': 329.29, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 teaspoon balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'teaspoon'}, {u'originalString': u'4 sweet or hot Italian sausages (about 12 ounces total)', u'aisle': u'Meat', u'name': u'italian sausages', u'metaInformation': [u'sweet', u'italian', u'hot', u'( 12 ounces total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 7036, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 medium onion, cut into 1/4-inch slices', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'cut into 1/4-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 red bell pepper, cut into 1/4-inch rings', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into 1/4-inch rings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'2 individual hero, hoagie, or grinder rolls (each about 7 inches long by 3 inches wide)', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'(each 7 inches long by 3 inches wide)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}, {u'originalString': u'1 yellow bell pepper, cut into 1/4-inch rings', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'cut into 1/4-inch rings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/grilled-sausages-peppers-and-onions-on-rolls-12662', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare gill.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl drizzle 2 teaspoons oil over pepper rings, tossing to coat well. Secure each slice of onion horizontally with a wooden pick (to prevent separation into rings) and brush with remaining teaspoon oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill peppers and onions on an oiled rack set 5 to 6 inches over glowing coals 3 minutes on each side, or until tender. (Alternatively, peppers and onions may be grilled in batches in a hot well-seasoned ridged grill pan over moderately high heat.)', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer peppers and onions to a bowl, discarding wooden picks, and toss with Worcestershire sauce and vinegar.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Prick sausages with a fork and grill, turning them, until golden and just cooked through (about 160 F. on a instant-read thermometer), 10 to 15 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Halve sausages lengthwise and rolls horizontally and grill, cut sides down, 1 minute, or until sausages are cooked through but still juicy and rolls are toasted lightly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Divide peppers and onions between rolls and top with sausages.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'aggregateLikes': 144, u'instructions': u'Preparation                                        Prepare gill.                                                                            In a small bowl drizzle 2 teaspoons oil over pepper rings, tossing to coat well. Secure each slice of onion horizontally with a wooden pick (to prevent separation into rings) and brush with remaining teaspoon oil.                                                                            Grill peppers and onions on an oiled rack set 5 to 6 inches over glowing coals 3 minutes on each side, or until tender. (Alternatively, peppers and onions may be grilled in batches in a hot well-seasoned ridged grill pan over moderately high heat.)                                                                            Transfer peppers and onions to a bowl, discarding wooden picks, and toss with Worcestershire sauce and vinegar.                                                                            Prick sausages with a fork and grill, turning them, until golden and just cooked through (about 160 F. on a instant-read thermometer), 10 to 15 minutes.                                                                            Halve sausages lengthwise and rolls horizontally and grill, cut sides down, 1 minute, or until sausages are cooked through but still juicy and rolls are toasted lightly.                                                                            Divide peppers and onions between rolls and top with sausages.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-sausages-peppers-and-onions-on-rolls-839777', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}