{u'recipes': [{u'sourceName': u'Barbara Bakes', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/477783-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 477783, u'veryPopular': False, u'lowFodmap': False, u'title': u'Granola Chocolate Chip Toffee Bars', u'diets': [u'dairy free'], u'pricePerServing': 38.4, u'creditText': u'Barbara Bakes', u'extendedIngredients': [{u'originalString': u'1/2 cup low fat almond granola', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1 roll (16.5 oz) Pillsbury refrigerated chocolate chip cookie dough', u'aisle': u'Sweet Snacks', u'name': u'chocolate chip cookie', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chip-cookie.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.5, u'consistency': u'solid', u'id': 28027, u'unit': u'oz'}, {u'originalString': u'1/4 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup English toffee bits', u'aisle': u'Baking', u'name': u'toffee bits', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toffee-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19383, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.barbarabakes.com/2013/12/granola-chocolate-chip-toffee-bars/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350\xb0In large mixing bowl, add all ingredients and mix until the dough forms large clumps.Press dough firmly into a greased or foil lined 8x8 pan.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 20 to 25 minutes until golden brown. Cool completely, about 2 hours before cutting in to 4 rows by 4 rows.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Schmitt Sohne Relax Riesling with a 4.4 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'Relax Riesling is fermented slightly dry with a wonderful fruity bouquet and intense flavors of apples and peaches with just a hint of citrus. The natural acidity gives this wine a perfect balance that is refreshingly crisp and leaves your mouth watering. A perfect party wine, or can be enjoyed with a variety of foods from seafood and poultry to oriental food and fresh salads.', u'title': u'Schmitt Sohne Relax Riesling', u'price': u'$9.49', u'id': 434166, u'link': u'https://www.wine.com/product/schmitt-sohne-relax-riesling-2008/99841', u'imageUrl': u'https://spoonacular.com/productImages/434166-312x231.jpg'}]}, u'aggregateLikes': 186, u'instructions': u'Preheat oven to 350\xb0In large mixing bowl, add all ingredients and mix until the dough forms large clumps.Press dough firmly into a greased or foil lined 8x8 pan.Bake 20 to 25 minutes until golden brown. Cool completely, about 2 hours before cutting in to 4 rows by 4 rows.', u'spoonacularSourceUrl': u'https://spoonacular.com/granola-chocolate-chip-toffee-bars-477783', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}