{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508046-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 508046, u'veryPopular': True, u'lowFodmap': False, u'title': u'Beer-Battered Onion Rings', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 353.03, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'3 cups beer, divided', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'cups'}, {u'originalString': u'\xbe teaspoon black pepper, divided', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'\xbe cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 teaspoons malt vinegar (can substitute cider vinegar)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'malt vinegar', u'metaInformation': [u'(can substitute cider vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002053, u'unit': u'teaspoons'}, {u'originalString': u'2 quarts peanut oil (can substitute vegetable oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'(can substitute vegetable oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 2.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'quarts'}, {u'originalString': u'1 teaspoon salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'Salt & freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 sweet onions, peeled and sliced into \xbd-inch rounds', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u'peeled', u'sliced into \xbd-inch rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.browneyedbaker.com/2013/04/10/beer-battered-onion-rings/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 105, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'In a large, resealable plastic bag, place the onions, 2 cups of the beer, the vinegar, \xbd teaspoon of the salt and \xbd teaspoon of the pepper. Seal the bag and refrigerate for at least 30 minutes, or up to 2 hours (do not leave them for more than 2 hours, as the onions will get soggy).2.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Add the oil to a large Dutch oven or heavy-bottomed pot (it should come to a depth of about 2 inches).', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat the oil over medium-high heat to 350 degrees F. Line a baking sheet with a double layer of paper towels and set aside.3. While the oil is heating, prepare the batter. In a large bowl, whisk together the flour, cornstarch, baking powder, remaining \xbd teaspoon salt and \xbc teaspoon pepper. Slowly whisk in \xbe cup of the remaining beer until just combined (the batter will be lumpy).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in remaining beer, if needed, 1 tablespoon at a time. The batter should fall from the whisk in a steady stream and leave a slight trail across the batter. 4.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove the onions from the beer marinade, separate into rings and pat dry with paper towels. (Be sure that the onions are completely dry, or the batter will run off of them and not stick.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/skimmer-spoon.jpg', u'id': 405894, u'name': u'skimmer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Transfer one-third of the onion rings to the bowl with the batter, turning to coat each one. 5. Once the oil reaches 350 degrees F, begin frying the onion rings, dropping them one at a time into the hot oil with a pair of tongs. Be sure not to overcrowd the pot, or they will stick together. Fry the onion rings for about 5 minutes, or until golden brown, flipping them over halfway through cooking. Using tongs, a slotted spatula or spoon, or a spider skimmer, remove the fried onion rings to the paper towel-lined baking sheet. Allow the oil to return to 350 degrees F and continue frying in batches. Season the onion rings with salt and pepper and serve immediately with ketchup or your favorite dipping sauce (see below).Notes:An ale or lager is recommended for the beer in this recipe.If you want to keep the onion rings warm before serving, heat the oven to 200 degrees and after draining and seasoning the onion rings, transfer them to the warmed oven.My favorite dipping sauce is this Outback Bloomin' Onion Dipping Sauce recipe.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10014006, u'name': u'ale'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Perrier-Jouet Nuit Blanche with a 4.9 out of 5 star rating seems like a good match. It costs about 68 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'The sweeter taste, combined with the rounded and smooth mouth feel give the wine, a full body and richness that makes Perrier-Jou\xebt Nuit Blanche the perfect champagne to awaken the senses.Perrier-Jou\xebt Nuit Blanche is an exceptional Non-Vintage blend of 20% Chardonnay, 40% Pinot Noir and 40% Pinot Meunier, sweetened to taste with a 20g/l dosage of cane sugar to create a sensual style.', u'title': u'Perrier-Jouet Nuit Blanche', u'price': u'$67.99', u'id': 461023, u'link': u'https://www.wine.com/product/perrier-jouet-nuit-blanche/137331', u'imageUrl': u'https://spoonacular.com/productImages/461023-312x231.jpg'}]}, u'aggregateLikes': 1294, u'instructions': u"1. In a large, resealable plastic bag, place the onions, 2 cups of the beer, the vinegar, \xbd teaspoon of the salt and \xbd teaspoon of the pepper. Seal the bag and refrigerate for at least 30 minutes, or up to 2 hours (do not leave them for more than 2 hours, as the onions will get soggy).2. Add the oil to a large Dutch oven or heavy-bottomed pot (it should come to a depth of about 2 inches). Heat the oil over medium-high heat to 350 degrees F. Line a baking sheet with a double layer of paper towels and set aside.3. While the oil is heating, prepare the batter. In a large bowl, whisk together the flour, cornstarch, baking powder, remaining \xbd teaspoon salt and \xbc teaspoon pepper. Slowly whisk in \xbe cup of the remaining beer until just combined (the batter will be lumpy). Whisk in remaining beer, if needed, 1 tablespoon at a time. The batter should fall from the whisk in a steady stream and leave a slight trail across the batter. 4. Remove the onions from the beer marinade, separate into rings and pat dry with paper towels. (Be sure that the onions are completely dry, or the batter will run off of them and not stick.) Transfer one-third of the onion rings to the bowl with the batter, turning to coat each one. 5. Once the oil reaches 350 degrees F, begin frying the onion rings, dropping them one at a time into the hot oil with a pair of tongs. Be sure not to overcrowd the pot, or they will stick together. Fry the onion rings for about 5 minutes, or until golden brown, flipping them over halfway through cooking. Using tongs, a slotted spatula or spoon, or a spider skimmer, remove the fried onion rings to the paper towel-lined baking sheet. Allow the oil to return to 350 degrees F and continue frying in batches. Season the onion rings with salt and pepper and serve immediately with ketchup or your favorite dipping sauce (see below).Notes:An ale or lager is recommended for the beer in this recipe.If you want to keep the onion rings warm before serving, heat the oven to 200 degrees and after draining and seasoning the onion rings, transfer them to the warmed oven.My favorite dipping sauce is this Outback Bloomin' Onion Dipping Sauce recipe.", u'spoonacularSourceUrl': u'https://spoonacular.com/beer-battered-onion-rings-508046', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}