{u'recipes': [{u'sourceName': u'Panini Happy', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/252264-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 252264, u'veryPopular': True, u'lowFodmap': False, u'title': u'How to Make Pizza on the Panini Press', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 151.19, u'creditText': u'Panini Happy', u'extendedIngredients': [{u'originalString': u'12 ounces shredded part-skim mozzarella OR sliced fresh mozzarella', u'aisle': u'Cheese', u'name': u'part-skim mozzarella', u'metaInformation': [u'fresh', u'shredded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1028, u'unit': u'ounces'}, {u'originalString': u'1 pound fresh pizza dough, divided into 6 servings', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [u'fresh', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u'pound'}, {u'originalString': u'1/3 cup basil pesto or sundried tomato pesto', u'aisle': u'Pasta and Rice', u'name': u'sundried tomato pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomato-pesto.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93697, u'unit': u'cup'}, {u'originalString': u'Toppings', u'aisle': u'?', u'name': u'toppings', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://paninihappy.com/how-to-make-pizza-on-the-panini-press/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}], u'step': u'Heat the panini press to high heat. If your panini press comes with a tilt option, be sure it is set to flat.Preparing one pizza at a time, tear off a sheet of aluminum foil about the same size of your press.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Brush olive oil (or spray cooking spray) onto the surface, in about a 6-inch diameter area.Stretch a portion of dough into a (somewhat) circular shape. The dough will be very elastic – stretch it, wait a few minutes, then stretch it some more. Thinner is better to ensure it cooks thoroughly.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread a few tablespoons of pesto on the stretched dough.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add your cheese and toppings (see tips for choosing toppings in the post above).', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Transfer the aluminum foil to the panini press. Close the lid, allowing the upper grate to hover about 1 inch above the pizza (if you don’t have a panini maker that allows for a fixed height, you might try creating your own 1-inch spacers by balling up some aluminum foil).Grill the pizza until the dough is cooked through and lightly browned (it may bubble up a bit too) and the cheese is melted and bubbly, 6 to 8 minutes. Slice and serve immediately.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Hills Vineyard Rosato di Sangiovese. It has 5 out of 5 stars and a bottle costs about 15 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Our DRY ros\xe9 wine, made with Sangiovese grapes, is dry, yet fruity, and a perfect wine with our Texas foods, like Bar-B-Q and even hamburgers!! Taste raspberry, strawberry & cherry!', u'title': u'Hills Vineyard Rosato di Sangiovese', u'price': u'$14.95', u'id': 430938, u'link': u'https://www.amazon.com/Texas-Hills-Vineyard-Rosato-Sangiovese/dp/B00CHCHU8E', u'imageUrl': u'https://spoonacular.com/productImages/430938-312x231.jpg'}]}, u'aggregateLikes': 1255, u'instructions': u'Heat the panini press to high heat. If your panini press comes with a tilt option, be sure it is set to flat.Preparing one pizza at a time, tear off a sheet of aluminum foil about the same size of your press. Brush olive oil (or spray cooking spray) onto the surface, in about a 6-inch diameter area.Stretch a portion of dough into a (somewhat) circular shape. The dough will be very elastic – stretch it, wait a few minutes, then stretch it some more. Thinner is better to ensure it cooks thoroughly.Spread a few tablespoons of pesto on the stretched dough. Add your cheese and toppings (see tips for choosing toppings in the post above).Transfer the aluminum foil to the panini press. Close the lid, allowing the upper grate to hover about 1 inch above the pizza (if you don’t have a panini maker that allows for a fixed height, you might try creating your own 1-inch spacers by balling up some aluminum foil).Grill the pizza until the dough is cooked through and lightly browned (it may bubble up a bit too) and the cheese is melted and bubbly, 6 to 8 minutes. Slice and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/how-to-make-pizza-on-the-panini-press-252264', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}