{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/760543-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760543, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tsunami Dog', u'diets': [u'dairy free'], u'pricePerServing': 119.29, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 8-oz. can pineapple chunks, drained and chopped', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'drained', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'oz'}, {u'originalString': u'6 scallions, thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'6 buns, lightly toasted', u'aisle': u'Bakery/Bread', u'name': u'sub buns', u'metaInformation': [u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'6 Tbs. commercial teriyaki sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 6.0, u'consistency': u'solid', u'id': 6112, u'unit': u'Tbs'}, {u'originalString': u'6 vegetarian hot dogs', u'aisle': u'Frozen', u'name': u'vegetarian hot dogs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98968, u'unit': u''}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/tsunami-dog/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Split dogs lengthwise until nearly halved. Spray grill with cooking spray. Open each hot dog out almost flat, and place on grill. Weight down, if possible, to increase amount of surface touching grill; turn to grill other side. Put hot dogs split-side up in buns. Sprinkle each liberally with chopped pineapple and scallions, and top with 1 Tbs. teriyaki sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6112, u'name': u'teriyaki sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Gewurztraminer, and ros\xe9 Wine are my top picks for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. One wine you could try is Chateau Ste. Michelle Dry Riesling. It has 4.5 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters.', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Split dogs lengthwise until nearly halved. Spray grill with cooking spray. Open each hot dog out almost flat, and place on grill. Weight down, if possible, to increase amount of surface touching grill; turn to grill other side. Put hot dogs split-side up in buns. Sprinkle each liberally with chopped pineapple and scallions, and top with 1 Tbs. teriyaki sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/tsunami-dog-760543', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}