{u'recipes': [{u'sourceName': u'Eclectic Recipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/609810-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 609810, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Tostadas', u'diets': [u'gluten free'], u'pricePerServing': 166.81, u'creditText': u'Eclectic Recipes', u'extendedIngredients': [{u'originalString': u'sliced avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u'serving'}, {u'originalString': u'1 egg, scrambled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons queso fresco cheese', u'aisle': u'Cheese', u'name': u'queso fresco cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1228, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons diced tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'tablespoons'}, {u'originalString': u'1 tostada', u'name': u'tostada', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 18952, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://eclecticrecipes.com/breakfast-tostadas', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Scramble eggs to desired doneness and place on top of tostada. Top with queso fresco cheese, cilantro, dice tomato and sliced avocados.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'id': 1228, u'name': u'queso fresco'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tostada-shell.jpg', u'id': 18952, u'name': u'tostadas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve and enjoy!', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tostadas on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The J Vineyards & Winery Pinot Noir with a 5 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'At J, we are devoted to the concept of terroir in the Russian River Valley, and our 2013 J Vineyards Pinot Noir is a reflection of this vintage, the vineyards and our attention to detail in the winery. Delivering bright berry flavors-red cherry, raspberry and blackberry- this elegant Pinot is enhanced by notes of licorice and red tea, which linger on the finish. Aromas of wild strawberries and spices delight the nose.', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Scramble eggs to desired doneness and place on top of tostada. Top with queso fresco cheese, cilantro, dice tomato and sliced avocados. Serve and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-tostadas-609810', u'dishTypes': [u'antipasti', u'lunch', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u"hor d'oeuvre", u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}