{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597593-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 597593, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Mascarpone Tart', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 136.7, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'6 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'9 ounces cookies, such as almond, orange or sweet oat', u'aisle': u'Sweet Snacks', u'name': u'cookies', u'metaInformation': [u'sweet', u' such as almond, orange or  oat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'liquid', u'id': 10118192, u'unit': u'ounces'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups mascarpone cheese', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 93820, u'unit': u'cups'}, {u'originalString': u'1/2 to 1/3 pound strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 9316, u'unit': u'pound'}, {u'originalString': u'Generous tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'2 drops vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'drops'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://leitesculinaria.com/44130/recipes-strawberry-mascarpone-tart.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Make the crumb base1. Melt the butter in a small saucepan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Remove from the heat.2. Crush the cookies to a coarse powder. A food processor will do this in seconds or you can put the cookies in a plastic bag and bash them with a rolling pin. (Do this gently or the bag will split.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the crumbs to the butter and thoroughly mix.3. Spoon the crumbs into the tart pan and smooth them into the corners and up the sides. Press firmly, but not so hard that they become compacted. The cookie base is better when short and crumbly.4. Refrigerate until the base has set, at least a couple of hours.Make the filling5. Separate the egg, put the yolk in a bowl with the sugar and beat for a few seconds until thoroughly mixed.6. Beat in the mascarpone till you have a custard-colored cream.7. Stir in a little vanilla extract. A couple of drops should be enough.8. With a clean whisk, beat the egg white till it stands stiff, then fold it into the creamed mascarpone.Assemble the tart9. Spoon the mascarpone into the cookie crust, spreading it smoothly right out to the edges.10. Hull the strawberries, slice them thinly, then arrange them on top of the mascarpone.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve immediately or cover loosely and refrigerate.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the tart from the refrigerator a good 20 minutes before slicing and serving.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tart works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'Make the crumb base1. Melt the butter in a small saucepan. Remove from the heat.2. Crush the cookies to a coarse powder. A food processor will do this in seconds or you can put the cookies in a plastic bag and bash them with a rolling pin. (Do this gently or the bag will split.) Add the crumbs to the butter and thoroughly mix.3. Spoon the crumbs into the tart pan and smooth them into the corners and up the sides. Press firmly, but not so hard that they become compacted. The cookie base is better when short and crumbly.4. Refrigerate until the base has set, at least a couple of hours.Make the filling5. Separate the egg, put the yolk in a bowl with the sugar and beat for a few seconds until thoroughly mixed.6. Beat in the mascarpone till you have a custard-colored cream.7. Stir in a little vanilla extract. A couple of drops should be enough.8. With a clean whisk, beat the egg white till it stands stiff, then fold it into the creamed mascarpone.Assemble the tart9. Spoon the mascarpone into the cookie crust, spreading it smoothly right out to the edges.10. Hull the strawberries, slice them thinly, then arrange them on top of the mascarpone. Serve immediately or cover loosely and refrigerate. Remove the tart from the refrigerator a good 20 minutes before slicing and serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-mascarpone-tart-597593', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 140, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}