{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/470631-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 470631, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Roasted Red Pepper and Ham Sandwich', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 246.99, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 teaspoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'2 thin slices ham', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10151, u'unit': u'slices'}, {u'originalString': u'2 slices provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'1/2 roasted red pepper packed in oil, drained and sliced', u'aisle': u'Canned and Jarred', u'name': u'roasted red pepper', u'metaInformation': [u'red', u'packed in oil, drained and sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11916, u'unit': u''}, {u'originalString': u'2 teaspoons grated Parmesan or Romano cheese', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1038, u'unit': u'teaspoons'}, {u'originalString': u'2 slices sourdough bread', u'aisle': u'Bakery/Bread', u'name': u'sourdough bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sourdough-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10118029, u'unit': u'slices'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Grilled-Roasted-Red-Pepper-and-Ham-Sandwich/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Spread mayonnaise onto one side of each slice of bread. On one slice of bread, place one slice of provolone cheese, then ham, red peppers, and the other slice of cheese. Top with the other slice of bread with the mayonnaise facing the filling. Butter the outsides of the sandwich, and sprinkle a little bit of Parmesan cheese onto the butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a skillet over medium heat until warm. Fry the sandwich on both sides until golden brown and cheese is melted. If you have an indoor grill, this sandwich may be grilled that way also.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the sandwich in half, and serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 33, u'instructions': u'Spread mayonnaise onto one side of each slice of bread. On one slice of bread, place one slice of provolone cheese, then ham, red peppers, and the other slice of cheese. Top with the other slice of bread with the mayonnaise facing the filling. Butter the outsides of the sandwich, and sprinkle a little bit of Parmesan cheese onto the butter.                            Heat a skillet over medium heat until warm. Fry the sandwich on both sides until golden brown and cheese is melted. If you have an indoor grill, this sandwich may be grilled that way also. Cut the sandwich in half, and serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-roasted-red-pepper-and-ham-sandwich-470631', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}