{u'recipes': [{u'sourceName': u'The Messy Baker', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/573928-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 573928, u'veryPopular': False, u'lowFodmap': False, u'title': u'Surreal Chocolate Wontons', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 84.25, u'creditText': u'The Messy Baker', u'extendedIngredients': [{u'originalString': u'1 banana, peeled and sliced in \xbc-inch-thick (6 mm) slices', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'peeled', u'sliced in \xbc-inch-thick (6 mm) slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'\xbc cup (60 mL) peanut butter (smooth or crunchy—your choice!)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'(smooth or crunchy—your choice!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 60.0, u'consistency': u'solid', u'id': 16098, u'unit': u'mL'}, {u'originalString': u'Peanut oil (for deep frying)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'for deep frying', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'servings'}, {u'originalString': u'8 Rolo or Caramilk bar segments', u'aisle': u'Sweet Snacks', u'name': u'twix bar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/twix-bar.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 19160, u'unit': u''}, {u'originalString': u'8 3\xbd-inch (9 cm) square wonton wrappers', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'(9 cm)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 83.5, u'consistency': u'solid', u'id': 10018368, u'unit': u'inch'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://themessybaker.com/2011/02/24/recipe-surreal-chocolate-wontons/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a small bowl of warm water beside wonton wrappers. Put a single wonton wrapper on a clean, dry surface in front of you. Schmear 1 teaspoon (5 mL) of peanut butter onto the center. Press down a banana slice on top of peanut butter and top with chocolate. Dip your finger in water and trace a circle on the wonton wrapper around the stack of ingredients (water is the glue of wonton wrappers). Pinch and seal wrapper around the ingredients. Be sure that seams are tightly sealed to keep frying oil from seeping in.Before frying, see Fear of Frying (page 246).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'id': 10018368, u'name': u'wonton wrappers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour oil into a small, tall pot until it is 3 inches (8 cm) deep.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Heat oil until it reaches 350\xb0F (177\xb0C). When oil is ready, fry 4 wontons at a time for approximately 1 minute, or until wonton wrappers are golden brown.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'id': 10018368, u'name': u'wonton wrappers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove and place on a paper towel to absorb excess oil.Dust with sugar (if desired).', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool for 1 minute before serving.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Wontons. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'Place a small bowl of warm water beside wonton wrappers. Put a single wonton wrapper on a clean, dry surface in front of you. Schmear 1 teaspoon (5 mL) of peanut butter onto the center. Press down a banana slice on top of peanut butter and top with chocolate. Dip your finger in water and trace a circle on the wonton wrapper around the stack of ingredients (water is the glue of wonton wrappers). Pinch and seal wrapper around the ingredients. Be sure that seams are tightly sealed to keep frying oil from seeping in.Before frying, see Fear of Frying (page 246).Pour oil into a small, tall pot until it is 3 inches (8 cm) deep. Heat oil until it reaches 350\xb0F (177\xb0C). When oil is ready, fry 4 wontons at a time for approximately 1 minute, or until wonton wrappers are golden brown. Remove and place on a paper towel to absorb excess oil.Dust with sugar (if desired). Let cool for 1 minute before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/surreal-chocolate-wontons-573928', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}