{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'mexican'], u'cheap': False, u'gaps': u'no', u'id': 725638, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skirt Steak Fajitas', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 642.89, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1/2 cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons finely minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons minced jalape\xf1o pepper', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup fresh lime juice (about 4 limes)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'( 4 limes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'Salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 skirt steaks (about 1 1/2 pounds each)', u'aisle': u'Meat', u'name': u'steaks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 23232, u'unit': u'pounds'}], u'healthScore': 37.0, u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Skirt-Steak-Fajitas-240848', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the steak crosswise into 2 to 4 pieces and place in a bowl. In a separate bowl, combine the remaining ingredients; pour over the steak, turning it to coat well. Marinate overnight, covered, in the refrigerator, turning once or twice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Remove from the refrigerator 30 minutes before cooking.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Preheat the broiler.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove the steak from the marinade, scrape off any bits and place on a baking sheet. Broil 4 inches from heat source for 3 minutes per side for medium-rare meat.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Let rest 10 to 15 minutes. Slice the meat thinly. (For easy eating, the steak strips should be 1/4- to 1/2-inch thick.) To assemble fajitas, click here .', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Nutritional analysis per serving (steak and marinade only): 290 calories, 1 g carbohydrate, 36 g protein, 15 g fat, 95 mg cholesterol', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Nutritional analysis provided by PARADE', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try Rombauer Merlot. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 26 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Enticing and lively red color; beautifully aromatic with black cherry and ripe plum. On the palate a purity of blackcurrant, cedar and mint flavors blend together seamlessly. Soft and supple, this wine has a medium-bodied mouth-feel with plush tannins that integrate with the generous finish.Our favorite pairings for this wine include chicken parmesan, cedar-planked salmon over wild rice, and mushroom pizza.', u'title': u'Rombauer Merlot', u'price': u'$25.59', u'id': 447938, u'link': u'https://www.wine.com/product/rombauer-merlot-2008/116883', u'imageUrl': u'https://spoonacular.com/productImages/447938-312x231.jpg'}]}, u'aggregateLikes': 643, u'instructions': u'Preparation                                        1. Cut the steak crosswise into 2 to 4 pieces and place in a bowl. In a separate bowl, combine the remaining ingredients; pour over the steak, turning it to coat well. Marinate overnight, covered, in the refrigerator, turning once or twice. Remove from the refrigerator 30 minutes before cooking.                                                                            2. Preheat the broiler. Remove the steak from the marinade, scrape off any bits and place on a baking sheet. Broil 4 inches from heat source for 3 minutes per side for medium-rare meat. Let rest 10 to 15 minutes. Slice the meat thinly. (For easy eating, the steak strips should be 1/4- to 1/2-inch thick.) To assemble fajitas, click here .                                    Nutritional analysis per serving (steak and marinade only): 290 calories, 1 g carbohydrate, 36 g protein, 15 g fat, 95 mg cholesterolNutritional analysis provided by PARADE', u'spoonacularSourceUrl': u'https://spoonacular.com/skirt-steak-fajitas-725638', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}