{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/388990-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 388990, u'veryPopular': False, u'lowFodmap': False, u'title': u'Steak on a Stick', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 205.42, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 beef flank steak (1-1/2 pounds)', u'aisle': u'Meat', u'name': u'beef steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23232, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ground mustard', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'2 tablespoons molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/steak-on-a-stick', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Freeze steak for 1-1/2 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut diagonally into 1/4-in. slices. In a small bowl, combine the remaining ingredients.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour 1/4 cup into another small bowl for basting; cover and refrigerate.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Pour remaining marinade into a large resealable plastic bag; add beef. Seal bag and turn to coat; refrigerate for at least 4 hours.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Drain and discard marinade. Thread beef ribbon-style on 12 metal or soaked wooden skewers. Using long-handled tongs, moisten a paper towel with cooking oil and lightly coat the grill rack.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill beef, covered, over medium heat or broil 4 in. from the heat for 3-4 minutes on each side or until meat reaches desired doneness(for medium, a meat thermometer should read 165\xb0; well-done 180\xb0), basting frequently with reserved marinade.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak can be paired with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Franciscan Estate Merlot with a 4.3 out of 5 star rating seems like a good match. It costs about 25 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Our Oakville estate produces distinctive, supple Merlot characterized by flavors of cherries and plums.  This wine shows rich, lush and velvety fruit flavors of cherries, plums and blackberries that merge with light toasted oak.  Blended with a samll percentage of Cabernet Sauvignon and Cabernet Franc this wine is well balanced and structured with a lingering finish.Alcohol: 13.5% View More', u'title': u'Franciscan Estate Merlot', u'price': u'$25.49', u'id': 443286, u'link': u'https://www.wine.com/product/franciscan-estate-merlot-1998/7308', u'imageUrl': u'https://spoonacular.com/productImages/443286-312x231.jpg'}]}, u'aggregateLikes': 48, u'instructions': u'Directions                                                                                Freeze steak for 1-1/2 hours. Cut diagonally into 1/4-in. slices. In a small bowl, combine the remaining ingredients. Pour 1/4 cup into another small bowl for basting; cover and refrigerate. Pour remaining marinade into a large resealable plastic bag; add beef. Seal bag and turn to coat; refrigerate for at least 4 hours.                                                                                           Drain and discard marinade. Thread beef ribbon-style on 12 metal or soaked wooden skewers. Using long-handled tongs, moisten a paper towel with cooking oil and lightly coat the grill rack.                                                                                           Grill beef, covered, over medium heat or broil 4 in. from the heat for 3-4 minutes on each side or until meat reaches desired doneness(for medium, a meat thermometer should read 165\xb0; well-done 180\xb0), basting frequently with reserved marinade.                                        Yield: 6 servings.                                                                                                                         Originally published as Steak on a Stick in  Light & TastyAugust/September 2001, p39                                                                                                                                                                                                        Nutritional Facts                                                                             One serving (2 each) equals 201 calories, 9 g fat (4 g saturated fat), 57 mg cholesterol, 617 mg sodium, 5 g carbohydrate, trace fiber, 24 g protein. Diabetic Exchanges: 3 lean meat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/steak-on-a-stick-388990', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}