{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/794983-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 794983, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Strawberry Popsicles with Coconut', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 385, u'pricePerServing': 69.43, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'1 tablespoon maple syrup or agave syrup', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tablespoon'}, {u'originalString': u'2 cups fresh strawberries, plus 8 sliced strawberries \xbc-inch thick', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'thick', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'1 can (about 13.5 ounces) unsweetened coconut milk, divided', u'aisle': u'Canned and Jarred', u'name': u'unsweetened coconut milk', u'metaInformation': [u'unsweetened', u'divided', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.5, u'consistency': u'liquid', u'id': 12117, u'unit': u'ounces'}, {u'originalString': u'\xbd cup unsweetened shredded coconut, lightly toasted', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened', u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.jessicagavin.com/vegan-strawberry-popsicles-with-coconut/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a small pan add shredded coconut and toast over medium heat for about 5 minutes, or until lightly browned. Shake pan every minute to distribute the coconut for even toasting.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and transfer to small bowl.To a blender add 2 cups strawberries, 1 cup coconut milk, 1 tablespoon maple syrup and about  cup toasted coconut flakes. Puree for about 30 seconds, or until just blended with some small strawberry pieces remaining.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'id': 12108, u'name': u'coconut flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a medium sized bowl.In an 8 piece serving mold, add one strawberry slice to the bottom of each mold.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Add each popsicle layer in the following order: 1 tablespoon strawberry mix, 1 teaspoon coconut milk, 1 tablespoon strawberry mix, 1 teaspoon coconut milk, 1 tablespoon strawberry mix, 1 teaspoon coconut milk, and 1 teaspoon toasted coconut flakes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'id': 12108, u'name': u'coconut flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-sticks.jpg', u'id': 408704, u'name': u'popsicle sticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Put the cover on the mold and insert the popsicle sticks about halfway. Freeze until completely frozen, about 6 hours or overnight.To remove the popsicle, use warm water over the molds for about 10 seconds, then pull the sticks to carefully withdraw the popsicle. Repeat the water process as needed. Eat immediately or transfer pops to small individual plastic bags and freeze right away.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 53, u'instructions': u'In a small pan add shredded coconut and toast over medium heat for about 5 minutes, or until lightly browned. Shake pan every minute to distribute the coconut for even toasting. Remove from heat and transfer to small bowl.To a blender add 2 cups strawberries, 1 cup coconut milk, 1 tablespoon maple syrup and about  cup toasted coconut flakes. Puree for about 30 seconds, or until just blended with some small strawberry pieces remaining. Transfer to a medium sized bowl.In an 8 piece serving mold, add one strawberry slice to the bottom of each mold. Add each popsicle layer in the following order: 1 tablespoon strawberry mix, 1 teaspoon coconut milk, 1 tablespoon strawberry mix, 1 teaspoon coconut milk, 1 tablespoon strawberry mix, 1 teaspoon coconut milk, and 1 teaspoon toasted coconut flakes. Put the cover on the mold and insert the popsicle sticks about halfway. Freeze until completely frozen, about 6 hours or overnight.To remove the popsicle, use warm water over the molds for about 10 seconds, then pull the sticks to carefully withdraw the popsicle. Repeat the water process as needed. Eat immediately or transfer pops to small individual plastic bags and freeze right away.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-strawberry-popsicles-with-coconut-794983', u'dishTypes': [u'side dish'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 390, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}