{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597921-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 597921, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Spiced Bourbon Toddies', u'diets': [u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 251.06, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 quart (4 cups) fresh apple cider', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1009016, u'unit': u'cups'}, {u'originalString': u'1 cup good-quality bourbon, or, if you must, whiskey', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'cup'}, {u'originalString': u'4 pats butter (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u''}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 whole star anise, plus 4 more for garnish', u'aisle': u'Spices and Seasonings', u'name': u'whole star anise', u'metaInformation': [u'whole', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://leitesculinaria.com/77167/recipes-hot-toddies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the cider, cinnamon, and star anise in a small saucepan and bring to a simmer over medium heat. Cook until the liquid has reduced by half and has intensified in flavor, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Add the lemon juice and bourbon and stir until warmed through. If desired, place over low, low heat and cover partially to keep warm until needed.2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}]}, {u'equipment': [], u'step': u'Pour into warmed mugs or snifters and garnish with a cinnamon stick and star anise and, if desired, a pat of butter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 306, u'instructions': u'1. Place the cider, cinnamon, and star anise in a small saucepan and bring to a simmer over medium heat. Cook until the liquid has reduced by half and has intensified in flavor, about 10 minutes. Add the lemon juice and bourbon and stir until warmed through. If desired, place over low, low heat and cover partially to keep warm until needed.2. Pour into warmed mugs or snifters and garnish with a cinnamon stick and star anise and, if desired, a pat of butter.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-spiced-bourbon-toddies-597921', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}