{u'recipes': [{u'sourceName': u'Citronlimette', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508319-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 508319, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Apple Bread in a Jar', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 84.15, u'creditText': u'Citronlimette', u'extendedIngredients': [{u'originalString': u'1 large finely diced, peeled apple, Granny Smith', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'diced', u'large', u'peeled', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1\xbd cups unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9019, u'unit': u'cups'}, {u'originalString': u'\xbd tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'\xbe cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'2 tbsp coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'2 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'\xbd cup quick oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. pumpkin spices', u'aisle': u'Spices and Seasonings', u'name': u'spices', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2035, u'unit': u'tsp'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'1 cup white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93824, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://citronlimette.com/recipe_archive/desserts/skinny-apple-bread-jar/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F. Prepare the mason jars by greasing the insides of the jars with cooking spray.In a large mixing bowl, beat together the coconut oil and sugar with an electric mixer until well incorporated. Beat in the egg whites, applesauce, and vanilla extract until light and fluffy.In a separate bowl, mix together the flour, oats, baking powder, baking soda, salt, cinnamon and pumpkin spices, and pour into the applesauce mixture a little at a time mixing well with each addition. Fold in diced apples and walnuts.Spoon batter into mason jars filling \xbd way full. Wipe off any spills on the jars before baking. Do not add the lids.Line the jars on a baking sheet and bake for 40-45 minutes of until a toothpick inserted in the center comes out clean.Meanwhile, sterilize the lids and rings in boiling water.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 2035, u'name': u'spices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the jars from the oven and screw on the lids and rings to the jars while the bread is cooling. The jars will seal as the bread cools down. You will hear a light “ping” when the jar seals itself. If you don’t, press down on the lid to see if it is firm. If it doesn’t “give”, it is sealed. Also, if the bread bakes above the rim of the jar, no worries. Just gently press the top of the bread down with the lid and seal.Store in the refrigerator for up to a week.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2354, u'instructions': u'Preheat oven to 325 degrees F. Prepare the mason jars by greasing the insides of the jars with cooking spray.In a large mixing bowl, beat together the coconut oil and sugar with an electric mixer until well incorporated. Beat in the egg whites, applesauce, and vanilla extract until light and fluffy.In a separate bowl, mix together the flour, oats, baking powder, baking soda, salt, cinnamon and pumpkin spices, and pour into the applesauce mixture a little at a time mixing well with each addition. Fold in diced apples and walnuts.Spoon batter into mason jars filling \xbd way full. Wipe off any spills on the jars before baking. Do not add the lids.Line the jars on a baking sheet and bake for 40-45 minutes of until a toothpick inserted in the center comes out clean.Meanwhile, sterilize the lids and rings in boiling water.Remove the jars from the oven and screw on the lids and rings to the jars while the bread is cooling. The jars will seal as the bread cools down. You will hear a light “ping” when the jar seals itself. If you don’t, press down on the lid to see if it is firm. If it doesn’t “give”, it is sealed. Also, if the bread bakes above the rim of the jar, no worries. Just gently press the top of the bread down with the lid and seal.Store in the refrigerator for up to a week.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-apple-bread-in-a-jar-508319', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}