{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/248996-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 248996, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten-Free Lemon Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 27.94, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'3-4 boneless chicken servings', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1025006, u'unit': u''}, {u'originalString': u'2 tbsp wine or cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp demerara sugar', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 10019908, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp gram flour [otherwise known as chickpea or garbanzo flour]', u'aisle': u'Gluten Free;Ethnic Foods;Health Foods', u'name': u'garbanzo flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 16157, u'unit': u'tbsp'}, {u'originalString': u'Juice and grated zest of 2 lemons', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'3 tbsp vegetable oil (for frying)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/entrees/lemon-chicken-egg-free-gluten-free-nut-free-soy-free', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Put the flour into a small plastic bag. Dice the chicken portions into bite-sized pieces and put them into the bag with the flour. Shake it about until the chicken pieces are evenly coated, then lift them out – leaving any spare flour in the bag (it will get used later).For the sauce, mix the lemon zest, lemon juice, sugar and vinegar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat on full power in the microwave or in a saucepan until the sugar has dissolved. Set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the vegetable oil in a large wok or frying pan. Fry the chicken pieces until they are golden brown and cooked through.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [], u'step': u'Add the lemon sauce and any remaining flour, and stir well. Allow to cook for another couple of minutes.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately with rice and steamed vegetables.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Put the flour into a small plastic bag. Dice the chicken portions into bite-sized pieces and put them into the bag with the flour. Shake it about until the chicken pieces are evenly coated, then lift them out – leaving any spare flour in the bag (it will get used later).For the sauce, mix the lemon zest, lemon juice, sugar and vinegar. Heat on full power in the microwave or in a saucepan until the sugar has dissolved. Set aside.Heat the vegetable oil in a large wok or frying pan. Fry the chicken pieces until they are golden brown and cooked through. Add the lemon sauce and any remaining flour, and stir well. Allow to cook for another couple of minutes.Serve immediately with rice and steamed vegetables.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-lemon-chicken-248996', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}