{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/630601-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 630601, u'veryPopular': False, u'lowFodmap': False, u'title': u'Herbed Chicken and Mushrooms', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 217.12, u'extendedIngredients': [{u'originalString': u'1/4-1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 cups hot cooked whole wheat and/or spinach fettuccine or linguine, or hot cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'whole wheat', u'hot', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'1 medium carrot, chopped (1/2 cup)', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1/4 cup dry white wine or reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'dry white', u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'12 small chicken thighs and/or drumsticks (about 3 pounds total), skinned', u'aisle': u'Meat', u'name': u'chicken drumsticks and thighs', u'metaInformation': [u'small', u'( 3 pounds total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 1005006, u'unit': u''}, {u'originalString': u'1/2 teaspoon dried basil, crushed', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried thyme, crushed', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'5 cups sliced assorted fresh mushrooms (such as shiitake, button, cremini, and oyster)', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'assorted', u'sliced', u'(such as shiitake, button, cremini, and oyster)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1 medium onion, chopped (1/2 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'3 tablespoons quick-cooking tapioca', u'aisle': u'Baking', u'name': u'quick cooking tapioca', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93660, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup dried tomato pieces (not oil-packed)', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'dried', u'(not oil-packed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.diabeticlivingonline.com/recipe/herbed-chicken-and-mushrooms', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a 4- to 5-quart slow cooker combine mushrooms, onion, carrot, and dried tomato pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add chicken broth and wine. Sprinkle with tapioca, thyme, dried basil, salt, and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2003, u'name': u'dried basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add chicken pieces to cooker.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}]}, {u'equipment': [], u'step': u'Cover and cook on low-heat setting for 7 to 8 hours or on high-heat setting for 3 1/2 to 4 hours.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer chicken and vegetables to a serving platter. Spoon some of the cooking liquid over the top.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Serve with hot cooked pasta. If desired, garnish with fresh basil.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 26, u'instructions': u'In a 4- to 5-quart slow cooker combine mushrooms, onion, carrot, and dried tomato pieces. Add chicken broth and wine. Sprinkle with tapioca, thyme, dried basil, salt, and pepper. Add chicken pieces to cooker.                                  Cover and cook on low-heat setting for 7 to 8 hours or on high-heat setting for 3 1/2 to 4 hours.                                  Transfer chicken and vegetables to a serving platter. Spoon some of the cooking liquid over the top. Serve with hot cooked pasta. If desired, garnish with fresh basil.', u'spoonacularSourceUrl': u'https://spoonacular.com/herbed-chicken-and-mushrooms-630601', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}