{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/716653-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 716653, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spicy Shrimp Tacos with Garlic Cilantro Lime Slaw', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 387.01, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'1-2 avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbc teaspoon cayenne pepper (more or less to taste)', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'to taste', u'(more or less )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon each chili powder, cumin, and southwestern seasoning (see notes)', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'(see notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup cilantro leaves', u'aisle': u'Produce', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'8 small corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'Cotija cheese and additional cilantro for topping', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001019, u'unit': u'servings'}, {u'originalString': u"2-3 cloves garlic (less if you're sensitive to garlicky things)", u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u"(less if you're sensitive to garlicky things)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2-3 cups shredded green cabbage', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'shredded', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cups'}, {u'originalString': u'\xbd cup chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'juice of 2 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'lime wedges for serving', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'\xbc cup oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 lb. shrimp, peeled and deveined, tails removed', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'\xbd cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://pinchofyum.com/spicy-shrimp-tacos-with-garlic-cilantro-lime-slaw', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Pulse all the sauce ingredients except the sour cream in a food processor. When mostly smooth, add the sour cream and pulse until combined. Taste and adjust as needed. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a drizzle of oil a large skillet over medium high heat. Pat the shrimp dry with paper towels and sprinkle with the spices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the shrimp to the hot pan and saute for 5-8 minutes, flipping occasionally, until the shrimp are cooked through.Toss some of the sauce (not all) with the cabbage until it the cabbage is coated to your liking. It should resemble a coleslaw - you want it to be enough sauce so the cabbage is weighed down a little bit. Use leftover sauce on top of the tacos or in other recipes.To serve tacos, smash a spoonful of avocado on the tortillas, top with a few pieces of shrimp, top with coleslaw, and finish with Cotjia cheese, cilantro, and lime wedges.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'aggregateLikes': 103141, u'instructions': u'Pulse all the sauce ingredients except the sour cream in a food processor. When mostly smooth, add the sour cream and pulse until combined. Taste and adjust as needed. Set aside.Heat a drizzle of oil a large skillet over medium high heat. Pat the shrimp dry with paper towels and sprinkle with the spices. Add the shrimp to the hot pan and saute for 5-8 minutes, flipping occasionally, until the shrimp are cooked through.Toss some of the sauce (not all) with the cabbage until it the cabbage is coated to your liking. It should resemble a coleslaw - you want it to be enough sauce so the cabbage is weighed down a little bit. Use leftover sauce on top of the tacos or in other recipes.To serve tacos, smash a spoonful of avocado on the tortillas, top with a few pieces of shrimp, top with coleslaw, and finish with Cotjia cheese, cilantro, and lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-shrimp-tacos-with-garlic-cilantro-lime-slaw-716653', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}