{u'recipes': [{u'sourceName': u'Onion Rings And Things', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/503184-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 503184, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Burritos', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 171.25, u'creditText': u'Onion Rings And Things', u'extendedIngredients': [{u'originalString': u'1/2 medium bell pepper, seeded and chopped', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'medium', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'cheddar cheese, grated', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'servings'}, {u'originalString': u'4 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 9-inch flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'9-inchs', u'unitShort': u'9-inch', u'amount': 8.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'9-inch'}, {u'originalString': u'1/2 cup oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 small onion, peeled and chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 pound pork sausage, crumbled', u'aisle': u'Meat', u'name': u'pork sausage', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 1007063, u'unit': u'pound'}, {u'originalString': u'4 to 5 medium red potatoes, cut into 1-inch cubes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'red', u'medium', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'salsa, store bought', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'store bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'servings'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.onionringsandthings.com/2013/04/breakfast-burritos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a skillet, heat oil over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add potatoes and cook, turning once or twice, for about 5 to 7 minutes or until golden brown and tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove from heat and drain on paper towels.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove oil from skillet except about 1 tablespoon.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add sausage and cook, crumbling with the back of spoon, for about 3 to 4 minutes.When meat starts to change color, add onions and bell peppers. Continue to cook until onions and bell peppers are limp and pork is cooked through. Return potatoes to skillet. Push pork-potato mixture to one side of skillet and pour eggs to other side. When eggs begin to set, begin to stir and combine with the pork mixture. Continue to cook for about 1 to 2 minutes or until eggs are set. Season with salt and pepper to taste.In a preheated skillet, warm tortillas for about 30 seconds on each side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove from heat and assemble burritos by layering pork mixture, sour cream, salsa and cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Roll into logs.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Breakfast Burrito on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Bernardus Rosella's Vineyard Pinot Noir with a 4.7 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come.", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'In a skillet, heat oil over medium heat. Add potatoes and cook, turning once or twice, for about 5 to 7 minutes or until golden brown and tender. Remove from heat and drain on paper towels.Remove oil from skillet except about 1 tablespoon. Add sausage and cook, crumbling with the back of spoon, for about 3 to 4 minutes.When meat starts to change color, add onions and bell peppers. Continue to cook until onions and bell peppers are limp and pork is cooked through. Return potatoes to skillet. Push pork-potato mixture to one side of skillet and pour eggs to other side. When eggs begin to set, begin to stir and combine with the pork mixture. Continue to cook for about 1 to 2 minutes or until eggs are set. Season with salt and pepper to taste.In a preheated skillet, warm tortillas for about 30 seconds on each side. Remove from heat and assemble burritos by layering pork mixture, sour cream, salsa and cheese. Roll into logs.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-burritos-503184', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}