{u'recipes': [{u'sourceName': u'Alidas Kitchen', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/547326-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 547326, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Fajita Pasta | quick family meals', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 105.48, u'creditText': u'Alidas Kitchen', u'extendedIngredients': [{u'originalString': u'2 bells peppers (any color) chopped', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'chopped', u'(any color)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'1 red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1 pound boneless, skinless chicken breasts, cut into bite-size pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'1 box (12 ounces) penne pasta, or similar shape', u'aisle': u'?', u'name': u'similar shape', u'metaInformation': [], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'unit': u'ounces'}], u'healthScore': 9.0, u'imageType': u'png', u'spoonacularScore': 66.0, u'sourceUrl': u'http://alidaskitchen.com/2013/10/29/chicken-fajita-pasta/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Cook pasta according to package directions and drain.  Preheat oven to 350F degrees.Meanwhile, add chicken to a large skillet and stir in half the Simmer Sauce.  Cook until done.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add vegetables and remaining Simmer Sauce.  Cook and stir until vegetables are crisp-tender (about 3 to 5 minutes).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add in cooked pasta and Salsa, stirring until combined.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour mixture into 13x9-inch baking dish sprayed with cooking spray.  Sprinkle with cheese and bake for 5 to 10 minutes, or until heated through and cheese is melted.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven, serve and enjoy!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 339, u'instructions': u'Cook pasta according to package directions and drain.  Preheat oven to 350F degrees.Meanwhile, add chicken to a large skillet and stir in half the Simmer Sauce.  Cook until done.Add vegetables and remaining Simmer Sauce.  Cook and stir until vegetables are crisp-tender (about 3 to 5 minutes).  Add in cooked pasta and Salsa, stirring until combined.Pour mixture into 13x9-inch baking dish sprayed with cooking spray.  Sprinkle with cheese and bake for 5 to 10 minutes, or until heated through and cheese is melted. Remove from oven, serve and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-fajita-pasta-quick-family-meals-547326', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}