{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/389202-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 389202, u'veryPopular': False, u'lowFodmap': False, u'title': u'Double Corn Cornbread', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 56.27, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 tablespoon cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoon'}, {u'originalString': u'1 cup cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'2 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup frozen corn, thawed', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'1 cup gluten-free all-purpose baking flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten free all purpose baking flour', u'metaInformation': [u'gluten-free', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93620, u'unit': u'cup'}, {u'originalString': u'1 cup rice milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'rice milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-milk.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93761, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/double-corn-cornbread', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the flour, cornmeal, sugar, baking powder, baking soda and salt. In a small bowl, whisk the eggs, rice milk, oil and vinegar. Stir into dry ingredients just until moistened; stir in corn.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-milk.png', u'id': 93761, u'name': u'rice milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Transfer to an 8-in x 4-in. loaf pan coated with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake at 350\xb0 for 40-45 minutes or until top is lightly browned and a toothpick inserted near the center comes out clean. Cool on a wire rack.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Cornbread. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. You could try Chateau Ste. Michelle Cold Creek Vineyard Riesling. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish.', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 118, u'instructions': u"Directions                                                                                In a large bowl, combine the flour, cornmeal, sugar, baking powder, baking soda and salt. In a small bowl, whisk the eggs, rice milk, oil and vinegar. Stir into dry ingredients just until moistened; stir in corn.                                                                                           Transfer to an 8-in x 4-in. loaf pan coated with cooking spray. Bake at 350\xb0 for 40-45 minutes or until top is lightly browned and a toothpick inserted near the center comes out clean. Cool on a wire rack.                                        Yield: 1 loaf (6 slices).                                                                                                     Editor's Note: Read all ingredient labels for possible gluten content prior to use. Ingredient formulas can change, and production facilities vary among brands. If you’re concerned that your brand may contain gluten, contact the company.                                                                                                Originally published as Double Corn Cornbread in  Healthy CookingOctober/November 2010, p11                                                                                                                                                                                                        Nutritional Facts                                                                             1 slice equals 334 calories, 13 g fat (1 g saturated fat), 71 mg cholesterol, 842 mg sodium, 51 g carbohydrate, 4 g fiber, 7 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/double-corn-cornbread-389202', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}