{u'recipes': [{u'sourceName': u'Weekend Bakery', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/668045-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 668045, u'veryPopular': True, u'lowFodmap': False, u'title': u'Classic French croissant', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 32.42, u'creditText': u'Weekend Bakery', u'extendedIngredients': [{u'originalString': u'1 egg + 1 tsp water for the egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'for the egg wash'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'11 g instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 11.0, u'consistency': u'solid', u'id': 10118375, u'unit': u'g'}, {u'originalString': u'12 g salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 12.0, u'consistency': u'solid', u'id': 2047, u'unit': u'g'}, {u'originalString': u'55 g sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 55.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'500 g unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10020081, u'unit': u'g'}, {u'originalString': u'40 g soft unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'280 g cold unsalted butter for laminating', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'for laminating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 280.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'140 g water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'g'}, {u'originalString': u'140 g whole milk (you can take it straight from the fridge)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'canned', u'(you can take it straight from the fridge)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.weekendbakery.com/posts/classic-french-croissant-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat the oven at 200 C / 390 F convection or 220 C / 430 F conventional oven.Right before baking, give the croissants their second thin coat of egg wash. We bake the croissants in our big convection oven for 6 minutes at 195C, then lowering the temperature to 165C, and bake them for another 9 minutes. Hamelman suggest baking the croissants for 18 to 20 minutes at 200C, turning your oven down a notch if you think the browning goes too quickly. But you really have to learn from experience and by baking several batches what the ideal time and temperature is for your own oven. Take out of the oven, leave for a few minutes on the baking sheet, then transfer to a cooling rack.', u'length': {u'number': 33, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 13497, u'instructions': u'<p>Preheat the oven at 200 C / 390 F convection or 220 C / 430 F conventional oven.</p><p>Right before baking, give the croissants their second thin coat of egg wash. We bake the croissants in our big convection oven for 6 minutes at 195C, then lowering the temperature to 165C, and bake them for another 9 minutes. Hamelman suggest baking the croissants for 18 to 20 minutes at 200C, turning your oven down a notch if you think the browning goes too quickly. But you really have to learn from experience and by baking several batches what the ideal time and temperature is for your own oven. Take out of the oven, leave for a few minutes on the baking sheet, then transfer to a cooling rack.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/classic-french-croissant-668045', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}