{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507232-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 507232, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cheesy Pull-Apart Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 109.37, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 large loaf or boule-style Italian bread (Sourdough or French could also work)', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'french', u'italian', u'loaf or boule-style', u'large', u'(Sourdough or could also work)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10028033, u'unit': u''}, {u'originalString': u'8 ounces Monterey Jack cheese, shredded (about 2 cups)', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'\xbd cup butter (unsalted or salted is fine), melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'unsalted', u'salted', u'melted', u'fine', u'( or is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001001, u'unit': u'cup'}, {u'originalString': u'1 bunch scallions, trimmed and thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'trimmed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}, {u'originalString': u'8 ounces sharp Cheddar cheese, shredded (about 2 cups)', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.browneyedbaker.com/2013/01/31/cheesy-pull-apart-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Spray a sheet of heavy-duty foil with non-stick cooking spray and set aside.2.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a cross-hatch pattern into the top of the bread by slicing \xbd-inch grid lines into the bread, stopping about \xbc-inch from the bottom of the bread so that it stays together.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the bread on the piece of foil that has been sprayed.3. Stir together the melted butter, garlic and scallions.4. Gently separate the bread with your fingers, then spoon the butter mixture in all of the seams, making sure it is evenly distributed among the whole loaf. Wrap the loaf up in the foil and place on a baking stone or directly on the oven rack and bake for 10 minutes.5.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove from the oven and increase the oven temperature to 425 degrees F. 6. Open the foil and sprinkle the shredded cheese on top of the bread. There will be a lot of cheese, so try to push down as much as you can in between all of the crevices in the bread. Leave the foil open and return it to the oven.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Bake until the cheese is completely melted, bubbling and starting to brown on top, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Let stand for 5 minutes before serving, then sprinkle with parsley (if desired) and dig in!', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 18745, u'instructions': u'1. Preheat oven to 350 degrees F. Spray a sheet of heavy-duty foil with non-stick cooking spray and set aside.2. Cut a cross-hatch pattern into the top of the bread by slicing \xbd-inch grid lines into the bread, stopping about \xbc-inch from the bottom of the bread so that it stays together. Place the bread on the piece of foil that has been sprayed.3. Stir together the melted butter, garlic and scallions.4. Gently separate the bread with your fingers, then spoon the butter mixture in all of the seams, making sure it is evenly distributed among the whole loaf. Wrap the loaf up in the foil and place on a baking stone or directly on the oven rack and bake for 10 minutes.5. Remove from the oven and increase the oven temperature to 425 degrees F. 6. Open the foil and sprinkle the shredded cheese on top of the bread. There will be a lot of cheese, so try to push down as much as you can in between all of the crevices in the bread. Leave the foil open and return it to the oven. Bake until the cheese is completely melted, bubbling and starting to brown on top, about 15 minutes. Let stand for 5 minutes before serving, then sprinkle with parsley (if desired) and dig in!', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-pull-apart-bread-507232', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}