{u'recipes': [{u'sourceName': u'Happy Money Saver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/668505-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 668505, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sweet Milk Homemade Waffles', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 91.28, u'creditText': u'Happy Money Saver', u'extendedIngredients': [{u'originalString': u'3 Teaspoons Baking Powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18371, u'unit': u'Teaspoons'}, {u'originalString': u'2 Tablespoons Melted Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'2 Eggs, Yokes & Whites separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1\xbc Cup Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'Cup'}, {u'originalString': u'2 cups Pastry Flour', u'aisle': u'Baking', u'name': u'pastry flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'cups'}, {u'originalString': u'\xbd Teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'1 Tablespoon Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tablespoon'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://happymoneysaver.com/sweet-milk-homemade-waffles-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix and sift dry ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add milk gradually and add egg yoke, well beaten. Fold in whites of eggs beaten stiff. Then add in melted butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Pour batter into heated waffle maker and cook till golden.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 873, u'instructions': u'Mix and sift dry ingredients. Add milk gradually and add egg yoke, well beaten. Fold in whites of eggs beaten stiff. Then add in melted butter.Pour batter into heated waffle maker and cook till golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-milk-homemade-waffles-668505', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}