{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214602-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 214602, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rhubarb & lemon curd cake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 93.71, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tbsp demerara sugar', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10019908, u'unit': u'tbsp'}, {u'originalString': u'75ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 75.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'4 medium eggs at room temperature, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'medium', u'beaten', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'75g ground almonds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'ground almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 93740, u'unit': u'g'}, {u'originalString': u'3 tbsp lemon curd, plus extra for drizzling', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'lemon curd', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-curd.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93834, u'unit': u'tbsp'}, {u'originalString': u'zest 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'140g forced rhubarb, washed and cut into small chunks', u'aisle': u'Produce', u'name': u'rhubarb', u'metaInformation': [u'washed and cut into small chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 9307, u'unit': u'g'}, {u'originalString': u'200g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}, {u'originalString': u'225g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'225g unsalted butter, softened, plus extra for the tin', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'for the tin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1974642/rhubarb-and-lemon-curd-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Lightly butter a deep, round 20cm caketin and line the base with a circle ofnon-stick baking parchment.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the butter in a large bowl andbeat with an electric whisk until lightand fluffy, then add the caster sugar andlemon zest and beat again. Gradually addthe eggs to the mixture, beating well witheach addition, until fully combined. Themixture will begin to look glossy – if atany stage the mixture curdles, beat in aspoonful of ground almonds and continueto add the egg until it is all amalgamated.Stir in the ground almonds, then theflour, and fold everything carefullytogether using a large spoon. Foldthrough half the rhubarb, then transferthe mixture into the prepared cake tinand scatter with the remaining rhubarb.Finish with the demerara sugar sprinkledon top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'id': 10019908, u'name': u'demerara sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 93740, u'name': u'almond meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'id': 9307, u'name': u'rhubarb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Bake the cake for 45 mins, oruntil a skewer inserted into the middlecomes out clean.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a wire rackto cool slightly in the tin, then removefrom the tin. When the cake is cold,make the topping.Whip the cream in a large bowl until itforms soft peaks. In a small bowl, loosenthe lemon curd with about 1 tbsp waterand carefully fold it through the cream,without overworking.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-curd.jpg', u'id': 93834, u'name': u'lemon curd'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Spread over thecake, drizzle with a little more lemoncurd and serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 677, u'instructions': u'Heat oven to 180C/160C fan/gas 4.Lightly butter a deep, round 20cm caketin and line the base with a circle ofnon-stick baking parchment.Place the butter in a large bowl andbeat with an electric whisk until lightand fluffy, then add the caster sugar andlemon zest and beat again. Gradually addthe eggs to the mixture, beating well witheach addition, until fully combined. Themixture will begin to look glossy – if atany stage the mixture curdles, beat in aspoonful of ground almonds and continueto add the egg until it is all amalgamated.Stir in the ground almonds, then theflour, and fold everything carefullytogether using a large spoon. Foldthrough half the rhubarb, then transferthe mixture into the prepared cake tinand scatter with the remaining rhubarb.Finish with the demerara sugar sprinkledon top. Bake the cake for 45 mins, oruntil a skewer inserted into the middlecomes out clean. Transfer to a wire rackto cool slightly in the tin, then removefrom the tin. When the cake is cold,make the topping.Whip the cream in a large bowl until itforms soft peaks. In a small bowl, loosenthe lemon curd with about 1 tbsp waterand carefully fold it through the cream,without overworking. Spread over thecake, drizzle with a little more lemoncurd and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/rhubarb-lemon-curd-cake-214602', u'dishTypes': [u'dessert'], u'occasions': [u'spring', u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}