{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587274-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 587274, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Pumpkin Butterscotch Dip with Cinnamon Sugar Twists', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 93.79, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'1 tablespoon melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 small box instant butterscotch pudding', u'aisle': u'Sweet Snacks', u'name': u'butterscotch pudding', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butterscotch-pudding.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'liquid', u'id': 19201, u'unit': u'box'}, {u'originalString': u'1/2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 1/2 cup cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'chopped pecans for garnish, optional', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped', u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 12142, u'unit': u'servings'}, {u'originalString': u'1 package puff pastry, thawed in the fridge', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'package'}, {u'originalString': u'1/2 cup pumpkin', u'aisle': u'Produce', u'name': u'pumpkin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11422, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.laurenslatest.com/creamy-pumpkin-butterscotch-dip-with-cinnamon-sugar-twists/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. Unfold both sheets of puff pastry and brush with melted butter. Stir sugar and cinnamon together and sprinkle over melted butter. Press sugar mixture into butter and cut into 6 strips each, giving you 12 strips total. Twist to create spiral effect and place onto baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake 8-12 minutes or until puffed and golden.For the dip- whip cream until stiff peaks form. Fold gently into pumpkin, cinnamon and pumpkin pie spice. In a separate bowl, whip milk and instant pudding together until completely smooth.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let stand 1 minute to thicken slightly, then fold into cream mixture. Refrigerate 5-10 minutes until completely set. Spoon into serving dish and sprinkle with chopped pecans.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve with baked cinnamon sugar twists.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar.jpg', u'id': 10219335, u'name': u'cinnamon sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 968, u'instructions': u'Preheat oven to 400 degrees. Unfold both sheets of puff pastry and brush with melted butter. Stir sugar and cinnamon together and sprinkle over melted butter. Press sugar mixture into butter and cut into 6 strips each, giving you 12 strips total. Twist to create spiral effect and place onto baking sheet. Bake 8-12 minutes or until puffed and golden.For the dip- whip cream until stiff peaks form. Fold gently into pumpkin, cinnamon and pumpkin pie spice. In a separate bowl, whip milk and instant pudding together until completely smooth. Let stand 1 minute to thicken slightly, then fold into cream mixture. Refrigerate 5-10 minutes until completely set. Spoon into serving dish and sprinkle with chopped pecans. Serve with baked cinnamon sugar twists.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-pumpkin-butterscotch-dip-with-cinnamon-sugar-twists-587274', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}