{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/694291-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 694291, u'veryPopular': False, u'lowFodmap': True, u'title': u'Herb Goug\xe8res with Pimento Cheese', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 45, u'pricePerServing': 8.56, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon Gourmet Garden Lightly Dried Chili Pepper', u'aisle': u'Produce', u'name': u'chili pepper', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11819, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon Gourmet Garden Lightly Dried Chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces whipped cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon country Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces extra sharp Cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'extra sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1021009, u'unit': u'ounces'}, {u'originalString': u'Pinch of kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'1/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Gourmet Garden Lightly Dried Parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons diced pimientos, drained', u'aisle': u'Produce', u'name': u'pimientos', u'metaInformation': [u'diced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pimento.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11943, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://foxeslovelemons.com/herb-gougeres-with-pimento-cheese/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Make the Herb Gougres: Preheat oven to 400 degrees F. Line 2 rimmed baking pans with parchment paper. In medium pot, heat water, butter and salt to boiling over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add flour and cook 1 minute, stirring rapidly with wooden spoon the entire time.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Mixture should form dough that pulls away from side of pot.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and transfer mixture to bowl of stand mixture fitted with whisk attachment.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Mix at medium-low speed 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add eggs 1 at a time, mixing until just combined. Using spoon or piping bag, dollop dough by heaping teaspoonfulonto prepared baking pans (you should have about 44 gougres). Wet finger with water and gently press down any peaks.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to oven; bake 20 minutes or until golden brown, rotating pans between upper and lower oven racks halfway through baking.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer baking pans to wire rack and let gougeres cool completely before filling.Meanwhile, make the Pimento Cheese: In bowl of food processor fitted with knife blade attachment, combine all ingredients. Pulse 5 to 10 seconds or until mixture is very well combined.Using the tip of a piping bag, poke a small hole in the bottom of each gougre. Use piping bag to fill eachgougre with pimento cheese (you may have some pimento cheese left over - use it to make a sandwich, or serve with crackers). If desired, transfer filled gougres to 350 degree F oven for 3 to 5 minutes or until cheese is warmed through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u'Make the Herb Gougres: Preheat oven to 400 degrees F. Line 2 rimmed baking pans with parchment paper. In medium pot, heat water, butter and salt to boiling over medium heat. Add flour and cook 1 minute, stirring rapidly with wooden spoon the entire time. Mixture should form dough that pulls away from side of pot. Remove from heat and transfer mixture to bowl of stand mixture fitted with whisk attachment.Mix at medium-low speed 1 minute. Add eggs 1 at a time, mixing until just combined. Using spoon or piping bag, dollop dough by heaping teaspoonfulonto prepared baking pans (you should have about 44 gougres). Wet finger with water and gently press down any peaks.Transfer to oven; bake 20 minutes or until golden brown, rotating pans between upper and lower oven racks halfway through baking. Transfer baking pans to wire rack and let gougeres cool completely before filling.Meanwhile, make the Pimento Cheese: In bowl of food processor fitted with knife blade attachment, combine all ingredients. Pulse 5 to 10 seconds or until mixture is very well combined.Using the tip of a piping bag, poke a small hole in the bottom of each gougre. Use piping bag to fill eachgougre with pimento cheese (you may have some pimento cheese left over - use it to make a sandwich, or serve with crackers). If desired, transfer filled gougres to 350 degree F oven for 3 to 5 minutes or until cheese is warmed through. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/herb-gougres-with-pimento-cheese-694291', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 44, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}