{u'recipes': [{u'sourceName': u'Healthy Green Kitchen', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/552330-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 552330, u'veryPopular': False, u'lowFodmap': False, u'title': u'for Strawberry Rose Lassi', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 199.14, u'creditText': u'Healthy Green Kitchen', u'extendedIngredients': [{u'originalString': u'*1/2 cup plain, organic yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain yogurt', u'metaInformation': [u'plain', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}, {u'originalString': u'*Tiny pinch of fine Himalayan or sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'*1 cup hulled organic strawberries, cut in half (if large)', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'organic', u'hulled', u'large', u'cut in half (if )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'*1/2 cup organic whole milk (I drink raw milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'raw', u'whole', u'organic', u'(I drink milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.healthygreenkitchen.com/strawberry-rose-lassi.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend all ingredients in a high speed blender (I use a blendtec) until smooth. Taste and adjust amount of strawberries, milk, yogurt, and/or cardamom, if you like.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Lassi works really well with Gruener Veltliner, Riesling, and Sparkling ros\xe9. The best wine for Indian food will depending on the dish, of course, but these picks can be served chilled and have some sweetness to complement the spiciness and complex flavors of a wide variety of traditional dishes. You could try Laurenz V Singing Gruner Veltliner. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'gruener veltliner', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate! View More', u'title': u'Laurenz V Singing Gruner Veltliner', u'price': u'$16.49', u'id': 434576, u'link': u'https://www.wine.com/product/laurenz-v-singing-gruner-veltliner-2007/99150', u'imageUrl': u'https://spoonacular.com/productImages/434576-312x231.jpg'}]}, u'aggregateLikes': 131, u'instructions': u'Blend all ingredients in a high speed blender (I use a blendtec) until smooth. Taste and adjust amount of strawberries, milk, yogurt, and/or cardamom, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/for-strawberry-rose-lassi-552330', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}