{u'recipes': [{u'sourceName': u'Cravings of a Lunatic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/538961-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 538961, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cinnamon Sugar Popcorn | @Beamly', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 16.26, u'creditText': u'Cravings of a Lunatic', u'extendedIngredients': [{u'originalString': u'1 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'3 to 4 tablespoons butter, melted and warm but not scorching hot', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'hot', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/2 to 1 teaspoon roasted saigon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon Demerara sugar', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10019908, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon nutmeg, optional', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'12 cups fresh popped popcorn, I use an air popper', u'aisle': u'Savory Snacks', u'name': u'popcorn', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'cups'}, {u'originalString': u'Note You may have sugar left over. I make super large batches of it to sprinkle on muffins and pies so I keep a massive mason jar full of it all the time!', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'jar'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.cravingsofalunatic.com/2014/04/cinnamon-sugar-popcorn.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Pop your popcorn however you like. You can use microwave if you don't like making your own. You can pop it on the stove, or you can use an air popper. We use an air popper about 85% of the time. Set aside in one giant bowl, or a bunch of smaller bowls. Melt the butter on the stove over medium heat. You want to whisk it to keep it smooth. Once it bubbles and melts completely you can turn off the heat. You want the butter warm, but if you pour it over the popcorn too hot it can shrink your popcorn. No one likes shrinkage so use warm, but not scorching butter on popcorn. As it cooks you can mix the Cinnamon Sugar", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar.jpg', u'id': 10219335, u'name': u'cinnamon sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in a small bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}], u'step': u'Combine everything and mix it up really well. I usually toss mine in a mason jar, pop the lid on, and shake the heck out of it. Leftovers can be stored in mason jars and used over muffins and pies.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u"Pour your melted butter over top of the popcorn and make sure you coat it all evenly.Now sprinkle as much, or as little of the cinnamon sugar mix over top of the popcorn. Start slow and taste as you go so you don't go too heavy handed for your own tastebuds. You can always add more, but you can't take away. Good rule of thumb for adding flavour to anything really. Nosh on it immediately while the butter and popcorn are still warm.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar.jpg', u'id': 10219335, u'name': u'cinnamon sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve with a big old "I\'m going to eat too much of this and I really don\'t care" smile!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Viva Diva Moscato Colada with a 4.9 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Sweet Moscato wine infused with natural coconut & pineapple flavor. Light orange in color. Fruity, typical of coconut & pineapple with light hints of Moscato. Excellent as an aperitif or mixing with cocktails.', u'title': u'Viva Diva Moscato Colada', u'price': u'$10.99', u'id': 465263, u'link': u'https://www.wine.com/product/viva-diva-moscato-colada/138557', u'imageUrl': u'https://spoonacular.com/productImages/465263-312x231.jpg'}]}, u'aggregateLikes': 7012, u'instructions': u'Pop your popcorn however you like. You can use microwave if you don\'t like making your own. You can pop it on the stove, or you can use an air popper. We use an air popper about 85% of the time. Set aside in one giant bowl, or a bunch of smaller bowls. Melt the butter on the stove over medium heat. You want to whisk it to keep it smooth. Once it bubbles and melts completely you can turn off the heat. You want the butter warm, but if you pour it over the popcorn too hot it can shrink your popcorn. No one likes shrinkage so use warm, but not scorching butter on popcorn. As it cooks you can mix the Cinnamon Sugar Mix in a small bowl. Combine everything and mix it up really well. I usually toss mine in a mason jar, pop the lid on, and shake the heck out of it. Leftovers can be stored in mason jars and used over muffins and pies. Pour your melted butter over top of the popcorn and make sure you coat it all evenly.Now sprinkle as much, or as little of the cinnamon sugar mix over top of the popcorn. Start slow and taste as you go so you don\'t go too heavy handed for your own tastebuds. You can always add more, but you can\'t take away. Good rule of thumb for adding flavour to anything really. Nosh on it immediately while the butter and popcorn are still warm.Serve with a big old "I\'m going to eat too much of this and I really don\'t care" smile!', u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-sugar-popcorn-beamly-538961', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}