{u'recipes': [{u'sourceName': u'Slender Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/510427-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 510427, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Cupcakes with Almond Cream Cheese Frosting For Two', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 81.39, u'creditText': u'Slender Kitchen', u'extendedIngredients': [{u'originalString': u'Dash almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002050, u'unit': u'Dash'}, {u'originalString': u'1/8 tsp plus 1/16 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 tbsp. cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp. dark chocolate chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp. all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp. light cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'light cream cheese', u'metaInformation': [u'light', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 43274, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp. low-fat buttermilk or nonfat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp. powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tbsp'}, {u'originalString': u'1/16 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.0625, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 tbsp. vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.slenderkitchen.com/chocolate-cupcakes-with-almond-cream-cheese-frosting-for-two/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.In a small bowl mix together the flour, sugar, cocoa powder, baking soda, and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the milk, vanilla extract, and oil. Stir until just combined.Fold in the chocolate chips. If you like, save a couple of chocolate chips for the top of the cupcakes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour into two lined muffin wells sprayed with cooking spray.Put in the oven and bake for 20 minutes.Meanwhile beat together the cream cheese, powdered sugar, and almond extract until it reaches frosting consistency.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Let cupcakes cool and spread frosting on top.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Preheat the oven to 350 degrees.In a small bowl mix together the flour, sugar, cocoa powder, baking soda, and salt. Add the milk, vanilla extract, and oil. Stir until just combined.Fold in the chocolate chips. If you like, save a couple of chocolate chips for the top of the cupcakes. Pour into two lined muffin wells sprayed with cooking spray.Put in the oven and bake for 20 minutes.Meanwhile beat together the cream cheese, powdered sugar, and almond extract until it reaches frosting consistency.Let cupcakes cool and spread frosting on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-cupcakes-with-almond-cream-cheese-frosting-for-two-510427', u'dishTypes': [], u'occasions': [u"valentine's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}