{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/211668-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 211668, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vietnamese pork salad', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 276.98, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'5 celery stalks, cut into matchsticks', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'a handful of coriander stems or roots, chopped', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'handful'}, {u'originalString': u'1 cucumber, cut into matchsticks', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 tsp golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tsp'}, {u'originalString': u'juice of 2 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'500g pork tenderloins, trimmed of fat', u'aisle': u'Meat', u'name': u'lean pork tenderloins', u'metaInformation': [u'trimmed of fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10060, u'unit': u'g'}, {u'originalString': u'2 trimmed stems of lemongrass, finely sliced', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemongrass', u'metaInformation': [u'trimmed', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11972, u'unit': u''}, {u'originalString': u'zest of 1 lime', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'a handful each of coriander and mint leaves, chopped', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'handful'}, {u'originalString': u'1 red chilli, seeded and finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1 tbsp each sesame oil, Thai fish sauce and light soy sauce', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'50g sesame seeds, dry roasted until golden', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12023, u'unit': u'g'}, {u'originalString': u'3 spring onions, finely sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'vegetable oil, for brushing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'\xbc white cabbage, shredded', u'aisle': u'Produce', u'name': u'white cabbage', u'metaInformation': [u'shredded', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11109, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3299/vietnamese-pork-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'The day before: make the dressing.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Put the sugar and lime juice in apan with 1 tbsp water and bring to the boil to dissolvethe sugar.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chilli and coriander and stir well, thenpulse in a blender until smooth. Tip into a bowl, then stirin the sesame oil, fish sauce, soy sauce and sesameseeds to make a dressing. Cover and chill until needed.Two hours before serving: heat a griddle pan. Preheat the oven to 200C/gas6/fan 180C.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Brush the pork with oil and griddle on allsides for a few minutes until seared.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to a bakingtray and put in the oven for about 10-12 minutes untilcooked through. Cool, thinly slice against the grain of themeat. Tip into a bowl and pour over half the dressing.To serve: toss the remaining salad ingredients in a bowl with theremaining dressing. Pile on to a platter, top with the porkslices and spoon over any juices.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 64, u'instructions': u'The day before: make the dressing. Put the sugar and lime juice in apan with 1 tbsp water and bring to the boil to dissolvethe sugar. Add the chilli and coriander and stir well, thenpulse in a blender until smooth. Tip into a bowl, then stirin the sesame oil, fish sauce, soy sauce and sesameseeds to make a dressing. Cover and chill until needed.Two hours before serving: heat a griddle pan. Preheat the oven to 200C/gas6/fan 180C. Brush the pork with oil and griddle on allsides for a few minutes until seared. Transfer to a bakingtray and put in the oven for about 10-12 minutes untilcooked through. Cool, thinly slice against the grain of themeat. Tip into a bowl and pour over half the dressing.To serve: toss the remaining salad ingredients in a bowl with theremaining dressing. Pile on to a platter, top with the porkslices and spoon over any juices.', u'spoonacularSourceUrl': u'https://spoonacular.com/vietnamese-pork-salad-211668', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}