{u'recipes': [{u'sourceName': u'Baked by Rachel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/579215-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 579215, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lobster Rolls', u'diets': [u'pescatarian'], u'pricePerServing': 908.86, u'creditText': u'Baked by Rachel', u'extendedIngredients': [{u'originalString': u'Butter for toasting the rolls', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for toasting the rolls'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1/4C celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11143, u'unit': u'C'}, {u'originalString': u'1/4 tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'New England style hot dog rolls', u'aisle': u'Bakery/Bread', u'name': u'hot dog rolls', u'metaInformation': [u'england style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-dog-buns.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 10018350, u'unit': u'servings'}, {u'originalString': u'1/2 tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'2C lobster meat, cooked (or roughly 1/2lb)', u'aisle': u'Seafood', u'name': u'lobster meat', u'metaInformation': [u'cooked', u'(or roughly 1/2lb)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10115147, u'unit': u'C'}, {u'originalString': u'1/4C mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'C'}, {u'originalString': u'1/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/4C yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10511282, u'unit': u'C'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.bakedbyrachel.com/lobster-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To a large bowl, add mayonnaise, lemon juice, salt and pepper. Chop celery and onions. Roughly chop lobster into large chunks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Combine all ingredients, tossing and coating the lobster well.Toast rolls until just golden on both sides. Stuff with lobster filling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}]}, {u'equipment': [], u'step': u'Serve immediately.Lobster filling may also be eaten as is or stored in the fridge in a covered container for up to several days.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}]}], u'name': u''}], u'aggregateLikes': 8, u'instructions': u'To a large bowl, add mayonnaise, lemon juice, salt and pepper. Chop celery and onions. Roughly chop lobster into large chunks. Combine all ingredients, tossing and coating the lobster well.Toast rolls until just golden on both sides. Stuff with lobster filling. Serve immediately.Lobster filling may also be eaten as is or stored in the fridge in a covered container for up to several days.', u'spoonacularSourceUrl': u'https://spoonacular.com/lobster-rolls-579215', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}