{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/462529-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 462529, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Candy Bar Dessert', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 145.0, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 packages (3.4 ounces each) instant vanilla or chocolate pudding mix', u'aisle': u'Baking', u'name': u'chocolate pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.8, u'consistency': u'solid', u'id': 19184, u'unit': u'ounces'}, {u'originalString': u'1 jar (11-3/4 ounces) hot fudge ice cream topping', u'aisle': u'Frozen;Condiments', u'name': u'fudge ice cream topping', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 19348, u'unit': u'ounces'}, {u'originalString': u'2 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'1/2 cup cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'6 to 7 (2.07 ounces each) Snickers candy bars, chopped, divided', u'aisle': u'Sweet Snacks', u'name': u'snickers candy bar', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snickers.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.489999999999998, u'consistency': u'liquid', u'id': 19155, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 cartons (16 ounces each) frozen whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/creamy-candy-bar-dessert', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine the crumb and sugar; stir in butter. Press onto an ungreased 13-in. x 9-in. dish. In a small saucepan, heat the fudge topping over low heat until warmed; pour evenly over crust. Cool.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'id': 10019348, u'name': u'hot fudge sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat the milk, pudding mix and whipped topping for 2-3 minutes or until stiff, scraping sides of bowl often. Stir in three-fourths of the candy bar pieces.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour over crust. Sprinkle with remaining candy bar pieces. Cover and refrigerate for 2-3 hours or overnight. Refrigerate leftovers.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 124, u'instructions': u'Directions                                                                                In a small bowl, combine the crumb and sugar; stir in butter. Press onto an ungreased 13-in. x 9-in. dish. In a small saucepan, heat the fudge topping over low heat until warmed; pour evenly over crust. Cool.                                                                                          In a large bowl, beat the milk, pudding mix and whipped topping for 2-3 minutes or until stiff, scraping sides of bowl often. Stir in three-fourths of the candy bar pieces. Pour over crust. Sprinkle with remaining candy bar pieces. Cover and refrigerate for 2-3 hours or overnight. Refrigerate leftovers.                                        Yield: 15 servings.                                                                                                                         Originally published as Creamy Candy Bar Dessert in  Country WomanJuly/August 2001, p33                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 316 calories, 15 g fat (10 g saturated fat), 18 mg cholesterol, 263 mg sodium, 40 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-candy-bar-dessert-462529', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}