{u'recipes': [{u'sourceName': u'Veg Recipes of India', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/486686-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 486686, u'veryPopular': False, u'lowFodmap': False, u'title': u'sheer khurma or sheer korma, how to make sheer khurma', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 123.66, u'creditText': u'Veg Recipes of India', u'extendedIngredients': [{u'originalString': u'8-9 almonds, sliced', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 12061, u'unit': u''}, {u'originalString': u'4 cardamoms, crushed to a powder in a mortar-pestle.', u'aisle': u'Spices and Seasonings', u'name': u'green cardamoms', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1022006, u'unit': u''}, {u'originalString': u'7-8 cashews, chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 12087, u'unit': u''}, {u'originalString': u'\xbd or 1 tbsp chironji/charoli', u'aisle': u'Spices and Seasonings', u'name': u'charoli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/charoli-seeds.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 99110, u'unit': u''}, {u'originalString': u'8-9 dates seedless, chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'seedless', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 9087, u'unit': u''}, {u'originalString': u'1 tbsp ghee', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9297, u'unit': u'tbsp'}, {u'originalString': u'500 ml milk, approx 3 cups full fat organic milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'\xbd to 1 tsp rose water', u'aisle': u'Gourmet', u'name': u'rose water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rose-water.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10411111, u'unit': u'tsp'}, {u'originalString': u'8-9 unsalted pistachios, sliced', u'aisle': u'Nuts;Savory Snacks', u'name': u'unsalted pistachios', u'metaInformation': [u'unsalted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 12152, u'unit': u''}, {u'originalString': u'1 to 1.5 tbsp sugar or as required ( the dates and raisins add a lot of sweetness to the milk, so add sugar accordingly.)', u'aisle': u'?', u'name': u'as required', u'metaInformation': [u'( the dates and raisins add a lot of sweetness to the milk, so add sugar accordingly.)'], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}, {u'originalString': u'\xbd cup broken seviyan/whole wheat vermicelli', u'aisle': u'?', u'name': u'broken seviyan/whole wheat vermicelli', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.vegrecipesofindia.com/sheer-khurma-recipe-sheer-korma-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'roast the seviyan till golden and keep aside. if you want then you can roast the seviyan in ghee also.in the same pan. heat ghee and add chopped dry fruits and saute for 3-4 minutes stirring often.heat milk in a saucepan and let it come to a boil. lower the flame and simmer for 8-10 minutes till the milk slightly thickens.add the roasted seviyan and sugar to the milk and simmer till the seviyan are cooked and have become soft for about 8-10 minutes on a low flame.the milk will also thicken and reduce in volume.add the whole dry fruit mixture and cardamom powder.switch off the fire and stir.taste the sheer kurma and add more sugar if required.serve the sheer khurma hot, warm or chilled.you can also garnish sheer khurma with saffron strands or rose petals or dry fruits or powdered cardamom.', u'length': {u'number': 24, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'id': 2006, u'name': u'cardamom powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try L'Ecole 41 Chenin Blanc. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish. View More', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 162, u'instructions': u'roast the seviyan till golden and keep aside. if you want then you can roast the seviyan in ghee also.in the same pan. heat ghee and add chopped dry fruits and saute for 3-4 minutes stirring often.heat milk in a saucepan and let it come to a boil. lower the flame and simmer for 8-10 minutes till the milk slightly thickens.add the roasted seviyan and sugar to the milk and simmer till the seviyan are cooked and have become soft for about 8-10 minutes on a low flame.the milk will also thicken and reduce in volume.add the whole dry fruit mixture and cardamom powder.switch off the fire and stir.taste the sheer kurma and add more sugar if required.serve the sheer khurma hot, warm or chilled.you can also garnish sheer khurma with saffron strands or rose petals or dry fruits or powdered cardamom.', u'spoonacularSourceUrl': u'https://spoonacular.com/sheer-khurma-or-sheer-korma-how-to-make-sheer-khurma-486686', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}