{u'recipes': [{u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/535913-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 535913, u'veryPopular': True, u'lowFodmap': False, u'title': u'BLAT Hot Dogs', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 197.54, u'extendedIngredients': [{u'originalString': u'1 avocado, halved, seeded, peeled and diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'peeled', u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'6 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'6 hot dog buns', u'aisle': u'Bakery/Bread', u'name': u'hot dog buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10018350, u'unit': u''}, {u'originalString': u'6 hot dogs', u'aisle': u'Meat', u'name': u'hot dogs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 21118, u'unit': u''}, {u'originalString': u'1/4 cup homemade Ranch', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}, {u'originalString': u'1 Roma tomato, diced', u'aisle': u'Produce', u'name': u'roma tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'1 cup shredded Romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://DAMNDELICIOUS.NET/2013/08/26/blat-hot-dogs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat grill to medium high heat. Wrap each hot dog in a strip of bacon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add the hot dogs to the grill and cook until the bacon is brown and crispy, about 4-5 minutes. To assemble the hot dogs, add hot dogs into each hot dog bun, top with Ranch, lettuce, tomato and avocado.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-dog-buns.jpg', u'id': 10018350, u'name': u'hot dog bun'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Riesling, Gewurztraminer, and ros\xe9 Wine are my top picks for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. The Columbia Winery Cellarmaster's Riesling with a 4.7 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham. View More", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 609, u'instructions': u'Preheat grill to medium high heat. Wrap each hot dog in a strip of bacon. Add the hot dogs to the grill and cook until the bacon is brown and crispy, about 4-5 minutes. To assemble the hot dogs, add hot dogs into each hot dog bun, top with Ranch, lettuce, tomato and avocado. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/blat-hot-dogs-535913', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}