{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212360-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 212360, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Cuban Sandwich (Sandwich Cubano)', u'diets': [], u'pricePerServing': 345.0, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 loaf Cuban bread, sliced lengthwise', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18064, u'unit': u'loaf'}, {u'originalString': u'1 1/2 pounds boiled ham, sliced', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'boiled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 7214, u'unit': u'pounds'}, {u'originalString': u'1 cup dill pickle chips, or to taste', u'aisle': u'Canned and Jarred', u'name': u'dill pickle chips', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickle-slices.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10211937, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds roasted pork, sliced', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10010219, u'unit': u'pounds'}, {u'originalString': u'1 pound Swiss cheese, sliced', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1040, u'unit': u'pound'}, {u'originalString': u'1/2 stick (1/4 cup) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'3 tablespoons yellow mustard, or to taste', u'aisle': u'Condiments', u'name': u'yellow mustard', u'metaInformation': [u'yellow', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'tablespoons'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/364812', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Assemble the sandwich', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 2 tablespoons of the butter on one half of the bread loaf and a thin layer of mustard on the other.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Place 1 to 2 layers of ham, pork, cheese, and, finally, pickles on the buttered bread and top with the mustard-spread bread.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'id': 11937, u'name': u'pickles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Wrap the sandwich in foil', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Smear the remaining butter all over the outside of the sandwich and wrap it completely in aluminum foil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Press and grill the sandwich', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat your grill to high (550\xb0F) and close the lid. Wait at least 15 minutes before lowering the heat to medium-high (450\xb0F) and continuing.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Before grilling the sandwich, press down on it with your hands to flatten it.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the wrapped, flattened sandwich on the grill and top with a brick, grill press, or any other heavy, heat-resistant object. Close the lid and grill for 5 to 6 minutes per side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove the wrapped sandwich from the grill and take off the foil. Return the sandwich to the grill and grill for about 2 to 3 minutes per side, or until both pieces of bread are crispy and golden brown.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Slice and serve', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove the sandwich from the grill and cut at an angle into small sandwich wedges (triangles).', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Place on a large platter and serve while still hot.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Cooking notes', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Ingredients', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Cuban bread Made from white flour, yeast, and a bit of lard, this bread has a very thin crust and soft middle filled with tunnels. Cuban bread is distinguished by the palm frond placed lengthwise down its middle prior to baking, its length (almost 3 feet), and its somewhat rectangular shape. Advance preparation', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'The loaf sandwich can be prepared and wrapped in foil a few hours in advance. Press and grill right before serving.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Reprinted with permission from Latin Grilling by Lourdes Castro,  \xa9 2011 Ten Speed Press, a division of Random House, Inc.A Miami native, Lourdes Castro has served as a personal chef and nutritionist for high-profile clients, such as Cristina Saralegui and professional athletes, and as an associate of the James Beard Foundation. A highly regarded Latin chef and cooking teacher, Castro is the author of Simply Mexican and Eat, Drink, Think in Spanish. She currently teaches food science at New York University and is the director of the Culinary Academy at the Biltmore Hotel in Coral Gables, Florida. Find out more at Lourdescastro.com', u'number': 18, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 55, u'instructions': u'Preparation                                        Assemble the sandwich                Spread 2 tablespoons of the butter on one half of the bread loaf and a thin layer of mustard on the other. Place 1 to 2 layers of ham, pork, cheese, and, finally, pickles on the buttered bread and top with the mustard-spread bread.                                                            Wrap the sandwich in foil                 Smear the remaining butter all over the outside of the sandwich and wrap it completely in aluminum foil.                                                            Press and grill the sandwich                  Heat your grill to high (550\xb0F) and close the lid. Wait at least 15 minutes before lowering the heat to medium-high (450\xb0F) and continuing.                                                                Before grilling the sandwich, press down on it with your hands to flatten it. Place the wrapped, flattened sandwich on the grill and top with a brick, grill press, or any other heavy, heat-resistant object. Close the lid and grill for 5 to 6 minutes per side.                                                                Remove the wrapped sandwich from the grill and take off the foil. Return the sandwich to the grill and grill for about 2 to 3 minutes per side, or until both pieces of bread are crispy and golden brown.                                                            Slice and serve                Remove the sandwich from the grill and cut at an angle into small sandwich wedges (triangles). Place on a large platter and serve while still hot.                                                Cooking notes            IngredientsCuban bread Made from white flour, yeast, and a bit of lard, this bread has a very thin crust and soft middle filled with tunnels. Cuban bread is distinguished by the palm frond placed lengthwise down its middle prior to baking, its length (almost 3 feet), and its somewhat rectangular shape. Advance preparationThe loaf sandwich can be prepared and wrapped in foil a few hours in advance. Press and grill right before serving.                                                            Reprinted with permission from Latin Grilling by Lourdes Castro,  \xa9 2011 Ten Speed Press, a division of Random House, Inc.A Miami native, Lourdes Castro has served as a personal chef and nutritionist for high-profile clients, such as Cristina Saralegui and professional athletes, and as an associate of the James Beard Foundation. A highly regarded Latin chef and cooking teacher, Castro is the author of Simply Mexican and Eat, Drink, Think in Spanish. She currently teaches food science at New York University and is the director of the Culinary Academy at the Biltmore Hotel in Coral Gables, Florida. Find out more at Lourdescastro.com', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-cuban-sandwich-sandwich-cubano-212360', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}