{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/568569-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 568569, u'veryPopular': False, u'lowFodmap': False, u'title': u'Heavenly Blueberry and Cream Angel Dessert', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 130.35, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u'12 ounces frozen blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9050, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup half-and-half or evaporated milk (can use skim evaporated milk)', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'(can use skim evaporated milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1214, u'unit': u'cup'}, {u'originalString': u'2 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'tablespoon of fresh lemon juice (about 1/2 tablespoon)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'16 ounces light cream cheese, softened to room temperature', u'aisle': u'Cheese', u'name': u'light cream cheese', u'metaInformation': [u'light', u'softened', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.melskitchencafe.com/heavenly-blueberry-and-cream-angel-dessert/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For the blueberry filling, in a medium saucepan, combine the blueberries, sugar, cornstarch, water and lemon juice. Bring the mixture to a simmer and cook until thickened, 5-7 minutes, stirring often.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Remove from the heat and let cool to room temperature. For the cake and cream layer, in a blender or with an electric mixer (handheld or stand mixer), whip together the cream cheese, half-and-half or evaporated milk and sugar until smooth and creamy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1214, u'name': u'evaporated milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the mixture to a bowl if you used a blender. Fold in the angel food cake cubes. Keep in mind (from the note above) that you may not use all the cake cubes, especially if using an angel food cake mix.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add cake cubes until they are all thickly coated with a layer of cream. If making this in advance, it can dry out if there is too much angel food cake added. For the whipped cream, beat together the heavy cream and powdered sugar until peaks form. To assemble, in a trifle dish or in a large glass bowl, spread half of the angel food cake mixture. Top with half of the blueberries, spreading evenly across, and then spread half of the sweetened whipped cream. Repeat the layers. Cover and refrigerate at least 2 hours or up to 24 hours.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve chilled.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 84, u'instructions': u'For the blueberry filling, in a medium saucepan, combine the blueberries, sugar, cornstarch, water and lemon juice. Bring the mixture to a simmer and cook until thickened, 5-7 minutes, stirring often. Remove from the heat and let cool to room temperature. For the cake and cream layer, in a blender or with an electric mixer (handheld or stand mixer), whip together the cream cheese, half-and-half or evaporated milk and sugar until smooth and creamy. Transfer the mixture to a bowl if you used a blender. Fold in the angel food cake cubes. Keep in mind (from the note above) that you may not use all the cake cubes, especially if using an angel food cake mix. Add cake cubes until they are all thickly coated with a layer of cream. If making this in advance, it can dry out if there is too much angel food cake added. For the whipped cream, beat together the heavy cream and powdered sugar until peaks form. To assemble, in a trifle dish or in a large glass bowl, spread half of the angel food cake mixture. Top with half of the blueberries, spreading evenly across, and then spread half of the sweetened whipped cream. Repeat the layers. Cover and refrigerate at least 2 hours or up to 24 hours. Serve chilled.', u'spoonacularSourceUrl': u'https://spoonacular.com/heavenly-blueberry-and-cream-angel-dessert-568569', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}