{u'recipes': [{u'sourceName': u'Simply Being Mommy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/617392-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 617392, u'veryPopular': False, u'lowFodmap': True, u'title': u'Slow Cooker Pork Sirloin Tip Roast with Red Potatoes', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 274.71, u'creditText': u'Simply Being Mommy', u'extendedIngredients': [{u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2-3 lb pork sirloin tip roast', u'aisle': u'Meat', u'name': u'pork sirloin tip roast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10963, u'unit': u'lb'}, {u'originalString': u'10-15 red potatoes, cut in half', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}, {u'originalString': u'3 tsp Homemade Steak Rub (I keep this on hand all the time. It is such a versatile rub.)', u'aisle': u'Spices and Seasonings', u'name': u'rub', u'metaInformation': [u'homemade', u'(I keep this on hand all the time. It is such a versatile rub.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1012034, u'unit': u'tsp'}, {u'originalString': u'3-4 cups vegetable stock (depending on size of slow cooker)', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'(depending on size of slow cooker)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 46.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://simplybeingmommy.com/2014/10/17/slow-cooker-pork-sirloin-tip-roast-with-red-potatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pork sirloin tip roast from package and trim away any visible fat. Sprinkle homemade steak rub over entire roast and with both hands rub evenly over whole roast.In a large frying pan, heat oil over medium-high heat and brown all sides of the roast. While roast is browning, add red potatoes to slow cooker. Once evenly browned on all sides, transfer roast to slow cooker, on top of the potatoes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'id': 10963, u'name': u'pork sirloin tip roast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'id': 10011355, u'name': u'red potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'id': 1012034, u'name': u'dry seasoning rub'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add vegetable broth to frying pan, scraping any bits that were left behind during the browning process; pour over meat. Turn slow cooker on low and cook for 6 hours.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Remove from slow cooker and place in middle of a serving platter, surrounded by potatoes.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Cabernet Sauvignon, and Merlot are great choices for Sirloin Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Mark West Black Label Monterey County Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'pinot noir', u'cabernet sauvignon', u'merlot'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches.", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Remove pork sirloin tip roast from package and trim away any visible fat. Sprinkle homemade steak rub over entire roast and with both hands rub evenly over whole roast.In a large frying pan, heat oil over medium-high heat and brown all sides of the roast. While roast is browning, add red potatoes to slow cooker. Once evenly browned on all sides, transfer roast to slow cooker, on top of the potatoes.Add vegetable broth to frying pan, scraping any bits that were left behind during the browning process; pour over meat. Turn slow cooker on low and cook for 6 hours.Remove from slow cooker and place in middle of a serving platter, surrounded by potatoes.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-pork-sirloin-tip-roast-with-red-potatoes-617392', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}