{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/450382-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 450382, u'veryPopular': False, u'lowFodmap': True, u'title': u'Tropical Strawberry Pops', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 15.92, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 medium banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2 cups strawberry-banana V8 juice blend', u'aisle': u'Beverages', u'name': u'juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1019016, u'unit': u'cups'}, {u'originalString': u'1 can (8 ounces) unsweetened crushed pineapple, undrained', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'unsweetened', u'crushed', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9266, u'unit': u'ounces'}, {u'originalString': u'1 cup frozen unsweetened strawberries, thawed', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'unsweetened', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/tropical-strawberry-pops', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the juice, pineapple, strawberries and banana in a blender; cover and process until pureed. Fill each mold or cup with 1/4 cup strawberry mixture; top with holders or insert sticks into cups. Freeze.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 1019016, u'name': u'juice'}]}], u'name': u''}], u'aggregateLikes': 11, u'instructions': u'Directions                                                                                Place the juice, pineapple, strawberries and banana in a blender; cover and process until pureed. Fill each mold or cup with 1/4 cup strawberry mixture; top with holders or insert sticks into cups. Freeze.                                        Yield: 1-1/2 dozen.                                                                                                                         Originally published as Tropical Strawberry Pops in  Simple & DeliciousFebruary/March 2011, p12                                                                                                                                                                                                        Nutritional Facts                                                                             1 pop equals 30 calories, trace fat (trace saturated fat), 0 cholesterol, 8 mg sodium, 7 g carbohydrate, trace fiber, trace protein. Diabetic Exchange: 1/2 fruit.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/tropical-strawberry-pops-450382', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}