{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/770932-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 770932, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow-Cooker Stout Beef Stew', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 214.87, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 4-pound boneless beef chuck roast, trimmed and cut into 1 1/2-inch pieces', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'boneless', u'trimmed', u'cut into 1 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 pound carrots, peeled and cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'pound'}, {u'originalString': u'3 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 large onions, finely chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 12-ounce bottle stout beer, such as Guinness Draught', u'aisle': u'Alcoholic Beverages', u'name': u'stout beer', u'metaInformation': [u' such as guinness draught'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 93619, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds Yukon gold potatoes, unpeeled, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'unpeeled', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'pounds'}], u'healthScore': 31.0, u'imageType': u'jpeg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/trisha-yearwood/slow-cooker-stout-beef-stew.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a 6-quart slow cooker, combine the potatoes, carrots, onions, garlic, parsley, stout, olive oil, brown sugar and tomato paste. In a separate bowl, mix the flour with the salt and pepper. Dredge the beef pieces in the dry mixture, shaking off any excess.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'id': 93619, u'name': u'stout'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a medium skillet, melt the butter and canola oil over medium-high heat. In batches, add the beef pieces and sear until brown, about 2 minutes, transferring the beef to the slow cooker as done.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the last batch of beef to the slow cooker, add 1 cup of the chicken broth to the skillet and scrape up all the brown bits that have accumulated on the bottom of the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pan juices to the slow cooker, along with the remaining 2 cups of chicken broth. Cover, and cook on high for 6 hours.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Malbec, and Shiraz are my top picks for Beef Stew. These full-bodied red wines are the perfect accompaniment for hearty beef stew.', u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'imageUrl': u'https://spoonacular.com/productImages/469305-312x231.jpg', u'description': u'This wine starts with a bouquet of rich plum and wild berries. It has a concentrated flavor profile of black fruit with a hint of chocolate and brown spice. With notes that are complex, full-bodied and expansive on the palate, it ends with firm tannins and a dash of espresso. This wine is balanced, with a supple texture and approachable grip.', u'link': u'https://www.amazon.com/Volta-Cabernet-Sauvignon-Mission-Valley/dp/B00GNKJZ02', u'id': 469305, u'title': u'Volta Cabernet Sauvignon Mission Ridge'}]}, u'aggregateLikes': 11134, u'instructions': u'In a 6-quart slow cooker, combine the potatoes, carrots, onions, garlic, parsley, stout, olive oil, brown sugar and tomato paste. In a separate bowl, mix the flour with the salt and pepper. Dredge the beef pieces in the dry mixture, shaking off any excess.                          In a medium skillet, melt the butter and canola oil over medium-high heat. In batches, add the beef pieces and sear until brown, about 2 minutes, transferring the beef to the slow cooker as done. Remove the last batch of beef to the slow cooker, add 1 cup of the chicken broth to the skillet and scrape up all the brown bits that have accumulated on the bottom of the pan. Add the pan juices to the slow cooker, along with the remaining 2 cups of chicken broth. Cover, and cook on high for 6 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-stout-beef-stew-770932', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u"father's day", u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 405, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}