{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/550024-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 550024, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Glazed Roasted Brussel Sprouts', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 123.85, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'1/2 cup Balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds Brussel Sprouts', u'aisle': u'Produce', u'name': u'brussel sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11098, u'unit': u'pounds'}, {u'originalString': u'1 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1/2 cup fresh cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon dried Thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'3/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons good olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 small Shallot, chopped', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 tablespoon whole-grain Dijon mustard', u'aisle': u'Condiments', u'name': u'whole grain dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoon'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.halfbakedharvest.com/cranberry-glazed-roasted-brussel-sprouts/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut off the brown ends of the Brussels sprouts and pull off any yellow outer leaves. If the sprouts are large cut them in half.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix them in a bowl with the olive oil, salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour them on a sheet pan and roast for 30 minutes, until crisp on the outside and tender on the inside. Shake the pan from time to time to brown the sprouts evenly.Well the brussel sprout roast make the glaze.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in a large saucepan over medium heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add shallots and saut\xe9 6 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add Balsamic Vinegar. Increase heat to high and bring to a boil. Boil 5-8 minutes until balsamic vinegar is reduced to a thick syrup. Stir in cranberries, honey and thyme.Reduce heat and cook 6 minutes, until cranberries start to break down.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add the broth and bring to a boil. Reduce heat and simmer 15 minutes, until thick.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the mixture to a blender with the mustard and pur\xe9e mixture in a blender until smooth.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour the glaze over the roasted brussels sprouts and return to the oven for anther 10-15 minutes or until glaze has clung and coated the brussel sprouts.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 267, u'instructions': u'Preheat oven to 400 degrees F.Cut off the brown ends of the Brussels sprouts and pull off any yellow outer leaves. If the sprouts are large cut them in half. Mix them in a bowl with the olive oil, salt and pepper.Pour them on a sheet pan and roast for 30 minutes, until crisp on the outside and tender on the inside. Shake the pan from time to time to brown the sprouts evenly.Well the brussel sprout roast make the glaze. Heat oil in a large saucepan over medium heat. Add shallots and saut\xe9 6 minutes. Add Balsamic Vinegar. Increase heat to high and bring to a boil. Boil 5-8 minutes until balsamic vinegar is reduced to a thick syrup. Stir in cranberries, honey and thyme.Reduce heat and cook 6 minutes, until cranberries start to break down. Add the broth and bring to a boil. Reduce heat and simmer 15 minutes, until thick. Add the mixture to a blender with the mustard and pur\xe9e mixture in a blender until smooth.Pour the glaze over the roasted brussels sprouts and return to the oven for anther 10-15 minutes or until glaze has clung and coated the brussel sprouts.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-glazed-roasted-brussel-sprouts-550024', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}