{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/203386-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 203386, u'veryPopular': False, u'lowFodmap': False, u'title': u'Charred Beef Tenderloin With Cacio e Pepe Toasted Barley and Watercress Pesto', u'diets': [], u'pricePerServing': 596.05, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'12 ounces beef tenderloin', u'aisle': u'Meat', u'name': u'beef tenderloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 13926, u'unit': u'ounces'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 clove garlic, roughly chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 packed cup mixed bitter greens, such as watercress, spinach, and arugula', u'aisle': u'Produce', u'name': u'greens', u'metaInformation': [u'mixed', u' such as watercress, spinach, and arugula', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2/3 cup pearl barley, rinsed', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'pearl barley', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 20005, u'unit': u'cup'}, {u'originalString': u'3 tablespoons grated Pecorino Romano, divided', u'aisle': u'Cheese', u'name': u'pecorino romano', u'metaInformation': [u'divided', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1038, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12155, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons extra-virgin olie oil, divided', u'aisle': u'?', u'name': u'olie oil', u'metaInformation': [u'extra-virgin', u'divided'], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'unit': u'tablespoons'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/01/charred-beef-tenderloin-barley-cacio-e-pepe-watercress-pesto.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Cover barley with water by 2 inches in a medium pot and add a teaspoon salt. Bring to a boil, reduce to a bare simmer, and cook until barley is tender, 35 to 45 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain, rinse under cold water, and set aside. Barley can be cooked up to 3 days in advance.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the pesto, place the greens, garlic, walnuts, 2 tablespoons olive oil, and 1 tablespoon of Pecorino Romano cheese in the bowl of a food processor or blender. Process until a paste is formed. Season to taste with salt and pepper and set aside.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino romano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Rub beef with 1 teaspoon oil and season generously with salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a cast iron skillet or grill pan over high heat until lightly smoking, then add beef. Cook, turning frequently, until well-browned on all sides and an instant read thermometer inserted into deepest part of meat registers 120\xb0F for medium rare or 130\xb0F for medium, about 10 minutes total (reduce heat if the meat threatens to burn or the smoking is excessive before it reaches its finished temperature).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer meat to a cutting board and let rest for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'While the meat is resting, make the cacio e pepe barley. Wipe out skillet and add remaining 2 teaspoons of olive oil. Return to medium-high heat until shimmering.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Add barley and 2 teaspoons of freshly ground black pepper, and cook, stirring frequently, until barley is toasty and lightly browned, about 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}]}, {u'equipment': [], u'step': u'Remove from heat and scatter remaining 2 tablespoons of Pecorino over the top. Stir into the barley, allowing the residual heat to melt it. Season to taste with more salt and pepper as desired.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino'}]}, {u'equipment': [], u'step': u'5', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To serve, divide the barley into two shallow bowls. After the meat has rested, cut into 1/2-inch slices.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Place on top of the barley. Spoon one or two spoonfuls of the pesto over the meat, and top with some extra freshly cracked black pepper.', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Serve.', u'number': 17, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 40, u'instructions': u'Procedures                                                                              1                                                                            Cover barley with water by 2 inches in a medium pot and add a teaspoon salt. Bring to a boil, reduce to a bare simmer, and cook until barley is tender, 35 to 45 minutes. Drain, rinse under cold water, and set aside. Barley can be cooked up to 3 days in advance.                                                                                                                            2                                                                            For the pesto, place the greens, garlic, walnuts, 2 tablespoons olive oil, and 1 tablespoon of Pecorino Romano cheese in the bowl of a food processor or blender. Process until a paste is formed. Season to taste with salt and pepper and set aside.                                                                                                                            3                                                                            Rub beef with 1 teaspoon oil and season generously with salt and pepper. Heat a cast iron skillet or grill pan over high heat until lightly smoking, then add beef. Cook, turning frequently, until well-browned on all sides and an instant read thermometer inserted into deepest part of meat registers 120\xb0F for medium rare or 130\xb0F for medium, about 10 minutes total (reduce heat if the meat threatens to burn or the smoking is excessive before it reaches its finished temperature). Transfer meat to a cutting board and let rest for 10 minutes.                                                                                                                            4                                                                            While the meat is resting, make the cacio e pepe barley. Wipe out skillet and add remaining 2 teaspoons of olive oil. Return to medium-high heat until shimmering. Add barley and 2 teaspoons of freshly ground black pepper, and cook, stirring frequently, until barley is toasty and lightly browned, about 7 minutes. Remove from heat and scatter remaining 2 tablespoons of Pecorino over the top. Stir into the barley, allowing the residual heat to melt it. Season to taste with more salt and pepper as desired.                                                                                                                            5                                                                            To serve, divide the barley into two shallow bowls. After the meat has rested, cut into 1/2-inch slices. Place on top of the barley. Spoon one or two spoonfuls of the pesto over the meat, and top with some extra freshly cracked black pepper. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/charred-beef-tenderloin-with-cacio-e-pepe-toasted-barley-and-watercress-pesto-203386', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}