{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/741546-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 741546, u'veryPopular': True, u'lowFodmap': False, u'title': u'Dressed Up Grilled Cheese Sandwiches', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 142.25, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'8 slices country white bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'Mayonnaise, for spreading', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [u'for spreading'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'servings'}, {u'originalString': u'8 slices Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'slices'}, {u'originalString': u'1 small red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 medium vine-ripened tomato, sliced', u'aisle': u'Produce', u'name': u'vine ripened tomatoes', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpeg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/nancy-fuller/dressed-up-grilled-cheese-sandwiches.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Preheat a griddle over low heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread a thin layer of mayonnaise on one side of each slice of breadthis will give the bread an even golden color when griddled. Flip 4 slices over and layer each with 1 slice Monterey Jack, 1 slice tomato, 1 slice red onion, 1 slice avocado and 1 more slice Monterey Jack. Top with another slice of bread, mayonnaise side up.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Place the sandwiches on the preheated griddle and toast until the bread is golden brown and the cheese is melted, about 2 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 448, u'instructions': u'Watch how to make this recipe.                    Preheat a griddle over low heat.                          Spread a thin layer of mayonnaise on one side of each slice of breadthis will give the bread an even golden color when griddled. Flip 4 slices over and layer each with 1 slice Monterey Jack, 1 slice tomato, 1 slice red onion, 1 slice avocado and 1 more slice Monterey Jack. Top with another slice of bread, mayonnaise side up.                          Place the sandwiches on the preheated griddle and toast until the bread is golden brown and the cheese is melted, about 2 minutes per side.', u'spoonacularSourceUrl': u'https://spoonacular.com/dressed-up-grilled-cheese-sandwiches-741546', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}