{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/690450-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 690450, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Pumpkin Pies', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 29.48, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1/4 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'4 ounces cream cheese, at room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'2 boxes (15 shells each) frozen Mini Fillo Shells, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'fillo shells', u'metaInformation': [u'frozen', u'mini', u'thawed', u'(15 shells each)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'unitLong': u'boxes', u'unitShort': u'boxes', u'amount': 2.0, u'consistency': u'solid', u'id': 93817, u'unit': u'boxes'}, {u'originalString': u'1 teaspoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup 100% pure pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [u'100%', u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1/2 cup thawed whipped topping, either store bought or homemade', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'homemade', u'thawed', u'store bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 42135, u'unit': u'cup'}, {u'originalString': u'additional whipped topping for the top', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'for the top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 42135, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.recipegirl.com/2015/11/17/mini-pumpkin-pies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a medium mixing bowl, use an electric mixer to beatthe cream cheese until fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add in the pumpkin puree, brown sugar and pumpkin pie spice andbeat well.Use a rubber spatula to fold in the whipped topping.Spoon the mixture into thefillo shells, and add a dollop of additional whipped topping.Keep refrigerated until ready to serve. These desserts should be eaten the same day as they were made.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pumpkin Pie works really well with Ice Wine, Moscato, and Vin Santo. Vin santo is typically sweet with notes of baking spices and nuts, so it pairs really well with pumpkin spiced desserts. A good sparkling Moscato would work too, and if you feel like splurging, an ice wine. One wine you could try is Schulze Vineyards Vidal Blanc Ice Wine. It has 5 out of 5 stars and a bottle costs about 50 dollars.', u'pairedWines': [u'ice wine', u'moscato', u'vin santo'], u'productMatches': [{u'description': u'peach , apricot , honey', u'title': u'Schulze Vineyards Vidal Blanc Ice Wine', u'price': u'$49.95', u'id': 469243, u'link': u'https://www.amazon.com/2011-Schulze-Vineyards-Vidal-Blanc/dp/B00H2V95M4', u'imageUrl': u'https://spoonacular.com/productImages/469243-312x231.jpg'}]}, u'aggregateLikes': 340, u'instructions': u'In a medium mixing bowl, use an electric mixer to beatthe cream cheese until fluffy.Add in the pumpkin puree, brown sugar and pumpkin pie spice andbeat well.Use a rubber spatula to fold in the whipped topping.Spoon the mixture into thefillo shells, and add a dollop of additional whipped topping.Keep refrigerated until ready to serve. These desserts should be eaten the same day as they were made.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-pumpkin-pies-690450', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}