{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/494688-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 494688, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gingerbread Ice Cream Floats', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 135.21, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'24 ounces cream soda', u'aisle': u'Beverages', u'name': u'cream soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 14130, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon Spice Islands\xae Ground Allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [u'spice islands\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Spice Islands\xae Ground Saigon Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [u'spice islands\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Spice Islands\xae Ground Ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [u'spice islands\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'1 quart vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'quart'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2012/12/gingerbread-ice-cream-floats.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, whisk together molasses and spices until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}]}, {u'equipment': [], u'step': u'Drizzle syrup down the insides and bottom of 4 chilled serving glasses. Gently drop two generous scoops of ice cream into each glass.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Pour cream soda over top, stirring gently to combine. Enjoy immediately.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 14130, u'name': u'cream soda'}]}], u'name': u''}], u'aggregateLikes': 4339, u'instructions': u'In a small bowl, whisk together molasses and spices until combined. Drizzle syrup down the insides and bottom of 4 chilled serving glasses. Gently drop two generous scoops of ice cream into each glass. Pour cream soda over top, stirring gently to combine. Enjoy immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/gingerbread-ice-cream-floats-494688', u'dishTypes': [u'dessert'], u'occasions': [u'christmas', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}