{u'recipes': [{u'sourceName': u'Bake Your Day', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552469-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 552469, u'veryPopular': True, u'lowFodmap': False, u'title': u"Peanut Butter Oatmeal Cookie Pie with Peanut Butter M&M's", u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 71.6, u'creditText': u'Bake Your Day', u'extendedIngredients': [{u'originalString': u'1/2 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 cup (1 stick) butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 cup + 2 Tbs. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup old-fashioned oats', u'aisle': u'Cereal', u'name': u'old-fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'1/4 cup + 2 Tbs. peanut butter, melted', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1 heaping cup peanut butter M&M candies (or other mix in of your choosing)', u'aisle': u'Sweet Snacks', u'name': u'peanut butter candies', u'metaInformation': [u'(or other mix in of your choosing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/reeses-pieces-or-peanut-butter-candies.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19151, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.bakeyourday.net/peanut-butter-oatmeal-cookie-pie-with-peanut-butter-mms/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees.  Grease a 9-inch round pie plate.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the butter and peanut butter to a large microwave bowl and melt.  Set aside to cool.  In a medium bowl, mix oats, flour, baking soda and salt and set aside.  When the butter and peanut butter are cooled completely, mix in the sugars until combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the egg, egg yolk and vanilla and mix well.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the dry ingredients and mix well.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread dough into the prepared pan and bake for 30-34 minutes.  The edges will be just browned and the center will be slightly firm but not fully set.  Don’t over bake!', u'length': {u'number': 34, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Let cool completely before cutting. Cassie's Notes:If you don't have old-fashioned oats, quick-cooking will work wonderfully; I just prefer the texture of old-fashioned.This dough can easily be made into cookies.  Drop by rounded teaspoon-full onto a prepared baking sheet and bake for 11-13 minutes.If you don't have a round pie plate, use any square baking dish and cut into square pieces. This would be divine with a scoop of ice cream on top, or so my husband says.", u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'rolled oats'}]}], u'name': u''}], u'aggregateLikes': 836, u'instructions': u"Preheat oven to 325 degrees.  Grease a 9-inch round pie plate.  Add the butter and peanut butter to a large microwave bowl and melt.  Set aside to cool.  In a medium bowl, mix oats, flour, baking soda and salt and set aside.  When the butter and peanut butter are cooled completely, mix in the sugars until combined.  Add the egg, egg yolk and vanilla and mix well.   Add the dry ingredients and mix well.  Spread dough into the prepared pan and bake for 30-34 minutes.  The edges will be just browned and the center will be slightly firm but not fully set.  Don’t over bake!  Let cool completely before cutting. Cassie's Notes:If you don't have old-fashioned oats, quick-cooking will work wonderfully; I just prefer the texture of old-fashioned.This dough can easily be made into cookies.  Drop by rounded teaspoon-full onto a prepared baking sheet and bake for 11-13 minutes.If you don't have a round pie plate, use any square baking dish and cut into square pieces. This would be divine with a scoop of ice cream on top, or so my husband says.", u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-oatmeal-cookie-pie-with-peanut-butter-m-ms-552469', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}