{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/393109-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 393109, u'veryPopular': True, u'lowFodmap': False, u'title': u'Broccoli-Cauliflower Cheese Bake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 35, u'pricePerServing': 68.47, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'6 cups fresh broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cups'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'7 cups fresh cauliflowerets', u'aisle': u'Produce', u'name': u'cauliflowerets', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'3-3/4 cups fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}, {u'originalString': u'1/3 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups (6 ounces) shredded part-skim mozzarella cheese, divided', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1028, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 teaspoons spicy brown mustard', u'aisle': u'Condiments', u'name': u'spicy brown mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'teaspoons'}, {u'originalString': u'1-1/2 cups (6 ounces) shredded Swiss cheese, divided', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1040, u'unit': u'ounces'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/broccoli-cauliflower-cheese-bake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Place cauliflower and broccoli in a Dutch oven; add 1 in. of water. Bring to a boil. Reduce heat; cover and simmer for 3-5 minutes or until crisp-tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Drain; transfer to a 13-in. x 9-in. baking dish coated with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In small saucepan, melt butter. Stir in the flour, mustard, salt, nutmeg, cayenne and pepper until smooth; gradually add milk. Bring to a boil; cook and stir for 1-2 minutes or until thickened.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Stir in 1-1/4 cups each mozzarella and Swiss cheeses until melted.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over vegetables.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake, uncovered, at 400\xb0 for 15-20 minutes or until bubbly. Sprinkle with remaining cheeses.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 5 minutes longer or until golden brown.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1499, u'instructions': u'Directions                                                                                Place cauliflower and broccoli in a Dutch oven; add 1 in. of water. Bring to a boil. Reduce heat; cover and simmer for 3-5 minutes or until crisp-tender. Drain; transfer to a 13-in. x 9-in. baking dish coated with cooking spray.                                                                                           In small saucepan, melt butter. Stir in the flour, mustard, salt, nutmeg, cayenne and pepper until smooth; gradually add milk. Bring to a boil; cook and stir for 1-2 minutes or until thickened.                                                                                           Stir in 1-1/4 cups each mozzarella and Swiss cheeses until melted. Pour over vegetables. Bake, uncovered, at 400\xb0 for 15-20 minutes or until bubbly. Sprinkle with remaining cheeses. Bake 5 minutes longer or until golden brown.                                        Yield: 16 servings.                                                                                                                         Originally published as Broccoli-Cauliflower Cheese Bake in  Healthy CookingOctober/November 2010, p34                                                                                                                                                                                                        Nutritional Facts                                                                             3/4 cup equals 132 calories, 7 g fat (4 g saturated fat), 22 mg cholesterol, 252 mg sodium, 9 g carbohydrate, 2 g fiber, 9 g protein. Diabetic Exchanges: 1 high-fat meat, 1 vegetable.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-cauliflower-cheese-bake-393109', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}