{u'recipes': [{u'sourceName': u'Low Carb Yum', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/920011-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 920011, u'veryPopular': True, u'lowFodmap': True, u'title': u'Blackberry Coconut Fat Bombs – Keto Paleo', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 55.74, u'creditText': u'Low Carb Yum', u'extendedIngredients': [{u'originalString': u'1 cup coconut butter see note for how to make homemade', u'aisle': u'Health Foods', u'name': u'coconut butter', u'metaInformation': [u'homemade', u'for how to make '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93746, u'unit': u'cup'}, {u'originalString': u'1 cup coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon SweetLeaf stevia drops add a bit more for sweeter taste', u'aisle': u'Baking', u'name': u'stevia drops', u'metaInformation': [u'for sweeter taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia-drops.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10811111, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup fresh or frozen blackberries can use raspberries or strawberries if desired', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon vanilla powder or 1/2 teaspoon vanilla extract', u'aisle': u'Gourmet', u'name': u'vanilla powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 93812, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'https://lowcarbyum.com/blackberry-coconut-fat-bombs-paleo/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place coconut butter, coconut oil and blackberries (if frozen) in a pot and heat over medium heat just until well combined.In a food processor or small blender, add coconut oil mix and remaining ingredients. Process until smooth. NOTE: Separation may occur if coconut oil mixture is too hot. If using fresh berries, there is no need to cook them with the coconut oil and butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'id': 93746, u'name': u'coconut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread out into a small pan lined with parchment paper (I used 6x6-inch container)Refrigerate one hour or until mix has hardened.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from container and cut into squares.Store covered in the refrigerator.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7056, u'instructions': u'Place coconut butter, coconut oil and blackberries (if frozen) in a pot and heat over medium heat just until well combined.In a food processor or small blender, add coconut oil mix and remaining ingredients. Process until smooth. NOTE: Separation may occur if coconut oil mixture is too hot. If using fresh berries, there is no need to cook them with the coconut oil and butter.Spread out into a small pan lined with parchment paper (I used 6x6-inch container)Refrigerate one hour or until mix has hardened.Remove from container and cut into squares.Store covered in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/blackberry-coconut-fat-bombs-keto-paleo-920011', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}