{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/397605-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 397605, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Chicken Wraps', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 121.7, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 packages (6 ounces each) ready-to-use grilled chicken breast strips', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 5062, u'unit': u'ounces'}, {u'originalString': u'6 flour tortillas (8 inches), room temperature', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'room temperature', u'(es)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 6.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'8-inch'}, {u'originalString': u'1/2 cup fat-free Italian salad dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian salad dressing', u'metaInformation': [u'fat-free', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'3 tablespoons shredded Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'1 package (16 ounces) frozen stir-fry vegetable blend', u'aisle': u'Produce', u'name': u'vegetable blend', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11583, u'unit': u'ounces'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/italian-chicken-wraps', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, cook vegetables according to package directions; drain. Stir in the chicken, salad dressing and cheese; heat through. Spoon about 3/4 cup down the center of each tortilla; roll up tightly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'id': 4114, u'name': u'salad dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Directions                                                                                In a large saucepan, cook vegetables according to package directions; drain. Stir in the chicken, salad dressing and cheese; heat through. Spoon about 3/4 cup down the center of each tortilla; roll up tightly.                                        Yield: 6 servings.                                                                                                                         Originally published as Italian Chicken Wraps in  Light & TastyJune/July 2005, p39                                                                                                                                                                                                        Nutritional Facts                                                                             1 wrap equals 290 calories, 6 g fat (2 g saturated fat), 40 mg cholesterol, 1,129 mg sodium, 38 g carbohydrate, 3 g fiber, 20 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-chicken-wraps-397605', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}