{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/196856-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196856, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick Pickled Chilies and Garlic', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 179.89, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 to 6 small red Thai chilies, roughly chopped', u'aisle': u'Produce', u'name': u'chilies', u'metaInformation': [u'red', u'small', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'24 medium cloves garlic, sliced thin', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'medium', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 24.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup distilled white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white distilled vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/01/quick-pickled-chili-garlic-condiment-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine vinegar, garlic, chilies, and salt in a small saucepan. Bring to a simmer over medium heat, stirring, and cook for 30 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Transfer to a heat-proof container and let cool completely. Store covered in the refrigerator for up to 6 months', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili on the menu? Try pairing with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Segura Viudas Brut Reserva Heredad Cava. It has 4.1 out of 5 stars and a bottle costs about 22 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Like a rich Chardonnay with bubbles, this limited production Cava rests on an authentic pewter base and comes in a handsome hand-blown bottle emblazoned with a metal crest of the Segura Viudas family. Perfect with pasta drizzled in truffle oil, slow braised meats, cured meat and cheese plates, oysters.', u'title': u'Segura Viudas Brut Reserva Heredad Cava', u'price': u'$21.99', u'id': 448175, u'link': u'https://www.wine.com/product/segura-viudas-brut-reserva-heredad-cava/4103', u'imageUrl': u'https://spoonacular.com/productImages/448175-312x231.jpg'}]}, u'aggregateLikes': 46, u'instructions': u'Procedures                                                                              1                                                                            Combine vinegar, garlic, chilies, and salt in a small saucepan. Bring to a simmer over medium heat, stirring, and cook for 30 seconds. Transfer to a heat-proof container and let cool completely. Store covered in the refrigerator for up to 6 months', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-pickled-chilies-and-garlic-196856', u'dishTypes': [u'soup'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}