{u'recipes': [{u'sourceName': u'Kitchen Confidante', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/626907-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 626907, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prime Rib Pho', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 281.07, u'creditText': u'Kitchen Confidante', u'extendedIngredients': [{u'originalString': u'1/4 cup basil, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 stalks celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'Asian chili garlic sauce, sriracha, and/or hoisin for serving', u'aisle': u'Ethnic Foods', u'name': u'chili-garlic sauce', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 93749, u'unit': u'servings'}, {u'originalString': u'1/4 cup cilantro, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 stick cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'stick'}, {u'originalString': u'3 tablespoons fish sauce, plus more to taste', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoons'}, {u'originalString': u'2 jalape\xf1os, thinly sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 limes, sliced in wedges', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'sliced in wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1 lb mung beans', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'mung beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mung-beans.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16080, u'unit': u'lb'}, {u'originalString': u'1 lb dried pho noodles (Vietnamese rice noodles)', u'aisle': u'Pasta and Rice', u'name': u'noodles', u'metaInformation': [u'dried', u'(Vietnamese rice noodles)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'lb'}, {u'originalString': u'1/2 onion with skin attached', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'with skin attached'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 left over prime rib bones, with some meat', u'aisle': u'Meat', u'name': u'prime rib', u'metaInformation': [u'with some meat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 13833, u'unit': u''}, {u'originalString': u'2 scallions, thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'8 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://kitchenconfidante.com/simple-sundays-left-over-prime-rib-pho-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven or stock pot, cover rib bones, onion, celery and carrot with 8 cups water. Bring to a boil, then allow to simmer over low heat for about 1hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Remove the ribs and meat, allow to cool for a moment, but let the soup stock continue to simmer on the stove. When the beefis cool enough to handle, debone and shred the meat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the shredded beefinto the refrigerator while the rest of the meal is cooking.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the bones and the skin back into the soup pot and continue to simmer for about 3 hours. Strain the soup stock into a large pot or dutch oven, add the cinnamon, fish sauce, and chicken broth, and cook over high heat until the liquid reduces to roughly 8cups. Season to taste with additional fish sauce and freshly ground black pepper, if necessary.Skim any fat from the broth. If possible, strain the broth into containers and refrigerate ovenight. Discard any fat that has chilled on the top.Soak the noodles in a bowl of hot water for 30 minutes, or until soft.Bring a pot of water to boil. Salt it generously, then drop in the softened rice noodles and cook for about 3 minutes.', u'length': {u'number': 33, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Drain. Do the same for the mung beans, blanching them briefly.Divide the rice noodles, mung beans, and shredded meatinto bowls, and ladle broth into each bowl.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mung-beans.png', u'id': 16080, u'name': u'mung beans'}]}, {u'equipment': [], u'step': u'Garnish with scallions, basil, cilantro, jalapeo slices and chili sauce.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Prime Rib works really well with Pinot Noir, Cabernet Sauvignon, and Merlot. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. One wine you could try is J Vineyards & Winery Pinot Noir. It has 5 out of 5 stars and a bottle costs about 48 dollars.', u'pairedWines': [u'pinot noir', u'cabernet sauvignon', u'merlot'], u'productMatches': [{u'description': u'At J, we are devoted to the concept of terroir in the Russian River Valley, and our 2013 J Vineyards Pinot Noir is a reflection of this vintage, the vineyards and our attention to detail in the winery. Delivering bright berry flavors-red cherry, raspberry and blackberry- this elegant Pinot is enhanced by notes of licorice and red tea, which linger on the finish. Aromas of wild strawberries and spices delight the nose.', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'In a Dutch oven or stock pot, cover rib bones, onion, celery and carrot with 8 cups water. Bring to a boil, then allow to simmer over low heat for about 1hour.Remove the ribs and meat, allow to cool for a moment, but let the soup stock continue to simmer on the stove. When the beefis cool enough to handle, debone and shred the meat. Place the shredded beefinto the refrigerator while the rest of the meal is cooking. Place the bones and the skin back into the soup pot and continue to simmer for about 3 hours. Strain the soup stock into a large pot or dutch oven, add the cinnamon, fish sauce, and chicken broth, and cook over high heat until the liquid reduces to roughly 8cups. Season to taste with additional fish sauce and freshly ground black pepper, if necessary.Skim any fat from the broth. If possible, strain the broth into containers and refrigerate ovenight. Discard any fat that has chilled on the top.Soak the noodles in a bowl of hot water for 30 minutes, or until soft.Bring a pot of water to boil. Salt it generously, then drop in the softened rice noodles and cook for about 3 minutes. Drain. Do the same for the mung beans, blanching them briefly.Divide the rice noodles, mung beans, and shredded meatinto bowls, and ladle broth into each bowl. Garnish with scallions, basil, cilantro, jalapeo slices and chili sauce. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/prime-rib-pho-626907', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}