{u'recipes': [{u'sourceName': u'Grumpys Honey Bunch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549897-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 549897, u'veryPopular': False, u'lowFodmap': False, u'title': u"Shelby's Take on the Bacon, Egg and Cheese", u'diets': [u'dairy free'], u'preparationMinutes': 4, u'pricePerServing': 285.51, u'creditText': u'Grumpys Honey Bunch', u'extendedIngredients': [{u'originalString': u'1 mini whole wheat bagel', u'aisle': u'Bakery/Bread', u'name': u'bagel', u'metaInformation': [u'whole wheat', u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-bagel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18408, u'unit': u''}, {u'originalString': u'1/8 cup egg beaters', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg beaters', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.125, u'consistency': u'solid', u'id': 93833, u'unit': u'cup'}, {u'originalString': u'2 MorningStar Farms Stripples', u'aisle': u'Frozen', u'name': u'morningstar farms patty', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 16147, u'unit': u''}, {u'originalString': u'1 wedge laughing cow cheese, queso flavored', u'aisle': u'?', u'name': u'wedge laughing cow cheese', u'metaInformation': [u' queso flavored'], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}], u'healthScore': 92.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.grumpyshoneybunch.com/2012/07/shelbys-take-on-bacon-egg-and-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook Stripples in the microcwave according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat skillet to medium heat and coat egg ring and pan with non stick cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place egg ring into hot pan and pour egg product into egg ring. Cook until egg is no longer wet about 3 minutes.Meanwhile, toast bagel in toaster.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bagels.jpg', u'id': 18408, u'name': u'bagel'}]}, {u'equipment': [], u'step': u'Spread each side of bagel with Laughing Cow Cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bagels.jpg', u'id': 18408, u'name': u'bagel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove egg from skillet and place on bottom half of bagel. Top with stripples and other half of bagel. Enjoy!Tips: \xa0Try other flavors of the laughing cow cheese for variety. You can also use the 100 calorie english muffins in place of the bagel and if you want to cut calories a little more go with only 1 stripple. I tend to like my stripples though so for me its worth the few extra calories!', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bagels.jpg', u'id': 18408, u'name': u'bagel'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 306, u'instructions': u'Cook Stripples in the microcwave according to package directions.Heat skillet to medium heat and coat egg ring and pan with non stick cooking spray. Place egg ring into hot pan and pour egg product into egg ring. Cook until egg is no longer wet about 3 minutes.Meanwhile, toast bagel in toaster. Spread each side of bagel with Laughing Cow Cheese.Remove egg from skillet and place on bottom half of bagel. Top with stripples and other half of bagel. Enjoy!Tips: \xa0Try other flavors of the laughing cow cheese for variety. You can also use the 100 calorie english muffins in place of the bagel and if you want to cut calories a little more go with only 1 stripple. I tend to like my stripples though so for me its worth the few extra calories!', u'spoonacularSourceUrl': u'https://spoonacular.com/shelbys-take-on-the-bacon-egg-and-cheese-549897', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 8, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}