{u'recipes': [{u'sourceName': u'From Valeries Kitchen', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/512946-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 512946, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Sausage Appetizer Bread', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 177.45, u'creditText': u'From Valeries Kitchen', u'extendedIngredients': [{u'originalString': u'2 (1 pound) loaves frozen white bread dough, thawed', u'aisle': u'Frozen', u'name': u'bread dough', u'metaInformation': [u'white', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 99063, u'unit': u'pound'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 cups shredded Italian blend cheese', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'shredded', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 93651, u'unit': u'cups'}, {u'originalString': u'1 (16 ounce) package Johnsonville All Natural Mild Ground Italian Sausage or Sausage Links', u'aisle': u'Meat', u'name': u'italian sausage links', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 7036, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoon poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2033, u'unit': u'teaspoon'}, {u'originalString': u'4 ounces reduced fat (Neufchatel) cream cheese, softened', u'aisle': u'Cheese', u'name': u'reduced fat cream cheese', u'metaInformation': [u'softened', u'(Neufchatel)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'1 (7 ounce) jar roasted red peppers, well drained and chopped', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'red', u'drained', u'chopped', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 11916, u'unit': u'ounce'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.fromvalerieskitchen.com/2013/11/italian-sausage-appetizer-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.If using sausage links, remove and discard casings. In a skillet, brown sausage until no longer pink.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer fully cooked sausage to a double layer of paper towels to drain.Meanwhile, on a lightly floured board, roll bread dough to a 16" x 9" rectangle.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough', u'id': 99063, u'name': u'bread dough'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Transfer dough to a rimmed baking sheet that has been lined with parchment paper or sprayed with non-stick cooking spray. Repeat with remaining loaf.In a small mixing bowl, combine cream cheese and garlic. Divide this mixture between the two loaves, spreading out over the center third of each. Top each with half the sausage, have the chopped peppers, and half the cheese. Fold ends of dough in and over filling and then fold over the sides, one on top of the other, smoothing the loaf out with your hands and pinching the seam to seal.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Brush lightly with milk and sprinkle with poppy seeds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Cut slits across loaves about every 2" to vent.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 degrees for 20-25 minutes or until golden brown.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 10 minutes before slicing.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 19, u'instructions': u'Preheat oven to 375 degrees.If using sausage links, remove and discard casings. In a skillet, brown sausage until no longer pink.Transfer fully cooked sausage to a double layer of paper towels to drain.Meanwhile, on a lightly floured board, roll bread dough to a 16" x 9" rectangle. Transfer dough to a rimmed baking sheet that has been lined with parchment paper or sprayed with non-stick cooking spray. Repeat with remaining loaf.In a small mixing bowl, combine cream cheese and garlic. Divide this mixture between the two loaves, spreading out over the center third of each. Top each with half the sausage, have the chopped peppers, and half the cheese. Fold ends of dough in and over filling and then fold over the sides, one on top of the other, smoothing the loaf out with your hands and pinching the seam to seal. Brush lightly with milk and sprinkle with poppy seeds. Cut slits across loaves about every 2" to vent.Bake at 375 degrees for 20-25 minutes or until golden brown. Let stand 10 minutes before slicing.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-sausage-appetizer-bread-512946', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}