{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598111-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 598111, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hunan Hot-and-Spicy Shrimp', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 40, u'pricePerServing': 293.92, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 tablespoons lightly beaten egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon peeled and minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'5 tablespoons ketchup (see Note below)', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [u'(see Note below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon mung bean starch', u'aisle': u'Produce;Ethnic Foods', u'name': u'mung bean sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11043, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4042, u'unit': u'cup'}, {u'originalString': u'2 teaspoons white rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup 1/4-inch-dice shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}, {u'originalString': u'1 1/2 tablespoons Shaoxing wine', u'aisle': u'Alcoholic Beverages', u'name': u'shaoxing wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 43479, u'unit': u'tablespoons'}, {u'originalString': u'1 pound large shrimp (40 count per pound)', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'per pound)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons pepper flakes from Hot Pepper Oil (below) or 1 1/2 teaspoons coarsely ground dried Thai chiles', u'aisle': u'Produce;Ethnic Foods', u'name': u'thai chiles', u'metaInformation': [u'dried', u'hot', u'(below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11670, u'unit': u'teaspoons'}, {u'originalString': u'Pinch of white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2032, u'unit': u'pinch'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://leitesculinaria.com/27145/recipes-hunan-hot-spicy-shrimp.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Peel the shrimp, leaving the tail segments intact, then devein and clean them.2. In a bowl, mix together all of the ingredients to make the shrimp coating.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the shrimp and turn to coat. Refrigerate for 30 minutes.3. To make the sauce mix together all of the ingredients in a small bowl and reserve.4.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a wok over high heat for 30 seconds.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Add the peanut oil, and, using a spatula, coat the wok with the oil. When a wisp of white smoke appears, add the ginger and stir briefly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'id': 4042, u'name': u'peanut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the garlic and stir briefly.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the shallots, stir to mix, and lower the heat to medium. Cook for 2 to 3 minutes, or until the shallots soften.5. Raise the heat to high, add the shrimp and their coating, and stir to mix.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Spread the shrimp in a single layer and cook for 1 minute, or until the shrimp begin to turn pink. Turn the shrimp over and mix.6.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Drizzle in the wine, adding it along the edge of the wok, and mix well. Stir the sauce, pour it over the shrimp, and mix well. Stir-fry for about 1 1/2 minutes, or until the shrimp are well-coated and the sauce begins to bubble.7. Turn off the heat, transfer to a heated dish, and serve.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Casa Catelli Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'1. Peel the shrimp, leaving the tail segments intact, then devein and clean them.2. In a bowl, mix together all of the ingredients to make the shrimp coating. Add the shrimp and turn to coat. Refrigerate for 30 minutes.3. To make the sauce mix together all of the ingredients in a small bowl and reserve.4. Heat a wok over high heat for 30 seconds. Add the peanut oil, and, using a spatula, coat the wok with the oil. When a wisp of white smoke appears, add the ginger and stir briefly. Add the garlic and stir briefly. Add the shallots, stir to mix, and lower the heat to medium. Cook for 2 to 3 minutes, or until the shallots soften.5. Raise the heat to high, add the shrimp and their coating, and stir to mix. Spread the shrimp in a single layer and cook for 1 minute, or until the shrimp begin to turn pink. Turn the shrimp over and mix.6. Drizzle in the wine, adding it along the edge of the wok, and mix well. Stir the sauce, pour it over the shrimp, and mix well. Stir-fry for about 1 1/2 minutes, or until the shrimp are well-coated and the sauce begins to bubble.7. Turn off the heat, transfer to a heated dish, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/hunan-hot-and-spicy-shrimp-598111', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}