{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/563575-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 563575, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crispy Coated Schnitzel with Creamy Leek and Mushroom Sauce', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 215.75, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 cup So Delicious Dairy Free Unsweetened Coconut Milk Beverage or Almond Plus Protein AlmondMilk', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'3 tablespoons black sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'black sesame seeds', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-sesame-seeds-or-chia-seeds.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10012023, u'unit': u'tablespoons'}, {u'originalString': u'1-1/2 cups finely crushed cornflakes cereal or bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'crushed', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cups'}, {u'originalString': u'6 thin pork cutlets or thin chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 large egg + 1 tablespoon water', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup washed, chopped leeks', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'washed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11246, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup chopped oyster mushrooms (or any type)', u'aisle': u'Produce', u'name': u'oyster mushrooms', u'metaInformation': [u'or any type)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11987, u'unit': u'cup'}, {u'originalString': u'2-3 tablespoons chopped parsley, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'Good quality vegetable oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'1 tablespoon whole grain mustard', u'aisle': u'Condiments', u'name': u'whole grain mustard', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoon'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/crispy-coated-schnitzel-creamy-leek-mushroom-sauce', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk egg and water in a shallow dish, like a pie plate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Place all of the cutlets in the plate. Using your hands toss to coat. Wash hands.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place crumbs, sesame seeds, garlic powder, salt & pepper to taste on a long piece of parchment/wax or butcher’s paper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Mix to combine. Using tongs grasp one cutlet at a time and dip into crumb mixture to coat on both sides. Using the back of the tongs to press the mixture onto the pork, or the back of your hand. Continue until all are coated.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour 1-inch of oil into a preheated large skillet pan on medium high heat. To test the oil, drop a pinch of crumbs into the oil. If it sizzles it is ready.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place one cutlet at a time into the pan, depending on the size of pan. Cook until golden brown on both sides.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain on paper towel to absorb oil. Continue until all are cooked and juices run clear.Meanwhile place 2 tablespoons of olive oil in a preheated small pot add leeks add salt to taste. Cook stirring to soften then add mushrooms and continue cooking for 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the flour stir to combine, mixture will “soak” up oil. Continue to cook and stir for 1 min.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour in the milk slowly, whisking constantly, then add mustard, pepper and taste for salt. Cook for 5-8 min. Do not allow to boil…keep it on a low simmer. Divide and pour over the cutlets.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Garnish with parsley.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Schnitzel works really well with Dornfelder and Riesling. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'Whisk egg and water in a shallow dish, like a pie plate. Place all of the cutlets in the plate. Using your hands toss to coat. Wash hands. Place crumbs, sesame seeds, garlic powder, salt & pepper to taste on a long piece of parchment/wax or butcher’s paper. Mix to combine. Using tongs grasp one cutlet at a time and dip into crumb mixture to coat on both sides. Using the back of the tongs to press the mixture onto the pork, or the back of your hand. Continue until all are coated.Pour 1-inch of oil into a preheated large skillet pan on medium high heat. To test the oil, drop a pinch of crumbs into the oil. If it sizzles it is ready. Place one cutlet at a time into the pan, depending on the size of pan. Cook until golden brown on both sides. Drain on paper towel to absorb oil. Continue until all are cooked and juices run clear.Meanwhile place 2 tablespoons of olive oil in a preheated small pot add leeks add salt to taste. Cook stirring to soften then add mushrooms and continue cooking for 1-2 minutes. Add the flour stir to combine, mixture will “soak” up oil. Continue to cook and stir for 1 min. Pour in the milk slowly, whisking constantly, then add mustard, pepper and taste for salt. Cook for 5-8 min. Do not allow to boil…keep it on a low simmer. Divide and pour over the cutlets.Garnish with parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-coated-schnitzel-with-creamy-leek-and-mushroom-sauce-563575', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}