{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/199752-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199752, u'veryPopular': True, u'lowFodmap': False, u'title': u'Potato Tacos with Avocado and Tomatillo Salsa', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 254.01, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbd cup cilantro leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'12 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1 large garlic clove, quartered', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'large', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 \xbd cups iceberg lettuce, shredded', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11252, u'unit': u'cups'}, {u'originalString': u'1 jalapeno, stemmed, seeded, and chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'stemmed', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'\xbd cup Mexican crema, or sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican crema', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93772, u'unit': u'cup'}, {u'originalString': u'Potato Tacos', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11362, u'unit': u'servings'}, {u'originalString': u'4 ounces queso fresco, divided, crumbled', u'aisle': u'Cheese', u'name': u'queso fresco', u'metaInformation': [u'divided', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1228, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'Avocado and Tomatillo Salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'tomatillo salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 27028, u'unit': u'servings'}, {u'originalString': u'4 medium tomatillos, husked, rinsed, and quartered', u'aisle': u'Produce', u'name': u'tomatillos', u'metaInformation': [u'medium', u'husked', u'rinsed', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11954, u'unit': u''}, {u'originalString': u'\xbc cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 pound Yukon Gold potatoes, peeled, chopped into \xbd-inch pieces', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'pound'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/02/potato-tacos-with-avocado-and-tomatillo-salsa-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Cut avocados in half lengthwise, and remove large seeds. Scoop out flesh and place in blender along with tomatillos, garlic, chiles, cilantro, \xbc cup water, and salt. Process until it is a coarse puree. Set aside. The avocado sauce won’t turn brown because of the tomatillos.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'For the Potato Tacos: Bring large pot of water to boil over high heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Add potatoes and cook until tender, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-ricer.jpg', u'id': 404790, u'name': u'potato ricer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain in a colander. Mash the potato in large bowl, or pass through potato ricer.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Mix in half of the queso fresco. Season mixture with salt and pepper to taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'id': 1228, u'name': u'queso fresco'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spoon two tablespoons of potato mixture into each tortilla. Fold each over, and secure each with one tooth pick, weaving in and out to keep each in a “U” shape.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour oil into large 10-inch cast iron pan set over medium-high heat. When oil is shimmering, add enough tacos as will fit in a single layer, probably three. Cook until crisp and golden on each side, about 30 seconds for each, flipping with pair of tongs. When done, remove tacos, draining as much oil as you can.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place on paper towels and repeat process until all tacos are cooked.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Serve tacos with salsa, crema, and lettuce.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 93772, u'name': u'mexican crema'}]}], u'name': u'For the Avocado Salsa'}], u'winePairing': {u'pairingText': u'Tacos can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Mark West Black Label Monterey County Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches.", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 425, u'instructions': u'Procedures                                                                              1                                                                            For the Avocado Salsa: Cut avocados in half lengthwise, and remove large seeds. Scoop out flesh and place in blender along with tomatillos, garlic, chiles, cilantro, \xbc cup water, and salt. Process until it is a coarse puree. Set aside. The avocado sauce won’t turn brown because of the tomatillos.                                                                                                                             2                                                                            For the Potato Tacos: Bring large pot of water to boil over high heat. Add potatoes and cook until tender, about 10 minutes. Drain in a colander. Mash the potato in large bowl, or pass through potato ricer. Mix in half of the queso fresco. Season mixture with salt and pepper to taste.                                                                                                                             3                                                                            Spoon two tablespoons of potato mixture into each tortilla. Fold each over, and secure each with one tooth pick, weaving in and out to keep each in a “U” shape.                                                                                                                             4                                                                            Pour oil into large 10-inch cast iron pan set over medium-high heat. When oil is shimmering, add enough tacos as will fit in a single layer, probably three. Cook until crisp and golden on each side, about 30 seconds for each, flipping with pair of tongs. When done, remove tacos, draining as much oil as you can. Place on paper towels and repeat process until all tacos are cooked.                                                                                                                             5                                                                            Serve tacos with salsa, crema, and lettuce.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-tacos-with-avocado-and-tomatillo-salsa-199752', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}