{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/199748-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199748, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bacon-Bourbon Jam', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 498.52, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'6 tablespoons bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'6 tablespoons brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 14209, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup packed dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'3 medium cloves garlic, peel and coarsely chopped (About 2 teaspoons)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'medium', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'2 medium onions, diced (about 2 cups)', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1 1/2 pounds regular, supermarket variety bacon, cut crosswise into 1-inch pieces', u'aisle': u'Cereal', u'name': u'regular chex', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chex-cereal.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 1008082, u'unit': u'pounds'}], u'healthScore': 96.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/02/bacon-bourbon-jam-recipe.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 41, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Divide bacon between two large skillets and cook over medium-high heat, stirring frequently, until fat is rendered and bacon is lightly browned and starting to crisp, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer bacon to paper towels to drain. Discard fat from one skillet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour off all but one tablespoon fat from remaining skillet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions and garlic and cook, stirring frequently, until onions are softened and translucent, about five minutes.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add vinegar, brown sugar, maple syrup, coffee, and bourbon. Bring to a boil and cook for two minutes, stirring and scraping browned bits from bottom of skillet with wooden spoon.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}, {u'equipment': [], u'step': u'Add bacon and stir to combine.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer mixture to a six-quart slow-cooker and cook on high, uncovered, until liquid has reduced and thickened slightly and bacon is a deep burnished brown, 3 1/2 to 4 hours.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Transfer mixture to food processor and pulse until coarsely chopped.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool, then transfer to airtight jars. Store in refrigerator for up to one month.', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 912, u'instructions': u'Procedures                                                                              1                                                                            Divide bacon between two large skillets and cook over medium-high heat, stirring frequently, until fat is rendered and bacon is lightly browned and starting to crisp, about 20 minutes.                                                                                                                            2                                                                            Transfer bacon to paper towels to drain. Discard fat from one skillet. Pour off all but one tablespoon fat from remaining skillet. Add onions and garlic and cook, stirring frequently, until onions are softened and translucent, about five minutes. Add vinegar, brown sugar, maple syrup, coffee, and bourbon. Bring to a boil and cook for two minutes, stirring and scraping browned bits from bottom of skillet with wooden spoon. Add bacon and stir to combine.                                                                                                                            3                                                                            Transfer mixture to a six-quart slow-cooker and cook on high, uncovered, until liquid has reduced and thickened slightly and bacon is a deep burnished brown, 3 1/2 to 4 hours.                                                                                                                             4                                                                            Transfer mixture to food processor and pulse until coarsely chopped. Let cool, then transfer to airtight jars. Store in refrigerator for up to one month.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-bourbon-jam-199748', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}