{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/210943-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 210943, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican roast chicken & tomato soup', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 476.76, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 avocados, stoned, peeled and cut into bite-sized pieces', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'peeled', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 medium chicken, jointed into pieces', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1025006, u'unit': u''}, {u'originalString': u'3 red chillies, deseeded and roughly chopped', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'red', u'deseeded', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'4 tbsp chipotle paste', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11632, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp coriander seed, crushed', u'aisle': u'Spices and Seasonings', u'name': u'coriander seed', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2013, u'unit': u'tbsp'}, {u'originalString': u'3 corn tortillas, cut into triangles', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'cut into triangles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'large handful coriander, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'3 garlic cloves, roughly chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'zest and juice 1 lime', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'2 tbsp olive oil, plus extra for shallow frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for shallow frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 onions, cut into wedges', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'400g can pinto or black beans, drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'pinto beans', u'metaInformation': [u'black', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 16043, u'unit': u'g'}, {u'originalString': u'200ml soured cream (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soured cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'solid', u'id': 1056, u'unit': u'ml'}, {u'originalString': u'1\xbd kg ripe tomatoes, halved vertically', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'ripe', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 1.5, u'consistency': u'solid', u'id': 11529, u'unit': u'kg'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2875667/mexican-roast-chicken-and-tomato-soup', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Put the tomatoes, cut-side up, in a largeroasting tin with the onions and top withthe chicken pieces. Season generouslyand drizzle over 1 tbsp of the olive oil.Roast for 45 mins until the chicken iscrisp and tender, and the tomatoesstart to caramelise.When the chicken is ready, removefrom the oven to a plate and cover with foil. Use a slotted spoon to transfer thetomato and onions to a food processorand blitz until smooth. Reserve thecooking juices from the roasting tin.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Heat the remaining oil in a mediumsaucepan and fry the garlic, chillies andcoriander seeds for a few mins until justbrown. Pull the meat from the chickenbones, tear into chunks and mix withthe beans, lime zest and chipotle paste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add this chicken mix to the pan butreserve one-third of it.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the soup intothe pan and add enough of the cookingjuices until you get a nice consistency.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Heat a few inches of oil in a smallsaucepan, then carefully shallow-frythe tortilla pieces in batches until crisp.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drain on kitchen paper.To serve, gently reheat the soup,season to taste and stir through thecoriander. Top with the reserved chickenmix, avocados and lime juice.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Servewith the tortilla chips and souredcream, if you like.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 179, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Put the tomatoes, cut-side up, in a largeroasting tin with the onions and top withthe chicken pieces. Season generouslyand drizzle over 1 tbsp of the olive oil.Roast for 45 mins until the chicken iscrisp and tender, and the tomatoesstart to caramelise.When the chicken is ready, removefrom the oven to a plate and cover with foil. Use a slotted spoon to transfer thetomato and onions to a food processorand blitz until smooth. Reserve thecooking juices from the roasting tin.Heat the remaining oil in a mediumsaucepan and fry the garlic, chillies andcoriander seeds for a few mins until justbrown. Pull the meat from the chickenbones, tear into chunks and mix withthe beans, lime zest and chipotle paste.Add this chicken mix to the pan butreserve one-third of it. Pour the soup intothe pan and add enough of the cookingjuices until you get a nice consistency.Heat a few inches of oil in a smallsaucepan, then carefully shallow-frythe tortilla pieces in batches until crisp.Drain on kitchen paper.To serve, gently reheat the soup,season to taste and stir through thecoriander. Top with the reserved chickenmix, avocados and lime juice. Servewith the tortilla chips and souredcream, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-roast-chicken-tomato-soup-210943', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}