{u'recipes': [{u'sourceName': u'This Mama Cooks', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/839301-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 839301, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick & Easy Pulled Pork & Cornbread Skillet Dinner', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 133.79, u'creditText': u'This Mama Cooks', u'extendedIngredients': [{u'originalString': u'1/3 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 (15 ounce) box Krusteaz Gluten Free Honey Cornbread and Muffin Mix', u'aisle': u'Baking', u'name': u'cornbread mix', u'metaInformation': [u'gluten free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornbread.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 18022, u'unit': u'ounce'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 bag frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'bag'}, {u'originalString': u'1 Farm Rich Smokehouse Pulled Pork BBQ', u'aisle': u'Meat', u'name': u'pulled pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10983, u'unit': u''}, {u'originalString': u'1 cup shredded Mexican four cheese blend', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1251, u'unit': u'cup'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.thismamacooks.com/2017/01/quick-easy-pulled-pork-cornbread-skillet-dinner-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place gluten free cornbread mix, water, canola oil, egg, and cheese in a medium bowl. Stir until well blended. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place bag of frozen corn in microwave and heat for 2 to 3 minutes, just long enough to separate kernels of corn.(From frozen)', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11913, u'name': u'frozen corn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove outer carton of Farm Rich Smokehouse Pulled Pork BBQ, lift corner of film tor vent and place tray on microwave-safe plate. Microwave on HIGH 4 minutes. Carefully pull back film, stir, and break up any large pieces of pulled pork.Take a 12-inch oven safe skillet and spray with cooking spray. Spoon pulled pork on to skillet and cover bottom of skillet evenly. Then evenly pour corn over pulled pork.Spoon cornbread batter over pulled pork in large spoonfuls and spread evenly with a spatula.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 30 to 32 minutes or until golden brown. A toothpick inserted into the center should come out clean.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern on the menu? Try pairing with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Bella Grace Vineyards Old Vine Zinfandel. It has 5 out of 5 stars and a bottle costs about 29 dollars.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'tobacco , cherry , black pepper', u'title': u'Bella Grace Vineyards Old Vine Zinfandel', u'price': u'$29.0', u'id': 430961, u'link': u'https://www.amazon.com/Bella-Vineyards-Amador-County-Zinfandel/dp/B016WNI6IQ', u'imageUrl': u'https://spoonacular.com/productImages/430961-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Preheat the oven to 375 degrees F.Place gluten free cornbread mix, water, canola oil, egg, and cheese in a medium bowl. Stir until well blended. Set aside.Place bag of frozen corn in microwave and heat for 2 to 3 minutes, just long enough to separate kernels of corn.(From frozen) Remove outer carton of Farm Rich Smokehouse Pulled Pork BBQ, lift corner of film tor vent and place tray on microwave-safe plate. Microwave on HIGH 4 minutes. Carefully pull back film, stir, and break up any large pieces of pulled pork.Take a 12-inch oven safe skillet and spray with cooking spray. Spoon pulled pork on to skillet and cover bottom of skillet evenly. Then evenly pour corn over pulled pork.Spoon cornbread batter over pulled pork in large spoonfuls and spread evenly with a spatula.Bake for 30 to 32 minutes or until golden brown. A toothpick inserted into the center should come out clean.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-easy-pulled-pork-cornbread-skillet-dinner-839301', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}