{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/556526-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 556526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skinny Cajun Alfredo Skillet with Pulled Pork', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 239.55, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'2 cup unsweetened almond milk, (or fat free milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'fat free', u'unsweetened', u'(or milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u"8 oz brown rice pasta, cooked according to package's instructions", u'aisle': u'Pasta and Rice', u'name': u'brown rice pasta', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-rice-vermicelli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 99038, u'unit': u'oz'}, {u'originalString': u'2 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 cup diced cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'Cilantro, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1 cup cottage cheese', u'aisle': u'Cheese', u'name': u'cottage cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1012, u'unit': u'cup'}, {u'originalString': u'1 cup fontina, shredded', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1020, u'unit': u'cup'}, {u'originalString': u'2 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped peppadew peppers', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111333, u'unit': u'cup'}, {u'originalString': u'1 small red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'4 tsp cajun seasonings', u'name': u'seasonings', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp Tapioca Starch', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93696, u'unit': u'Tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/skinny-cajun-alfredo-skillet-pulled-pork/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt butter in large skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add red onion. Cook 5 minutes or until opaque. Stir in tapioca starch until it coats the onions and butter is fully absorbed.In a blender, puree milk and cottage cheese until well blended and smooth.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'id': 1012, u'name': u'cottage cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add milk mixture to skillet and whisk until fully incorporated.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add peppadew pepper,tomatoes, cajun seasoning and garlic powder. Stir well.Slowly whisk in fontina cheese and whisk until cheese is fully melted. Stir in pasta.Turn on broiler to high.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'id': 1020, u'name': u'fontina cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}]}, {u'equipment': [], u'step': u'Add pork to top of pasta.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place skillet under broiler for 2-3 minutes, or until pork is crisp and heated through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with cilantro and serve immediately.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Felsina Chianti Colli Senesi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and  mellow on the palate, with a delightful finish of red fruit and vanilla. View More', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'Melt butter in large skillet over medium heat. Add red onion. Cook 5 minutes or until opaque. Stir in tapioca starch until it coats the onions and butter is fully absorbed.In a blender, puree milk and cottage cheese until well blended and smooth.Add milk mixture to skillet and whisk until fully incorporated.Add peppadew pepper,tomatoes, cajun seasoning and garlic powder. Stir well.Slowly whisk in fontina cheese and whisk until cheese is fully melted. Stir in pasta.Turn on broiler to high. Add pork to top of pasta. Place skillet under broiler for 2-3 minutes, or until pork is crisp and heated through.Garnish with cilantro and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-cajun-alfredo-skillet-with-pulled-pork-556526', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}