{u'recipes': [{u'sourceName': u'My Recipes', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/834946-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 834946, u'veryPopular': True, u'lowFodmap': False, u'title': u'Greek Baked Ziti', u'diets': [], u'pricePerServing': 251.63, u'creditText': u'My Recipes', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 (15-oz.) cans tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'1/3 cup fine, dry breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'dry breadcrumbs', u'metaInformation': [u'dry', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'3 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 pounds lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 23557, u'unit': u'pounds'}, {u'originalString': u'1 tablespoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'3 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 teaspoons dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'1 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 (8-oz.) package shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'oz'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 small yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}, {u'originalString': u'12 ounces ziti pasta', u'aisle': u'Pasta and Rice', u'name': u'ziti pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ziti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11520420, u'unit': u'ounces'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.myrecipes.com/recipe/greek-baked-ziti-0', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350. Cook pasta in a Dutch oven according to package directions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, saut onion in hot oil in large skillet over medium-high heat 4 to 5 minutes or until tender.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic; saut 30 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add beef; cook, stirring occasionally, 5 minutes or until crumbled and no longer pink.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain mixture, and return to skillet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Stir tomato sauce, next 4 ingredients, and 1 tsp. salt into meat mixture. Bring to a simmer over medium-high heat, and cook, stirring occasionally, 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt butter in a large saucepan over low heat.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in flour, and cook, whisking constantly, 2 minutes. Gradually whisk in milk. Increase heat to medium, and cook, whisking constantly, 5 to 7 minutes or until thickened and bubbly. Stir in Parmesan cheese, pepper, and remaining 1/2 tsp. salt.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add sauce to pasta, stirring to coat.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer pasta mixture to a lightly greased (with cooking spray) 13- x 9-inch baking dish. Top with beef mixture, mozzarella cheese, and breadcrumbs.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Bake at 350 for 20 to 25 minutes or until mixture is bubbly and cheese is melted.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'MAKE IT AHEAD Fix and freeze this dish (unbaked) for a hands-off dinner.', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Let it stand 30 minutes before baking, and add 15 to 20 minutes in the oven.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Greek on the menu? Try pairing with Assyrtiko and Moschofilero. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. You could try Sigalas Assyrtiko Santorini. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 22 dollars per bottle.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko.', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 11105, u'instructions': u'Preheat oven to 350. Cook pasta in a Dutch oven according to package directions.                                                                                                 Meanwhile, saut onion in hot oil in large skillet over medium-high heat 4 to 5 minutes or until tender. Add garlic; saut 30 seconds. Add beef; cook, stirring occasionally, 5 minutes or until crumbled and no longer pink. Drain mixture, and return to skillet.                                                                                                 Stir tomato sauce, next 4 ingredients, and 1 tsp. salt into meat mixture. Bring to a simmer over medium-high heat, and cook, stirring occasionally, 2 minutes. Remove from heat.                                                                                                 Melt butter in a large saucepan over low heat. Whisk in flour, and cook, whisking constantly, 2 minutes. Gradually whisk in milk. Increase heat to medium, and cook, whisking constantly, 5 to 7 minutes or until thickened and bubbly. Stir in Parmesan cheese, pepper, and remaining 1/2 tsp. salt. Add sauce to pasta, stirring to coat.                                                                                                 Transfer pasta mixture to a lightly greased (with cooking spray) 13- x 9-inch baking dish. Top with beef mixture, mozzarella cheese, and breadcrumbs.                                                                                                 Bake at 350 for 20 to 25 minutes or until mixture is bubbly and cheese is melted. Let stand 10 minutes before serving.                                                                                                MAKE IT AHEAD Fix and freeze this dish (unbaked) for a hands-off dinner. Let it stand 30 minutes before baking, and add 15 to 20 minutes in the oven.', u'spoonacularSourceUrl': u'https://spoonacular.com/greek-baked-ziti-834946', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}