{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552707-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 552707, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brown Sugar Buffalo Chex Mix', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 79.71, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'1 teaspoon sweet BBQ rub seasoning (or 1/2 teaspoon cumin, 1/2 teaspoon chili powder)', u'aisle': u'Spices and Seasonings', u'name': u'bbq seasoning', u'metaInformation': [u'sweet', u'(or 1/2 teaspoon cumin, 1/2 teaspoon chili powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062034, u'unit': u'teaspoon'}, {u'originalString': u'2 - 4 Tablespoons brown sugar (more or less to taste ... I used 3 Tablespoons)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'to taste', u'(more or less ... I used 3 Tablespoons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup buffalo wing sauce (the heat of the sauce will help determine how spicy hot the mix will be)', u'aisle': u'Condiments', u'name': u'buffalo wing sauce', u'metaInformation': [u'hot', u'(the heat of the sauce will help determine how spicy the mix will be)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 98878, u'unit': u'cup'}, {u'originalString': u'3 Tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'1 cup white cheddar crackers', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'cup'}, {u'originalString': u'2 cups Corn Chex', u'aisle': u'Cereal', u'name': u'corn chex', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chex-cereal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8019, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon granulated garlic (or garlic powder)', u'aisle': u'Spices and Seasonings', u'name': u'granulated garlic', u'metaInformation': [u'(or garlic powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002020, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'2 cups peanuts (or mixed nuts)', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'mixed', u'(or nuts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16091, u'unit': u'cups'}, {u'originalString': u'1 cup pretzels', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19047, u'unit': u'cup'}, {u'originalString': u'2 cups Rice Chex', u'aisle': u'Cereal', u'name': u'rice chex', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chex-cereal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8064, u'unit': u'cups'}, {u'originalString': u'1 - 3 teaspoons Red Robin seasoning (or your favorite seasoned salt)', u'name': u'seasoning', u'metaInformation': [u'red', u'your favorite', u'(or seasoned salt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'teaspoons'}, {u'originalString': u'1 - 3 Tablespoons Sriracha hot sauce (or your favorite hot sauce, more or less to taste ... the more you use, the hotter the mix will be)', u'aisle': u'Condiments', u'name': u'sriracha hot sauce', u'metaInformation': [u'to taste', u'your favorite', u'(or hot sauce, more or less ... the more you use, the hotter the mix will be)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'Tablespoons'}, {u'originalString': u'2 cups Wheat Chex', u'aisle': u'Cereal', u'name': u'wheat chex', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chex-cereal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1008082, u'unit': u'cups'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/brown-sugar-buffalo-chex-mix/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, mix the chex with the nuts, pretzels and crackers.In a smaller bowl, melt the butter, then stir in the buffalo sauce, Sriracha, brown sugar, Red Robin seasoning, onion powder, and garlic powder. Taste the mixture and add more Sriracha, brown sugar, or seasoned salt to suit your tastes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 98878, u'name': u'buffalo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Pour the sauce over the chex mixture and stir to mix well. Microwave on high for 2 minutes. Stir. Microwave again for 2 minutes. Stir. One more time in the microwave. Stir. Try a sample ... is it still soggy? If so, nuke it again for 2 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread the mix out on a large baking sheet or clean kitchen towel and let it cool, then store in an airtight container.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 111, u'instructions': u'In a large bowl, mix the chex with the nuts, pretzels and crackers.In a smaller bowl, melt the butter, then stir in the buffalo sauce, Sriracha, brown sugar, Red Robin seasoning, onion powder, and garlic powder. Taste the mixture and add more Sriracha, brown sugar, or seasoned salt to suit your tastes.  Pour the sauce over the chex mixture and stir to mix well. Microwave on high for 2 minutes. Stir. Microwave again for 2 minutes. Stir. One more time in the microwave. Stir. Try a sample ... is it still soggy? If so, nuke it again for 2 minutes.Spread the mix out on a large baking sheet or clean kitchen towel and let it cool, then store in an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/brown-sugar-buffalo-chex-mix-552707', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}