{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/770566-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 770566, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shrimp Cocktail Bar: Classic Cocktail Sauce, Avocado Crema, Remoulade', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 25, u'pricePerServing': 196.79, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 to 3 avocados (ripe but not overripe)', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'ripe', u'( but not overripe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 tablespoon capers, drained', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon chile powder', u'aisle': u'Spices and Seasonings', u'name': u'chile powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons chopped fresh cilantro, or more to taste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons finely minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, pressed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/4 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 green onion, sliced', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 tablespoons prepared horseradish', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002055, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons Louisiana hot sauce, or more to taste', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'tablespoons'}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Juice of 1 lime, or more to taste', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'Lemon wedges, for garnish', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 60.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'1 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'About 3/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 60.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 60.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'12 to 13 pounds peeled, cooked, tail-on large shrimp, chilled', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'chilled', u'large', u'cooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 12.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}, {u'originalString': u'3 dashes Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'dashes'}], u'healthScore': 4.0, u'imageType': u'jpeg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/shrimp-cocktail-bar-classic-cocktail-sauce-avocado-crema-remoulade.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the remoulade: Stir together the mayonnaise, hot sauce, parsley, capers, chile powder, garlic, lemon juice and green onions in a bowl (or for a smoother remoulade, whizz in a food processor). Chill thoroughly before serving.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the classic cocktail sauce: Stir the ketchup, horseradish, Worcestershire and some salt and pepper together in a bowl. Chill before serving.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put the yogurt, cilantro, avocados, lime juice and some salt in a food processor and mix until completely smooth. Gradually add the milk and keep blending until the desired consistency is reached. (You can add more or less milk as desired.)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Arrange the shrimp on a large platter over ice, and serve with separate ramekins of the avocado crema, remoulade and classic cocktail sauce and lemon wedges to garnish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u'For the avocado crema'}], u'winePairing': {u'pairingText': u"Seafood Cocktail on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 4103, u'instructions': u'Watch how to make this recipe.                    For the remoulade: Stir together the mayonnaise, hot sauce, parsley, capers, chile powder, garlic, lemon juice and green onions in a bowl (or for a smoother remoulade, whizz in a food processor). Chill thoroughly before serving.                          For the classic cocktail sauce: Stir the ketchup, horseradish, Worcestershire and some salt and pepper together in a bowl. Chill before serving.                          For the avocado crema: Put the yogurt, cilantro, avocados, lime juice and some salt in a food processor and mix until completely smooth. Gradually add the milk and keep blending until the desired consistency is reached. (You can add more or less milk as desired.)                          Arrange the shrimp on a large platter over ice, and serve with separate ramekins of the avocado crema, remoulade and classic cocktail sauce and lemon wedges to garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-cocktail-bar-classic-cocktail-sauce-avocado-crema-remoulade-770566', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 60, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}