{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590461-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590461, u'veryPopular': True, u'lowFodmap': False, u'title': u'Raspberry Cheesecake Popsicles', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 70.19, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'2 Tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup light or regular sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'light', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 (8 oz.) package light or regular cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'6 standard-sized graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1/3 cup milk (any kind – I used skim)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(any kind - I used skim)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'3/4 cup fresh or frozen raspberries (or any berries)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'or any berries)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon McCormick Raspberry Extract', u'aisle': u'Baking', u'name': u'raspberry extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 14011111, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2013/06/raspberry-cheesecake-popsicles.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'In a food processor, add cream cheese, sour cream, powdered sugar, milk, and raspberry extract. Process until well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 14011111, u'name': u'raspberry extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add raspberries and pulse to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-sticks.jpg', u'id': 408704, u'name': u'popsicle sticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-molds.jpg', u'id': 405929, u'name': u'popsicle molds'}], u'step': u'Pour mixture into popsicle molds, leaving about 1 inch of the top empty for the crust (if you don’t have popsicle molds, use small paper cups and popsicle sticks).In a food processor, add graham crackers and process until fine crumbs remain. While food processor is running, add melted butter in a slow stream until the mixture resembles wet sand.Divide the crust evenly between the popsicles, pressing down gently to compact. Insert popsicle sticks. Freeze for at least 6 hours and up to 3 days.Enjoy!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 14887, u'instructions': u'In a food processor, add cream cheese, sour cream, powdered sugar, milk, and raspberry extract. Process until well combined. Add raspberries and pulse to combine.Pour mixture into popsicle molds, leaving about 1 inch of the top empty for the crust (if you don’t have popsicle molds, use small paper cups and popsicle sticks).In a food processor, add graham crackers and process until fine crumbs remain. While food processor is running, add melted butter in a slow stream until the mixture resembles wet sand.Divide the crust evenly between the popsicles, pressing down gently to compact. Insert popsicle sticks. Freeze for at least 6 hours and up to 3 days.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-cheesecake-popsicles-590461', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}