{u'recipes': [{u'sourceName': u'Healthy Green Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551920-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 551920, u'veryPopular': False, u'lowFodmap': False, u'title': u'for Spicy Lacto-fermented Pickles', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 46.35, u'creditText': u'Healthy Green Kitchen', u'extendedIngredients': [{u'originalString': u'*1 tablespoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'*1 tablespoon minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'*1 jalape\xf1o pepper, thinly sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'*1 tablespoon pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoon'}, {u'originalString': u'*5 or 6 pickling (Kirby) cucumbers, or 6 or 7 small Persian cucumbers (about 1 lb/455 g), ends trimmed off, and cut into 1 to 2 inch pieces', u'aisle': u'Produce', u'name': u'pickling cucumbers', u'metaInformation': [u'small', u'trimmed', u'cut into 1 to 2 inch pieces', u'(Kirby)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'*1 tablespoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tablespoon'}, {u'originalString': u'*1 tablespoon all-natural Thai fish sauce or wheat-free tamari', u'aisle': u'Ethnic Foods', u'name': u'tamari', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'tablespoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.healthygreenkitchen.com/spicy-lacto-fermented-pickles-weck-jars-giveaway.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Clean the glass jar in hot, soapy water, or use the hottest setting on your dishwasher.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the cucumbers with the salt, fish sauce, maple syrup, jalape\xf1o. garlic, and ginger in a medium bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Mix well, then transfer everything to the glass jar. If a few pieces of the cucumbers don't fit, that's fine; you can just eat them. 3.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}, {u'equipment': [], u'step': u'Add enough water (preferably filtered water) so the liquid covers the cucumbers. (The cucumbers may want to pop up over the brine, so to ensure they stay below it, I\'ve started putting a piece of sliced cucumber over the top of the pickles as a "weight"...you can see what I mean in the top photo of this post). I discard the "cucumber weight" once I transfer the pickles to the refrigerator.) It\'s important to leave about 1 inch/2.5 cm. of room at the top of the jar before closing the lid. If you don\'t leave enough room, liquid may seep out of your jar as the pickles ferment. 4. Allow your pickles to sit at room temperature for 2 to 4 days. You\'ll know they\'re done when the brine begins to bubble; do not worry if the brine is a bit cloudy- this is completely normal (it\'s also normal for the hue of the cucumbers to darken a bit). Enjoy right away, or store in the refrigerator, where the pickles with keep for at least 2-3 weeks: the heat from the jalape\xf1os will mellow a bit as they sit in the brine.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 206, u'instructions': u'1. Clean the glass jar in hot, soapy water, or use the hottest setting on your dishwasher.2. Combine the cucumbers with the salt, fish sauce, maple syrup, jalape\xf1o. garlic, and ginger in a medium bowl. Mix well, then transfer everything to the glass jar. If a few pieces of the cucumbers don\'t fit, that\'s fine; you can just eat them. 3. Add enough water (preferably filtered water) so the liquid covers the cucumbers. (The cucumbers may want to pop up over the brine, so to ensure they stay below it, I\'ve started putting a piece of sliced cucumber over the top of the pickles as a "weight"...you can see what I mean in the top photo of this post). I discard the "cucumber weight" once I transfer the pickles to the refrigerator.) It\'s important to leave about 1 inch/2.5 cm. of room at the top of the jar before closing the lid. If you don\'t leave enough room, liquid may seep out of your jar as the pickles ferment. 4. Allow your pickles to sit at room temperature for 2 to 4 days. You\'ll know they\'re done when the brine begins to bubble; do not worry if the brine is a bit cloudy- this is completely normal (it\'s also normal for the hue of the cucumbers to darken a bit). Enjoy right away, or store in the refrigerator, where the pickles with keep for at least 2-3 weeks: the heat from the jalape\xf1os will mellow a bit as they sit in the brine.', u'spoonacularSourceUrl': u'https://spoonacular.com/for-spicy-lacto-fermented-pickles-551920', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}