{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601414-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 601414, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stuffed Jalapeno Peppers', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 1111.85, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'2 cups breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cups'}, {u'originalString': u'3 eggs, slightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'slightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'24 fresh jalapeno peppers (1 1/4 lb) medium size', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'fresh', u'medium size'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 11979, u'unit': u'lb'}, {u'originalString': u'1 1/2 cups shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cups'}, {u'originalString': u'6 cups vegetable oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'cups'}], u'healthScore': 97.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.copykat.com/2009/02/02/stuffed-jalapeno-peppers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 120, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Wearing plastic gloves, cut stem end off peppers with paring knife.\xa0 Carefully remove seeds and white membrane. Stuff peppers with cheese.\xa0', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil in deep-fat fryer to 375* or in large pot until oil registers\xa0 375 degrees. Meanwhile, place eggs in small bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place crumbs in shallow pan.Drop 4 peppers in eggs; toss to coat. Using fork, lift 1 pepper at a time out of egg, shaking off excess. Drop into crumbs; toss to coat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place on sheet pan. When all peppers are coated, set aside for 15 min. to set up and dry. Repeat 6 more times with remaining peppers. With slotted spoon, slip peppers, 5-6 at a time, into hot oil. Fry 2-3 minutes, until golden.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove to platter lined with paper towels to drain. Repeat with remaining peppers.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately. 24 poppers.You may want to serve this a side of your favorite Ranch dressing.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Poema Brut Cava. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 11 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Vibrant aromas of ripe peaches, pears and toasted bread with a hint of spice fill the nose. The palate is dry with a rich, creamy texture. Layers of flavor include orange rind and spice that persists through an elegant finish.', u'title': u'Poema Brut Cava', u'price': u'$10.99', u'id': 449764, u'link': u'https://www.wine.com/product/poema-brut-cava/104054', u'imageUrl': u'https://spoonacular.com/productImages/449764-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Wearing plastic gloves, cut stem end off peppers with paring knife.\xa0 Carefully remove seeds and white membrane. Stuff peppers with cheese.\xa0 Heat oil in deep-fat fryer to 375* or in large pot until oil registers\xa0 375 degrees. Meanwhile, place eggs in small bowl. Place crumbs in shallow pan.Drop 4 peppers in eggs; toss to coat. Using fork, lift 1 pepper at a time out of egg, shaking off excess. Drop into crumbs; toss to coat. Place on sheet pan. When all peppers are coated, set aside for 15 min. to set up and dry. Repeat 6 more times with remaining peppers. With slotted spoon, slip peppers, 5-6 at a time, into hot oil. Fry 2-3 minutes, until golden. Remove to platter lined with paper towels to drain. Repeat with remaining peppers. Serve immediately. 24 poppers.You may want to serve this a side of your favorite Ranch dressing.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-jalapeno-peppers-601414', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}