{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479718-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 479718, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coffee Chocolate Meringue Pie', u'diets': [], u'preparationMinutes': 90, u'pricePerServing': 124.7, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'9 whole graham crackers, ground in a food processor or crushed into fine crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'whole', u'crushed', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 18079, u'unit': u''}, {u'originalString': u'2 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 Tablespoons ground coffee', u'aisle': u'Tea and Coffee', u'name': u'ground coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10093715, u'unit': u'Tablespoons'}, {u'originalString': u'2 Tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'Tablespoons'}, {u'originalString': u'2 Tablespoons Nutella', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19125, u'unit': u'Tablespoons'}, {u'originalString': u'1 oz. semi sweet chocolate, melted', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'sweet', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'12 oz. semisweet chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'\xbe cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons unsalted butter, cut into \xbd” cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into \xbd” cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2013/02/coffee-chocolate-meringue-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium sized bowl mix together graham cracker crumbs, heavy cream, Nutella, chocolate, and butter until cohesive.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add additional Nutella if needed. Press mixture onto the bottom and sides of a 9 inch pie dish. Chill for about 30 minutes or until ready to proceed.Put chopped chocolate and butter pieces in a large bowl.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place cream, coffee ground, and 2 Tablespoons water in a medium sauce pan. Bring to a boil over medium high heat. Watch carefully because it will bubble up quickly! As soon as the mixture boils, remove the pan from the heat, cover it, and allow to steep for 5 minutes.Strain the cream mixture through a fine mesh sieve into the bowl of chocolate. Stir until chocolate is melted and smooth and no chunks remain.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10093715, u'name': u'ground coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Pour chocolate mixture over the graham cracker crust. Chill until set, about 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place egg whites in the bowl of an electric mixer. Beat egg whites on medium high speed until light and frothy.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the sugar in 4 additions, beating well after each addition. Scrape down the bowl as needed. Continue to beat egg whites on high speed until they are glossy and hold a stiff peak.Spoon meringue over chocolate filling and swirl or smooth.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Serve immediately or chill for up to 8 hours.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 180, u'instructions': u'In a medium sized bowl mix together graham cracker crumbs, heavy cream, Nutella, chocolate, and butter until cohesive. Add additional Nutella if needed. Press mixture onto the bottom and sides of a 9 inch pie dish. Chill for about 30 minutes or until ready to proceed.Put chopped chocolate and butter pieces in a large bowl. Place cream, coffee ground, and 2 Tablespoons water in a medium sauce pan. Bring to a boil over medium high heat. Watch carefully because it will bubble up quickly! As soon as the mixture boils, remove the pan from the heat, cover it, and allow to steep for 5 minutes.Strain the cream mixture through a fine mesh sieve into the bowl of chocolate. Stir until chocolate is melted and smooth and no chunks remain. Pour chocolate mixture over the graham cracker crust. Chill until set, about 1 hour.Place egg whites in the bowl of an electric mixer. Beat egg whites on medium high speed until light and frothy. Add the sugar in 4 additions, beating well after each addition. Scrape down the bowl as needed. Continue to beat egg whites on high speed until they are glossy and hold a stiff peak.Spoon meringue over chocolate filling and swirl or smooth. Serve immediately or chill for up to 8 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/coffee-chocolate-meringue-pie-479718', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}