{u'recipes': [{u'sourceName': u'Culicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/586430-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 586430, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cucumber Dill Dip', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 164.75, u'creditText': u'Culicurious', u'extendedIngredients': [{u'originalString': u'2 cucumbers, peeled, seeded, and diced small', u'aisle': u'Produce', u'name': u'cucumbers', u'metaInformation': [u'diced', u'small', u'peeled', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 teaspoon dry dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'teaspoon'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup thinly sliced green onion bottoms', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 lemon, zest and juice', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 tablespoon Slap Ya Mama seasoning', u'name': u'seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'tablespoon'}, {u'originalString': u'3 cups whole milk Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk greek yogurt', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.culicurious.com/from-my-kitchen-cucumber-dill-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix all ingredients and chill an hour or so before serving.Lasts up to a week in the fridge in an air tight container.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Mix all ingredients and chill an hour or so before serving.Lasts up to a week in the fridge in an air tight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/cucumber-dill-dip-586430', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}