{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/709619-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 709619, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Noodle Soup', u'diets': [u'dairy free'], u'pricePerServing': 503.23, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'1 1/2 cups diced carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups diced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cups'}, {u'originalString': u'4 (14.5 oz) cans low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'low-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 58.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'oz'}, {u'originalString': u'1 1/3 cups medium egg noodles (dry)', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'dry', u'medium', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 20409, u'unit': u'cups'}, {u'originalString': u'2 tsp each chopped fresh thyme, rosemary and sage leaves (look for the poultry herb pkg. it should have all 3 or use 1/2 tsp of each dried)', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'dried', u'fresh', u'chopped', u'for the poultry herb pkg. it should have all 3 or use 1/2 tsp of each )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 Tbsp fresh lemon juice (optional)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1/3 cup chopped parsley, divided', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'12 oz. shredded rotisserie chicken (from about a 2 lb rotisserie chicken)', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded', u'(from a 2 lb rotisserie chicken)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'oz'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups diced yellow onions', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cups'}], u'healthScore': 46.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.cookingclassy.com/2016/01/chicken-noodle-soup-2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat olive oil in a large pot over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add carrots, celery and onions and saute 4 minutes then add garlic and saute 1 minute longer. Stir in chicken broth, thyme, rosemary, sage and half of the parsley. Season with salt and pepper to taste then bring mixture to a boil, reduce heat to medium - low, cover pot and simmer 10 minutes. Stir in pasta, cover pot, boil over medium heat until noodles are cooked through, stirring occasionally, about 8 minutes (or as directed on package). Stir in chicken, lemon juice and remaining parsley.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Serve warm.Recipe source: Cooking Classy, adapted from my Slow Cooker Chicken Noodle Soup', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 149, u'instructions': u'Heat olive oil in a large pot over medium-high heat. Add carrots, celery and onions and saute 4 minutes then add garlic and saute 1 minute longer. Stir in chicken broth, thyme, rosemary, sage and half of the parsley. Season with salt and pepper to taste then bring mixture to a boil, reduce heat to medium - low, cover pot and simmer 10 minutes. Stir in pasta, cover pot, boil over medium heat until noodles are cooked through, stirring occasionally, about 8 minutes (or as directed on package). Stir in chicken, lemon juice and remaining parsley. Serve warm.Recipe source: Cooking Classy, adapted from my Slow Cooker Chicken Noodle Soup', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-noodle-soup-709619', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}