{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/246131-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 246131, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramelized Fennel and Onions', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 86.27, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'2 large fennel bulbs, sliced into 1/4-inch thick slices', u'aisle': u'Produce', u'name': u'fennel bulbs', u'metaInformation': [u'large', u'sliced into 1/ slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 Tbsp chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'2 teaspoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 large onions, halved then sliced lengthwise (root to tip) in 1/4-inch thick slices', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'halved', u'sliced lengthwise', u'(root to tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'slices'}, {u'originalString': u'1/4 cup grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/caramelized_fennel_and_onions/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil and butter in a large, uncovered, wide pan on medium high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Add the sliced fennel and onions and stir to coat. Stir occasionally. After about 10 minutes, sprinkle the onions and fennel with salt. Lower the temperature to medium. You want to strike a balance between allowing the pan to get hot enough so that some caramelization (when the natural sugars in the onion and fennel start to brown) and keeping the pot from getting so hot that the onions and fennel dry out. If it becomes an issue, you can add a couple tablespoons of water to the pan to help the onions and fennel to keep from drying out too much.2 Stir occasionally, scraping up any browned bits from the bottom of the pan. Note that the browned bits are the tastiest parts. Cook for another 30 minutes to an hour, depending on how much of a hurry you're in, and how caramelized you want your mixture to be. The longer you cook, the more caramelized and browned. Taste test along the way to see if the cooking has been sufficient for your taste. By the way, the onions and fennel will have plenty of flavor without having to be completely cooked down and browned all over.3 When ready to serve, remove from heat and toss in the freshly grated Parmesan cheese, the chopped parsley, lemon zest and lemon juice. Taste and add more lemon juice if necessary.", u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve alone as a side to chicken or seafood, or on crackers or thinly sliced toasted baguette for a crostini. You can also use it as a filling for a rustic tart.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 328, u'instructions': u"1 Heat olive oil and butter in a large, uncovered, wide pan on medium high heat. Add the sliced fennel and onions and stir to coat. Stir occasionally. After about 10 minutes, sprinkle the onions and fennel with salt. Lower the temperature to medium. You want to strike a balance between allowing the pan to get hot enough so that some caramelization (when the natural sugars in the onion and fennel start to brown) and keeping the pot from getting so hot that the onions and fennel dry out. If it becomes an issue, you can add a couple tablespoons of water to the pan to help the onions and fennel to keep from drying out too much.2 Stir occasionally, scraping up any browned bits from the bottom of the pan. Note that the browned bits are the tastiest parts. Cook for another 30 minutes to an hour, depending on how much of a hurry you're in, and how caramelized you want your mixture to be. The longer you cook, the more caramelized and browned. Taste test along the way to see if the cooking has been sufficient for your taste. By the way, the onions and fennel will have plenty of flavor without having to be completely cooked down and browned all over.3 When ready to serve, remove from heat and toss in the freshly grated Parmesan cheese, the chopped parsley, lemon zest and lemon juice. Taste and add more lemon juice if necessary.Serve alone as a side to chicken or seafood, or on crackers or thinly sliced toasted baguette for a crostini. You can also use it as a filling for a rustic tart.", u'spoonacularSourceUrl': u'https://spoonacular.com/caramelized-fennel-and-onions-246131', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}