{u'recipes': [{u'sourceName': u'Dessert Now Dinner Later', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/505643-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 505643, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Crockpot Macaroni & Cheese', u'diets': [], u'pricePerServing': 152.28, u'creditText': u'Dessert Now Dinner Later', u'extendedIngredients': [{u'originalString': u'2 1/2 cups grated medium (or sharp) cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated', u'medium', u'(or sharp)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 1009, u'unit': u'cups'}, {u'originalString': u'1 (10.75oz) can condensed cheddar cheese soup', u'aisle': u'Canned and Jarred', u'name': u'cheddar cheese soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6038, u'unit': u'oz'}, {u'originalString': u'1/2 tsp dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'2 1/2 cups elbow macaroni, uncooked', u'aisle': u'Pasta and Rice', u'name': u'elbow macaroni', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 10120499, u'unit': u'cups'}, {u'originalString': u'1/2 tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 cup skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1/2 cup light sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'light', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'4 Tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.dessertnowdinnerlater.com/2013/02/creamy-crockpot-macaroni-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Par-cook macaroni noodles by boiling for 6 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Drain & set aside.Meanwhile, in a small saucepan, melt butter with cheese.  Stir until completely melted.Spray the inside of a 4-QT slow cooker, add sour cream, condensed cheddar cheese soup, milk, salt, pepper, & mustard.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese-soup.png', u'id': 6038, u'name': u'cheddar cheese soup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add melted butter & cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Mix well.  Stir in cooked macaroni.  Cook on low for 2 to 2 1/2 hours, stirring every 45 minutes (equals two times) until the noodles are done & have soaked up a lot of the cheese sauce.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve as is or as a side dish.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese can be paired with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. One wine you could try is Tanian et Vincent Careme Terre Brulee Chenin Blanc. It has 4.1 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Par-cook macaroni noodles by boiling for 6 minutes.  Drain & set aside.Meanwhile, in a small saucepan, melt butter with cheese.  Stir until completely melted.Spray the inside of a 4-QT slow cooker, add sour cream, condensed cheddar cheese soup, milk, salt, pepper, & mustard.  Add melted butter & cheese.  Mix well.  Stir in cooked macaroni.  Cook on low for 2 to 2 1/2 hours, stirring every 45 minutes (equals two times) until the noodles are done & have soaked up a lot of the cheese sauce.  Serve as is or as a side dish.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-crockpot-macaroni-cheese-505643', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}