{u'recipes': [{u'sourceName': u'Mountain Mama Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625744-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 625744, u'veryPopular': False, u'lowFodmap': False, u'title': u'Israeli Couscous and Kale Stew', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 178.73, u'creditText': u'Mountain Mama Cooks', u'extendedIngredients': [{u'originalString': u'2 carrots, diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3/4 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup Israeli couscous', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'israeli couscous', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-israeli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020028, u'unit': u'cup'}, {u'originalString': u'2 cups finely chopped kale (about 1 small bunch)', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'small', u'finely chopped', u'( 1 bunch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'6 cups stock (could use vegetable, turkey or chicken)', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [u'(could use vegetable, turkey or chicken)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'28 oz whole tomatoes', u'aisle': u'Canned and Jarred', u'name': u'whole tomatoes', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011531, u'unit': u'oz'}, {u'originalString': u'1 small yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}, {u'originalString': u'plain yogurt and chopped cilantro for serving', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'plain', u'chopped', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'servings'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.mountainmamacooks.com/2015/01/israeli-couscous-kale-stew/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large stock pot, heat olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add onion and carrot and cook over medium-low heat for 15 minutes until vegetables are soft and start to caramelize.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, cumin and turmeric. Cook for 2 minutes more.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add stock and tomatoes, using your hand to bread up the whole tomatoes and gently crush them. Bring to a boil and simmer for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'id': 10011531, u'name': u'canned whole tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add kale and couscous and cook 12-15 minutes more. Season with salt and pepper.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Serve immediately and top soup with a dollop of plain yogurt and fresh chopped cilantro.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'plain yogurt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are great choices for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. You could try Noble Vines 337 Lodi Cabernet Sauvignon. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'337 Cabernet Sauvignon exudes vibrant aromas of black cherry, ripe currant, fresh herbs and lightly roasted coffee. Smooth tannins and balanced acidity support core flavors of blackberry, black cherry and chocolate, intertwined with spicy black pepper accents on the finish. This wine can be enjoyed on its own or with herb-roasted pork loin, baked chicken or barbecued steak and sauteed mushrooms.', u'title': u'Noble Vines 337 Lodi Cabernet Sauvignon', u'price': u'$11.99', u'id': 438039, u'link': u'https://www.wine.com/product/noble-vines-337-lodi-cabernet-sauvignon-2014/165669', u'imageUrl': u'https://spoonacular.com/productImages/438039-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'In a large stock pot, heat olive oil. Add onion and carrot and cook over medium-low heat for 15 minutes until vegetables are soft and start to caramelize. Add garlic, cumin and turmeric. Cook for 2 minutes more. Add stock and tomatoes, using your hand to bread up the whole tomatoes and gently crush them. Bring to a boil and simmer for 10 minutes. Add kale and couscous and cook 12-15 minutes more. Season with salt and pepper. Serve immediately and top soup with a dollop of plain yogurt and fresh chopped cilantro.', u'spoonacularSourceUrl': u'https://spoonacular.com/israeli-couscous-and-kale-stew-625744', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}