{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/376981-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 376981, u'veryPopular': True, u'lowFodmap': False, u'title': u'English Muffin Pizza Joes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 141.16, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (8 ounces) tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'6 English muffins, split and toasted', u'aisle': u'Bakery/Bread', u'name': u'english muffins', u'metaInformation': [u'split', u'english', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/English-muffins.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18439, u'unit': u''}, {u'originalString': u'1/2 cup fresh chopped mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 medium green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 teaspoons Italian seasonings', u'aisle': u'Spices and Seasonings', u'name': u'italian seasonings', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 cups shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cups'}, {u'originalString': u'1 pound Johnsonville\xae Mild Italian Sausage Links, casings removed', u'aisle': u'Frozen', u'name': u'veggie sausage links', u'metaInformation': [u'italian', u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 98971, u'unit': u'pound'}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/english-muffin-pizza-joes', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, brown sausage until no longer pink; drain.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the peppers, onion, mushrooms and seasonings; cook 2 minutes or until crisp-tender.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic; cook 1 minute longer. Stir in tomato sauce and simmer, uncovered, for 10 minutes.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Top each muffin half with 2 tablespoons meat sauce; sprinkle with cheese. Broil until cheese melts and filling is hot.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 393, u'instructions': u'Directions                                                                                In a large skillet, brown sausage until no longer pink; drain. Add the peppers, onion, mushrooms and seasonings; cook 2 minutes or until crisp-tender. Add garlic; cook 1 minute longer. Stir in tomato sauce and simmer, uncovered, for 10 minutes.                                                                                            Top each muffin half with 2 tablespoons meat sauce; sprinkle with cheese. Broil until cheese melts and filling is hot. Serve immediately.                                        Yield: 12 servings.                                                                                                                         Originally published as Pizza Joes in  Country ExtraSeptember  1990, p45                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 192 calories, 10 g fat (4 g saturated fat), 30 mg cholesterol, 466 mg sodium, 16 g carbohydrate, 1 g fiber, 10 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/english-muffin-pizza-joes-376981', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}