{u'recipes': [{u'sourceName': u'Lady Behind the Curtain', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/571777-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 571777, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fudge Filled Hearts', u'diets': [u'gluten free'], u'preparationMinutes': 150, u'pricePerServing': 83.25, u'creditText': u'Lady Behind the Curtain', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'candies or sprinkles for decorating', u'aisle': u'Sweet Snacks', u'name': u'm&m candies', u'metaInformation': [u'for decorating'], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19157, u'unit': u'servings'}, {u'originalString': u'1 cup peanut butter chips', u'aisle': u'Baking', u'name': u'peanut butter chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93762, u'unit': u'cup'}, {u'originalString': u'1-10 ounce bag of semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounce'}, {u'originalString': u'1-14 ounce can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.ladybehindthecurtain.com/fudge-filled-heart/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place each of six cookie cutter on a piece of foil.  Seal foil tightly around outside of each cookie cutter.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place on cookie sheet.  Lightly spray cookie cutter with cooking spray.In a 4-cup microwave measuring cup, mix chocolate chips, peanut butter chips, milk and butter.  Microwave uncovered on high 1 to 2 minutes, stirring every 30 seconds, until chips are almost melted.  Stir in vanilla.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 93762, u'name': u'peanut butter chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Pour mixture into cookie cutter molds, filling to tops of molds. Refrigerate uncovered about 2 hours or until firm.  Decorate with icing and candies.  Carefully remove foil. Gently press fudge out of molds to serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cajun can be paired with Albarino, ros\xe9 Wine, and Sauvignon Blanc. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. One wine you could try is Salneval Albarino. It has 4.2 out of 5 stars and a bottle costs about 9 dollars.', u'pairedWines': [u'albarino', u'rose wine', u'sauvignon blanc'], u'productMatches': [{u'description': u'Light straw in color, the nose of this Albari\xf1o is seductive with honey, pear and tropical fruit and a slight mineral component. It is racy andzesty with citrus and floral flavors in the mouth, yet is round and soft at the same time.It matches perfectly with fresh seafood and shellfish; is an ideal accompaniment to salty, spicy Asian cuisine; and is also great on its own as a cocktail wine. Truly adventurous food lovers will amaze and inspire their friends by serving it with the unlikely, but fantastic pairing of traditional barbequed ribs with a sweet, slightly spicy tomato based sauce.', u'title': u'Salneval Albarino', u'price': u'$9.39', u'id': 446012, u'link': u'https://www.wine.com/product/salneval-albarino-2008/98474', u'imageUrl': u'https://spoonacular.com/productImages/446012-312x231.jpg'}]}, u'aggregateLikes': 567, u'instructions': u'Place each of six cookie cutter on a piece of foil.  Seal foil tightly around outside of each cookie cutter. Place on cookie sheet.  Lightly spray cookie cutter with cooking spray.In a 4-cup microwave measuring cup, mix chocolate chips, peanut butter chips, milk and butter.  Microwave uncovered on high 1 to 2 minutes, stirring every 30 seconds, until chips are almost melted.  Stir in vanilla.Pour mixture into cookie cutter molds, filling to tops of molds. Refrigerate uncovered about 2 hours or until firm.  Decorate with icing and candies.  Carefully remove foil. Gently press fudge out of molds to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/fudge-filled-hearts-571777', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}