{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520595-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 3, u'id': 520595, u'veryPopular': True, u'lowFodmap': False, u'title': u'No-Bake Honey Nut Cheerios Snack Bars', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 294.05, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u"about 1/2 cup chocolate-covered sunflower seeds, optional (I used Trader Joe's)", u'aisle': u'Sweet Snacks;Health Foods', u'name': u'chocolate covered sunflower seeds', u'metaInformation': [u"(I used Trader Joe's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-covered-sunflower-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93641, u'unit': u'cup'}, {u'originalString': u'1/4 cup creamy unsalted butter (half of 1 stick)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [u'unsalted', u'(half of 1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1/4 cup honey (light-colored corn syrup may be substituted and will keep the bars firmer at room temp than using honey)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'(light-colored corn syrup may be substituted and will keep the bars firmer at room temp than using honey)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'3 cups Honey Nut Cheerios (or similar storebrand cereal; plain Cheerios may be substituted for a less sweet bar)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'plain', u'sweet', u'for a less  bar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'cups'}, {u'originalString': u'pinch sea salt or Kosher salt for sprinkling, optional', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'for sprinkling, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'1/4 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup raisins, optional (1 cup honey-roasted peanuts, 1 cup chopped almonds, or 1 cup trail mix may be substituted)', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.averiecooks.com/2013/10/no-bake-honey-nut-cheerios-snack-bars.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 43, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line an 8-inch square pan with aluminum foil leaving overhang, spray with cooking spray; set aside. In a large microwave-safe bowl, combine butter, honey, brown sugar, and heat on high power for 1 minute to melt. Stop to stir.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mixture will be on the granular side, this is okay. Return bowl to microwave and heat for 1 more minute on high power. Stop to stir Return bowl to microwave and heat for 1 more minute on high power. Stop to stir. On this third and final burst, mixture will become quite bubbly and foamy; use caution when removing from micro because this is boiling hot caramel and can cause burns. Stir in the vanilla using caution because mixture could bubble up. Stir in the cereal. Stir in the optional raisins (or nuts). Turn mixture out into prepared pan, packing it down firmly with a spatula and smoothing the top. Optionally, sprinkle evenly with sunflower seeds and salt (the salt cuts some of the sweetness and I recommend it). Cover pan with a sheet of foil (to prevent fridge smells), and place pan in fridge to set up for at least 2 to 3 hours, or overnight, or until bars are completely set before lifting out with foil overhang, slicing, and serving. Bars will keep airtight in the refrigerator for up to 2 weeks, or in the freezer for up to 6 months. I recommend storing them in the fridge rather than room temp because they soften and get loose.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 8634, u'instructions': u'Line an 8-inch square pan with aluminum foil leaving overhang, spray with cooking spray; set aside. In a large microwave-safe bowl, combine butter, honey, brown sugar, and heat on high power for 1 minute to melt. Stop to stir. Mixture will be on the granular side, this is okay. Return bowl to microwave and heat for 1 more minute on high power. Stop to stir Return bowl to microwave and heat for 1 more minute on high power. Stop to stir. On this third and final burst, mixture will become quite bubbly and foamy; use caution when removing from micro because this is boiling hot caramel and can cause burns. Stir in the vanilla using caution because mixture could bubble up. Stir in the cereal. Stir in the optional raisins (or nuts). Turn mixture out into prepared pan, packing it down firmly with a spatula and smoothing the top. Optionally, sprinkle evenly with sunflower seeds and salt (the salt cuts some of the sweetness and I recommend it). Cover pan with a sheet of foil (to prevent fridge smells), and place pan in fridge to set up for at least 2 to 3 hours, or overnight, or until bars are completely set before lifting out with foil overhang, slicing, and serving. Bars will keep airtight in the refrigerator for up to 2 weeks, or in the freezer for up to 6 months. I recommend storing them in the fridge rather than room temp because they soften and get loose.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-honey-nut-cheerios-snack-bars-520595', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}