{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/569661-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 569661, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dirt Pudding Cups {Homemade Version}', u'diets': [], u'pricePerServing': 89.48, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u"20 chocolate sandwich cookies, crushed (like Oreos or Jo Jo's)", u'aisle': u'Sweet Snacks', u'name': u'chocolate sandwich cookies', u'metaInformation': [u'crushed', u"(like Oreos or Jo Jo's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 18166, u'unit': u''}, {u'originalString': u'1 batch homemade chocolate pudding', u'aisle': u'Sweet Snacks;Health Foods', u'name': u'chocolate soy pudding', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 93700, u'unit': u''}, {u'originalString': u'Gummy worms', u'aisle': u'Sweet Snacks', u'name': u'gummy worms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gummy-worms.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 93642, u'unit': u'servings'}, {u'originalString': u'1 cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 tablespoon powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.melskitchencafe.com/dirt-pudding-cups-homemade-version/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Make pudding according to recipe and refrigerate until chilled and set up. Whip the cream and powdered sugar together using a handheld mixer on high speed (or an electric stand mixer or a blender) until stiff peaks form. Fold the cream into the pudding until combined. Measure 3/4 cup of the crushed cookies and stir them into the pudding mixture.Divide the pudding mixture between six cups. Top with remaining crushed cookies. Gently press one or two gummy worms into the top of each pudding. Refrigerate until ready to serve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gummy-worms.jpg', u'id': 93642, u'name': u'gummy worms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 13, u'instructions': u'Make pudding according to recipe and refrigerate until chilled and set up. Whip the cream and powdered sugar together using a handheld mixer on high speed (or an electric stand mixer or a blender) until stiff peaks form. Fold the cream into the pudding until combined. Measure 3/4 cup of the crushed cookies and stir them into the pudding mixture.Divide the pudding mixture between six cups. Top with remaining crushed cookies. Gently press one or two gummy worms into the top of each pudding. Refrigerate until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/dirt-pudding-cups-homemade-version-569661', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}