{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'south american', u'latin american'], u'image': u'https://spoonacular.com/recipeImages/705207-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 705207, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kickin’ Quinoa Salad with Aji Amarillo Dressing', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 66.0, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 tablespoon aji amarillo paste', u'aisle': u'Ethnic Foods', u'name': u'aji amarillo paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amarillo-chili-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1006973, u'unit': u'tablespoon'}, {u'originalString': u'1 can (15 ounces) cannellini beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned cannellini beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'ounces'}, {u'originalString': u'\xbc cup non-GMO canola oil (a neutral-tasting oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'(a neutral-tasting oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'\xbd cup celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 cup whole cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 cup peas (fresh or frozen)', u'aisle': u'Produce', u'name': u'fresh peas', u'metaInformation': [u'fresh', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'\xbc cup lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'1 cup quinoa (traditional, red or tri-color!)', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'red', u'traditional', u'(, or tri-color!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'\xbd cup red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/kickin-quinoa-salad-aji-amarillo', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'For the quinoa, rinse the quinoa well under cool water in fine sieve for several changes of water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain well.In a large pot, boil the vegetable broth and quinoa over medium heat. Reduce to simmer, cover, and cook until the quinoa is tender but still firm to bite, about 15 minutes. Its done when germ separates, making it look like a curly.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain well and return quinoa to pot off the heat. Cover with tea towel and replace lid, allowing it to steam and fluff as it cools.For the dressing, add all ingredients to food processor and blend until smooth.For the salad, if using fresh peas, bring a medium-size pot of water to a boil over high heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'fresh peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the peas and cook about 5 minutes. Strain and rinse with cold water to cool. If using frozen, skip this step.In a large mixing bowl, combine the cooled quinoa, peas, beans, celery, red onion and dressing. Stir until dressing is distributed evenly and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Ghost Pines Sonoma County Napa County Monterey County Chardonnay. It has 5 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'For the quinoa, rinse the quinoa well under cool water in fine sieve for several changes of water. Drain well.In a large pot, boil the vegetable broth and quinoa over medium heat. Reduce to simmer, cover, and cook until the quinoa is tender but still firm to bite, about 15 minutes. Its done when germ separates, making it look like a curly. Drain well and return quinoa to pot off the heat. Cover with tea towel and replace lid, allowing it to steam and fluff as it cools.For the dressing, add all ingredients to food processor and blend until smooth.For the salad, if using fresh peas, bring a medium-size pot of water to a boil over high heat. Add the peas and cook about 5 minutes. Strain and rinse with cold water to cool. If using frozen, skip this step.In a large mixing bowl, combine the cooled quinoa, peas, beans, celery, red onion and dressing. Stir until dressing is distributed evenly and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/kickin-quinoa-salad-with-aji-amarillo-dressing-705207', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}