{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/677810-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 677810, u'veryPopular': True, u'lowFodmap': False, u'title': u'Corsican Greens Pie with Butternut Squash and Three Cheeses', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 305.73, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'3 celery stalks with leaves, thinly sliced (about 3/4 cup)', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'with leaves, thinly sliced ( 3/4 cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup crumbled feta', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'6 tablespoons fresh ricotta, divided', u'aisle': u'Cheese', u'name': u'fresh ricotta', u'metaInformation': [u'fresh', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Grated zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tablespoons torn mint leaves', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons plus 1 teaspoon olive oil, divided, plus more for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided', u'plus more for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 small red onion, thinly sliced (about 3/4 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'red', u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chopped Italian parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup finely grated Pecorino', u'aisle': u'Cheese', u'name': u'pecorino', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'2 tablespoons pine nuts, lightly toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tablespoons'}, {u'originalString': u'12 ounces all-butter puff pastry, thawed if frozen', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 18337, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons chopped sage', u'aisle': u'Spices and Seasonings', u'name': u'sage', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2038, u'unit': u'teaspoons'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 bunch Swiss chard (about 8 ounces) or mix of other greens like kale, beet tops, turnip tops, or spinach, stemmed, leaves coarsely chopped, and stalks sliced 1/2-inch thick', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'stemmed', u'sliced', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounces'}, {u'originalString': u'12 wide, long ribbons of peeled butternut squash', u'aisle': u'Pasta and Rice', u'name': u'wide egg noodles', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 20409, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/corsican-greens-pie-with-butternut-squash-and-three-cheeses-51253450', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out pastry to 1/8-inch thickness, then cut it into a 12-inch-wide circle.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on a baking sheet lined with parchment paper. Refrigerate until ready to use.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'a large saut pan over medium-high heat, heat 2 tablespoons oil.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, celery, chard stems, 1/4 teaspoon salt, and a hearty grind of black pepper and cook until softened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add chard leaves, garlic, and sage and cook until chard leaves are wilted, about 5 minutes more.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer vegetable mixture to a large bowl and stir in mint, parsley, feta, Pecorino, pine nuts, lemon zest, and 3 tablespoons of the ricotta. Set aside to cool, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Toss the squash ribbons (if using) with remaining 1 teaspoon oil.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Spread vegetable mixture onto the pastry, leaving 1 1/4-inch border. Dollop remaining ricotta on the vegetable mixture and top with squash ribbons.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [], u'step': u'Roll the pastry edges up around the side of the filling and pinch edges together to form a secure edge around the tart.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Brush pastry with beaten egg and refrigerate for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake tart until pastry is golden and cooked through at the bottom, 25 to 30 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and drizzle with a bit of olive oil.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Cut into wedges and serve warm or at room temperature.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Adapted from Plenty More, by Yotam Ottolenghi, Copyright  2014, published by Ten Speed Press, an imprint of Random House LLC.', u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Vineyards Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 25 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 365, u'instructions': u'Preparation                                                        Preheat oven to 425F. Roll out pastry to 1/8-inch thickness, then cut it into a 12-inch-wide circle. Place on a baking sheet lined with parchment paper. Refrigerate until ready to use.                                                                a large saut pan over medium-high heat, heat 2 tablespoons oil. Add onion, celery, chard stems, 1/4 teaspoon salt, and a hearty grind of black pepper and cook until softened, about 5 minutes. Add chard leaves, garlic, and sage and cook until chard leaves are wilted, about 5 minutes more. Transfer vegetable mixture to a large bowl and stir in mint, parsley, feta, Pecorino, pine nuts, lemon zest, and 3 tablespoons of the ricotta. Set aside to cool, about 10 minutes.                                                                 Toss the squash ribbons (if using) with remaining 1 teaspoon oil. Spread vegetable mixture onto the pastry, leaving 1 1/4-inch border. Dollop remaining ricotta on the vegetable mixture and top with squash ribbons. Roll the pastry edges up around the side of the filling and pinch edges together to form a secure edge around the tart. Brush pastry with beaten egg and refrigerate for 10 minutes.                                                                 Bake tart until pastry is golden and cooked through at the bottom, 25 to 30 minutes. Remove from oven and drizzle with a bit of olive oil. Cut into wedges and serve warm or at room temperature.                                                                            Adapted from Plenty More, by Yotam Ottolenghi, Copyright  2014, published by Ten Speed Press, an imprint of Random House LLC.', u'spoonacularSourceUrl': u'https://spoonacular.com/corsican-greens-pie-with-butternut-squash-and-three-cheeses-677810', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}