{u'recipes': [{u'sourceName': u'Healthy Delicious', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/629465-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 629465, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Risotto with Apples and Raisins', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 129.04, u'creditText': u'Healthy Delicious', u'extendedIngredients': [{u'originalString': u'4 cups unsweetened almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cups'}, {u'originalString': u'Optional: additional chopped apple, brown sugar, and/or walnuts for serving', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'chopped', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9003, u'unit': u'servings'}, {u'originalString': u'1 cup apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9016, u'unit': u'cup'}, {u'originalString': u'2 Ruby Frost apples, peeled and chopped', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1.5 cups arborio rice', u'aisle': u'Pasta and Rice', u'name': u'arborio rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020052, u'unit': u'cups'}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons flax meal', u'aisle': u'Health Foods;Baking', u'name': u'flax meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1 pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.healthy-delicious.com/breakfast-risotto-apples-raisins/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt the butter in a large, shallow saute pan set over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the apples and cook for 2-3 minutes, or until slightly softened.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Add the rice; stir so that each grain of rice is coated with butter and appears glossy. Cook for 3-4 minutes, or until the rice is mostly translucent. Stir in the apple juice and cook until it has been absorbed.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 9016, u'name': u'apple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add 1 cup of almond milk along with the raisins, flax meal, chia seeds, and salt. Stir constantly until all the milk has absorbed into the rice. Continue this process, adding the milk  cup at a time, until the rice is creamy and soft  the whole process will take about 30 minutes.Top with brown sugar, chopped apples, and walnuts, as desired.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'id': 12006, u'name': u'chia seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 12220, u'name': u'ground flaxseed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Risotto can be paired with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Felsina Chianti Colli Senesi with a 4.1 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and  mellow on the palate, with a delightful finish of red fruit and vanilla. View More', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 60, u'instructions': u'Melt the butter in a large, shallow saute pan set over medium heat. Add the apples and cook for 2-3 minutes, or until slightly softened.Add the rice; stir so that each grain of rice is coated with butter and appears glossy. Cook for 3-4 minutes, or until the rice is mostly translucent. Stir in the apple juice and cook until it has been absorbed.Add 1 cup of almond milk along with the raisins, flax meal, chia seeds, and salt. Stir constantly until all the milk has absorbed into the rice. Continue this process, adding the milk  cup at a time, until the rice is creamy and soft  the whole process will take about 30 minutes.Top with brown sugar, chopped apples, and walnuts, as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-risotto-with-apples-and-raisins-629465', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}