{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/487089-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 487089, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ocean Packets', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 222.2, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'32 large cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 32.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'32 clams in shell, scrubbed', u'aisle': u'Seafood', u'name': u'clams', u'metaInformation': [u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 32.0, u'consistency': u'solid', u'id': 15157, u'unit': u''}, {u'originalString': u'8 ears corn on the cob, cut into quarters', u'aisle': u'Produce', u'name': u'cob corn', u'metaInformation': [u'cut into quarters'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1 tablespoon chopped fresh chives', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon grated fresh lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tablespoon'}, {u'originalString': u'32 sea scallops', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 32.0, u'consistency': u'solid', u'id': 1012047, u'unit': u''}, {u'originalString': u'32 uncooked shrimp, deveined but with shells', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'with shells', u'deveined', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 32.0, u'consistency': u'solid', u'id': 15152, u'unit': u''}, {u'originalString': u'1/2 cup unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Ocean-Packets/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat an outdoor grill for medium heat, and lightly oil the grate.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the butter with lemon peel in a bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Spread out the sheets of foil onto a flat work surface, and place 4 clams, 4 shrimp, 4 scallops, 4 pieces of corn on the cob, and 4 cherry tomatoes in the center of each piece of foil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'id': 11167, u'name': u'corn on the cob'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Drizzle 1 tablespoon of lemon-butter mixture over the seafood and vegetables. Bring two opposite ends of a foil sheet together and fold over several times to seal. Leave room for steam. Fold the remaining ends over several times to seal the packet completely.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place the foil packets on the preheated grill, cover the grill, and bake until the clams are open and the shrimp are pink and opaque, 15 to 20 minutes (open a packet a little to take a peek).', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'To serve, place a foil packet on a plate, cut a diagonal X through the foil, and peel back the foil.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish each packet with about 1/2 teaspoon of chives.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'aggregateLikes': 154, u'instructions': u'Preheat an outdoor grill for medium heat, and lightly oil the grate. Mix the butter with lemon peel in a bowl.                            Spread out the sheets of foil onto a flat work surface, and place 4 clams, 4 shrimp, 4 scallops, 4 pieces of corn on the cob, and 4 cherry tomatoes in the center of each piece of foil. Drizzle 1 tablespoon of lemon-butter mixture over the seafood and vegetables. Bring two opposite ends of a foil sheet together and fold over several times to seal. Leave room for steam. Fold the remaining ends over several times to seal the packet completely.                            Place the foil packets on the preheated grill, cover the grill, and bake until the clams are open and the shrimp are pink and opaque, 15 to 20 minutes (open a packet a little to take a peek).                            To serve, place a foil packet on a plate, cut a diagonal X through the foil, and peel back the foil. Garnish each packet with about 1/2 teaspoon of chives.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/ocean-packets-487089', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}