{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/717764-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 717764, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Cauli Potato Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 222.3, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1.5 lb. cauliflower, separated into florets', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11135, u'unit': u'lb'}, {u'originalString': u'1 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'3 oz. Greek cream cheese (or Neufchatel), cold', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cold', u'(or Neufchatel)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'2 - 3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 green onions, snipped (with tops), plus extra for garnish', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'with tops), plus extra for garnish', u'snipped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Red Robin Seasoning (or salt) & freshly ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'lemon pepper seasoning', u'metaInformation': [u'red', u'freshly ground', u'to taste', u'(or salt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1012030, u'unit': u'servings'}, {u'originalString': u'1/2 cup - 1 cup milk, cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'A pinch of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'1 Tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'1 onion, peeled and chopped (about 1 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 lb. potatoes, peeled and chopped', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u'lb'}, {u'originalString': u'Optional: shredded sharp cheddar cheese, for garnish', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'servings'}, {u'originalString': u'4 cups chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/creamy-cauli-potato-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Put the potatoes in a small mixing bowl, toss them in 1/2 Tablespoon of olive oil, cover and microwave on high for 5 - 7 minutes or until tender. Roughly mash the potatoes with a fork.Meanwhile, heat a soup pot over medium heat and add the rest of the olive oil, then the onion, celery and garlic.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute until the onion is soft and translucent.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the cauliflower, broth and bay leaf to the pot. Bring to a boil, then reduce heat to a simmer, cover partially and let cook for about 15 minutes until the cauliflower is very tender.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Let the soup cool a bit, then put in a blender with the cream cheese and milk. Blend until smooth.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the cauliflower puree back into the pot and stir in the potatoes and green onions. Season to taste with Red Robin Seasoning, freshly ground black pepper, and a pinch of nutmeg.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'Serve hot with additional green onions and, if desired, a bit of shredded sharp cheddar cheese, for garnish.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'aggregateLikes': 22, u'instructions': u'Put the potatoes in a small mixing bowl, toss them in 1/2 Tablespoon of olive oil, cover and microwave on high for 5 - 7 minutes or until tender. Roughly mash the potatoes with a fork.Meanwhile, heat a soup pot over medium heat and add the rest of the olive oil, then the onion, celery and garlic. Saute until the onion is soft and translucent.Add the cauliflower, broth and bay leaf to the pot. Bring to a boil, then reduce heat to a simmer, cover partially and let cook for about 15 minutes until the cauliflower is very tender. Let the soup cool a bit, then put in a blender with the cream cheese and milk. Blend until smooth.Pour the cauliflower puree back into the pot and stir in the potatoes and green onions. Season to taste with Red Robin Seasoning, freshly ground black pepper, and a pinch of nutmeg.Serve hot with additional green onions and, if desired, a bit of shredded sharp cheddar cheese, for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-cauli-potato-soup-717764', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}