{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601001-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 601001, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cashew & Fig Milkshake', u'diets': [u'gluten free'], u'preparationMinutes': 240, u'pricePerServing': 98.1, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Cashew nuts – \xbc cup', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashew nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'Dried figs – 5-6', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9094, u'unit': u''}, {u'originalString': u'Rose essence – 2-3 drops, optional', u'aisle': u'Health Foods;Gourmet', u'name': u'rose hips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rose-hip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 35203, u'unit': u''}, {u'originalString': u'Milk – 1 \xbd cups', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'Honey or Sugar– 2 tablespoons or to taste', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'Vanilla ice cream – 1 scoop, optional', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'scoop'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.spiceupthecurry.com/cashew-fig-milkshake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Take dried figs and cashews in a small bowl. I have used broken cashews. Soak them in the water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'id': 9094, u'name': u'dried figs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}]}, {u'equipment': [], u'step': u'Add enough water, so figs and cashews are just covered. Do not add too much water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Let them soak for at least 4 hours, more hours will not harm. By that time, figs will soak all the water and become very soft.Now chop the figs into small pieces.Take cashews and figs in the blender with milk, vanilla ice cream, sugar and rose essence.Blend it till figs and cashews are grinded and smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'vanilla ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour into serving glass and serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Milkshake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Take dried figs and cashews in a small bowl. I have used broken cashews. Soak them in the water. Add enough water, so figs and cashews are just covered. Do not add too much water.Let them soak for at least 4 hours, more hours will not harm. By that time, figs will soak all the water and become very soft.Now chop the figs into small pieces.Take cashews and figs in the blender with milk, vanilla ice cream, sugar and rose essence.Blend it till figs and cashews are grinded and smooth.Pour into serving glass and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/cashew-fig-milkshake-601001', u'dishTypes': [u'dessert', u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}