{u'recipes': [{u'sourceName': u'Ambitious Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/724172-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 724172, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet & Spicy Quinoa Beet Burgers with Mango & Sprouts', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 158.85, u'creditText': u'Ambitious Kitchen', u'extendedIngredients': [{u'originalString': u'1/2 cup chopped and peeled beets (about 1 beet)', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'peeled', u'chopped', u'( 1 beet)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11080, u'unit': u'cup'}, {u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Oat flour or GF breadcrumbs, if necessary', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18079, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon coconut oil, divided', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons flaxseed meal', u'aisle': u'Health Foods;Baking', u'name': u'flaxseed meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground coriander (can sub cumin)', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [u'(can sub cumin)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'4 large pitted Medjool dates, finely chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'medjool dates', u'metaInformation': [u'pitted', u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 9421, u'unit': u''}, {u'originalString': u'1 cup walnuts or pecans, whatever you prefer', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'5 slices Go Veggie Lactose Free Pepper Jack singles', u'aisle': u'Cheese', u'name': u'pepper jack', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 5.0, u'consistency': u'solid', u'id': 1025, u'unit': u'slices'}, {u'originalString': u'3/4 cup uncooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'5 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'5 whole grain or gluten free buns or lettuce wraps', u'aisle': u'Bakery/Bread', u'name': u'wraps', u'metaInformation': [u'gluten free', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10018364, u'unit': u''}, {u'originalString': u'1 yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.ambitiouskitchen.com/2016/03/quinoa-beet-burgers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place 3/4 cup quinoa and 1 1/2 cups water in a small sauce pan over high heat, bring to a boil, then cover, reduce heat and cook for about 15 minutes or until all the water has been absorbed by the quinoa. Allow the quinoa to cool for 5-10 minutes.In a small bowl, mix together flaxseed meal and 5 tablespoons of water to form a flax egg.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 12220, u'name': u'ground flaxseed'}, {u'image': None, u'id': 10112220, u'name': u'flax egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place mixture in fridge until ready to use so that it has time to gel up (to become egg-like).While the quinoa is cooking, add 1 teaspoon of coconut oil to a medium skillet and place over medium high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add onions and saute until translucent, about 4 minutes.Next add in cooked quinoa, onion, chopped beets, dates, walnuts, salt, pepper, garlic powder, cayenne pepper and coriander to a food processor and pulse 10-15 times until the mixture resembles ground beef.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and add in your flaxseed meal. If the mixture feels to wet and sticks to your hands, add a little oat flour or breadcrumbs. Start with a few tablespoons and gradually increase until the mixture is no longer sticky. Form into 6 patties, about 1/2 inch thick. Each patty will be about 1/3 cup of the mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 12220, u'name': u'ground flaxseed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a nonstick skillet over medium heat and add the remaining coconut oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the patties to the oil, two at a time if your pan is on the smaller side (this makes them easier to flip), and cook for about 4-6 minutes or until patties are golden brown, then gently flip and cook for an additional 4-5 minutes.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cheese a minute or two before taking off the heat.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve burgers on buns or lettuce wrap and garnish with mango, avocado and sprouts. Makes 6 burgers.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger can be paired with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Nieto Senetiner Malbec. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Wine of well defined profile, deep red color and great intensity. Aromas of small red fruits and plums dominate the nose; the vanilla scents from the oak barrel add elegance. Mouthfeel shows a great personality, great body and is fruity, well balanced and sensual.This wine pairs well with grilled meats, pasta with red sauce, salmon and veal. View More', u'title': u'Nieto Senetiner Malbec', u'price': u'$14.99', u'id': 440601, u'link': u'https://www.wine.com/product/nieto-senetiner-malbec-2011/124685', u'imageUrl': u'https://spoonacular.com/productImages/440601-312x231.jpg'}]}, u'aggregateLikes': 275, u'instructions': u'Place 3/4 cup quinoa and 1 1/2 cups water in a small sauce pan over high heat, bring to a boil, then cover, reduce heat and cook for about 15 minutes or until all the water has been absorbed by the quinoa. Allow the quinoa to cool for 5-10 minutes.In a small bowl, mix together flaxseed meal and 5 tablespoons of water to form a flax egg. Place mixture in fridge until ready to use so that it has time to gel up (to become egg-like).While the quinoa is cooking, add 1 teaspoon of coconut oil to a medium skillet and place over medium high heat. Add onions and saute until translucent, about 4 minutes.Next add in cooked quinoa, onion, chopped beets, dates, walnuts, salt, pepper, garlic powder, cayenne pepper and coriander to a food processor and pulse 10-15 times until the mixture resembles ground beef. Transfer to a bowl and add in your flaxseed meal. If the mixture feels to wet and sticks to your hands, add a little oat flour or breadcrumbs. Start with a few tablespoons and gradually increase until the mixture is no longer sticky. Form into 6 patties, about 1/2 inch thick. Each patty will be about 1/3 cup of the mixture.Heat a nonstick skillet over medium heat and add the remaining coconut oil. Add the patties to the oil, two at a time if your pan is on the smaller side (this makes them easier to flip), and cook for about 4-6 minutes or until patties are golden brown, then gently flip and cook for an additional 4-5 minutes. Add the cheese a minute or two before taking off the heat.Serve burgers on buns or lettuce wrap and garnish with mango, avocado and sprouts. Makes 6 burgers.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-spicy-quinoa-beet-burgers-with-mango-sprouts-724172', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}