{u'recipes': [{u'sourceName': u'Tidy Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/185097-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 185097, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Smoked Sausage & White Bean Soup', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 159.07, u'creditText': u'Tidy Mom', u'extendedIngredients': [{u'originalString': u'1/2 cup shredded Parmesan or Asiago cheese (optional)', u'aisle': u'Cheese', u'name': u'asiago cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001033, u'unit': u'cup'}, {u'originalString': u'1 cup carrot, sliced or diced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2-3 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'2 sprigs of fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'3 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u"2 (15.8 ounce) cans BUSH'S\xae Great Northern Beans, drained", u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'great northern beans', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 31.6, u'consistency': u'solid', u'id': 16025, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'pinch of Smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'pinch'}, {u'originalString': u'13 oz smoked sausage, sliced into medallions', u'aisle': u'Meat', u'name': u'smoked sausage', u'metaInformation': [u'smoked', u'sliced into medallions'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.0, u'consistency': u'solid', u'id': 7916, u'unit': u'oz'}, {u'originalString': u'2 cups fresh spinach, chopped or 12 ounces frozen, thawed and squeezed to drain', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://tidymom.net/2013/smoked-sausage-bean-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat 1 tablespoon oil in a 4-quart saucepan or dutch-oven over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add sausage medallions and cook, turning occasionally, until browned and cooked through, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer sausage to a plate.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat remaining oil in same pan. Cook carrots, garlic, oregano, black pepper and thyme sprigs about 5 minutes; stir often. Return sausage (and any juices) to pan.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add beans and broth and cook on medium-low heat, crushing a few beans with the back of a spoon to thicken sauce, until slightly thickened, 8-10 minutes. Season with salt and smoked paprika. Cover and simmer 30 minutes over low heat.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}]}, {u'equipment': [], u'step': u'Add spinach and cook just until wilted, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Serve topped with cheese, if desired.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2383, u'instructions': u'Heat 1 tablespoon oil in a 4-quart saucepan or dutch-oven over medium-high heat. Add sausage medallions and cook, turning occasionally, until browned and cooked through, about 15 minutes. Transfer sausage to a plate.Heat remaining oil in same pan. Cook carrots, garlic, oregano, black pepper and thyme sprigs about 5 minutes; stir often. Return sausage (and any juices) to pan. Add beans and broth and cook on medium-low heat, crushing a few beans with the back of a spoon to thicken sauce, until slightly thickened, 8-10 minutes. Season with salt and smoked paprika. Cover and simmer 30 minutes over low heat.Add spinach and cook just until wilted, about 2 minutes.Serve topped with cheese, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-smoked-sausage-white-bean-soup-185097', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}