{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/393811-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 393811, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pineapple Rice Pudding', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 83.01, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (8 ounces) crushed pineapple, drained', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'ounces'}, {u'originalString': u"2 tablespoons confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'1 cup cooked long grain rice', u'aisle': u'Pasta and Rice', u'name': u'cooked long grain rice', u'metaInformation': [u'long grain', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cup'}, {u'originalString': u'1/2 cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Maraschino cherries and fresh mint, optional', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9328, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pineapple-rice-pudding', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine the rice and pineapple; set aside. In a small bowl, beat cream, sugar and vanilla until soft peaks form. Fold into rice mixture. Cover and chill until serving.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Garnish with cherries and mint if desired.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 92, u'instructions': u'Directions                                                                                In a small bowl, combine the rice and pineapple; set aside. In a small bowl, beat cream, sugar and vanilla until soft peaks form. Fold into rice mixture. Cover and chill until serving. Garnish with cherries and mint if desired.                                        Yield: 2 servings.                                                                                                                         Originally published as Pineapple Rice Pudding in  Reminisce ExtraFebruary 1997, p47                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 406 calories, 22 g fat (14 g saturated fat), 82 mg cholesterol, 25 mg sodium, 49 g carbohydrate, 1 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-rice-pudding-393811', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}