{u'recipes': [{u'sourceName': u'Seasonal and Savory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478280-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_3', u'cookingMinutes': 10, u'id': 478280, u'veryPopular': False, u'lowFodmap': True, u'title': u'Crispy Noodle Pancake', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 51.48, u'creditText': u'Seasonal and Savory', u'extendedIngredients': [{u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons ghee', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon salt (or to taste)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 cups of cooked, “fluffed” spaghetti squash strands', u'aisle': u'Produce', u'name': u'spaghetti squash', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11492, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.seasonalandsavory.com/2013/11/crispy-noodle-pancake.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a medium mixing bowl, beat the egg with the salt and pepper. I sometimes add in a little minced garlic or chives at this stage–whatever you like. Use a fork to stir in the spaghetti squash strands until they are coated with the egg.In a medium skillet, heat two tablespoons of the ghee over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'id': 11492, u'name': u'spaghetti squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the squash mixture in and press it down into a round of even thickness.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Let the pancake cook until the edges are starting to look golden–you can use the spatula to tip up the edge to see how it looks. When it looks nicely browned, use the spatula to carefully flip the pancake over. At this point, add the remaining tablespoon of ghee in around the edges, and let it cook until the other side is golden. Slide the cooked pancake onto a serving plate, and use a knife to cut it into wedges to serve. Best served hot out of the skillet.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}]}], u'name': u''}], u'aggregateLikes': 354, u'instructions': u'In a medium mixing bowl, beat the egg with the salt and pepper. I sometimes add in a little minced garlic or chives at this stage–whatever you like. Use a fork to stir in the spaghetti squash strands until they are coated with the egg.In a medium skillet, heat two tablespoons of the ghee over medium-high heat. Add the squash mixture in and press it down into a round of even thickness. Let the pancake cook until the edges are starting to look golden–you can use the spatula to tip up the edge to see how it looks. When it looks nicely browned, use the spatula to carefully flip the pancake over. At this point, add the remaining tablespoon of ghee in around the edges, and let it cook until the other side is golden. Slide the cooked pancake onto a serving plate, and use a knife to cut it into wedges to serve. Best served hot out of the skillet.', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-noodle-pancake-478280', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}