{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/245414-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 245414, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spicy Corn Fritters', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 29.23, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons red chili pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 cups of corn kernels, (see steps for cutting corn from a cob) cut from 3 large cobs (or frozen corn, defrost and drain first)', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'frozen', u'large', u'for cutting corn from a cob) cut from 3  cobs (or  corn, defrost and drain first)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11172, u'unit': u'cups'}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 large clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'4 large scallions or green onions, finely sliced (about half a cup)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'large', u'finely sliced', u'( half a cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 teaspoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'Grapeseed, canola, or peanut oil (a high smoke point oil) for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'for frying', u'(a high smoke point oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'servings'}, {u'originalString': u'3/4 cup rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1022053, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/spicy_corn_fritters/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'1 Make the dipping sauce by combining all of the sauce ingredients into a small saucepan.  Cook on medium heat, stirring with a wooden spoon, until sugar dissolves.  Increase the heat to medium high, let boil for 5-10 minutes or so, until the mixture becomes somewhat syrupy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and let cool.  The sauce should continue to thicken as it cools.  If it becomes too thick, you can add a little water to it to thin it out a bit. 2 Sift together the flour, baking powder, salt, ground coriander, and ground cumin in a medium bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'ground coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add egg, lemon juice and water.  Stir vigorously with a wooden spoon until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the corn, onions, and cilantro.  Stir until just combined. 3', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large frying pan on medium high heat.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add enough oil to generously coat the bottom of the pan.  When oil is hot (shimmering not smoking), spoon about 2 heaping tablespoons worth of fritter batter into the pan to form one fritter, patting it down with the back of the spoon as soon as it is in the pan.  Work in batches.  Leave about 1/2 inch between the fritters in the pan.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Let cook about 2-3 minutes on each side, flipping the fritters when they are nicely browned on one side.  When browned on the other side, remove the fritters to a plate lined with paper towels to absorb the excess fat.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add oil as needed to keep the bottom of the pan well coated.  Note that the fritters will likely splatter a bit as you are cooking.  So, either use a screen splatter guard, or wear long sleeved clothes while you cook.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately with the sweet chili dipping sauce.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 561, u'instructions': u'1 Make the dipping sauce by combining all of the sauce ingredients into a small saucepan.  Cook on medium heat, stirring with a wooden spoon, until sugar dissolves.  Increase the heat to medium high, let boil for 5-10 minutes or so, until the mixture becomes somewhat syrupy.  Remove from heat and let cool.  The sauce should continue to thicken as it cools.  If it becomes too thick, you can add a little water to it to thin it out a bit. 2 Sift together the flour, baking powder, salt, ground coriander, and ground cumin in a medium bowl.  Add egg, lemon juice and water.  Stir vigorously with a wooden spoon until smooth.  Add the corn, onions, and cilantro.  Stir until just combined. 3 Heat a large frying pan on medium high heat.  Add enough oil to generously coat the bottom of the pan.  When oil is hot (shimmering not smoking), spoon about 2 heaping tablespoons worth of fritter batter into the pan to form one fritter, patting it down with the back of the spoon as soon as it is in the pan.  Work in batches.  Leave about 1/2 inch between the fritters in the pan.  Let cook about 2-3 minutes on each side, flipping the fritters when they are nicely browned on one side.  When browned on the other side, remove the fritters to a plate lined with paper towels to absorb the excess fat.Add oil as needed to keep the bottom of the pan well coated.  Note that the fritters will likely splatter a bit as you are cooking.  So, either use a screen splatter guard, or wear long sleeved clothes while you cook.Serve immediately with the sweet chili dipping sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-corn-fritters-245414', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}