{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/224224-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 224224, u'veryPopular': False, u'lowFodmap': False, u'title': u'Speedy Moroccan meatballs', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 161.3, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'25g toasted flaked almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'flaked', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 12061, u'unit': u'g'}, {u'originalString': u'350g pack ready-made beef or chicken meatballs (approx 16)', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'(approx 16)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'g'}, {u'originalString': u'1 small cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'100g dried apricots, halved', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9032, u'unit': u'g'}, {u'originalString': u'handful coriander, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 large onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'400g tin chopped tomatoes with garlic', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'with garlic', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 11529, u'unit': u'g'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2998/speedy-moroccan-meatballs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large deep frying pan, then fry the meatballs for 10 mins, turning occasionally until cooked through. Scoop out of the pan and set aside, then cook the onion for 5 mins, until softened.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the dried apricots, cinnamon stick, tomatoes and half a can of water to the pan, then bring to the boil and simmer for 10 mins.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'id': 9032, u'name': u'dried apricots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the cinnamon stick. Return the meatballs to the pan and coat well with the tomato sauce.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}]}, {u'equipment': [], u'step': u'Serve sprinkled with the almonds and coriander.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 288, u'instructions': u'Heat the oil in a large deep frying pan, then fry the meatballs for 10 mins, turning occasionally until cooked through. Scoop out of the pan and set aside, then cook the onion for 5 mins, until softened.Add the dried apricots, cinnamon stick, tomatoes and half a can of water to the pan, then bring to the boil and simmer for 10 mins. Remove the cinnamon stick. Return the meatballs to the pan and coat well with the tomato sauce. Serve sprinkled with the almonds and coriander.', u'spoonacularSourceUrl': u'https://spoonacular.com/speedy-moroccan-meatballs-224224', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}