{u'recipes': [{u'sourceName': u'My Korean Kitchen', u'cuisines': [u'asian', u'korean'], u'image': u'https://spoonacular.com/recipeImages/567346-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 567346, u'veryPopular': False, u'lowFodmap': False, u'title': u'LA Galbi (Thinly Sliced BBQ Short Ribs)', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 240, u'pricePerServing': 454.06, u'creditText': u'My Korean Kitchen', u'extendedIngredients': [{u'originalString': u'3 \xbd Tbsp dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.5, u'consistency': u'solid', u'id': 10019334, u'unit': u'Tbsp'}, {u'originalString': u'1 \xbd Tbsp minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11215, u'unit': u'Tbsp'}, {u'originalString': u'4 sprinkles of ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u''}, {u'originalString': u'800g LA Galbi meat (Beef short rib)', u'name': u'meat', u'metaInformation': [u'(Beef short rib)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 1065062, u'unit': u'g'}, {u'originalString': u'2 Tbsp grated onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp grated apple (I used red kind of apple not the green apple, if you can substitute this with Korean/Nashi pear that is even better)', u'aisle': u'Produce', u'name': u'red apple', u'metaInformation': [u'green', u'red', u'with korean/nashi pear that is even better)', u'grated', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u'Tbsp'}, {u'originalString': u'7 Tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp cooking wine (or rice wine/sake/soju/mirin)', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [u'(or rice wine/sake/soju/mirin)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14084, u'unit': u'Tbsp'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://mykoreankitchen.com/2013/03/29/la-galbi/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Soak the meat in cold water for 1 hour to get rid of the blood. Change the water a couple of times as it releases debris (blood and floating fat).While waiting, mix the rest of the ingredients in a bowl. (You can use a blender to quicken the process).One hour later, pat-dry the meat with some kitchen paper. Then put it into a sealable container.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [], u'step': u'Pour out the sauce onto the meat and mix them with a spoon to thoroughly season. Close the lid.Marinade the meat for about 3 hours at room temperature (24 -27 Celsius degree). Turn the meat over 2-3 times during this time, so that the meat gets marindated thoroughly. (You can also marinade this overnight in the fridge to give extra tenderness and flavour.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place baking paper on a tray and line the meat on the tray. Grill it in an oven for 10 mins. (I cooked both side 5 mins each.) Alternatively you can cook it on a BBQ grill or pan.When both sides are all cooked, serve it on a plate & Enjoy.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Essay Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 32, u'instructions': u'Soak the meat in cold water for 1 hour to get rid of the blood. Change the water a couple of times as it releases debris (blood and floating fat).While waiting, mix the rest of the ingredients in a bowl. (You can use a blender to quicken the process).One hour later, pat-dry the meat with some kitchen paper. Then put it into a sealable container. Pour out the sauce onto the meat and mix them with a spoon to thoroughly season. Close the lid.Marinade the meat for about 3 hours at room temperature (24 -27 Celsius degree). Turn the meat over 2-3 times during this time, so that the meat gets marindated thoroughly. (You can also marinade this overnight in the fridge to give extra tenderness and flavour.)Place baking paper on a tray and line the meat on the tray. Grill it in an oven for 10 mins. (I cooked both side 5 mins each.) Alternatively you can cook it on a BBQ grill or pan.When both sides are all cooked, serve it on a plate & Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/la-galbi-thinly-sliced-bbq-short-ribs-567346', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}