{u'recipes': [{u'sourceName': u'Simply Being Mommy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512562-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 512562, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Barbeque Meatloaf', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 63.72, u'creditText': u'Simply Being Mommy', u'extendedIngredients': [{u'originalString': u'1 cup barbeque sauce', u'aisle': u'Condiments', u'name': u'barbeque sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'1 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'\xbc cup Egg Beaters', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg beaters', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93833, u'unit': u'cup'}, {u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'1 teaspoon seasoned salt', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://simplybeingmommy.com/2012/08/08/mini-barbeque-meatloaf/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees. In large bowl, combine ground beef and Egg Beaters with your hands. When well combined, add bread crumbs, minced garlic, seasoned salt and black pepper and continue to combine with your hands.In a small bowl, combine barbeque sauce and Worcestershire sauce together.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'id': 93833, u'name': u'eggbeaters'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Pour half of the barbeque mix with beef mixture, and set the other half to the side. With your hands, combine the beef mixture with the barbeque mixture.In a greased muffin tin, fill each cup with the beef mixture. I found it easier to use an ice cream scoop to fill each cup. Make sure each cup is filled completely.Spoon the rest of the barbeque mixture over the top of each mini meatloaf.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Bake for about 20 minutes or until cooked through completely (internal temperature should be 165 degrees).', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Meatloaf works really well with Cabernet Sauvignon and Zinfandel. Meatloaf will work with many red wines. We recommend something bold and fruity, like a Cabernet Sauvignon or Zinfandel. The DeLille Four Flags Cabernet Sauvignon with a 4.1 out of 5 star rating seems like a good match. It costs about 70 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'zinfandel'], u'productMatches': [{u'description': u'This vintage has powerful yet harmonious fruit and oak balance. Classically structured with great lift, the 2013 Four Flags includes rich cassis, black cherries and pine nut nuances. Add savory ripe tannins, toasty oak, exotic spices of coriander and cardamom along with a smoky texture and you can see how complex and dynamic itis right now. Equally important, there are clues as to where this wine is headed as it develops over the next decade.', u'title': u'DeLille Four Flags Cabernet Sauvignon', u'price': u'$69.99', u'id': 457303, u'link': u'https://www.wine.com/product/delille-four-flags-cabernet-sauvignon-2013/176062', u'imageUrl': u'https://spoonacular.com/productImages/457303-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Preheat oven to 450 degrees. In large bowl, combine ground beef and Egg Beaters with your hands. When well combined, add bread crumbs, minced garlic, seasoned salt and black pepper and continue to combine with your hands.In a small bowl, combine barbeque sauce and Worcestershire sauce together. Pour half of the barbeque mix with beef mixture, and set the other half to the side. With your hands, combine the beef mixture with the barbeque mixture.In a greased muffin tin, fill each cup with the beef mixture. I found it easier to use an ice cream scoop to fill each cup. Make sure each cup is filled completely.Spoon the rest of the barbeque mixture over the top of each mini meatloaf. Bake for about 20 minutes or until cooked through completely (internal temperature should be 165 degrees).', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-barbeque-meatloaf-512562', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}