{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/184686-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 184686, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mojito Shrimp Salad in Biscuit Bowls', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 230.47, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'1 can (10.2 oz) Grands!™ Flaky Layers refrigerated Original biscuits', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [u'refrigerated', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.2, u'consistency': u'solid', u'id': 18009, u'unit': u'oz'}, {u'originalString': u'1/4 cup olive or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chopped fresh mint leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'1 small clove garlic, finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2 medium green onions, sliced (2 tablespoons)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'5 cups torn leaf lettuce', u'aisle': u'Produce', u'name': u'lettuce leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 93623, u'unit': u'cups'}, {u'originalString': u'2 tablespoons fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon grated lime peel', u'aisle': u'Produce', u'name': u'lime peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'1 can (11 oz) mandarin orange segments, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'mandarin orange segments', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 9218, u'unit': u'oz'}, {u'originalString': u'1/2 cup fresh sweet peas (from pods)', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'fresh', u'sweet', u'(from pods)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon rum extract', u'aisle': u'Baking', u'name': u'rum extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 12211111, u'unit': u'teaspoon'}, {u'originalString': u'12 oz cooked deveined peeled medium (32 count) shrimp, tail shells removed', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'cooked', u'peeled', u'(32 count)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'oz'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.bettycrocker.com/recipes/mojito-shrimp-salad-in-biscuit-bowls/80ba8a4b-a57a-479f-ad2b-c76976c45d82', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350F. On ungreased large cookie sheet, turn 5 (6-oz) custard cups upside down; spray outsides of cups with cooking spray. Separate dough into 5 biscuits; press each to form 6-inch circle. Press each biscuit over bottom and around side of each cup. Using fingers, press dough around each cup, forming bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [], u'step': u'Bake 15 to 18 minutes or until golden brown. Carefully remove custard cups. Set aside. Cool completely, about 5 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Meanwhile, in large bowl, mix dressing ingredients with wire whisk; fold in shrimp. Set aside. In small microwavable bowl, microwave peas about 30 seconds or just until heated through. Refrigerate while biscuit bowls cool.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place biscuit bowls on serving plates. Fold oranges, peas, lettuce and onions into shrimp and dressing. Spoon into biscuit bowls.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'1                               Heat oven to 350F. On ungreased large cookie sheet, turn 5 (6-oz) custard cups upside down; spray outsides of cups with cooking spray. Separate dough into 5 biscuits; press each to form 6-inch circle. Press each biscuit over bottom and around side of each cup. Using fingers, press dough around each cup, forming bowl. Bake 15 to 18 minutes or until golden brown. Carefully remove custard cups. Set aside. Cool completely, about 5 minutes.                                                          2                               Meanwhile, in large bowl, mix dressing ingredients with wire whisk; fold in shrimp. Set aside. In small microwavable bowl, microwave peas about 30 seconds or just until heated through. Refrigerate while biscuit bowls cool.                                                          3                               Place biscuit bowls on serving plates. Fold oranges, peas, lettuce and onions into shrimp and dressing. Spoon into biscuit bowls. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/mojito-shrimp-salad-in-biscuit-bowls-184686', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}