{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/494211-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 494211, u'veryPopular': True, u'lowFodmap': False, u'title': u'Moonshine-Glazed Doughnuts', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 206.35, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'2 1/4 teaspoons (one package) active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry', u'(one package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup butter, melted and cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 tablespoons cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 quarts vegetable oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'quarts'}, {u'originalString': u'1-2 tablespoons water, as needed', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'2 whole eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup whole milk, lukewarm', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 tablespoon moonshine', u'aisle': u'?', u'name': u'moonshine', u'metaInformation': [], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tablespoon'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2013/09/moonshine-glazed-doughnuts.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 44, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To prepare doughnuts, combine the warm milk and sugar in a small bowl. Stir in yeast, and let sit for 5 minutes or until foamy.In a small bowl, whisk together the egg and melted butter and set aside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'Place flour and salt in a large mixing bowl or the bowl of the stand mixer fitted with a dough hook.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the milk mixture and mix on low speed until flour is moistened, then increase the speed until dough comes together.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add egg mixture and mix on medium-high speed for approximately 10 minutes until dough is smooth and very stretchy, scraping down the bowl as needed. When it is done, the dough should make a slapping sound against the edge of the bowl.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer dough to a lightly-oiled bowl and cover with plastic wrap; place in the refrigerator overnight.The next day, line two sheet pans with lightly-oiled parchment paper or silicone mats.Turn out dough onto a lightly floured work surface. Gently roll the dough to a uniform 1/2-inch thickness.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut out rounds using circle or doughnut cutters; arrange on the prepared tray, leaving room for them to expand.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place them in the warm place for about 1 hour or until they puffed. (Tip: if your kitchen is on the cold side, turn on your oven for 30 seconds, then turn it off, and place your sheet pans inside. The residual heat will create the perfect proofing environment)Fill a large, heavy-bottomed pot with oil to a depth of at least 1 1/2 inches.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat over medium heat until oil reaches 375 degrees F. Continue to monitor the temperature throughout the cooking process, adjusting heat as necessary. Line another sheet pan with paper towels, and set a metal cooling rack inside.Gently lay the doughnuts in the hot oil, one at a time. Fry the doughnuts in batches of 2 or 3 (depending on the size of your pot) for 1 to 2 minutes per side, then flip and cook until evenly golden brown (they will get darker when you take them out of the oil).', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer with tongs or a slotted spoon to prepared rack to cool. Repeat with remaining doughnuts.To prepare glaze, sift powdered sugar (and cocoa powder if making chocolate version) into a bowl to remove any large clumps.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add moonshine and vanilla extract (for vanilla variation), along with 1 tablespoon water, and whisk until no dry sugar remains.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add additional water as needed, 1 teaspoon at a time, until glaze reaches desired consistency. The glaze should flow thickly off your whisk and melt back into itself in 2 to 3 seconds.Dip tops of doughnuts, one at a time, into glaze. Invert and arrange on cooling rack until glaze sets. Repeat with remaining doughnuts. Doughnuts are best enjoyed fresh the day they are made.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1520, u'instructions': u'To prepare doughnuts, combine the warm milk and sugar in a small bowl. Stir in yeast, and let sit for 5 minutes or until foamy.In a small bowl, whisk together the egg and melted butter and set aside.Place flour and salt in a large mixing bowl or the bowl of the stand mixer fitted with a dough hook. Add the milk mixture and mix on low speed until flour is moistened, then increase the speed until dough comes together. Add egg mixture and mix on medium-high speed for approximately 10 minutes until dough is smooth and very stretchy, scraping down the bowl as needed. When it is done, the dough should make a slapping sound against the edge of the bowl. Transfer dough to a lightly-oiled bowl and cover with plastic wrap; place in the refrigerator overnight.The next day, line two sheet pans with lightly-oiled parchment paper or silicone mats.Turn out dough onto a lightly floured work surface. Gently roll the dough to a uniform 1/2-inch thickness. Cut out rounds using circle or doughnut cutters; arrange on the prepared tray, leaving room for them to expand. Place them in the warm place for about 1 hour or until they puffed. (Tip: if your kitchen is on the cold side, turn on your oven for 30 seconds, then turn it off, and place your sheet pans inside. The residual heat will create the perfect proofing environment)Fill a large, heavy-bottomed pot with oil to a depth of at least 1 1/2 inches. Heat over medium heat until oil reaches 375 degrees F. Continue to monitor the temperature throughout the cooking process, adjusting heat as necessary. Line another sheet pan with paper towels, and set a metal cooling rack inside.Gently lay the doughnuts in the hot oil, one at a time. Fry the doughnuts in batches of 2 or 3 (depending on the size of your pot) for 1 to 2 minutes per side, then flip and cook until evenly golden brown (they will get darker when you take them out of the oil). Transfer with tongs or a slotted spoon to prepared rack to cool. Repeat with remaining doughnuts.To prepare glaze, sift powdered sugar (and cocoa powder if making chocolate version) into a bowl to remove any large clumps. Add moonshine and vanilla extract (for vanilla variation), along with 1 tablespoon water, and whisk until no dry sugar remains. Add additional water as needed, 1 teaspoon at a time, until glaze reaches desired consistency. The glaze should flow thickly off your whisk and melt back into itself in 2 to 3 seconds.Dip tops of doughnuts, one at a time, into glaze. Invert and arrange on cooling rack until glaze sets. Repeat with remaining doughnuts. Doughnuts are best enjoyed fresh the day they are made.', u'spoonacularSourceUrl': u'https://spoonacular.com/moonshine-glazed-doughnuts-494211', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 1440, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}