{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536317-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 536317, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Fish with Tahini Sauce and Toasted Pine Nuts', u'diets': [u'gluten free', u'whole 30', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 1415.81, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'1 tablespoon clarified butter (or olive oil)', u'aisle': u'Ethnic Foods', u'name': u'clarified butter', u'metaInformation': [u'(or olive oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoon'}, {u'originalString': u'4 white fish filets (cod and tilapia work well)', u'aisle': u'Seafood', u'name': u'cat fish filets', u'metaInformation': [u'white', u'well', u'(cod and tilapia work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/catfish.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 15010, u'unit': u''}, {u'originalString': u'2 garlic cloves – grated', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup tahini', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12698, u'unit': u'cup'}, {u'originalString': u'1/4 cup warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'jpeg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.acedarspoon.com/guest-post-liz-from-the-lemon-bowl/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place fish filets in a large baking dish sprayed with cooking spray and season with salt and pepper to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake at 375 degrees for 20-25 minutes or until fish flakes easily with a fork.While fish is baking, whisk together tahini, lemon juice, warm water, grated garlic, salt and pepper in a small bowl; set aside.In a small pan, melt clarified butter over medium heat and add pine nuts. Toast nuts until evenly browned by stirring frequently for 4-5 minutes; set aside.When fish is cooked, place on a platter and drizzle the tahini sauce evenly over each filet. Top with toasted pine nuts and fresh chopped parsley.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'clarified butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'id': 12698, u'name': u'tahini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Fetzer Vineyards Valley Oaks Pinot Grigio. It has 5 out of 5 stars and a bottle costs about 11 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This Pinot Grigio is clean with a fruit forward character and a crisp acid backbone . There are aromas of mango, pear, orange spice, lemongrass and pineapple. In the mouth, there are flavors of tropical fruit, apples, pears and a nice orange citrus note, balanced with minerality and a wonderful, round finish.', u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 153, u'instructions': u'Place fish filets in a large baking dish sprayed with cooking spray and season with salt and pepper to taste. Bake at 375 degrees for 20-25 minutes or until fish flakes easily with a fork.While fish is baking, whisk together tahini, lemon juice, warm water, grated garlic, salt and pepper in a small bowl; set aside.In a small pan, melt clarified butter over medium heat and add pine nuts. Toast nuts until evenly browned by stirring frequently for 4-5 minutes; set aside.When fish is cooked, place on a platter and drizzle the tahini sauce evenly over each filet. Top with toasted pine nuts and fresh chopped parsley. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-fish-with-tahini-sauce-and-toasted-pine-nuts-536317', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}