{u'recipes': [{u'sourceName': u'The Hungry House Wife', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/532876-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 532876, u'veryPopular': False, u'lowFodmap': False, u'title': u'Light Chicken Parmesan with Pesto Pasta ($10 Meal)', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 255.68, u'creditText': u'The Hungry House Wife', u'extendedIngredients': [{u'originalString': u'1 loaf French Bread', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18029, u'unit': u'loaf'}, {u'originalString': u'\xbd cup My Essentials Shredded Italian Cheese Blend', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'shredded', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93651, u'unit': u'cup'}, {u'originalString': u'1 teaspoon Italian Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'3 tablespoons Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'8 oz. (1/2 box) Hannaford Gemelli Pasta, cooked to package directions', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'cooked', u'(1/2 box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'oz'}, {u'originalString': u'\xbd cup Hannaford Pasta Sauce', u'aisle': u'Pasta and Rice', u'name': u'pasta sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011549, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'Salt and Pepper for additional seasoning', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'for additional seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 lb. Boneless Skinless Chicken Breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'1 16 oz. package My Essentials Frozen Green Beans, cooked to package directions', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'green', u'frozen', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16033, u'unit': u'oz'}, {u'originalString': u'1 0.50 oz. packet Dried Pesto Mix', u'aisle': u'?', u'name': u'pesto mix', u'metaInformation': [u'dried'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'unit': u'oz'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.thehungryhousewife.com/2012/02/light-chicken-parmesan-with-pesto-pasta-10-meal.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u') In a shallow dish mix together the flour, pepper, salt and Italian Seasoning.Coat each piece of chicken with the seasoned flour.Over medium heat, in a large skillet, heat the oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken to the skillet, and cook for 8 minutes per side or until no longer pink in the middle.In a small saucepan mix together the dry pesto mix, milk and oil and cook over medium heat for about 1 minute or until heated through.Toss the pesto sauce with the cooked noodles. Season with salt and pepper if desired.Slice the chicken, pour on the pasta sauce and sprinkle with cheese.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10011549, u'name': u'pasta sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Place the chicken over noodles and serve with green beans and bread.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Parmesan can be paired with Barbera Wine, Chianti, and Montepulciano. When chicken is paired with tomato sauce and cheese, it can handle a light or medium bodied red wine. Since this is an Italian-American dish, we went for Italian wines. The Montoliva Vineyard, Late Harvest, Viani Vineyard, Barbera with a 4.5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'barbera wine', u'chianti', u'montepulciano'], u'productMatches': [{u'description': u'sweet , rich , blackberry', u'title': u'Montoliva Vineyard, Late Harvest, Viani Vineyard, Barbera', u'price': u'$20.0', u'id': 432139, u'link': u'https://www.amazon.com/Montoliva-Vineyard-Harvest-Foothills-Barbera/dp/B00GDQ3ONA', u'imageUrl': u'https://spoonacular.com/productImages/432139-312x231.jpg'}]}, u'aggregateLikes': 71, u'instructions': u') In a shallow dish mix together the flour, pepper, salt and Italian Seasoning.Coat each piece of chicken with the seasoned flour.Over medium heat, in a large skillet, heat the oil.Add the chicken to the skillet, and cook for 8 minutes per side or until no longer pink in the middle.In a small saucepan mix together the dry pesto mix, milk and oil and cook over medium heat for about 1 minute or until heated through.Toss the pesto sauce with the cooked noodles. Season with salt and pepper if desired.Slice the chicken, pour on the pasta sauce and sprinkle with cheese.Place the chicken over noodles and serve with green beans and bread.', u'spoonacularSourceUrl': u'https://spoonacular.com/light-chicken-parmesan-with-pesto-pasta-10-meal-532876', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}