{u'recipes': [{u'sourceName': u'Seasonal and Savory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478438-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 478438, u'veryPopular': False, u'lowFodmap': True, u'title': u'Raspberry Semifreddo (Dairy free)', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 208.28, u'creditText': u'Seasonal and Savory', u'extendedIngredients': [{u'originalString': u'2 14-ounce cans coconut milk (full fat–light will make the texture very hard)', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'hard', u'canned', u'(full fat-light will make the texture very )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons coconut oil (or butter)', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'(or butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'1 cup coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'3 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'\xbd cup pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'2 cups whole raspberries (fresh or frozen)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'whole', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cups'}, {u'originalString': u'\xbd cup unsweetened, shredded coconut', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}, {u'originalString': u'seeds from \xbd vanilla bean (or two teaspoons vanilla extract)', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'(or two teaspoons vanilla extract)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'2 whole eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.seasonalandsavory.com/2013/05/raspberry-semifreddo-dairy-free.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'First, prepare the brickle topping.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the pecans and coconut in the food processor and pulse until coarsely chopped.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the chopped mixture in a small saucepan with the coconut oil and the tablespoon of coconut sugar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u'Heat over medium heat, stirring frequently, until the nuts just start to smell toasty. Do not brown.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Remove from heat and cool completely.For the custard, place the coconut milk, cup of coconut sugar, eggs, egg yolks, and vanilla in a blender. Blend on low to begin, and then blend on high until very smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour the mixture into a saucepan and heat the mixture over medium heat, stirring frequently, until it just starts to thicken. Do not let the mixture boil. After it begins to thicken, turn off the heat and continue stirring for 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Let the custard cool completely.Line a standard loaf pan with plastic wrap, leaving a little hanging over the edges to make it easier to remove the dessert.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the raspberries to the pan, and then pour in the cooled custard. Shake the pan a bit to fill in any air gaps. Top with the cooled brickle, then place in the freezer to freeze overnight.To unmold, dip the pan in a bowl of hot water, then dry the sides off well before inverting onto a serving plate.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Remove the plastic wrap and discard. Use a serrated knife that you have dipped into hot water to cut slices for serving.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 79, u'instructions': u'First, prepare the brickle topping. Place the pecans and coconut in the food processor and pulse until coarsely chopped. Place the chopped mixture in a small saucepan with the coconut oil and the tablespoon of coconut sugar. Heat over medium heat, stirring frequently, until the nuts just start to smell toasty. Do not brown. Remove from heat and cool completely.For the custard, place the coconut milk, cup of coconut sugar, eggs, egg yolks, and vanilla in a blender. Blend on low to begin, and then blend on high until very smooth. Pour the mixture into a saucepan and heat the mixture over medium heat, stirring frequently, until it just starts to thicken. Do not let the mixture boil. After it begins to thicken, turn off the heat and continue stirring for 2-3 minutes. Let the custard cool completely.Line a standard loaf pan with plastic wrap, leaving a little hanging over the edges to make it easier to remove the dessert. Add the raspberries to the pan, and then pour in the cooled custard. Shake the pan a bit to fill in any air gaps. Top with the cooled brickle, then place in the freezer to freeze overnight.To unmold, dip the pan in a bowl of hot water, then dry the sides off well before inverting onto a serving plate. Remove the plastic wrap and discard. Use a serrated knife that you have dipped into hot water to cut slices for serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-semifreddo-dairy-free-478438', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}