{u'recipes': [{u'sourceName': u'Alaska from Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519566-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 519566, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hearty Split Pea Soup with Lemon & Olive Oil Croutons', u'diets': [u'dairy free'], u'pricePerServing': 95.98, u'creditText': u'Alaska from Scratch', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 carrots, peeled and diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery stalks, greens removed and chopped', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2 cups cubed French bread', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18029, u'unit': u'cups'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 pound ham hock*', u'aisle': u'Meat', u'name': u'ham hock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93669, u'unit': u'pound'}, {u'originalString': u'1 teaspoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons fresh lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoons'}, {u'originalString': u'olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 cups dry split peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'split', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cups'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups potato, peeled and chopped (I used an Alaska potato, similar to Yukon Gold)', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'peeled', u'chopped', u'(I used an Alaska potato, similar to Yukon Gold)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11362, u'unit': u'cups'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon dry thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'8-10 cups** of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.alaskafromscratch.com/2013/02/03/hearty-split-pea-soup-with-lemon-olive-oil-croutons/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"To a large pot, add the onions, carrots, celery, garlic, peas, bay leaves, thyme, salt, pepper, and ham hock. Cover with water, turn heat to medium-high, and bring to a simmer. When the soup comes to a simmer, a bubbly film will rise to the top of the pot. Skim this off and discard (if you get some vegetables and herbs when you skim, simply rinse them and return them to the pot). Then, cover the soup leaving the lid just slightly open, and reduce the heat to medium-low. Simmer, stirring often so the soup doesn't stick as it thickens, 1 hour.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'id': 93669, u'name': u'ham hock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Remove the ham hock to a cutting board to cool.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'id': 93669, u'name': u'ham hock'}]}, {u'equipment': [], u'step': u'Add the potatoes to the soup and stir. Cover and cook another 30 minutes or until the potatoes are soft and the peas are no longer firm (they turn to mush and become the thick base of the soup). During this time, remove the meat from the hock and chop it up finely, discarding any fat. Stir the ham into the soup.  Turn off the heat, remove the bay leaves, and stir in the fresh lemon juice. Taste for seasoning and adjust salt and pepper as needed.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Serve hot with chives, if using, and croutons. *If you prefer a smoother soup, you can blend all or some of it with an immersion blender until the desired texture is achieved. I prefer mine hearty and chunky, so I did not blend it.  Preheat oven to 200.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the cubed French bread on a baking sheet in a single layer.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}]}, {u'equipment': [], u'step': u'Bake the bread for 15-20 minutes or until it is dry to the touch on the exterior.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large frying pan over medium heat.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drizzle the bread generously with olive oil and toss to coat. Cook in the frying pan in batches, turning often, until croutons are golden and toasted, adding more olive oil if needed to get them crispy and browned. Season with sea salt and black pepper and top with fresh lemon zest.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Serve warm over soup.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 73, u'instructions': u"To a large pot, add the onions, carrots, celery, garlic, peas, bay leaves, thyme, salt, pepper, and ham hock. Cover with water, turn heat to medium-high, and bring to a simmer. When the soup comes to a simmer, a bubbly film will rise to the top of the pot. Skim this off and discard (if you get some vegetables and herbs when you skim, simply rinse them and return them to the pot). Then, cover the soup leaving the lid just slightly open, and reduce the heat to medium-low. Simmer, stirring often so the soup doesn't stick as it thickens, 1 hour.  Remove the ham hock to a cutting board to cool. Add the potatoes to the soup and stir. Cover and cook another 30 minutes or until the potatoes are soft and the peas are no longer firm (they turn to mush and become the thick base of the soup). During this time, remove the meat from the hock and chop it up finely, discarding any fat. Stir the ham into the soup.  Turn off the heat, remove the bay leaves, and stir in the fresh lemon juice. Taste for seasoning and adjust salt and pepper as needed. Serve hot with chives, if using, and croutons. *If you prefer a smoother soup, you can blend all or some of it with an immersion blender until the desired texture is achieved. I prefer mine hearty and chunky, so I did not blend it.  Preheat oven to 200. Place the cubed French bread on a baking sheet in a single layer. Bake the bread for 15-20 minutes or until it is dry to the touch on the exterior.  Heat a large frying pan over medium heat. Drizzle the bread generously with olive oil and toss to coat. Cook in the frying pan in batches, turning often, until croutons are golden and toasted, adding more olive oil if needed to get them crispy and browned. Season with sea salt and black pepper and top with fresh lemon zest. Serve warm over soup.", u'spoonacularSourceUrl': u'https://spoonacular.com/hearty-split-pea-soup-with-lemon-olive-oil-croutons-519566', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}