{u'recipes': [{u'sourceName': u'Bunky Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575401-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 575401, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken and Dumplings', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 330.9, u'creditText': u'Bunky Cooks', u'extendedIngredients': [{u'originalString': u'1 carrot, peeled, thinly sliced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery stalks, cut crosswise into 1/4"-thick slices', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'slices'}, {u'originalString': u'1 large egg, beaten to blend', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'beaten to blend'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'6 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup chopped fresh chives', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11156, u'unit': u'cup'}, {u'originalString': u'Kosher salt, freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 leek, halved lengthwise, cut crosswise into 1/4"-thick slices', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u'slices'}, {u'originalString': u"10 cups low-salt chicken broth (I used Swanson's Organic Chicken Broth)", u'aisle': u'Canned and Jarred', u'name': u'low-salt chicken broth', u'metaInformation': [u'organic', u"(I used Swanson's Chicken Broth)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 10.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'3/4 teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 1/4 cups finely grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cups'}, {u'originalString': u'* Shaved Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 parsnip, peeled, cut into 1/4"-thick rounds', u'aisle': u'Produce', u'name': u'parsnip', u'metaInformation': [u'peeled', u'cut into 1/4"-thick rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'1 pound ricotta (I prefer Calabro Part-Skim Ricotta)', u'aisle': u'Cheese', u'name': u'ricotta', u'metaInformation': [u'(I prefer Calabro Part-Skim Ricotta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'pound'}, {u'originalString': u'2 pounds skinless, boneless chicken thighs', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5096, u'unit': u'pounds'}, {u'originalString': u'1/4 cup (1/2 stick) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.bunkycooks.com/2012/02/chicken-and-dumplings-chef-mike-lata-fig-charleston-sc/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For gnocchi:1. If using fresh ricotta that has excess liquid, you may need to drain it overnight. Line a fine-mesh strainer with cheesecloth and set it over a medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add ricotta; cover with plastic wrap and let drain overnight in refrigerator. If using supermarket ricotta, proceed with recipe; no draining required.2. Gently mix ricotta, 1/2 cup plus 2 tablespoons flour, egg, Parmesan, nutmeg, and salt in a large bowl just to blend (do not overwork). Form dough into a ball (it will be sticky); wrap in plastic and chill for at least 1 hour and up to 1 day.3. Line a baking sheet with parchment paper; set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place dough on a lightly floured work surface. Divide dough into 4 equal portions and cover with a clean kitchen towel. Using your hands, roll 1 portion into a 1/2"-diameter rope; cut crosswise into 1/2"-thick pieces. Lightly dust gnocchi with flour and transfer to prepared baking sheet. Repeat with remaining portions of dough. Cover gnocchi with a kitchen towel and chill until ready to cook. DO AHEAD: Can be made 2 months ahead. Freeze on sheets, then store, frozen, in an airtight container.For chicken and gravy:1. Bring broth to a boil in a large saucepan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add chicken; reduce heat to low, cover, and gently simmer until chicken is tender and cooked through, 20–30 minutes. (* Be sure to skim off the foam that rises to the top of the broth as it boils.)', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove chicken; let cool slightly and shred into bite-size pieces. Bring broth to a boil and cook until reduced to 8 cups, about 15 minutes.2. Meanwhile, melt butter in a small heavy saucepan over low heat.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in flour until smooth and cook, whisking constantly, until roux is pale beige in color, about 15 minutes (do not brown).3. Scrape roux into simmering broth; whisk until thickened and broth coats the back of a spoon. Reduce heat to low and add vegetables. Cook until tender, about 5 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add shredded chicken and herbs. Season with salt and pepper. DO AHEAD: Can be made 2 days ahead. Chill, uncovered, until cold; cover and keep chilled. Rewarm before serving.4. Cook gnocchi in a large pot of boiling salted water, stirring occasionally, until gnocchi float to the surface, about 2 minutes (slightly longer if frozen). Using a slotted spoon, transfer gnocchi to bowls, dividing equally. Ladle chicken and vegetables with gravy over. Season with pepper and top with Parmesan.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 129, u'instructions': u'For gnocchi:1. If using fresh ricotta that has excess liquid, you may need to drain it overnight. Line a fine-mesh strainer with cheesecloth and set it over a medium bowl. Add ricotta; cover with plastic wrap and let drain overnight in refrigerator. If using supermarket ricotta, proceed with recipe; no draining required.2. Gently mix ricotta, 1/2 cup plus 2 tablespoons flour, egg, Parmesan, nutmeg, and salt in a large bowl just to blend (do not overwork). Form dough into a ball (it will be sticky); wrap in plastic and chill for at least 1 hour and up to 1 day.3. Line a baking sheet with parchment paper; set aside. Place dough on a lightly floured work surface. Divide dough into 4 equal portions and cover with a clean kitchen towel. Using your hands, roll 1 portion into a 1/2"-diameter rope; cut crosswise into 1/2"-thick pieces. Lightly dust gnocchi with flour and transfer to prepared baking sheet. Repeat with remaining portions of dough. Cover gnocchi with a kitchen towel and chill until ready to cook. DO AHEAD: Can be made 2 months ahead. Freeze on sheets, then store, frozen, in an airtight container.For chicken and gravy:1. Bring broth to a boil in a large saucepan. Add chicken; reduce heat to low, cover, and gently simmer until chicken is tender and cooked through, 20–30 minutes. (* Be sure to skim off the foam that rises to the top of the broth as it boils.) Remove chicken; let cool slightly and shred into bite-size pieces. Bring broth to a boil and cook until reduced to 8 cups, about 15 minutes.2. Meanwhile, melt butter in a small heavy saucepan over low heat. Whisk in flour until smooth and cook, whisking constantly, until roux is pale beige in color, about 15 minutes (do not brown).3. Scrape roux into simmering broth; whisk until thickened and broth coats the back of a spoon. Reduce heat to low and add vegetables. Cook until tender, about 5 minutes. Add shredded chicken and herbs. Season with salt and pepper. DO AHEAD: Can be made 2 days ahead. Chill, uncovered, until cold; cover and keep chilled. Rewarm before serving.4. Cook gnocchi in a large pot of boiling salted water, stirring occasionally, until gnocchi float to the surface, about 2 minutes (slightly longer if frozen). Using a slotted spoon, transfer gnocchi to bowls, dividing equally. Ladle chicken and vegetables with gravy over. Season with pepper and top with Parmesan.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-and-dumplings-575401', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}