{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/523141-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 523141, u'veryPopular': False, u'lowFodmap': False, u'title': u'Healthy Spinach Mango Lassi', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 222.6, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'1 cup Baby Spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cup'}, {u'originalString': u'pinch of Cardamom', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2006, u'unit': u'pinch'}, {u'originalString': u'1-2 Tbs Honey (vegans, use agave)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'(vegans, use agave)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbs'}, {u'originalString': u'5-7 Ice Cubes', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10014412, u'unit': u''}, {u'originalString': u'2 large Mangos', u'aisle': u'Produce', u'name': u'mangos', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'1 cup Plain, Nonfat Greek Yogurt (vegans, use soy/coconut/almond yogurt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain', u'(vegans, use soy/coconut/almond yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'png', u'spoonacularScore': 81.0, u'sourceUrl': u'http://dessertswithbenefits.com/spinach-mango-lassi/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Put all ingredients into a blender (in the order of the recipe, so chops mangos first etc...) and liquify until spinach is broken up as pictured above (add honey and stevia to taste)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Gruener Veltliner, Riesling, and Sparkling ros\xe9 are great choices for Lassi. The best wine for Indian food will depending on the dish, of course, but these picks can be served chilled and have some sweetness to complement the spiciness and complex flavors of a wide variety of traditional dishes. You could try Laurenz V Singing Gruner Veltliner. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'gruener veltliner', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!', u'title': u'Laurenz V Singing Gruner Veltliner', u'price': u'$16.49', u'id': 434576, u'link': u'https://www.wine.com/product/laurenz-v-singing-gruner-veltliner-2007/99150', u'imageUrl': u'https://spoonacular.com/productImages/434576-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Put all ingredients into a blender (in the order of the recipe, so chops mangos first etc...) and liquify until spinach is broken up as pictured above (add honey and stevia to taste)', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-spinach-mango-lassi-523141', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}