{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542091-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 542091, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black-Eyed Pea Salad', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 330.44, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'2 cups dry black-eyed peas', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black eyed peas', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-eyed-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16063, u'unit': u'cups'}, {u'originalString': u'1 cup black olives, preferably Kalamata or oil-cured', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'cup'}, {u'originalString': u'1 package of feta cheese, about 7 ounces', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 1019, u'unit': u'package'}, {u'originalString': u'1 finely chopped garlic clove', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 finely chopped green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Zest and juice of a lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large bunch of spinach, about 1 pound, washed, chopped', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'washed', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'bunch'}, {u'originalString': u'1 jar of sun-dried tomatoes in oil, about 8 ounces', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun-dried tomatoes', u'metaInformation': [u'in oil'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 11955, u'unit': u'jar'}], u'healthScore': 65.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/greek_black_eyed_peas_salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'1 Bring a medium pot of water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add enough salt to make the water taste like the sea. Turn the heat down to low and add the black-eyed peas.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let them cook slowly, uncovered, until they are done, anywhere from 30 minutes to an hour, depending on how old the peas are. Don’t let the water simmer.2', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the spinach to a large bowl. Crumble the feta cheese into the bowl and add all the other ingredients except the lemon juice.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Mix well.3 When the black-eyed peas are done, pour them into a colander and spray them with cold water to stop the cooking. Pick through and discard any loose skins or mashed peas; you’ll find a few, but hopefully not many.4', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the black-eyed peas to the salad, mix well and serve. Squirt some lemon juice over each serving before you take them to the table.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'1 Bring a medium pot of water to a boil. Add enough salt to make the water taste like the sea. Turn the heat down to low and add the black-eyed peas. Let them cook slowly, uncovered, until they are done, anywhere from 30 minutes to an hour, depending on how old the peas are. Don’t let the water simmer.2 Add the spinach to a large bowl. Crumble the feta cheese into the bowl and add all the other ingredients except the lemon juice. Mix well.3 When the black-eyed peas are done, pour them into a colander and spray them with cold water to stop the cooking. Pick through and discard any loose skins or mashed peas; you’ll find a few, but hopefully not many.4 Add the black-eyed peas to the salad, mix well and serve. Squirt some lemon juice over each serving before you take them to the table.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-eyed-pea-salad-542091', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}