{u'recipes': [{u'sourceName': u'I Wash You Dry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/884535-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 884535, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fluffy Brown Sugar Icing', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 54.6, u'creditText': u'I Wash You Dry', u'extendedIngredients': [{u'originalString': u'1 cup brown sugar (packed)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 cup corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'4 egg whites*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.iwashyoudry.com/fluffy-brown-sugar-icing/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix brown sugar, water and corn syrup in a medium saucepan. Bring to a full rolling boil. (Be careful, as it will rise, so make sure the sides of your pan are taller).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let it boil at medium to medium high until the syrup drops like a hair from spoon (approximately 10 minutes).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from burner and set aside.Meanwhile, beat egg whites until stiff.SLOWLY pour the hot syrup in a THIN stream into egg whites, beating constantly. Beat until icing holds peaks, then blend in vanilla.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Let cool to room temp, then store covered in the fridge until ready to use.Enjoy!', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 545, u'instructions': u'Mix brown sugar, water and corn syrup in a medium saucepan. Bring to a full rolling boil. (Be careful, as it will rise, so make sure the sides of your pan are taller). Let it boil at medium to medium high until the syrup drops like a hair from spoon (approximately 10 minutes). Remove from burner and set aside.Meanwhile, beat egg whites until stiff.SLOWLY pour the hot syrup in a THIN stream into egg whites, beating constantly. Beat until icing holds peaks, then blend in vanilla.Let cool to room temp, then store covered in the fridge until ready to use.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/fluffy-brown-sugar-icing-884535', u'dishTypes': [u'frosting', u'icing'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}