{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522306-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 522306, u'veryPopular': False, u'lowFodmap': True, u'title': u'Ypocras – Spiced Red Wine with Cabernet Sauvignon from Mira Winery', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 433.76, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'1 cup brown sugar (200 grams)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'1 Tbsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2011, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp ground mace', u'aisle': u'Spices and Seasonings', u'name': u'ground mace', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2022, u'unit': u'Tbsp'}, {u'originalString': u'1 bottle fruity red wine, such as Merlot (750 ml)', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'fruity', u'red', u' such as merlot (750 ml)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'bottle'}, {u'originalString': u'Cheesecloth', u'aisle': u'?', u'name': u'cheesecloth', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'unit': u'servings'}, {u'originalString': u'1 Tbsp ground grains of paradise (not readily available so I substituted with half black pepper and half ginger)', u'aisle': u'?', u'name': u'ground grains of paradise', u'metaInformation': [u'with half black pepper and half ginger)'], u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'Tbsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.creative-culinary.com/ypocras-spiced-red-wine-with-cabernet-sauvignon-from-mira-winery/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium nonmetallic bowl, stir together the spices; add the wine and stir well. Leave for 10 minutes, then stir again to dissolve the sugar fully. Cover tightly and leave at room temperature for 1 to 2 days.Strain the mixture through a strainer lined with a double layer of cheesecloth into a bowl. Rinse the cheesecloth and strain the wine at least once more through it to clarify it as much as possible. Store the wine in an airtight container (save and use the original bottle?) at room temperature. It will keep for up to 1 month.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 94, u'instructions': u'In a medium nonmetallic bowl, stir together the spices; add the wine and stir well. Leave for 10 minutes, then stir again to dissolve the sugar fully. Cover tightly and leave at room temperature for 1 to 2 days.Strain the mixture through a strainer lined with a double layer of cheesecloth into a bowl. Rinse the cheesecloth and strain the wine at least once more through it to clarify it as much as possible. Store the wine in an airtight container (save and use the original bottle?) at room temperature. It will keep for up to 1 month.', u'spoonacularSourceUrl': u'https://spoonacular.com/ypocras-spiced-red-wine-with-cabernet-sauvignon-from-mira-winery-522306', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}