{u'recipes': [{u'sourceName': u'Eat at Home Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/504370-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 504370, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot Chocolate Ice Cream', u'diets': [u'gluten free'], u'pricePerServing': 85.82, u'creditText': u'Eat at Home Cooks', u'extendedIngredients': [{u'originalString': u'2 cups half & half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'8 Tbs. hot cocoa mix', u'aisle': u'Beverages', u'name': u'hot cocoa mix', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 8.0, u'consistency': u'solid', u'id': 14197, u'unit': u'Tbs'}, {u'originalString': u'1 can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 1095, u'unit': u'can'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://eatathomecooks.com/2011/01/hot-chocolate-ice-cream.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk all the ingredients together.  Freeze according to your ice cream maker’s instructions.Homemade ice cream is always very soft when it’s first made.  If you want it to harden a bit, take it out of the ice cream maker and put it in a bowl in your freezer for several hours or till the next day.  This ice cream was still very soft and dippable even after being stored in the freezer.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 274, u'instructions': u'Whisk all the ingredients together.  Freeze according to your ice cream maker’s instructions.Homemade ice cream is always very soft when it’s first made.  If you want it to harden a bit, take it out of the ice cream maker and put it in a bowl in your freezer for several hours or till the next day.  This ice cream was still very soft and dippable even after being stored in the freezer.', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-chocolate-ice-cream-504370', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}