{u'recipes': [{u'sourceName': u'Memorie Di Angelina', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/481336-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 481336, u'veryPopular': False, u'lowFodmap': False, u'title': u'Risotto alla crema di scampi (Risotto with Pur\xe9ed Shrimp)', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 526.16, u'creditText': u'Memorie Di Angelina', u'extendedIngredients': [{u'originalString': u'400g (14 oz) Arborio or other rice for risotto', u'aisle': u'Pasta and Rice', u'name': u'arborio rice', u'metaInformation': [u'for risotto'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10020052, u'unit': u'oz'}, {u'originalString': u'Brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'servings'}, {u'originalString': u'1 small carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stick of celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stick'}, {u'originalString': u'1-2 cloves of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'200 ml (7 oz.) heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'oz'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 medium onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'A few sprigs of parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'sprigs'}, {u'originalString': u'200g (7 oz.) canned crushed tomatoes or passata di pomodoro', u'aisle': u'Canned and Jarred', u'name': u'passata', u'metaInformation': [u'canned', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 10011547, u'unit': u'oz'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'250g (1/2 lb.) shrimp, just the shells', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'The above shrimp', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'servings'}, {u'originalString': u'White wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'servings'}, {u'originalString': u'The above fumetto', u'aisle': u'?', u'name': u'the above fumetto', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://memoriediangelina.com/2009/08/20/risotto-alla-crema-di-scampi/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Begin by making the fumetto di scampi: shell the shrimp. Take the shells (and heads if you have them) and put them in a saucepan with one liter (1 qt.) of water, a splash of white wine, a pinch of salt and the usual odori: a small onion, a carrot and a stick of celery, cut up into chunks, along with a few sprigs of parsley. Simmer for about 20 minutes.Then make the crema di scampi: saut\xe9 a lightly crushed garlic clove in a bit of olive oil. When the garlic just begins to give off aroma, add the shrimp and saut\xe9 them as well. When the shrimp have just turned pink, add a splash a brandy and allow it to evaporate. (Some recipes call for you to set light to the brandy.) If you like, remove a few shrimp—enough for one or two shrimp per person—from the skillet as garnish. Then add the crushed canned tomatoes or passata di pomodoro and a ladleful of the fumetto, and simmer for about 20 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'id': 10011547, u'name': u'passata'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer this shrimp and tomato mixture to a blender, add the cream and blend on the highest setting until you have a very smooth, cream-like pur\xe9e.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer this back to the skillet and allow to simmer for 10-15 minutes more to thicken the crema and concentrate its flavor. Make sure that the puree is well seasoned.Finally, make a normal risotto in bianco, with 400g of rice, using the usual technique (see Notes), beginning with a shallot or half a small onion saut\xe9ed in olive oil and using the remainder of the fumetto in place of the usual broth. About halfway through the cooking time, add the crema di scampi and continue with the cooking. (You can hold back a bit of the crema for garnish. When the rice is fully cooked, add a dab of butter and proceed to mantecare.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Let the risotto rest, covered, for 2 or 3 minutes before serving. If you like, garnish with a spoonful of the crema di scampi, one or two saut\xe9ed shrimp and a pinch of finely chopped parsley.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Risotto works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Fonterutoli Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'Begin by making the fumetto di scampi: shell the shrimp. Take the shells (and heads if you have them) and put them in a saucepan with one liter (1 qt.) of water, a splash of white wine, a pinch of salt and the usual odori: a small onion, a carrot and a stick of celery, cut up into chunks, along with a few sprigs of parsley. Simmer for about 20 minutes.Then make the crema di scampi: saut\xe9 a lightly crushed garlic clove in a bit of olive oil. When the garlic just begins to give off aroma, add the shrimp and saut\xe9 them as well. When the shrimp have just turned pink, add a splash a brandy and allow it to evaporate. (Some recipes call for you to set light to the brandy.) If you like, remove a few shrimp—enough for one or two shrimp per person—from the skillet as garnish. Then add the crushed canned tomatoes or passata di pomodoro and a ladleful of the fumetto, and simmer for about 20 minutes. Transfer this shrimp and tomato mixture to a blender, add the cream and blend on the highest setting until you have a very smooth, cream-like pur\xe9e. Transfer this back to the skillet and allow to simmer for 10-15 minutes more to thicken the crema and concentrate its flavor. Make sure that the puree is well seasoned.Finally, make a normal risotto in bianco, with 400g of rice, using the usual technique (see Notes), beginning with a shallot or half a small onion saut\xe9ed in olive oil and using the remainder of the fumetto in place of the usual broth. About halfway through the cooking time, add the crema di scampi and continue with the cooking. (You can hold back a bit of the crema for garnish. When the rice is fully cooked, add a dab of butter and proceed to mantecare. Let the risotto rest, covered, for 2 or 3 minutes before serving. If you like, garnish with a spoonful of the crema di scampi, one or two saut\xe9ed shrimp and a pinch of finely chopped parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/risotto-alla-crema-di-scampi-risotto-with-pured-shrimp-481336', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}