{u'recipes': [{u'sourceName': u'Dine and Dish', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/625035-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 625035, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pizza Dough {Saut\xe9ed Spinach & Mushroom Pizza}', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 136.12, u'creditText': u'Dine and Dish', u'extendedIngredients': [{u'originalString': u'2 cups baby bella mushrooms, sliced', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11266, u'unit': u'cups'}, {u'originalString': u'2 cups baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'pizza pan or baking sheet', u'aisle': u'Baking', u'name': u'baking mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18010, u'unit': u'sheet'}, {u'originalString': u'8-10 slices fresh mozzarella', u'aisle': u'Cheese', u'name': u'fresh mozzarella', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1026, u'unit': u'slices'}, {u'originalString': u'dash of Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'dash'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'dash of cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'dash'}, {u'originalString': u"1 prepared batch of Basic Regular Pizza Crust dough using Fleischmann's\xae Yeast", u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'\xbc to \xbd cup prepared pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11549, u'unit': u''}, {u'originalString': u"OR Fleischmann's\xae Pizza Yeast, patted out to a 12-inch circle placed on a greased", u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 12.0, u'consistency': u'solid', u'id': 18375, u'unit': u'inch'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://dineanddish.net/2014/12/pizza-dough-recipe-sauteed-spinach-mushroom-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425F', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add olive oil to a medium skillet and heat to medium low. Once warmed, add the baby bella mushrooms and spinach and cook for 5 minutes, stirring occasionally, until the spinach starts to wilt and mushrooms soften.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11266, u'name': u'crimini mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread pizza sauce over prepared dough. Top with mushroom / spinach mixture and then the fresh mozzarella cheese slices.Sprinkle salt and pepper over the topped pizza.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'fresh mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the oven on the lowest rack and bake for 12-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven when cheese is bubbly and crust is a golden brown.Slice and enjoy!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Hills Vineyard Rosato di Sangiovese with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'strawberry , raspberry , cherry', u'title': u'Hills Vineyard Rosato di Sangiovese', u'price': u'$14.95', u'id': 430938, u'link': u'https://www.amazon.com/Texas-Hills-Vineyard-Rosato-Sangiovese/dp/B00CHCHU8E', u'imageUrl': u'https://spoonacular.com/productImages/430938-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Preheat oven to 425FAdd olive oil to a medium skillet and heat to medium low. Once warmed, add the baby bella mushrooms and spinach and cook for 5 minutes, stirring occasionally, until the spinach starts to wilt and mushrooms soften. Remove from heat.Spread pizza sauce over prepared dough. Top with mushroom / spinach mixture and then the fresh mozzarella cheese slices.Sprinkle salt and pepper over the topped pizza.Place in the oven on the lowest rack and bake for 12-15 minutes. Remove from oven when cheese is bubbly and crust is a golden brown.Slice and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/pizza-dough-sauted-spinach-mushroom-pizza-625035', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}