{u'recipes': [{u'sourceName': u'Alidas Kitchen', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/547639-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 547639, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheese Enchilada Casserole', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 145.23, u'creditText': u'Alidas Kitchen', u'extendedIngredients': [{u'originalString': u'15 oz can diced tomatoes with green chiles', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'with green chiles', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2 tsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'9 6" corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1 cup (8 oz) fat free cottage cheese', u'aisle': u'Cheese', u'name': u'fat free cottage cheese', u'metaInformation': [u'fat free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1014, u'unit': u'oz'}, {u'originalString': u'3 cloves minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 bunch green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}, {u'originalString': u'1 cup (4 oz) shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'oz'}, {u'originalString': u'1 cup taco sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://alidaskitchen.com/2011/06/01/cheese-enchilada-casserole/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees. Spray 13 x 9 baking dish with cooking spray.  Set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix first 6 ingredients, through chili powder, in bowl.  [This step can be done in advance]', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place 3 corn tortillas in baking dish.  Top tortillas with 1/2 of cheese mixture.  Repeat.  Top final layer with 3 corn tortillas.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Pour taco sauce over tortillas and top with 1/4 cup cheddar cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}]}, {u'equipment': [], u'step': u'Bake uncovered for 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let sit for 5 minutes before serving.  Slice into 4 pieces and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u'Preheat oven to 375 degrees. Spray 13 x 9 baking dish with cooking spray.  Set aside.Mix first 6 ingredients, through chili powder, in bowl.  [This step can be done in advance]Place 3 corn tortillas in baking dish.  Top tortillas with 1/2 of cheese mixture.  Repeat.  Top final layer with 3 corn tortillas. Pour taco sauce over tortillas and top with 1/4 cup cheddar cheese.Bake uncovered for 25 minutes.  Let sit for 5 minutes before serving.  Slice into 4 pieces and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheese-enchilada-casserole-547639', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}