{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/599641-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 599641, u'veryPopular': False, u'lowFodmap': False, u'title': u'Le Bonne French Onion Soup', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 161.73, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'2 quarts (8 cup) beef broth, preferably homemade', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'Black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 ribs celery with leaves, each cut in half', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'with leaves, each cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'ribs', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'1 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'4 (1/4-inch thick) slices baguette (French bread)', u'aisle': u'Bakery/Bread', u'name': u'french baguette', u'metaInformation': [u'french', u'(1/)', u'( bread)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18033, u'unit': u'slices'}, {u'originalString': u'1 teaspoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup coarsely grated Emmenthal or Gruyere cheese', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1023, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds (approximately 4 large) sweet Bermuda or Spanish onions, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'sweet', u'spanish', u'large', u'peeled', u'thinly sliced', u'(approximately 4 )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11282, u'unit': u'pounds'}, {u'originalString': u'Salt to taste (depending upon the saltiness of the broth and the cheese)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'(depending upon the saltiness of the broth and the cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/4 cup dry Fino sherry', u'aisle': u'Alcoholic Beverages', u'name': u'sherry', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10214106, u'unit': u'cup'}, {u'originalString': u'3 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.copykat.com/2009/03/28/le-bonne-french-onion-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare onion mixture:. Cook onions and sugar in butter over low heat until onions are lightly caramelized (about 20 - 30 minutes)..', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add wine. Increase flame to medium and cook until wine is reduced by half (about 5 minutes)..', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add broth, celery, salt, and pepper. Bring to boil over high flame.. Reduce heat to low, partially cover, and simmer for approximately 40 minutes..', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove celery; discard it..', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add sherry; simmer 5 minutes longer.-- Prepare baguette-topped soup:. Preheat oven to 375 degrees F.. Lightly toast each slice of baguette. Set aside..', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place soup bowls on jelly roll pan or cookie sheet.. Put jelly roll pan or cookie sheet (containing empty soup bowls) on center shelf of oven.. Pull out shelf (so that you can fill the soup bowls).. Ladle soup into 4 individual oven-proof soup bowls.. Top each soup-filled bowl with one toasted slice of baguette.. Sprinkle 1 tablespoon cheese over top of each bowl.. Push back oven shelf..', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [], u'step': u'Heat until cheese melts and bubbles (approximately 5 - 6 minutes).', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"French Onion Soup works really well with Beaujolais and Pinot Grigio. A fruity Beaujolais will complement this soup's rich flavors. If you prefer white wine, try a pinot grigio. The Louis Jadot Beaujolais Villages with a 4.3 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'beaujolais', u'pinot grigio'], u'productMatches': [{u'description': u'This crisp, fruit-forward, juicy wine has expressive aromas and flavors of ripe red berries, with nice weight and typically high acidity in the mouth and mineral and spice notes underlying the fruit.', u'title': u'Louis Jadot Beaujolais Villages', u'price': u'$13.99', u'id': 435360, u'link': u'https://www.wine.com/product/louis-jadot-beaujolais-villages-2011/119527', u'imageUrl': u'https://spoonacular.com/productImages/435360-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Prepare onion mixture:. Cook onions and sugar in butter over low heat until onions are lightly caramelized (about 20 - 30 minutes).. Add wine. Increase flame to medium and cook until wine is reduced by half (about 5 minutes).. Add broth, celery, salt, and pepper. Bring to boil over high flame.. Reduce heat to low, partially cover, and simmer for approximately 40 minutes.. Remove celery; discard it.. Add sherry; simmer 5 minutes longer.-- Prepare baguette-topped soup:. Preheat oven to 375 degrees F.. Lightly toast each slice of baguette. Set aside.. Place soup bowls on jelly roll pan or cookie sheet.. Put jelly roll pan or cookie sheet (containing empty soup bowls) on center shelf of oven.. Pull out shelf (so that you can fill the soup bowls).. Ladle soup into 4 individual oven-proof soup bowls.. Top each soup-filled bowl with one toasted slice of baguette.. Sprinkle 1 tablespoon cheese over top of each bowl.. Push back oven shelf.. Heat until cheese melts and bubbles (approximately 5 - 6 minutes).', u'spoonacularSourceUrl': u'https://spoonacular.com/le-bonne-french-onion-soup-599641', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}