{u'recipes': [{u'sourceName': u'Normal Cooking', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/719382-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 719382, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Beef & Spinach Enchiladas', u'diets': [], u'pricePerServing': 279.05, u'creditText': u'Normal Cooking', u'extendedIngredients': [{u'originalString': u'1 lb 90% lean ground beef', u'aisle': u'Meat', u'name': u'90% lean ground beef', u'metaInformation': [u'90%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23562, u'unit': u'lb'}, {u'originalString': u'1 (5-oz) pkg fresh baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'1 (14.5-oz) can no-salt-added diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1 (8-oz) block 1⁄3-less-fat cream cheese, cubed', u'aisle': u'Cheese', u'name': u'cream cheese block', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1186, u'unit': u'oz'}, {u'originalString': u'6 taco-size low-carb flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'low-carb'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'2 tsp ground cumin, divided', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 cup shredded reduced fat Mexican-blend cheese', u'aisle': u'Cheese', u'name': u'reduced-fat shredded mexican cheese blend', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-mexican-cheese-blend.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1209, u'unit': u'cup'}, {u'originalString': u'2 cups refrigerated fresh salsa, divided', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'fresh', u'refrigerated', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'cups'}, {u'originalString': u'1⁄4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://normalcooking.com/2016/03/02/creamy-beef-spinach-enchiladas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F. Cook ground beef in a large nonstick skillet over medium heat until meat crumbles and is no longer pink; drain.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1 cup salsa, spinach, 112 tsp cumin, and salt. Cook, stirring occasionally, 2 to 3 minutes or until most of liquid has evaporated and spinach wilts.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cream cheese, and stir until blended.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat. Spoon meat mixture evenly onto tortillas.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Roll up, and place, seam sides down, in a 13- x 9-inch baking dish coated with cooking spray. Stir together diced tomatoes and remaining 1 cup salsa and 12 tsp cumin; pour over enchiladas.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Bake 20 minutes. Top with cheese, and bake 5 minutes longer or until cheese melts.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Enchilada. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The The Donum Estate Russian River Valley Pinot Noir with a 4.9 out of 5 star rating seems like a good match. It costs about 67 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'This Pinot Noir displays abundant and intense aromas of ripe black fruits, including cherry, plum and raspberry, in a complex and concentrated nose. Smooth and richly textured, the wine offers great depth of black cherry, berry and cola flavors with notes of mineral and spice on a bright and long-lasting finish.', u'title': u'The Donum Estate Russian River Valley Pinot Noir', u'price': u'$66.99', u'id': 433784, u'link': u'https://www.wine.com/product/the-donum-estate-russian-river-valley-pinot-noir-2009/121584', u'imageUrl': u'https://spoonacular.com/productImages/433784-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Preheat oven to 350F. Cook ground beef in a large nonstick skillet over medium heat until meat crumbles and is no longer pink; drain. Add 1 cup salsa, spinach, 112 tsp cumin, and salt. Cook, stirring occasionally, 2 to 3 minutes or until most of liquid has evaporated and spinach wilts. Add cream cheese, and stir until blended. Remove from heat. Spoon meat mixture evenly onto tortillas. Roll up, and place, seam sides down, in a 13- x 9-inch baking dish coated with cooking spray. Stir together diced tomatoes and remaining 1 cup salsa and 12 tsp cumin; pour over enchiladas. Bake 20 minutes. Top with cheese, and bake 5 minutes longer or until cheese melts.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-beef-spinach-enchiladas-719382', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}