{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/853244-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 853244, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oaxacan Rusty Nail', u'diets': [u'dairy free'], u'preparationMinutes': 2, u'pricePerServing': 358.69, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'3/4 ounce Drambuie', u'aisle': u'Alcoholic Beverages', u'name': u'drambuie', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-liqueur.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.75, u'consistency': u'solid', u'id': 99187, u'unit': u'ounce'}, {u'originalString': u'ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'serving'}, {u'originalString': u'optional: 1 slice jalape\xf1o*', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u'slice'}, {u'originalString': u'1 1/2 ounces mezcal (or tequila)', u'aisle': u'Alcoholic Beverages', u'name': u'mezcal', u'metaInformation': [u'(or tequila)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 11014037, u'unit': u'ounces'}, {u'originalString': u'3 dashes orange bitters', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 9200, u'unit': u'dashes'}, {u'originalString': u'1 orange peel', u'aisle': u'Produce', u'name': u'orange peel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.gimmesomeoven.com/oaxacan-rusty-nail/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Add mezcal, Drambuie, orange bitters, and jalapeo slice (if using) to a cocktail shaker. Use a muddler or a spoon to slightly muddle thejalapeo.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-liqueur.png', u'id': 99187, u'name': u'drambuie'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 11014037, u'name': u'mezcal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}]}, {u'equipment': [], u'step': u'Add a handful of ice to the cocktail shaker, and stir or shake vigorously for 20 seconds or until the mixture is completely chilled.Run the orange peel around the rim of the glass. Then give it a twist to express the oils, and place it in the glass. Strain the chilled cocktail mixture on top of the orange peel.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 61, u'instructions': u'Add mezcal, Drambuie, orange bitters, and jalapeo slice (if using) to a cocktail shaker. Use a muddler or a spoon to slightly muddle thejalapeo.Add a handful of ice to the cocktail shaker, and stir or shake vigorously for 20 seconds or until the mixture is completely chilled.Run the orange peel around the rim of the glass. Then give it a twist to express the oils, and place it in the glass. Strain the chilled cocktail mixture on top of the orange peel.Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/oaxacan-rusty-nail-853244', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}