{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/511035-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 511035, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Caesar Salad #SundaySupper', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 114.28, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'1/2 loaf sourdough baguette, stale if possible', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'stale'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'loafs', u'unitShort': u'loaf', u'amount': 0.5, u'consistency': u'solid', u'id': 18033, u'unit': u'loaf'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'16 oz chicken, cooked', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 5112, u'unit': u'oz'}, {u'originalString': u'1 tbsp. dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tbsp'}, {u'originalString': u"2 egg yolks Davidson's Safest Choice\xae Eggs", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'safest choice\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 clove garlic, smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1 1/2 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup Parmesan cheese, plus extra for garnish', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'12 cups romaine lettuce, chopped', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'2 tbsp. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2014/06/01/chicken-caesar-salad-sundaysupper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, add garlic, egg yolks, dijon mustard, lemon juice, and water. Process for 30 seconds and pour in the olive oil until smooth. Stir in Parmesan cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Cut baguette in half, brush with olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place on a grill over medium, low heat and cook each side for 2 minutes. Take off the grill and cut into bite size pieces.Evenly divide about 2 cups of romaine lettuce over 6 plates. Evenly divide the chicken over the lettuce.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}]}, {u'equipment': [], u'step': u'Add croutons over the lettuce and chicken and top with dressing and additional Parmesan cheese, if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u'Place in the refrigerator until ready to use.To make grilled croutons'}], u'aggregateLikes': 107, u'instructions': u'In a blender, add garlic, egg yolks, dijon mustard, lemon juice, and water. Process for 30 seconds and pour in the olive oil until smooth. Stir in Parmesan cheese. Place in the refrigerator until ready to use.To make grilled croutons: Cut baguette in half, brush with olive oil. Place on a grill over medium, low heat and cook each side for 2 minutes. Take off the grill and cut into bite size pieces.Evenly divide about 2 cups of romaine lettuce over 6 plates. Evenly divide the chicken over the lettuce. Add croutons over the lettuce and chicken and top with dressing and additional Parmesan cheese, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-caesar-salad-sundaysupper-511035', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 24, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}