{u'recipes': [{u'sourceName': u'Farm Girl Gourmet', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/556662-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 556662, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spicy Hummus & Quinoa Falafel', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 240.27, u'creditText': u'Farm Girl Gourmet', u'extendedIngredients': [{u'originalString': u'2 cups cooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'cooked quinoa', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cooked-quinoa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20137, u'unit': u'cups'}, {u'originalString': u'Feta Crumbles', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1019, u'unit': u'servings'}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 cup Supremely Spicy Sabra Hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'cup'}, {u'originalString': u'Small Pitas', u'aisle': u'Bakery/Bread', u'name': u'pitas', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 18413, u'unit': u'servings'}, {u'originalString': u'Sliced Red Onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'servings'}, {u'originalString': u'Spinach Leaves', u'aisle': u'Produce', u'name': u'spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'Leave', u'unitShort': u'Leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'Leaves'}, {u'originalString': u'Sliced Tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}, {u'originalString': u'Condiments', u'aisle': u'?', u'name': u'condiments', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'unit': u'servings'}], u'healthScore': 36.0, u'imageType': u'png', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.farmgirlgourmet.com/2013/07/hummus-quinoa-falafel.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Mix the quinoa, hummus and flour together.  Cover and chill for 1 hour.Preheat oven to 425\xba.  Line a rimmed baking sheet with parchment.Use a hinged scoop to make 12 equal sized balls.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Place on parchment lined baking sheet and press down slightly with a spatula.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake 10 minutes.Turn the oven on to broil and broil until crisp, about 3-5 minutes.  Carefully flip each falafel and broil until crisp, about 3 minutes more.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove immediately and serve with mini pita pockets, tomato, spinach, red onion, feta and your favorite condiments.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 18413, u'name': u'pita'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Hummus on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 1311, u'instructions': u'Mix the quinoa, hummus and flour together.  Cover and chill for 1 hour.Preheat oven to 425\xba.  Line a rimmed baking sheet with parchment.Use a hinged scoop to make 12 equal sized balls.  Place on parchment lined baking sheet and press down slightly with a spatula.  Bake 10 minutes.Turn the oven on to broil and broil until crisp, about 3-5 minutes.  Carefully flip each falafel and broil until crisp, about 3 minutes more.  Remove immediately and serve with mini pita pockets, tomato, spinach, red onion, feta and your favorite condiments.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-hummus-quinoa-falafel-556662', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}