{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518572-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 518572, u'veryPopular': True, u'lowFodmap': False, u'title': u"Farmer's Casserole", u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 144.41, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'2 cups diced cooked ham or Canadian bacon', u'aisle': u'Meat', u'name': u'canadian bacon', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canadian-bacon.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10130, u'unit': u'cups'}, {u'originalString': u'8 large beaten eggs (or 2 cups egg substitute)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten', u'(or 2 cups egg substitute)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 12-ounce cans (3 cups total) evaporated milk or evaporated skim milk', u'aisle': u'Baking', u'name': u'evaporated skim milk', u'metaInformation': [u'canned', u'(3 cups total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'liquid', u'id': 1097, u'unit': u'ounce'}, {u'originalString': u'1/2 cup sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'6 cups frozen shredded hash brown potatoes', u'aisle': u'Frozen', u'name': u'hash brown potatoes', u'metaInformation': [u'shredded', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11390, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups shredded Monterey Jack cheese with jalape\xf1o peppers (or shredded Cheddar cheese)', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded', u'with jalape\xf1o peppers (or  cheddar cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.recipegirl.com/2006/06/21/farmers-casserole/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Grease a 3-quart rectangular baking dish. Arrange potatoes evenly in the bottom of the dish. Sprinkle with cheese, ham, and green onion. In a large mixing bowl, combine eggs, milk, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour egg mixture over potato mixture in dish.2.  At this point, you can cover and refrigerate until ready to bake (several hours or overnight). When ready to bake, preheat oven to 350\xb0F.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake, uncovered, for 45-55 minutes or until center appears set.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for 5 minutes before serving. If baking after casserole has been chilled, you will need to increase baking time to 55 to 60 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 176358, u'instructions': u'1.  Grease a 3-quart rectangular baking dish. Arrange potatoes evenly in the bottom of the dish. Sprinkle with cheese, ham, and green onion. In a large mixing bowl, combine eggs, milk, salt and pepper. Pour egg mixture over potato mixture in dish.2.  At this point, you can cover and refrigerate until ready to bake (several hours or overnight). When ready to bake, preheat oven to 350\xb0F. Bake, uncovered, for 45-55 minutes or until center appears set. Let stand for 5 minutes before serving. If baking after casserole has been chilled, you will need to increase baking time to 55 to 60 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/farmers-casserole-518572', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}