{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/214539-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 214539, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chorizo & pepper lasagne', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 1839.34, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g pack cooking chorizo sausages, halved lengthways and sliced', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'halved', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 7019, u'unit': u'g'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'small handful basil leaves, to serve', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'handful'}, {u'originalString': u'300g dried lasagne (9 sheets)', u'aisle': u'Pasta and Rice', u'name': u'lasagne pasta', u'metaInformation': [u'dried', u'(9 sheets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 10620420, u'unit': u'g'}, {u'originalString': u'500g tub natural fromage frais', u'aisle': u'Spices and Seasonings', u'name': u'natural spices', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 2035, u'unit': u'g'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 onions, sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'500ml carton passata', u'aisle': u'Canned and Jarred', u'name': u'passata', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'solid', u'id': 10011547, u'unit': u'ml'}, {u'originalString': u'1 value pack peppers (about 4, any mix of colours), deseeded and diced', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'diced', u'deseeded', u'( 4, any mix of colours)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'100g Red Leicester, grated', u'aisle': u'Cheese', u'name': u'red leicester', u'metaInformation': [u'red', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/manchego.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93667, u'unit': u'g'}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2952682/chorizo-and-pepper-lasagne', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large, deep frying pan orwok, then cook the onions for 5-10 minsor until they start to colour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add thechorizo, peppers and some seasoning,and cook for a few mins.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [], u'step': u'Pour in thepassata with 150ml water, then coverand cook for 10 mins.Meanwhile, beat the fromage fraisand egg with the cheese, then season.Spoon a third of the tomato saucemixture into the base of a deep lasagnedish. Put 3 sheets of lasagne in a singlelayer on top, then cover with a thirdmore sauce and 3 more lasagne sheets.Cover with the remainder of the sauceand sheets, then pour the cheese sauceon top.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 40-50 mins until thetopping is set and starting to colour.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve sprinkled with basil leaves.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Montepulciano, Sangiovese, and Chianti are my top picks for Lasagne. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. You could try Buccicatino Montepulciano d. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'plum , dark chocolate , rich', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 127, u'instructions': u'Heat oven to 180C/160C fan/gas 4.Heat the oil in a large, deep frying pan orwok, then cook the onions for 5-10 minsor until they start to colour. Add thechorizo, peppers and some seasoning,and cook for a few mins. Pour in thepassata with 150ml water, then coverand cook for 10 mins.Meanwhile, beat the fromage fraisand egg with the cheese, then season.Spoon a third of the tomato saucemixture into the base of a deep lasagnedish. Put 3 sheets of lasagne in a singlelayer on top, then cover with a thirdmore sauce and 3 more lasagne sheets.Cover with the remainder of the sauceand sheets, then pour the cheese sauceon top. Bake for 40-50 mins until thetopping is set and starting to colour.Serve sprinkled with basil leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/chorizo-pepper-lasagne-214539', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}