{u'recipes': [{u'sourceName': u'Veg Recipes of India', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/487280-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 487280, u'veryPopular': False, u'lowFodmap': False, u'title': u'strawberry almond milkshake', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 139.75, u'creditText': u'Veg Recipes of India', u'extendedIngredients': [{u'originalString': u'powdered jaggery or organic cane sugar as required', u'aisle': u'Baking', u'name': u'cane sugar', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'2 \xbd cups almond milk or regular milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'200-250 g strawberry, hulled and chopped', u'aisle': u'Produce', u'name': u'strawberry', u'metaInformation': [u'hulled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 9316, u'unit': u'g'}, {u'originalString': u'2 scoops vanilla or any ice cream', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u'or any ice cream'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'scoops', u'unitShort': u'scoops', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'scoops'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.vegrecipesofindia.com/strawberry-almond-milkshake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'except the ice cream pour all the ingredients in a blender.blend till smooth.pour in tall glasses.gently place a scoop of the ice cream in the milkshake.garnish the milkshake with some chopped strawberries or dry fruits.serve strawberry almond milkshake immediately.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Milkshake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 200, u'instructions': u'except the ice cream pour all the ingredients in a blender.blend till smooth.pour in tall glasses.gently place a scoop of the ice cream in the milkshake.garnish the milkshake with some chopped strawberries or dry fruits.serve strawberry almond milkshake immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-almond-milkshake-487280', u'dishTypes': [u'dessert', u'beverage', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}