{u'recipes': [{u'sourceName': u'Spoonful of Flavor', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/521411-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 521411, u'veryPopular': False, u'lowFodmap': False, u'title': u'German Chocolate Cake', u'diets': [], u'pricePerServing': 222.47, u'creditText': u'Spoonful of Flavor', u'extendedIngredients': [{u'originalString': u'1 tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 cup buttermilk, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 tbsp. light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. dark rum', u'aisle': u'Alcoholic Beverages', u'name': u'dark rum', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'tbsp'}, {u'originalString': u'3 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'4 large eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 cup pecans, toasted and finely chopped', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'toasted', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'8 oz. bittersweet or semisweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'1 1/2 cups sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'16 tbsp. (2 sticks) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 16.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'2 oz. unsweetened chocolate, chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'oz'}, {u'originalString': u'1 1/3 cups unsweetened coconut, toasted', u'aisle': u'Baking', u'name': u'unsweetened coconut', u'metaInformation': [u'unsweetened', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 12108, u'unit': u'cups'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'6 tbsp. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.spoonfulofflavor.com/2013/11/13/german-chocolate-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 48, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'To make the cake, preheat the oven to 350 degrees F. Grease the edges of two 9-inch round cake pans. Dust with flour and tap out the excess. Line the bottom of each pan with a circle of parchment paper. Melt the chopped chocolate with the water in a heatproof bowl set over a pot of simmering water. Stir until smooth, then set aside until it cools to room temperature.In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and 1 1/4 cup of the sugar until light and fluffy, about 5 minutes. Beat in the melted chocolate.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the egg yolks, one at a time.In a medium bowl, stir together the flour, baking powder, baking soda and salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in half of the dry ingredients into the creamed butter mixture beating on low speed until incorporated.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix in the buttermilk and the vanilla until combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in the remaining dry ingredients.In a clean dry bowl of an electric mixer fitted with the whisk attachment, beat the egg whites until the form soft, droopy peaks. Slowly add the remaining 1/4 cup of sugar and continue beating until stiff peaks form. Using a rubber spatula, fold about one-third of the egg whites into the cake batter to lighten it. Then fold in the remaining egg whites just until incorporated.Divide the batter between the prepared cake pans and bake for 45 minutes, until a toothpick inserted into the center comes out clean. Allow to cool in the pans for 10 minutes, then remove from pans and transfer to a wire rack to cool completely.While the cakes are cooling, make the filling. In a medium saucepan combine the cream, sugar, and egg yolks.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the butter, salt, toasted coconut and pecan pieces in a large bowl; set aside.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Heat the cream mixture and cook, stirring constantly until the mixture begins to thicken and coat the back of the spoon (about 170-175 degrees F on an instant read thermometer).', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour the hot custard into the pecan-coconut mixture and stir until the butter is melted. Cool completely to room temperature. It will thicken as it cools.To make the syrup, in a small saucepan, heat the sugar and water until the sugar has dissolved, stirring occasionally.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and stir in the dark rum.To make the icing, place the chopped chocolate in a bowl with the corn syrup and butter.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'dark rum'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the cream in a small saucepan over medium heat until it just begins to boil.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Remove from heat and pour over the chocolate.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bread-knife.jpg', u'id': 404773, u'name': u'bread knife'}], u'step': u'Let stand one minute, then stir until smooth. Chill thoroughly in the refrigerator until firm enough for icing the cake.To assemble the cake, cut both cake layers in half horizontally, using a serrate bread knife. Set the first cake layer on a cake plate.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Brush well with syrup.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 3/4 cup of the coconut filling over the cake layer, making sure to reach the edges. Set another cake layer on top. Repeat, using the syrup to brush each cake layer, then spreading 3/4 cup of the coconut filling over each layer, including the top. Ice the sides with the chocolate icing. Pipe a decorative border of the chocolate icing around the top, encircling the coconut topping.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 67, u'instructions': u'To make the cake, preheat the oven to 350 degrees F. Grease the edges of two 9-inch round cake pans. Dust with flour and tap out the excess. Line the bottom of each pan with a circle of parchment paper. Melt the chopped chocolate with the water in a heatproof bowl set over a pot of simmering water. Stir until smooth, then set aside until it cools to room temperature.In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and 1 1/4 cup of the sugar until light and fluffy, about 5 minutes. Beat in the melted chocolate. Add the egg yolks, one at a time.In a medium bowl, stir together the flour, baking powder, baking soda and salt. Mix in half of the dry ingredients into the creamed butter mixture beating on low speed until incorporated. Mix in the buttermilk and the vanilla until combined. Mix in the remaining dry ingredients.In a clean dry bowl of an electric mixer fitted with the whisk attachment, beat the egg whites until the form soft, droopy peaks. Slowly add the remaining 1/4 cup of sugar and continue beating until stiff peaks form. Using a rubber spatula, fold about one-third of the egg whites into the cake batter to lighten it. Then fold in the remaining egg whites just until incorporated.Divide the batter between the prepared cake pans and bake for 45 minutes, until a toothpick inserted into the center comes out clean. Allow to cool in the pans for 10 minutes, then remove from pans and transfer to a wire rack to cool completely.While the cakes are cooling, make the filling. In a medium saucepan combine the cream, sugar, and egg yolks. Put the butter, salt, toasted coconut and pecan pieces in a large bowl; set aside. Heat the cream mixture and cook, stirring constantly until the mixture begins to thicken and coat the back of the spoon (about 170-175 degrees F on an instant read thermometer). Pour the hot custard into the pecan-coconut mixture and stir until the butter is melted. Cool completely to room temperature. It will thicken as it cools.To make the syrup, in a small saucepan, heat the sugar and water until the sugar has dissolved, stirring occasionally. Remove from heat and stir in the dark rum.To make the icing, place the chopped chocolate in a bowl with the corn syrup and butter. Heat the cream in a small saucepan over medium heat until it just begins to boil. Remove from heat and pour over the chocolate. Let stand one minute, then stir until smooth. Chill thoroughly in the refrigerator until firm enough for icing the cake.To assemble the cake, cut both cake layers in half horizontally, using a serrate bread knife. Set the first cake layer on a cake plate. Brush well with syrup. Spread 3/4 cup of the coconut filling over the cake layer, making sure to reach the edges. Set another cake layer on top. Repeat, using the syrup to brush each cake layer, then spreading 3/4 cup of the coconut filling over each layer, including the top. Ice the sides with the chocolate icing. Pipe a decorative border of the chocolate icing around the top, encircling the coconut topping.', u'spoonacularSourceUrl': u'https://spoonacular.com/german-chocolate-cake-521411', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}