{u'recipes': [{u'sourceName': u'Recipes Food and Cooking', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/608319-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 608319, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blueberry Cobbler Ice Cream', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 135.82, u'creditText': u'Recipes Food and Cooking', u'extendedIngredients': [{u'originalString': u'1 can blueberry pie filling', u'aisle': u'Baking', u'name': u'blueberry pie filling', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberry-pie-filling.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 44158, u'unit': u'can'}, {u'originalString': u'1 can condensed milk', u'aisle': u'Baking', u'name': u'condensed milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 1095, u'unit': u'can'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 cup old fashioned oats', u'aisle': u'Cereal', u'name': u'old fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'dash of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dash'}, {u'originalString': u'Cobbler topping', u'aisle': u'Meat', u'name': u'bacon topping', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10862, u'unit': u'servings'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://recipesfoodandcooking.com/2014/08/03/blueberry-cobbler-ice-cream/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add all of the ingredients to a mixing bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together to combine. If not using a ice cream maker pour into a freezer container. Freeze for at least 4 hours or overnight.If using a ice cream maker, refrigerate mixture covered for 2 hours.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into ice cream maker and freeze according to manufactures directions.Toast oatmeal in a 350 degree oven for 7 - 10 minutes.Put sugar into a small saut\xe9 pan over medium heat.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let sugar melt and swirl pan until sugar reaches a caramel color.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour over oatmeal. Stir with a spoon until oatmeal is coated.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool and break into pieces. Keep in an airtight container.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 107, u'instructions': u'Add all of the ingredients to a mixing bowl. Whisk together to combine. If not using a ice cream maker pour into a freezer container. Freeze for at least 4 hours or overnight.If using a ice cream maker, refrigerate mixture covered for 2 hours. Pour into ice cream maker and freeze according to manufactures directions.Toast oatmeal in a 350 degree oven for 7 - 10 minutes.Put sugar into a small saut\xe9 pan over medium heat. Let sugar melt and swirl pan until sugar reaches a caramel color. Pour over oatmeal. Stir with a spoon until oatmeal is coated. Let cool and break into pieces. Keep in an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-cobbler-ice-cream-608319', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}