{u'recipes': [{u'sourceName': u'Love & Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619238-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619238, u'veryPopular': False, u'lowFodmap': False, u'title': u'spaghetti squash w/ chickpeas & kale', u'diets': [u'gluten free'], u'pricePerServing': 471.23, u'creditText': u'Love & Lemons', u'extendedIngredients': [{u'originalString': u'1/2 cup chickpeas, drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16057, u'unit': u'cup'}, {u'originalString': u'pinch of chile flakes', u'aisle': u'Spices and Seasonings', u'name': u'chile flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'1/2 tablespoon minced fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'1 clove garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'juice of 1/2 a lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 (packed) cups of chopped kale leaves', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'packed', u'chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'1-2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'optional: a bit of freshly grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1/4 cup toasted pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 shallot, sliced thinly', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 spaghetti squash', u'aisle': u'Produce', u'name': u'spaghetti squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11492, u'unit': u''}, {u'originalString': u'1/4 cup chopped sun dried tomatoes (or capers or olives)', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun dried tomatoes', u'metaInformation': [u'dried', u'chopped', u'(or capers or olives)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11955, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.loveandlemons.com/2014/10/29/roasted-spaghetti-squash-w-chickpeas-kale/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F.Slice your squash in half lengthwise. Scoop out the seeds and pulp from the middle.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the squash on a baking sheet, cut side up.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with olive oil and sprinkle with salt and pepper. Roast for about 1 hour or until the flesh is tender and you can scrape noodle-like strands with a fork. (If your squash is difficult to cut, roast it whole for the first 20 minutes until it softens a bit, then cut and continue).', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove squash from the oven, let it cool slightly and use a fork to scrape the squash into strands. (set aside).In a large skillet over medium heat, add enough olive oil to lightly coat the pan, then add the shallot, garlic, rosemary, chile flakes, salt and pepper. (I added my garlic clove whole and removed it later). Once the shallot starts to soften, add the chickpeas and cook for a few minutes until they turn lightly golden brown.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the garlic clove, and add the kale leaves, lemon juice, and then give everything in the pan a good stir. Once the kale is partially wilted, add the squash strands, a little grated cheese, sun dried tomatoes,  and more salt and pepper, to taste. Toss to incorporate.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Remove from heat and top with toasted pine nuts and extra grated cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 214, u'instructions': u'Preheat oven to 375 degrees F.Slice your squash in half lengthwise. Scoop out the seeds and pulp from the middle. Place the squash on a baking sheet, cut side up. Drizzle with olive oil and sprinkle with salt and pepper. Roast for about 1 hour or until the flesh is tender and you can scrape noodle-like strands with a fork. (If your squash is difficult to cut, roast it whole for the first 20 minutes until it softens a bit, then cut and continue).Remove squash from the oven, let it cool slightly and use a fork to scrape the squash into strands. (set aside).In a large skillet over medium heat, add enough olive oil to lightly coat the pan, then add the shallot, garlic, rosemary, chile flakes, salt and pepper. (I added my garlic clove whole and removed it later). Once the shallot starts to soften, add the chickpeas and cook for a few minutes until they turn lightly golden brown. Remove the garlic clove, and add the kale leaves, lemon juice, and then give everything in the pan a good stir. Once the kale is partially wilted, add the squash strands, a little grated cheese, sun dried tomatoes,  and more salt and pepper, to taste. Toss to incorporate. Remove from heat and top with toasted pine nuts and extra grated cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-squash-w-chickpeas-kale-619238', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}