{u'recipes': [{u'sourceName': u'Eat Drink Love', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/674562-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 674562, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Chocolate Mousse', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 330.77, u'creditText': u'Eat Drink Love', u'extendedIngredients': [{u'originalString': u'2/3 cup agave (can also use stevia, granulated sugar, or powdered sugar)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave', u'metaInformation': [u'(can also use stevia, granulated sugar, or powdered sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'4 very ripe avocados, peeled and pitted', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'pitted', u'very ripe', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/3 cup milk (any will do)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(any will do)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'fresh raspberries or strawberries (for garnish)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'(for garnish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9302, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://eat-drink-love.com/2015/08/easy-chocolate-mousse/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Prepare a double boiler by placing a heat-safe bowl over a saucepan filled halfway with water. Bring the water to a light boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in the chocolate chips and continue stirring until completely melted.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the bowl from the pan and let the chocolate cool for a minute.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add all of the remaining ingredients to a blender or food processor.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour in the melted chocolate. Cover and blend until completely smooth and creamy. Spoon the mousse into serving bowls. Cover and chill for at least 4 hours.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with berries if desired. The mousse is best eaten within 48 hours.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u'Prepare a double boiler by placing a heat-safe bowl over a saucepan filled halfway with water. Bring the water to a light boil. Pour in the chocolate chips and continue stirring until completely melted. Remove the bowl from the pan and let the chocolate cool for a minute.Add all of the remaining ingredients to a blender or food processor. Pour in the melted chocolate. Cover and blend until completely smooth and creamy. Spoon the mousse into serving bowls. Cover and chill for at least 4 hours. Garnish with berries if desired. The mousse is best eaten within 48 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-chocolate-mousse-674562', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}