{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/450432-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 450432, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel Crunch', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 60.61, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 cups packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'1 cup butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'9 cups Crispix cereal', u'aisle': u'Cereal', u'name': u'cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bran-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 9.0, u'consistency': u'solid', u'id': 8029, u'unit': u'cups'}, {u'originalString': u'1/2 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'9 cups popped popcorn', u'aisle': u'Savory Snacks', u'name': u'popcorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 9.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'cups'}, {u'originalString': u'1 cup slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10012061, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/caramel-crunch', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a very large heat-proof bowl, combine the popcorn, cereal and almonds; set aside. In a large heavy-duty saucepan, melt butter; stir in corn syrup and brown sugar. Cook and stir over medium heat until mixture comes to a boil. Reduce heat to medium-low. Cook 5 minutes longer, stirring occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'id': 8029, u'name': u'cereal'}]}, {u'equipment': [], u'step': u'Remove from the heat. Stir in baking soda. (', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}]}, {u'equipment': [], u'step': u'Mixture will foam up and get lighter in color.) Carefully pour over popcorn mixture; stir to coat evenly.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to two 15-in. x 10-in. x 1-in. baking pans coated with cooking spray.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 250\xb0 for 45 minutes, stirring every 15 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Spread on waxed paper to cool. Store in airtight containers.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 46, u'instructions': u'Directions                                                                                In a very large heat-proof bowl, combine the popcorn, cereal and almonds; set aside. In a large heavy-duty saucepan, melt butter; stir in corn syrup and brown sugar. Cook and stir over medium heat until mixture comes to a boil. Reduce heat to medium-low. Cook 5 minutes longer, stirring occasionally.                                                                                            Remove from the heat. Stir in baking soda. (Mixture will foam up and get lighter in color.) Carefully pour over popcorn mixture; stir to coat evenly.                                                                                           Transfer to two 15-in. x 10-in. x 1-in. baking pans coated with cooking spray. Bake at 250\xb0 for 45 minutes, stirring every 15 minutes. Spread on waxed paper to cool. Store in airtight containers.                                        Yield: about 4-1/2 quarts.                                                                                                                         Originally published as Caramel Crunch in  Country WomanNovember/December 2003, p31                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 324 calories, 15 g fat (7 g saturated fat), 27 mg cholesterol, 312 mg sodium, 48 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-crunch-450432', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}