{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/472205-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 472205, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Bean Burrito Bowl', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 223.74, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'Ripe avocado, peeled and cut into chunks', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'ripe', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'4 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1/2 cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'Sour cream or crema fresca (skip if cooking vegan)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'crema', u'metaInformation': [u'sour', u'(skip if cooking vegan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 93772, u'unit': u'servings'}, {u'originalString': u'Chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 Tbsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'Tbsp'}, {u'originalString': u'2 teaspoons Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u"Queso fresco Mexican farmer's cheese (or Cotija cheese) (skip if cooking vegan)", u'aisle': u'Cheese', u'name': u'queso fresco cheese', u'metaInformation': [u'(or Cotija cheese)', u'(skip if cooking vegan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1228, u'unit': u'servings'}, {u'originalString': u'Sliced red cabbage', u'aisle': u'Produce', u'name': u'red cabbage', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11112, u'unit': u'servings'}, {u'originalString': u'Fresh tomato salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound dry black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'black', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16033, u'unit': u'pound'}, {u'originalString': u'4 1/2 to 6 cups of water, depending on the type of rice (read package)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(read package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'3 cups, uncooked rice, white or brown', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'white', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cups'}, {u'originalString': u"4 15-ounce cans of whole black bean (preferably S&W premium black beans, or Bush's best black beans)", u'aisle': u'Produce', u'name': u'yam bean', u'metaInformation': [u'whole', u'black', u'canned', u"(preferably S&W premium beans, or Bush's best beans)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jicama.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 60.0, u'consistency': u'solid', u'id': 11603, u'unit': u'ounce'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/black_bean_burrito_bowl/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+elise%2Fsimplyrecipes+%28Simply+Recipes%29', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Preparing dry beans1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place black beans in a large bowl or pot. Cover with 2 inches of water, let soak overnight, then drain. You can skip overnight soaking, place black beans in bowl, and cover with 2-inches of boiling water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let soak for one hour. Then drain.2\xa0', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place soaked and drained beans in a large pot. Cover with 2 inches of water. Bring to a boil, reduce to a simmer.3 While the beans are coming to a boil in step 2, heat 2 tablespoons of olive oil in a small pan on medium heat. Stir in the ground cumin and cook until fragrant, 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the minced garlic, cook a minute more. Once the beans are boiling, add the cumin and garlic to the pot with the beans.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add bay leaves and salt to the pot as well.4 Cook the beans, uncovered, until tender, but not mushy, 30 minutes to 2 hours, depending on the size and age of the beans.5 When the beans are done, place a strainer over a separate pot.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the beans into the strainer, to collect the cooking water into the pot. Set aside the beans, and boil down the cooking liquid until thickened and slightly syrupy. Return the cooking liquid to the beans and stir.Preparing canned beans1', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the beans and the liquid from the can in a sauce pan. (Taste the liquid first; if it tastes good, use it, if not, drain the beans first, and add as much liquid to the pot with the beans as you strained out.)2', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cumin and garlic powder to the beans. Bring to a simmer and simmer for a minute or two to heat the beans through. Stir in the cilantro and remove from heat.Preparing the rest1', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place 3 cups of rice in a large saucepan. Depending on the type of rice you are using (short grain, long grain, white, brown) you will add any where from 4 1/2 cup of water to 6 cups of water to the pot. Check the rice package instructions.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add 1/2 teaspoon of salt. Bring to a boil, lower the heat to low to maintain a very low simmer. Cover and cook from 15 minutes to 45 minutes, depending on the type of rice (again, check the package instructions for the rice you are using).', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and let rest for 10 minutes, covered, before fluffing with a fork to serve.2 To construct the burrito bowl, place a serving of cooked rice at the bottom of a serving bowl. Top with black beans. Top with assorted garnishes—thinly sliced cabbage, chopped avocados, chopped cilantro, queso fresco and sour cream.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'id': 1228, u'name': u'queso fresco'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The The Donum Estate Russian River Valley Pinot Noir with a 4.9 out of 5 star rating seems like a good match. It costs about 67 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'This Pinot Noir displays abundant and intense aromas of ripe black fruits, including cherry, plum and raspberry, in a complex and concentrated nose. Smooth and richly textured, the wine offers great depth of black cherry, berry and cola flavors with notes of mineral and spice on a bright and long-lasting finish. View More', u'title': u'The Donum Estate Russian River Valley Pinot Noir', u'price': u'$66.99', u'id': 433784, u'link': u'https://www.wine.com/product/the-donum-estate-russian-river-valley-pinot-noir-2009/121584', u'imageUrl': u'https://spoonacular.com/productImages/433784-312x231.jpg'}]}, u'aggregateLikes': 93, u'instructions': u'Preparing dry beans1 Place black beans in a large bowl or pot. Cover with 2 inches of water, let soak overnight, then drain. You can skip overnight soaking, place black beans in bowl, and cover with 2-inches of boiling water. Let soak for one hour. Then drain.2\xa0Place soaked and drained beans in a large pot. Cover with 2 inches of water. Bring to a boil, reduce to a simmer.3 While the beans are coming to a boil in step 2, heat 2 tablespoons of olive oil in a small pan on medium heat. Stir in the ground cumin and cook until fragrant, 1 to 2 minutes. Add the minced garlic, cook a minute more. Once the beans are boiling, add the cumin and garlic to the pot with the beans. Add bay leaves and salt to the pot as well.4 Cook the beans, uncovered, until tender, but not mushy, 30 minutes to 2 hours, depending on the size and age of the beans.5 When the beans are done, place a strainer over a separate pot. Pour the beans into the strainer, to collect the cooking water into the pot. Set aside the beans, and boil down the cooking liquid until thickened and slightly syrupy. Return the cooking liquid to the beans and stir.Preparing canned beans1 Place the beans and the liquid from the can in a sauce pan. (Taste the liquid first; if it tastes good, use it, if not, drain the beans first, and add as much liquid to the pot with the beans as you strained out.)2 Add the cumin and garlic powder to the beans. Bring to a simmer and simmer for a minute or two to heat the beans through. Stir in the cilantro and remove from heat.Preparing the rest1 Place 3 cups of rice in a large saucepan. Depending on the type of rice you are using (short grain, long grain, white, brown) you will add any where from 4 1/2 cup of water to 6 cups of water to the pot. Check the rice package instructions. Add 1/2 teaspoon of salt. Bring to a boil, lower the heat to low to maintain a very low simmer. Cover and cook from 15 minutes to 45 minutes, depending on the type of rice (again, check the package instructions for the rice you are using). Remove from heat and let rest for 10 minutes, covered, before fluffing with a fork to serve.2 To construct the burrito bowl, place a serving of cooked rice at the bottom of a serving bowl. Top with black beans. Top with assorted garnishes—thinly sliced cabbage, chopped avocados, chopped cilantro, queso fresco and sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-burrito-bowl-472205', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}