{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/535669-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 535669, u'veryPopular': True, u'lowFodmap': False, u'title': u'Breakfast Stuffed Sweet Potatoes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 270.95, u'extendedIngredients': [{u'originalString': u'1 avocado, halved, seeded, peeled and diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'peeled', u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/2 cup cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'3 large eggs, scrambled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'4 sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'3 maple sausage links', u'aisle': u'Frozen', u'name': u'veggie sausage links', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 98971, u'unit': u''}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://DAMNDELICIOUS.NET/2013/09/03/breakfast-stuffed-sweet-potatoes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place potatoes onto a baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into oven and bake for 1 hour, or until tender; let cool enough to handle.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut each potato in half horizontally, then carefully scoop out the center of the potato, reserving for another use, leaving about 1/2-inch of potato on the skin. In a medium skillet, add sausage links and cook until browned, about 2-3 minutes, making sure to crumble the beef as it cooks; drain excess fat.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add eggs, crumbled sausage, cherry tomatoes and cheese to each potato skin.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into oven and bake for an additional 5 minutes, or until the cheese has melted.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Serve immediately, topped with avocados.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 10970, u'instructions': u'Preheat oven to 400 degrees F. Place potatoes onto a baking sheet. Place into oven and bake for 1 hour, or until tender; let cool enough to handle. Cut each potato in half horizontally, then carefully scoop out the center of the potato, reserving for another use, leaving about 1/2-inch of potato on the skin. In a medium skillet, add sausage links and cook until browned, about 2-3 minutes, making sure to crumble the beef as it cooks; drain excess fat. Add eggs, crumbled sausage, cherry tomatoes and cheese to each potato skin. Place into oven and bake for an additional 5 minutes, or until the cheese has melted. Serve immediately, topped with avocados.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-stuffed-sweet-potatoes-535669', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}