{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/212578-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 212578, u'veryPopular': False, u'lowFodmap': False, u'title': u'Four-in-one pizza with dough stick dividers', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 62.03, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'400g can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'g'}, {u'originalString': u'1 large garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'large', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 garlic cloves, sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'juice \xbd small lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'4 tbsp mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tbsp'}, {u'originalString': u'1 tsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'300ml warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ml'}, {u'originalString': u'1 tbsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tbsp'}, {u'originalString': u'7g sachet fast-action dried yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 18375, u'unit': u'g'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2972679/fourinone-pizza-with-dough-stick-dividers', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the dough, mix together theyeast, sugar and flour in a bowl. Stir inthe olive oil and add the water graduallyuntil you have a soft dough that comesaway from the sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a clean,oiled bowl, cover with a tea towel andleave in a warm place to rise. To makethe tomato sauce, heat the olive oil in asaucepan and sizzle the garlic for 1 min.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the sugar, vinegar, tomatoes andoregano, and simmer everything for20 mins until you have a thick sauce.Can be made up to 3 days in advance.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6 andoil a large baking tray, about 20 x 30cm.Tear off about an eighth of the doughand roll out the rest on a lightly flouredsurface to fit the tray.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the remainingdough out into 2 snakes, the first about20cm and the other about 30cm. Layboth into the pizza dough, crossed soyou have 4 sections, and pinch theminto the dough. Now it’s up to you andyour family which toppings you choose.(I have anchovies and olives; my wifeloves a vegetarian feast; my son wantsmeat, so we pile his with mozzarellaand pepperoni; and my daughter likesham, sweetcorn & cheddar.)', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake thepizza for 20 mins, or until puffed up andgolden. Leave to cool slightly beforetransferring to a board.While the pizza bakes, make thedipping sauce.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix all the ingredientsand whisk in enough cold water until youhave a runny consistency, then season.Pull the pizza into quarters, then use thedough stick dividers to dip into the sauce.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizzan on the menu? Try pairing with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Felsina Chianti Colli Senesi with a 4.1 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u'To make the dough, mix together theyeast, sugar and flour in a bowl. Stir inthe olive oil and add the water graduallyuntil you have a soft dough that comesaway from the sides. Place in a clean,oiled bowl, cover with a tea towel andleave in a warm place to rise. To makethe tomato sauce, heat the olive oil in asaucepan and sizzle the garlic for 1 min.Add the sugar, vinegar, tomatoes andoregano, and simmer everything for20 mins until you have a thick sauce.Can be made up to 3 days in advance.Heat oven to 200C/180C fan/gas 6 andoil a large baking tray, about 20 x 30cm.Tear off about an eighth of the doughand roll out the rest on a lightly flouredsurface to fit the tray. Roll the remainingdough out into 2 snakes, the first about20cm and the other about 30cm. Layboth into the pizza dough, crossed soyou have 4 sections, and pinch theminto the dough. Now it’s up to you andyour family which toppings you choose.(I have anchovies and olives; my wifeloves a vegetarian feast; my son wantsmeat, so we pile his with mozzarellaand pepperoni; and my daughter likesham, sweetcorn & cheddar.) Bake thepizza for 20 mins, or until puffed up andgolden. Leave to cool slightly beforetransferring to a board.While the pizza bakes, make thedipping sauce. Mix all the ingredientsand whisk in enough cold water until youhave a runny consistency, then season.Pull the pizza into quarters, then use thedough stick dividers to dip into the sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/four-in-one-pizza-with-dough-stick-dividers-212578', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}