{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/550858-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 550858, u'veryPopular': False, u'lowFodmap': False, u'title': u'Paleo Pa\xeblla', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 567.57, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'150g bay scallops, patted dry', u'aisle': u'Seafood', u'name': u'bay scallops', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 15172, u'unit': u'g'}, {u'originalString': u'1 cup black olives, pitted and sliced', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'pitted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'cup'}, {u'originalString': u'1 large head cauliflower', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'1 cup chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'2 tsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'2 Italian style sausages', u'aisle': u'Meat', u'name': u'sausages', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1017063, u'unit': u''}, {u'originalString': u'2lb fresh mussels, cleaned', u'aisle': u'Seafood', u'name': u'mussels', u'metaInformation': [u'fresh', u'cleaned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 15164, u'unit': u'lb'}, {u'originalString': u'2 tbsp Old Bay Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'old bay seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1052034, u'unit': u'tbsp'}, {u'originalString': u'Olive oil, to drizzle at the moment of serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'serving'}, {u'originalString': u'2 small onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'A large handful fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'1 pinch saffron', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2037, u'unit': u'pinch'}, {u'originalString': u'Generous sprinkle of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1lb raw shrimp, patted dry (I used size 26-30)', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'raw', u'dry', u'(I used size 26-30)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'1 large skinless, boneless chicken breast, cut into bite size chunks', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless', u'large', u'cut into bite size chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'3 small tomatoes, diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://thehealthyfoodie.com/paleo-paella/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404778, u'name': u'box grater'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404631, u'name': u'grater'}], u'step': u'Use a box grater or the grater disc of your food processor to grate the cauliflower. Set aside.In a small saucepan, add the chicken stock and sausage and bring to a simmer. Cook the sausage for about 3-4 minutes then kill the heat, remove the sausage to a plate and set aside to cool.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Add the saffron to the chicken stock and set it aside to infuse for a few minutes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat some coconut oil in a large skillet over medium high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pieces of chicken, sprinkle with salt and pepper and cook until nice and golden brown on all sides.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onion and continue cooking until the onion softens and becomes translucent. Toss the chicken and onion to one side of the pan. Slice the sausage into thick slices and add them to the skillet. Cook until a lovely brown crust forms on each side of the slices.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Mix the Dijon mustard and Old Bay spices into the saffron infused chicken stock.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}]}, {u'equipment': [], u'step': u'Pour that over the sausage chicken mixture and bring up to a simmer. Lower the heat and continue cooking until the liquid has reduced by half.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Add the cauliflower rice and cook for 2-3 minutes, then throw in shrimp, bay scallops and mussels. Cover and continue cooking over low heat for about 3-5 minutes, until the shrimp turns pink and the mussels open up*. Kill the heat and let stand for about 5 minutes to allow flavors to mingle. Stir in fresh tomatoes, olives and parsley.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10111135, u'name': u'cauliflower rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 15172, u'name': u'bay scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Drizzle liberally with olive oil at the moment of serving.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 94, u'instructions': u'Use a box grater or the grater disc of your food processor to grate the cauliflower. Set aside.In a small saucepan, add the chicken stock and sausage and bring to a simmer. Cook the sausage for about 3-4 minutes then kill the heat, remove the sausage to a plate and set aside to cool. Add the saffron to the chicken stock and set it aside to infuse for a few minutes. Heat some coconut oil in a large skillet over medium high heat. Add the pieces of chicken, sprinkle with salt and pepper and cook until nice and golden brown on all sides. Add the onion and continue cooking until the onion softens and becomes translucent. Toss the chicken and onion to one side of the pan. Slice the sausage into thick slices and add them to the skillet. Cook until a lovely brown crust forms on each side of the slices.  Mix the Dijon mustard and Old Bay spices into the saffron infused chicken stock. Pour that over the sausage chicken mixture and bring up to a simmer. Lower the heat and continue cooking until the liquid has reduced by half. Add the cauliflower rice and cook for 2-3 minutes, then throw in shrimp, bay scallops and mussels. Cover and continue cooking over low heat for about 3-5 minutes, until the shrimp turns pink and the mussels open up*. Kill the heat and let stand for about 5 minutes to allow flavors to mingle. Stir in fresh tomatoes, olives and parsley. Drizzle liberally with olive oil at the moment of serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/paleo-palla-550858', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}