{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/607227-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 607227, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bananas Foster Chimichangas', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 2, u'pricePerServing': 197.12, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'3 firm bananas. sliced', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'firm', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 (10 inch) flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'10-inchs', u'unitShort': u'10-inch', u'amount': 2.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'10-inch'}, {u'originalString': u'2 tablespoons spiced rum', u'aisle': u'Alcoholic Beverages', u'name': u'spiced rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10914037, u'unit': u'tablespoons'}, {u'originalString': u'1 cup vegetable oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Bananas-Foster-Chimichangas/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet over medium heat, melt butter .  Stir in bananas and sugar, and stir until sugar is dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Pour in  rum and cook 1 to 2 minutes more.  Spoon half the banana mixture onto each flour tortilla, and roll up, tucking in the ends, like a burrito.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'id': 10218364, u'name': u'flour tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, heat the vegetable oil over medium-high heat.  Fry chimichangas until golden.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chimichanga can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Parducci Small Lot Pinot Noir New Label Wine. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Our Pinot Noir offers aromas of Juicy, ripe raspberries and strawberries. Its berry flavors are full and rich on the palate, picking up a hint of cedar in the finish. Enjoy this medium bodied red wine with grilled salmon, pork tenderloin, and fine cuts of red meat.', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 130, u'instructions': u'In a large skillet over medium heat, melt butter .  Stir in bananas and sugar, and stir until sugar is dissolved.  Pour in  rum and cook 1 to 2 minutes more.  Spoon half the banana mixture onto each flour tortilla, and roll up, tucking in the ends, like a burrito.                            In a large skillet, heat the vegetable oil over medium-high heat.  Fry chimichangas until golden.  Drain on paper towels.  Serve warm.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/bananas-foster-chimichangas-607227', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}