{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/629300-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 629300, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Fajita', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 373.74, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'sliced avocado or guacamole', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon fresh black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'pinch cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'pinch'}, {u'originalString': u'\xbd teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 medium onion, peeled and sliced into thin strips', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'peeled', u'sliced into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 red pepper, deseeded and sliced into thin strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'deseeded', u'sliced into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'servings'}, {u'originalString': u'2 pounds skinless, boneless chicken breasts, sliced into thin strips', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'sliced into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}, {u'originalString': u'sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'6-8 tortillas, warmed', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'1 green or yellow pepper, deseeded and sliced into thin strips', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'green', u'yellow', u'deseeded', u'sliced into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://addapinch.com/cooking/chicken-fajita-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place the chicken into a sealable bag.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place the peppers and onion into a separate sealable bag.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the olive oil, lemon juice, chili powder, ground cumin, cayenne pepper, salt, pepper, and garlic to a jar with a screw top or tight fitting lid. Shake until well combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour  over chicken,  over vegetables and reserve the remainder in the jar for using when cooking the chicken fajitas. Seal the bags tightly and refrigerate for one hour to overnight.When ready to cook, heat a large skillet over medium-high heat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour vegetable bag into the skillet and cook until just tender crisp, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the vegetables from the skillet to a plate and add chicken strips to the same skillet. When the chicken is cooked throughout, add vegetables back to the skillet along with the reserved marinade.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'id': 1015062, u'name': u'chicken tenders'}]}, {u'equipment': [], u'step': u'Serve with tortilla and optional garnishes.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Raymond Reserve Selection Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 797, u'instructions': u'Place the chicken into a sealable bag. Place the peppers and onion into a separate sealable bag. Add the olive oil, lemon juice, chili powder, ground cumin, cayenne pepper, salt, pepper, and garlic to a jar with a screw top or tight fitting lid. Shake until well combined. Pour  over chicken,  over vegetables and reserve the remainder in the jar for using when cooking the chicken fajitas. Seal the bags tightly and refrigerate for one hour to overnight.When ready to cook, heat a large skillet over medium-high heat. Pour vegetable bag into the skillet and cook until just tender crisp, about 5 minutes. Remove the vegetables from the skillet to a plate and add chicken strips to the same skillet. When the chicken is cooked throughout, add vegetables back to the skillet along with the reserved marinade.Serve with tortilla and optional garnishes.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-fajita-629300', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}