{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/753743-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 753743, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pork with Apple Cream Sauce', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 315.26, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup hard cider (or 1/2 cup each apple cider and white wine)', u'aisle': u'Alcoholic Beverages', u'name': u'dry cider', u'metaInformation': [u'white', u'hard', u'(or 1/2 cup each apple cider and wine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cider.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93807, u'unit': u'cup'}, {u'originalString': u'3 tablespoons chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons chopped fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'2 Granny Smith apples, thinly sliced', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'12 ounces haricots verts or green beans, trimmed', u'aisle': u'Produce', u'name': u'haricots verts', u'metaInformation': [u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11052, u'unit': u'ounces'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 boneless center-cut pork chops (1 inch thick, 6 to 7 ounces each)', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'boneless', u'(, 6 to 7 ounces each)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'1/2 cup pitted prunes, halved', u'aisle': u'Dried Fruits;Produce', u'name': u'prunes', u'metaInformation': [u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9291, u'unit': u'cup'}, {u'originalString': u'1 large shallot, finely chopped', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 21.0, u'imageType': u'jpeg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/pork-with-apple-cream-sauce.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of salted water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the haricots verts; cook until crisp-tender, 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'haricots verts'}]}, {u'equipment': [], u'step': u'Drain and toss with 1 tablespoon each butter and parsley; season with salt and pepper. Cover to keep warm.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Meanwhile, season the pork with salt and pepper and rub with the thyme.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the vegetable oil in a large skillet over medium-high heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [], u'step': u'Add the pork and cook until browned and just cooked through, 4 to 5 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer to a plate; tent with foil and let rest.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Wipe out the skillet; add the remaining 2 tablespoons butter.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shallot and cook, stirring, until softened, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the apples and cook, stirring, until lightly browned, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Add the cider and prunes; cook until reduced by half, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'id': 9291, u'name': u'prunes'}]}, {u'equipment': [], u'step': u'Add the heavy cream and cook until thickened, 3 to 5 minutes. Season with salt and pepper and stir in the remaining 2 tablespoons parsley.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve the pork with the apple cream sauce and haricots verts.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'haricots verts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Photograph by Justin Walker', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 219, u'instructions': u'Bring a large pot of salted water to a boil. Add the haricots verts; cook until crisp-tender, 4 minutes. Drain and toss with 1 tablespoon each butter and parsley; season with salt and pepper. Cover to keep warm.                          Meanwhile, season the pork with salt and pepper and rub with the thyme. Heat the vegetable oil in a large skillet over medium-high heat. Add the pork and cook until browned and just cooked through, 4 to 5 minutes per side. Transfer to a plate; tent with foil and let rest.                          Wipe out the skillet; add the remaining 2 tablespoons butter. Add the shallot and cook, stirring, until softened, about 1 minute. Add the apples and cook, stirring, until lightly browned, about 3 minutes. Add the cider and prunes; cook until reduced by half, about 3 minutes. Add the heavy cream and cook until thickened, 3 to 5 minutes. Season with salt and pepper and stir in the remaining 2 tablespoons parsley. Serve the pork with the apple cream sauce and haricots verts.                          Photograph by Justin Walker', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-with-apple-cream-sauce-753743', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}