{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551576-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 551576, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fresh Coconut Tapioca Pudding', u'diets': [u'gluten free'], u'pricePerServing': 331.85, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'Enough store-bought coconut water (or plain water) to bring your liquid to 3 cups total', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [u'plain', u'store-bought', u'(or water)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12119, u'unit': u'cups'}, {u'originalString': u'the water from a fresh coconut (learn how to easily crack open a coconut here)', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [u'fresh', u'(learn how to easily crack open a coconut here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'rack', u'unitShort': u'rack', u'amount': 1.0, u'consistency': u'solid', u'id': 12119, u'unit': u'rack'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 can full fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'can'}, {u'originalString': u'2 tablespoon ghee', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup fresh coconut meat, finely grated (you could also use unsweetened finely shredded coconut)', u'name': u'meat', u'metaInformation': [u'fresh', u'shredded', u'unsweetened', u'finely grated', u'finely', u'(you could also use coconut)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1065062, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Himalayan salt', u'aisle': u'Spices and Seasonings;Gourmet', u'name': u'pink himalayan salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/himalayan-pink-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup raw honey, melted', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/2 cup small pearl tapioca', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20068, u'unit': u'cup'}, {u'originalString': u'1 vanilla bean, seeds scraped', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'png', u'spoonacularScore': 41.0, u'sourceUrl': u'http://thehealthyfoodie.com/fresh-coconut-tapioca-pudding/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'In a large measuring cup, combine coconut milk and water from fresh coconut.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}, {u'equipment': [], u'step': u'Add enough canned coconut water or just plain water to bring your total quantity of liquid to 3 cups.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'id': 12119, u'name': u'coconut water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Transfer to a large saucepan, add tapioca, salt and scraped vanilla seeds along with the bean itself to the pot. This pod will release a lot of flavor while cooking; we'll simply fish it out at the end. Cook this over medium high heat until it starts to boil, then lower the heat to the lowest possible setting and simmer for 5 minutes, uncovered. Slowly stir in honey and continue cooking for about two minutes.  Beat eggs in a separate bowl and very slowly whisk in some of the hot tapioca, about 2 cups total, half a cup at a time, to equalize the temperature of the two mixtures and prevent the eggs from curdling.Return the egg mixture to the pan, whisking constantly. Slowly bring the mixture back to a slow simmer, stirring constantly. Reduce heat again and stir for several minutes until your tapioca reaches a nice thick pudding consistency. Throw in grated coconut and ghee and give the pudding a final stir. Cool for about 15 minutes, fish out vanilla pod and serve. This pudding is at its best served warm, but it's also delicious cold. Just keep in mind that it'll be firmer than your typical tapioca pudding because of the firm consistency of chilled coconut milk.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'id': 20068, u'name': u'tapioca'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 328, u'instructions': u"In a large measuring cup, combine coconut milk and water from fresh coconut. Add enough canned coconut water or just plain water to bring your total quantity of liquid to 3 cups. Transfer to a large saucepan, add tapioca, salt and scraped vanilla seeds along with the bean itself to the pot. This pod will release a lot of flavor while cooking; we'll simply fish it out at the end. Cook this over medium high heat until it starts to boil, then lower the heat to the lowest possible setting and simmer for 5 minutes, uncovered. Slowly stir in honey and continue cooking for about two minutes.  Beat eggs in a separate bowl and very slowly whisk in some of the hot tapioca, about 2 cups total, half a cup at a time, to equalize the temperature of the two mixtures and prevent the eggs from curdling.Return the egg mixture to the pan, whisking constantly. Slowly bring the mixture back to a slow simmer, stirring constantly. Reduce heat again and stir for several minutes until your tapioca reaches a nice thick pudding consistency. Throw in grated coconut and ghee and give the pudding a final stir. Cool for about 15 minutes, fish out vanilla pod and serve. This pudding is at its best served warm, but it's also delicious cold. Just keep in mind that it'll be firmer than your typical tapioca pudding because of the firm consistency of chilled coconut milk.", u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-coconut-tapioca-pudding-551576', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}