{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/449334-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 449334, u'veryPopular': False, u'lowFodmap': False, u'title': u'Veal Saltimbocca', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 326.62, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup white wine or chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'8 thin slices prosciutto or deli ham', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10010151, u'unit': u'slices'}, {u'originalString': u'1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 ounces fontina cheese', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1020, u'unit': u'ounces'}, {u'originalString': u'1/2 cup minced fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'16 fresh sage leaves', u'aisle': u'Produce', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'8 veal cutlets (4 ounces each)', u'aisle': u'Meat', u'name': u'veal cutlets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 17094, u'unit': u'ounces'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/veal-saltimbocca', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut cheese into 1/4-in. strips.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place a prosciutto slice, 2 sage leaves and cheese down center of each cutlet.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Roll up and secure with toothpicks.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'In a large resealable plastic bag, combine flour, salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add veal, a few rolls at a time, and shake to coat. In a large skillet, brown veal in butter and oil on all sides; remove and keep warm.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add broth and wine, stirring to loosen browned bits from pan. Return rolls to the pan; cook 8-10 minutes or until a thermometer reads 160\xb0 and sauce is thickened. Stir in parsley and lemon juice; heat through. Discard toothpicks; serve with sauce.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 24, u'instructions': u'Directions                                                                                Cut cheese into 1/4-in. strips. Place a prosciutto slice, 2 sage leaves and cheese down center of each cutlet. Roll up and secure with toothpicks.                                                                                           In a large resealable plastic bag, combine flour, salt and pepper. Add veal, a few rolls at a time, and shake to coat. In a large skillet, brown veal in butter and oil on all sides; remove and keep warm.                                                                                           Add broth and wine, stirring to loosen browned bits from pan. Return rolls to the pan; cook 8-10 minutes or until a thermometer reads 160\xb0 and sauce is thickened. Stir in parsley and lemon juice; heat through. Discard toothpicks; serve with sauce.                                        Yield: 8 servings.                                                                                                                         Originally published as Veal Saltimbocca  in  Taste of Home Christmas AnnualAnnual 2010, p44                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 348 calories, 23 g fat (9 g saturated fat), 117 mg cholesterol, 490 mg sodium, 5 g carbohydrate, trace fiber, 29 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/veal-saltimbocca-449334', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}