{u'recipes': [{u'sourceName': u'Crock Pot Ladies', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/484549-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 484549, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crock-Pot Taco Dip', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 53.15, u'creditText': u'Crock Pot Ladies', u'extendedIngredients': [{u'originalString': u'1 Can Cheese Soup', u'aisle': u'Canned and Jarred', u'name': u'cheese soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese-soup.png', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6038, u'unit': u'Can'}, {u'originalString': u'1 Can Cream Of Chicken Soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'Can'}, {u'originalString': u'1 Can Cream Of Mushroom Soup', u'aisle': u'Canned and Jarred', u'name': u'cream of mushroom soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-mushroom-soup.png', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6147, u'unit': u'Can'}, {u'originalString': u'1 Can Enchilada Sauce', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'enchilada sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'solid', u'id': 6599, u'unit': u'Can'}, {u'originalString': u'1 Lb. Hamburger , Cooked, Crumbled & Drained', u'aisle': u'Bakery/Bread', u'name': u'hamburger bun', u'metaInformation': [u'crumbled', u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'Lb', u'unitShort': u'Lb', u'amount': 1.0, u'consistency': u'solid', u'id': 18350, u'unit': u'Lb'}, {u'originalString': u'1 Package Taco Seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'Package'}], u'healthScore': 3.0, u'imageType': u'png', u'spoonacularScore': 32.0, u'sourceUrl': u'http://crockpotladies.com/crockpot-taco-dip/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Mix all ingredients together in crock pot.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Heat on high until heated through, stirring as necessary.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with chips.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Mix all ingredients together in crock pot.Heat on high until heated through, stirring as necessary.Serve with chips.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-taco-dip-484549', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}