{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/149956-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 149956, u'veryPopular': False, u'lowFodmap': False, u'title': u'Seared Scallops with Asian Lime-chile Sauce', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 88.54, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'2 tablespoons Asian fish sauce', u'aisle': u'Ethnic Foods', u'name': u'asian fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoons'}, {u'originalString': u'1 small garlic clove, chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 small fresh hot chile (2 1/2 inches long, preferably red), chopped, including seeds', u'aisle': u'Produce', u'name': u'red chile', u'metaInformation': [u'fresh', u'red', u'hot', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'16 medium sea scallops (1 pound), tough muscle removed from side of each if necessary', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pound'}, {u'originalString': u'2 tablespoons seasoned rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'seasoned rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1032053, u'unit': u'tablespoons'}, {u'originalString': u'2 1/4 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Seared-Scallops-with-Asian-Lime-chile-Sauce-105027', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Soak skewers in water 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Pound garlic, chile, and sugar to a fine paste with a mortar and pestle. Stir paste together with vinegar, fish sauce, water, and lime juice. (Alternatively, pur\xe9e sauce ingredients together in a blender.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Pat scallops dry. Thread 4 on each skewer (flat sides facing out; see photo), then brush both sides with oil (2 teaspoons total for 4 skewers). Season scallops with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush a 12-inch nonstick skillet with remaining teaspoon oil and heat over high heat until hot but not smoking. Sear scallops, turning over once, until just cooked through, about 6 minutes total.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve scallops with sauce spooned over.', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Sauce may be made 1 day ahead and chilled, covered. Bring to room temperature before serving.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Each serving about 153 calories and 4 grams fat', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Nutritional analysis provided by', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Gourmet', u'number': 4, u'ingredients': []}], u'name': u"Cooks' note"}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Attems Ramato Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif.', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u"Preparation                                                                    Soak skewers in water 30 minutes.                                                                            Pound garlic, chile, and sugar to a fine paste with a mortar and pestle. Stir paste together with vinegar, fish sauce, water, and lime juice. (Alternatively, pur\xe9e sauce ingredients together in a blender.)                                                                            Pat scallops dry. Thread 4 on each skewer (flat sides facing out; see photo), then brush both sides with oil (2 teaspoons total for 4 skewers). Season scallops with salt and pepper.                                                                            Brush a 12-inch nonstick skillet with remaining teaspoon oil and heat over high heat until hot but not smoking. Sear scallops, turning over once, until just cooked through, about 6 minutes total.                                                                            Serve scallops with sauce spooned over.                                                Cooks' note:            Sauce may be made 1 day ahead and chilled, covered. Bring to room temperature before serving.                                                          Each serving about 153 calories and 4 grams fat                            Nutritional analysis provided by                                        Gourmet", u'spoonacularSourceUrl': u'https://spoonacular.com/seared-scallops-with-asian-lime-chile-sauce-149956', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}