{u'recipes': [{u'sourceName': u'Olgas Flavor Factory', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/763343-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 763343, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet and Sour Chicken With Pineapple and Peppers', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 142.15, u'creditText': u'Olgas Flavor Factory', u'extendedIngredients': [{u'originalString': u'\xbc cup apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'\xbc cup brown sugar (or honey)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'(or honey)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 chicken breast halves, cut into \xbe - 1 inch pieces', u'aisle': u'Meat', u'name': u'chicken breast halves', u'metaInformation': [u'cut into \xbe - 1 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1045062, u'unit': u''}, {u'originalString': u'1 Tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tablespoon'}, {u'originalString': u'3 Tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tablespoons'}, {u'originalString': u'2-3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 small jalape\xf1o pepper, seeded and thinly sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'small', u'seeded', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 Tablespoons ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'Tablespoons'}, {u'originalString': u'1 large onion, cut into large chunks', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1\xbd cups fresh pineapple, cut into \xbd inch chunks', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'cut into \xbd inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9266, u'unit': u'cups'}, {u'originalString': u'\xbd cup pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9273, u'unit': u'cup'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 Tablespoon scallions (green onions), thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'thinly sliced', u'(green onions)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tablespoon'}, {u'originalString': u'2 Tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tablespoons'}, {u'originalString': u'2-4 Tablespoons soy sauce (I used 3 Tablespoons)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'(I used 3 Tablespoons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tablespoons'}, {u'originalString': u'1\xbd bell peppers (I used 1 red and \xbd yellow bell peppers), cut into 1 inch pieces', u'aisle': u'Produce', u'name': u'yellow bell peppers', u'metaInformation': [u'red', u'yellow', u'cut into 1 inch pieces', u'(I used 1 and \xbd bell peppers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.5, u'consistency': u'solid', u'id': 11951, u'unit': u''}, {u'originalString': u'3 Tablespoons high smoke point oil, divided (I used avocado oil, but you can use canola, vegetable, grapeseed, coconut oil, etc.)', u'aisle': u'?', u'name': u'high smoke point oil', u'metaInformation': [u'divided', u'canned', u'(I used avocado oil, but you can use canola, vegetable, grapeseed, coconut oil, etc.)'], u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'unit': u'Tablespoons'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.olgasflavorfactory.com/main-course/poultry/sweet-and-sour-chicken-with-pineapple-and-peppers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Prep all the ingredients ahead of time, because once you start cooking, it will go very fast. I also like serving this dish with rice, so I start the rice first, before I start making this dish, so that it's all ready to be served together.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the chicken, 2 Tablespoons oil, soy sauce and cornstarch in a medium bowl and allow it to stand for about 10 minutes, while you chop the rest of the vegetables.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all the sauce ingredients together in a large liquid measuring cup until thoroughly combined. The sauce is very adjustable. I made it according to my own taste preferences, but you can add more brown sugar if you want it sweeter, or more vinegar if you want it to have a more "sour" flavor.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat  a Tablespoon of oil in a 12 inch nonstick skillet to medium heat to medium high heat and then cook the chicken in two batches, about 2-3 minutes per side, until golden brown. Set the chicken aside.In the same skillet, add the remaining  Tablespoon of oil and add the onions, cooking for 2-4 minutes, on medium high heat, until the onions are just starting to turn golden.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the bell peppers and the jalapeo. Season with salt to taste. Cook for another 3-5 minutes, until the peppers soften.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the pineapple and cook for 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in the sauce into the skillet. Bring the sauce to a boil and then reduce to a simmer, cooking the sauce until it thickens, just 3-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken to the skillet, mixing to combine, so that the sauce coats the chicken and keep it on the heat for just a few minutes until the chicken warms through.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over rice.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with green onions.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Sweet and Sour Chicken. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. One wine you could try is Ken Forrester Old Vine Reserve Chenin Blanc. It has 4.9 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This full-bodied Chenin harmoniously balances ripe fruit with delicate oak nuances. It flaunts a rich, luscious mouthfeel, with flavors of melon and tropical fruit enhanced by complex mineral notes and hints of spice. Extended lees contact imparts an alluring honeycomb character.', u'title': u'Ken Forrester Old Vine Reserve Chenin Blanc', u'price': u'$15.99', u'id': 442201, u'link': u'https://www.wine.com/product/ken-forrester-old-vine-reserve-chenin-blanc-2010/112605', u'imageUrl': u'https://spoonacular.com/productImages/442201-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Prep all the ingredients ahead of time, because once you start cooking, it will go very fast. I also like serving this dish with rice, so I start the rice first, before I start making this dish, so that it\'s all ready to be served together.Combine the chicken, 2 Tablespoons oil, soy sauce and cornstarch in a medium bowl and allow it to stand for about 10 minutes, while you chop the rest of the vegetables.Whisk all the sauce ingredients together in a large liquid measuring cup until thoroughly combined. The sauce is very adjustable. I made it according to my own taste preferences, but you can add more brown sugar if you want it sweeter, or more vinegar if you want it to have a more "sour" flavor.Heat  a Tablespoon of oil in a 12 inch nonstick skillet to medium heat to medium high heat and then cook the chicken in two batches, about 2-3 minutes per side, until golden brown. Set the chicken aside.In the same skillet, add the remaining  Tablespoon of oil and add the onions, cooking for 2-4 minutes, on medium high heat, until the onions are just starting to turn golden.Add the bell peppers and the jalapeo. Season with salt to taste. Cook for another 3-5 minutes, until the peppers soften.Add the pineapple and cook for 2-3 minutes.Pour in the sauce into the skillet. Bring the sauce to a boil and then reduce to a simmer, cooking the sauce until it thickens, just 3-5 minutes.Add the chicken to the skillet, mixing to combine, so that the sauce coats the chicken and keep it on the heat for just a few minutes until the chicken warms through. Serve over rice. Garnish with green onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-sour-chicken-with-pineapple-and-peppers-763343', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}