{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536709-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 536709, u'veryPopular': False, u'lowFodmap': False, u'title': u'Summer Phyllo Tart', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 326.23, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'20 thin asparagus stalks', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'3-4 ounces blue cheese, crumbled', u'aisle': u'Cheese', u'name': u'blue cheese', u'metaInformation': [u'blue', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1004, u'unit': u'ounces'}, {u'originalString': u'2 ears sweet corn', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'15-20 grape tomatoes, halved', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 10111529, u'unit': u''}, {u'originalString': u'1 roll phyllo dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18338, u'unit': u''}, {u'originalString': u'1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup unsalted butter, melted (or olive oil)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'(or olive oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.macheesmo.com/2012/06/summer-phyllo-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u"Remove and unroll the dough, being careful to not break up the thin layers. When not working with a layer, keep the stack covered with a damp paper towel so they don't dry out.2) Melt butter in a small dish.3)", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add one layer of dough to a baking sheet and brush lightly with butter. No need to cover the whole sheet, just do some strokes in each direction.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add another layer on top and brush again. Repeat until you have a stack of phyllo dough 12-14 layers thick.4)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}]}, {u'equipment': [], u'step': u'Brush top layer with butter or olive oil.5) Top phyllo stack with trimmed and washed asparagus stalks. The thin stalks work better for this recipe.6)', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Add corn kernels and halved grape tomatoes to the tart also. Then top with blue cheese and season with red pepper flakes, salt, and pepper.7)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10111529, u'name': u'grape tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'id': 1004, u'name': u'blue cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Bake the dish at 350 degrees for 25-30 minutes until it's very crispy around the edges.8) Slice and serve!", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 92, u'instructions': u"Directions1) Thaw phyllo dough slowly in the fridge. Remove and unroll the dough, being careful to not break up the thin layers. When not working with a layer, keep the stack covered with a damp paper towel so they don't dry out.2) Melt butter in a small dish.3) Add one layer of dough to a baking sheet and brush lightly with butter. No need to cover the whole sheet, just do some strokes in each direction. Add another layer on top and brush again. Repeat until you have a stack of phyllo dough 12-14 layers thick.4) Brush top layer with butter or olive oil.5) Top phyllo stack with trimmed and washed asparagus stalks. The thin stalks work better for this recipe.6) Add corn kernels and halved grape tomatoes to the tart also. Then top with blue cheese and season with red pepper flakes, salt, and pepper.7) Bake the dish at 350 degrees for 25-30 minutes until it's very crispy around the edges.8) Slice and serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/summer-phyllo-tart-536709', u'dishTypes': [], u'occasions': [u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}