{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537406-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 537406, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Peach Stuff(ing)', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 243.61, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'2 Tablespoons bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'Tablespoons'}, {u'originalString': u'2 cups breadcrumbs (approx.)', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'(approx.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cups'}, {u'originalString': u'2 Tablespoons chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'Tablespoons'}, {u'originalString': u'1 Tablespoon fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'Tablespoon'}, {u'originalString': u'2 Tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'Tablespoons'}, {u'originalString': u'1 ripe peach, diced', u'aisle': u'Produce', u'name': u'peach', u'metaInformation': [u'diced', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1 3-pound pork tenderloin or 2 1.5 lb tenderloins', u'aisle': u'Meat', u'name': u'pork tenderloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 10218, u'unit': u'pound'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.macheesmo.com/2011/08/peach-stuffed-pork-tenderloin/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Add filling to tenderloin in a small layer and sprinkle with salt and pepper. Leave about 1/2 inch of room around the outside of the tenderloin.5)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Roll the tenderloin up and secure it with kitchen twine.6) Grill the tenderloin over medium-high heat until it registers 135-140 degrees in the center. This should be around 16 minutes total. Use a meat thermometer to check the temperature occasionally.7) Cover the tenderloin with foil and let it rest for 10 minutes.8) Slice up the tenderloin into 1/2 inch coins and serve!', u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14, u'instructions': u"Directions1) If you're making your own bread crumbs, toast bread in a 300 degree oven for about 20 minutes until very dry. Then crumble.2) Stir other filling ingredients together and set aside until needed.3) Slice tenderloin down the center (but not all the way through), then use a sharp knife to carve it open until it lays flat. Once it's mostly flat, cover it with plastic wrap and pound it out to an even thickness.4) Add filling to tenderloin in a small layer and sprinkle with salt and pepper. Leave about 1/2 inch of room around the outside of the tenderloin.5) Roll the tenderloin up and secure it with kitchen twine.6) Grill the tenderloin over medium-high heat until it registers 135-140 degrees in the center. This should be around 16 minutes total. Use a meat thermometer to check the temperature occasionally.7) Cover the tenderloin with foil and let it rest for 10 minutes.8) Slice up the tenderloin into 1/2 inch coins and serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/the-peach-stuffing-537406', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}