{u'recipes': [{u'sourceName': u'Eat at Home Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/504589-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 504589, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Beans for the Freezer aka Refried Beans without the Refry', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 40.62, u'creditText': u'Eat at Home Cooks', u'extendedIngredients': [{u'originalString': u'1 Tbs. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Tbs'}, {u'originalString': u'1 1/2 tsp. cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'10 big cloves garlic, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 jalepeno, seeds removed and diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalepeno', u'metaInformation': [u'diced', u'seeds removed and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 Tbs. Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'Tbs'}, {u'originalString': u'2 onions, diced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 lb. dry pinto beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'pinto beans', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16043, u'unit': u'lb'}, {u'originalString': u'1 lb. dry black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'black', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16033, u'unit': u'lb'}, {u'originalString': u'9-11 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 9.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://eatathomecooks.com/2012/05/slow-cooker-beans-for-the-freezer-aka-refried-beans-without-the-refry.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Sort and rinse beans.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place in slow cooker.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add remaining ingredients to slow cooker.Cook on high 5-6 hours or low 7-8 hours.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drain.Mash or keep them whole.Can be frozen for later use.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1529, u'instructions': u'Sort and rinse beans. Place in slow cooker.Add remaining ingredients to slow cooker.Cook on high 5-6 hours or low 7-8 hours.Drain.Mash or keep them whole.Can be frozen for later use.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-beans-for-the-freezer-aka-refried-beans-without-the-refry-504589', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}