{u'recipes': [{u'sourceName': u"Annie's Eats", u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/631695-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631695, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tiramisu Cupcakes', u'diets': [], u'pricePerServing': 45.12, u'creditText': u"Annie's Eats", u'extendedIngredients': [{u'originalString': u'1\xbc tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1\xbe cups plus 2 tbsp. cake flour, sifted', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'\xbe tsp. coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u"\xbe cup confectioners' sugar, sifted", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'5 large whole eggs plus 4 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'whole', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1\xbd cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'3 tbsp. Kahlua', u'aisle': u'Alcoholic Beverages', u'name': u'kahlua', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coffee-liqueur.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93716, u'unit': u'tbsp'}, {u'originalString': u'12 oz. mascarpone cheese, at room temperature', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 93820, u'unit': u'oz'}, {u'originalString': u'6 tbsp. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'\xbd cup freshly brewed very strong coffee (or espresso)', u'aisle': u'Tea and Coffee', u'name': u'strong coffee', u'metaInformation': [u'brewed', u'(or espresso)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'6 tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'6 tbsp. unsalted butter, at room temperature, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into pieces', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1 vanilla bean, split lengthwise', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.annies-eats.com/2012/03/02/tiramisu-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make the cupcakes, preheat the oven to 325 F. Line cupcake pans with paper liners.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the cake flour, baking powder, and salt in a medium bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10020129, u'name': u'cake flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to blend; set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the milk to a small saucepan. Scrape the seeds from the vanilla bean pod into the pan, and add the scraped pod to the pan as well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat over medium-high heat just until bubbles appear around the edge of the pan.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from the heat and whisk in the butter until melted.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the vanilla bean pod and discard (or rinse and save for another use).In the bowl of an electric mixer, combine the eggs, egg yolks, and sugar.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk lightly to blend. Set the bowl over an inch or two of simmering water and heat, whisking occasionally, until the mixture is warm and the sugar is dissolved, about 6 minutes. Return the bowl to the mixer base.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk on high speed until the mixture is pale yellow and fluffy, and able to hold a ribbon when the whisk is lifted.Gently fold the dry ingredients into the egg mixture in three additions. Stir cup of the batter into the milk mixture to thicken, then fold the milk mixture into the batter just until evenly incorporated. Divide the batter between the prepared liners, filling them about three-quarters full.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Bake, rotating the pans halfway through baking, until the cakes are set and light golden, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer pans to wire racks to cool slightly before removing from the pans.To make the soaking syrup, combine the hot coffee, Kahlua, and sugar, and stir until the sugar is dissolved.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coffee-liqueur.jpg', u'id': 93716, u'name': u'kahlua'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Place the warm cupcakes on a wire rack and place a baking sheet underneath to catch dripping liquid. Use a pastry brush to brush the soaking liquid onto the tops of the cupcakes, repeating until the syrup is used up. (This took me about four or five cycles of brushing). If necessary, poke each cupcake a few times with a wooden skewer to help the syrup soak in.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the cupcakes cool completely before frosting.To make the frosting, add the heavy cream to the bowl of a stand mixer fitted with the whisk attachment. Whip on medium-high speed until stiff peaks form.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a separate bowl and return the mixer bowl to its base. In the mixer bowl, combine the mascarpone and confectioners sugar and beat with the paddle attachment on medium-high speed until smooth and fluffy, about 2 minutes. Fold about a third of the whipped cream into the mascarpone mixture with a spatula to lighten. Gently fold in the remaining whipped cream until evenly incorporated.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Transfer the frosting to a pastry bag fitted with a plain round tip (I used Ateco # 809). Pipe a large dollop of frosting on top of each cupcake. Refrigerate until ready to serve. Just before serving, dust the cupcakes with unsweetened cocoa powder.', u'number': 16, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 680, u'instructions': u'<p>To make the cupcakes, preheat the oven to 325 F. Line cupcake pans with paper liners. Combine the cake flour, baking powder, and salt in a medium bowl. Whisk to blend; set aside. Add the milk to a small saucepan. Scrape the seeds from the vanilla bean pod into the pan, and add the scraped pod to the pan as well. Heat over medium-high heat just until bubbles appear around the edge of the pan. Remove from the heat and whisk in the butter until melted. Let stand 15 minutes. Remove the vanilla bean pod and discard (or rinse and save for another use).</p><p>In the bowl of an electric mixer, combine the eggs, egg yolks, and sugar. Whisk lightly to blend. Set the bowl over an inch or two of simmering water and heat, whisking occasionally, until the mixture is warm and the sugar is dissolved, about 6 minutes. Return the bowl to the mixer base. Whisk on high speed until the mixture is pale yellow and fluffy, and able to hold a ribbon when the whisk is lifted.</p><p>Gently fold the dry ingredients into the egg mixture in three additions. Stir cup of the batter into the milk mixture to thicken, then fold the milk mixture into the batter just until evenly incorporated. Divide the batter between the prepared liners, filling them about three-quarters full. Bake, rotating the pans halfway through baking, until the cakes are set and light golden, about 20 minutes. Transfer pans to wire racks to cool slightly before removing from the pans.</p><p>To make the soaking syrup, combine the hot coffee, Kahlua, and sugar, and stir until the sugar is dissolved. Place the warm cupcakes on a wire rack and place a baking sheet underneath to catch dripping liquid. Use a pastry brush to brush the soaking liquid onto the tops of the cupcakes, repeating until the syrup is used up. (This took me about four or five cycles of brushing). If necessary, poke each cupcake a few times with a wooden skewer to help the syrup soak in. Let the cupcakes cool completely before frosting.</p><p>To make the frosting, add the heavy cream to the bowl of a stand mixer fitted with the whisk attachment. Whip on medium-high speed until stiff peaks form. Transfer to a separate bowl and return the mixer bowl to its base. In the mixer bowl, combine the mascarpone and confectioners sugar and beat with the paddle attachment on medium-high speed until smooth and fluffy, about 2 minutes. Fold about a third of the whipped cream into the mascarpone mixture with a spatula to lighten. Gently fold in the remaining whipped cream until evenly incorporated.</p><p>Transfer the frosting to a pastry bag fitted with a plain round tip (I used Ateco # 809). Pipe a large dollop of frosting on top of each cupcake. Refrigerate until ready to serve. Just before serving, dust the cupcakes with unsweetened cocoa powder.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/tiramisu-cupcakes-631695', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 28, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}