{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/497346-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497346, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lime & Cilantro Salmon with Grilled Corn and Avocado Salsa', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 482.05, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 avocado, diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'Cilantro, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1-2 ears of white corn, husks removed', u'aisle': u'Produce', u'name': u'ears of corn', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'2 tsp fresh cilantro, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tsp'}, {u'originalString': u'1 clove of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Handful of grape tomatoes, diced', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'Handful'}, {u'originalString': u'Juice from 1/2 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Lime wedges', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1 1/2 lbs. fresh wild Sockeye salmon', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'wild', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 15076, u'unit': u'lbs'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2014/06/lime-cilantro-salmon-with-grilled-corn-and-avocado-salsa.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Heat your grill pan over medium high heat then add the corn on the cob and cook  for about 12-14 minutes, making sure to turn to evenly cook all sides.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'id': 11167, u'name': u'corn on the cob'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the grill and let cool. Once cool, cut the kernels from the ears of corn with a knife..Preheat the oven to 450 degrees. Line a baking sheet with tin foil then coat it with cooking spray.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'id': 11167, u'name': u'corn on the cob'}]}, {u'equipment': [], u'step': u'Combine the butter, minced garlic, cilantro, and juice from 1/2 a lime together then spread evenly over the top of the fish. Season with sea salt and freshly cracked pepper, to taste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place skin side down on the prepared baking sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place into the oven and bake for 10 minutes or until the salmon flakes easily with a fork - DON'T OVERCOOK!", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and slice into servings and place on plates. Season the diced tomatoes, diced avocado, and cut grilled corn with sea salt and freshly cracked pepper, to taste. Sp0on over the salmon servings and sprinkle with chopped cilantro.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Serve with lime wedges. Enjoy.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Tiamo Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u"Light straw yellow color. Fresh and rich fruity aromas of apple and pear with a hint of citrus fruit that fade into the floral bouquet. Fresh and fruity, very clean and crisp.Tiamo Pinot Grigio pairs well with a wide array of lighter cuisine, especially fish/shellfish, poultry, pastas in cream sauce and softer cheeses. It's also an ideal aperitif.", u'title': u'Tiamo Pinot Grigio', u'price': u'$8.49', u'id': 438682, u'link': u'https://www.wine.com/product/tiamo-pinot-grigio-2008/98091', u'imageUrl': u'https://spoonacular.com/productImages/438682-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u"Heat your grill pan over medium high heat then add the corn on the cob and cook  for about 12-14 minutes, making sure to turn to evenly cook all sides. Remove from the grill and let cool. Once cool, cut the kernels from the ears of corn with a knife..Preheat the oven to 450 degrees. Line a baking sheet with tin foil then coat it with cooking spray.Combine the butter, minced garlic, cilantro, and juice from 1/2 a lime together then spread evenly over the top of the fish. Season with sea salt and freshly cracked pepper, to taste. Place skin side down on the prepared baking sheet.Place into the oven and bake for 10 minutes or until the salmon flakes easily with a fork - DON'T OVERCOOK! Remove from the oven and slice into servings and place on plates. Season the diced tomatoes, diced avocado, and cut grilled corn with sea salt and freshly cracked pepper, to taste. Sp0on over the salmon servings and sprinkle with chopped cilantro. Serve with lime wedges. Enjoy.", u'spoonacularSourceUrl': u'https://spoonacular.com/lime-cilantro-salmon-with-grilled-corn-and-avocado-salsa-497346', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}