{u'recipes': [{u'sourceName': u'My Life as a Mrs', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/498222-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 498222, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato Avocado and Arugula Salad', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 181.96, u'creditText': u'My Life as a Mrs', u'extendedIngredients': [{u'originalString': u'2 avocados, pitted peeled and diced', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'diced', u'pitted', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'4 ounce bag of baby arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11959, u'unit': u'ounce'}, {u'originalString': u'balsamic reduction', u'aisle': u'Condiments', u'name': u'balsamic glaze', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 98998, u'unit': u'servings'}, {u'originalString': u'1 loaf ciabatta', u'aisle': u'Bakery/Bread', u'name': u'ciabatta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 93655, u'unit': u'loaf'}, {u'originalString': u'1 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'3-4 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 large tomato (or 2 small-medium tomatoes), chopped into bite sized pieces', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'large', u'chopped', u'(or 2 small-medium tomatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.mylifeasamrs.com/2012/02/tomato-avocado-and-arugula-salad.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Slice ciabatta bread into 1/2" slices and place in an even layer on a sheet pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'id': 93655, u'name': u'ciabatta'}]}, {u'equipment': [], u'step': u'Brush the one side with 1 tablespoon of olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the oven and broil until golden. Flip the toasts and brush the other side with another tablespoon of olive oil and place back into the oven and broil until golden.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to cool.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the baby arugula to a serving dish and top with chopped tomatoes and diced avocado (avocado dicing  tutorial here). Immediately squeeze lemon juice (1/2 - 1 whole lemon) on top of salad (prevents avocado from turning) and drizzle with 1-2 tablespoons olive oil. Season with a little salt and pepper. When ready to serve toss salad and place 1-2 of the ciabatta crisps on each individual dish and top with some of the salad mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'baby arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'id': 93655, u'name': u'ciabatta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Drizzle with a healthy amount of balsamic reduction and serve.Note: Buy a Rotisserie chicken if you want to add little protein to this salad to serve it as a main course!', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 353, u'instructions': u'Slice ciabatta bread into 1/2" slices and place in an even layer on a sheet pan. Brush the one side with 1 tablespoon of olive oil. Place in the oven and broil until golden. Flip the toasts and brush the other side with another tablespoon of olive oil and place back into the oven and broil until golden. Remove from oven and allow to cool.Add the baby arugula to a serving dish and top with chopped tomatoes and diced avocado (avocado dicing  tutorial here). Immediately squeeze lemon juice (1/2 - 1 whole lemon) on top of salad (prevents avocado from turning) and drizzle with 1-2 tablespoons olive oil. Season with a little salt and pepper. When ready to serve toss salad and place 1-2 of the ciabatta crisps on each individual dish and top with some of the salad mixture. Drizzle with a healthy amount of balsamic reduction and serve.Note: Buy a Rotisserie chicken if you want to add little protein to this salad to serve it as a main course!', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-avocado-and-arugula-salad-498222', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}