{u'recipes': [{u'sourceName': u'Blahnik Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/488923-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 488923, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baileys Mint Oreo Ice Cream', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 207.95, u'creditText': u'Blahnik Baker', u'extendedIngredients': [{u'originalString': u'3 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 \xbd cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'2 tablespoons Baileys Irish cream', u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93764, u'unit': u'tablespoons'}, {u'originalString': u'5-6 Oreo mint chocolate cookies, crushed', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1 vanilla bean, cut in half', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'1 \xbd cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://blahnikbaker.com/2014/03/baileys-mint-oreo-ice-cream/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium saucepan, combine the milk and cream. Split the vanilla bean and scrape out the seeds. Stir the seeds into the milk mixture. Over medium heat, bring the milk/cream mixture to a slow boil. Reduce heat to low and simmer for 30 minutes, stirring occasionally.In a large bowl, combine the eggs, yolks and sugar together. Using a mixer, beat the eggs until the mixture is thick, smooth and pale yellow in color, about 2 minutes on medium speed.', u'length': {u'number': 32, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove the vanilla bean pod from the milk mixture and pour out a cup of the hot milk/cream mixture. Reduce the mixer speed to low and slowly add the hot milk to the egg mixture. Be sure not to scramble your eggs, so add the milk in a slow steady stream while mixing the eggs on low speed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix until combined. Then pour the egg mixture back into the saucepan with the remaining milk/cream mixture and stir to combine. Cook, stirring constantly, over medium low heat until the mixture is thick enough to cover the back of a spoon.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl, cover and chill completely.When chilled, turn on your ice cream maker.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the chilled custard into the bowl and churn according to your manufacturer’s instruction. About 5 minutes before completion add in the crushed Oreos and keep mixing.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [], u'step': u'Add in the Baileys in the final two minutes.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer ice cream to a freezer safe bowl and freeze for about 3 hours or overnight.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are my top picks for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1909, u'instructions': u'In a medium saucepan, combine the milk and cream. Split the vanilla bean and scrape out the seeds. Stir the seeds into the milk mixture. Over medium heat, bring the milk/cream mixture to a slow boil. Reduce heat to low and simmer for 30 minutes, stirring occasionally.In a large bowl, combine the eggs, yolks and sugar together. Using a mixer, beat the eggs until the mixture is thick, smooth and pale yellow in color, about 2 minutes on medium speed.Remove the vanilla bean pod from the milk mixture and pour out a cup of the hot milk/cream mixture. Reduce the mixer speed to low and slowly add the hot milk to the egg mixture. Be sure not to scramble your eggs, so add the milk in a slow steady stream while mixing the eggs on low speed. Mix until combined. Then pour the egg mixture back into the saucepan with the remaining milk/cream mixture and stir to combine. Cook, stirring constantly, over medium low heat until the mixture is thick enough to cover the back of a spoon. Transfer to a bowl, cover and chill completely.When chilled, turn on your ice cream maker. Pour the chilled custard into the bowl and churn according to your manufacturer’s instruction. About 5 minutes before completion add in the crushed Oreos and keep mixing. Add in the Baileys in the final two minutes.Transfer ice cream to a freezer safe bowl and freeze for about 3 hours or overnight.', u'spoonacularSourceUrl': u'https://spoonacular.com/baileys-mint-oreo-ice-cream-488923', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}