{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205772-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205772, u'veryPopular': False, u'lowFodmap': True, u'title': u'The 108', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'vegan'], u'pricePerServing': 4280.03, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'10 cracked green cardamom pods', u'aisle': u'Spices and Seasonings', u'name': u'cardamom pods', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 1002006, u'unit': u''}, {u'originalString': u'3 ounces garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 93663, u'unit': u'ounces'}, {u'originalString': u'3/4 ounce cardamom infused gin', u'aisle': u'Alcoholic Beverages', u'name': u'gin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vermouth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.75, u'consistency': u'liquid', u'id': 10514037, u'unit': u'ounce'}, {u'originalString': u'1.5 ounces Old Raj Gin', u'aisle': u'Alcoholic Beverages', u'name': u'gin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vermouth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 10514037, u'unit': u'ounces'}, {u'originalString': u'750 mL gin', u'aisle': u'Alcoholic Beverages', u'name': u'gin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vermouth.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 750.0, u'consistency': u'liquid', u'id': 10514037, u'unit': u'mL'}, {u'originalString': u'1/2 ounce Lillet blanc', u'aisle': u'Alcoholic Beverages', u'name': u'lillet blanc', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 93786, u'unit': u'ounce'}, {u'originalString': u'1 ounce maple masala syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'ounce'}, {u'originalString': u'8 ounces maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'ounces'}, {u'originalString': u'24 ounces water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ounces'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/12/the-108-chai-cocktail-clockbar-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 107, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place gin and and cardamom in a large glass jar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vermouth.jpg', u'id': 10514037, u'name': u'gin'}]}, {u'equipment': [], u'step': u'Let rest for 5 days. Strain before use.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'To Make Cocktail: Fill a cocktail shaker with ice.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Add Old Raj Gin, masala syrup, cardamom infused gin, and Lillet. Shake well and strain into a coupe glass.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vermouth.jpg', u'id': 10514037, u'name': u'gin'}]}], u'name': u'To Make Cardamom Infused Gin'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place water in a small sauc pan over medium heat. Once warm, add maple syrup and garam masala. Stir until blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 93663, u'name': u'garam masala'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let cool.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}], u'name': u'To Make Masala Syrup'}], u'aggregateLikes': 111, u'instructions': u'Procedures                                                                              1                                                                            To Make Masala Syrup: Place water in a small sauc pan over medium heat. Once warm, add maple syrup and garam masala. Stir until blended. Let cool.                                                                                                                             2                                                                            To Make Cardamom Infused Gin: Place gin and and cardamom in a large glass jar. Let rest for 5 days. Strain before use.                                                                                                                             3                                                                            To Make Cocktail: Fill a cocktail shaker with ice. Add Old Raj Gin, masala syrup, cardamom infused gin, and Lillet. Shake well and strain into a coupe glass.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-108-205772', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 7200, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}