{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/225637-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 225637, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kerala prawn curry', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 448.2, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'freshly boiled basmati rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [u'boiled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10020444, u'unit': u'servings'}, {u'originalString': u'1 tsp black mustard seed', u'aisle': u'Spices and Seasonings', u'name': u'black mustard seed', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'tsp'}, {u'originalString': u'2 red chillies split, cut into quarters lengthways and seeded', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'split', u'red', u'seeded', u'cut into quarters lengthways and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'14 curry leaves, fresh or dried', u'aisle': u'Ethnic Foods', u'name': u'curry leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 14.0, u'consistency': u'solid', u'id': 93604, u'unit': u''}, {u'originalString': u'\xbd tsp fenugreek seeds', u'aisle': u'Spices and Seasonings', u'name': u'fenugreek seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fenugreek.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2019, u'unit': u'tsp'}, {u'originalString': u'chopped fresh coriander, plus a sprig or two', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'fresh', u'chopped', u'plus a sprig or two'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'2\xbd cm piece of fresh root ginger, peeled and chopped', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.5, u'consistency': u'solid', u'id': 11216, u'unit': u''}, {u'originalString': u'250g jumbo prawns, leave some with their tails on if you like', u'aisle': u'Seafood', u'name': u'jumbo prawns', u'metaInformation': [u'with their tails on if you like'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'g'}, {u'originalString': u'a tablespoon of lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'tablespoon'}, {u'originalString': u'150ml reduced-fat coconut milk', u'aisle': u'Canned and Jarred', u'name': u'low fat coconut milk', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'ml'}, {u'originalString': u'\xbd tsp cracked black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022030, u'unit': u'tsp'}, {u'originalString': u'1 small red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 tbsp vegetable or sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1326/kerala-prawn-curry', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'In a food processor, blitz the chillies, onion and ginger with 3 tbsp water into a smoothish paste – you may need to scrape it down the sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the oil in a heavy pan or wok. When hot, toss in the mustard and fenugreek seeds, and curry leaves – they’ll crackle and pop – and fry for 10 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fenugreek.jpg', u'id': 2019, u'name': u'fenugreek seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'id': 93604, u'name': u'curry leaves'}]}, {u'equipment': [], u'step': u'Add the onion paste, turn the heat down a tad and cook without colouring for about 5 minutes. Splash in some water if it starts to catch.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the turmeric and cracked peppercorns and stir the spices around for a few seconds before tipping in theprawns.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}]}, {u'equipment': [], u'step': u'Pour in the coconut milk and bring to a simmer, stirring all the time. The milk will take on a yellow colour from the turmeric. Cook for 1 minute until everything’s heated through. Squeeze over some lime, sprinkle with fresh coriander and serve with rice.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Tramin Pinot Grigio. It has 4.5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Bright yellow in color with coppery reflections and clear fruit aromas of pear, citrus, honeysuckle, tropical fruits and light spices. Firm, velvety and rich on the palate, with well-integrated acidity. A very round and satisfying wine. Recommended with fish antipasti, risotto with asparagus, omelets and pasta', u'title': u'Tramin Pinot Grigio', u'price': u'$18.29', u'id': 448227, u'link': u'https://www.wine.com/product/tramin-pinot-grigio-2009/106454', u'imageUrl': u'https://spoonacular.com/productImages/448227-312x231.jpg'}]}, u'aggregateLikes': 403, u'instructions': u'In a food processor, blitz the chillies, onion and ginger with 3 tbsp water into a smoothish paste – you may need to scrape it down the sides.Heat the oil in a heavy pan or wok. When hot, toss in the mustard and fenugreek seeds, and curry leaves – they’ll crackle and pop – and fry for 10 seconds. Add the onion paste, turn the heat down a tad and cook without colouring for about 5 minutes. Splash in some water if it starts to catch.Add the turmeric and cracked peppercorns and stir the spices around for a few seconds before tipping in theprawns. Pour in the coconut milk and bring to a simmer, stirring all the time. The milk will take on a yellow colour from the turmeric. Cook for 1 minute until everything’s heated through. Squeeze over some lime, sprinkle with fresh coriander and serve with rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/kerala-prawn-curry-225637', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}