{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/692984-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 692984, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Farro Risotto with Cauliflower', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 156.29, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 cups cauliflower florets', u'aisle': u'Produce', u'name': u'cauliflower florets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cups'}, {u'originalString': u'2 teaspoons dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoons'}, {u'originalString': u'1\xbd cup pearled farro', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'farro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020005, u'unit': u'cup'}, {u'originalString': u'Fresh minced parsley, for serving', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup shredded parmesan (see note)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'shredded', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt (see note)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 large shallot or 2 medium, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'medium', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://naturallyella.com/baked-farro-risotto-with-cauliflower/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat a small, 3 quart dutch oven over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add in olive oil followed by the minced shallots. Cook until shallots are fragrant and starting brown, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add in minced garlic and cook for one more minute.Next, stir in the salt, pepper, thyme, and farro, Stir and let farro toast for a minute. Measure in vegetable broth, bring to a simmer, cover, and place the dutch oven in the oven. Cook for 20 minutes.After 20 minutes, remove from oven and add the cauliflower to the top of the pot. Cover, return to oven, and cook for another 10 minutes until cauliflower is just starting to softened.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'id': 10020005, u'name': u'farro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven, set aside lid, and parmesan.Return the risotto to the oven, without the lid, and continue to cook for another 15 minutes or until the liquid has all been absorbed.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Serve with an extra sprinkle of parmesan and fresh parsley if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 50, u'instructions': u'Heat a small, 3 quart dutch oven over medium heat. Add in olive oil followed by the minced shallots. Cook until shallots are fragrant and starting brown, 6 to 8 minutes. Add in minced garlic and cook for one more minute.Next, stir in the salt, pepper, thyme, and farro, Stir and let farro toast for a minute. Measure in vegetable broth, bring to a simmer, cover, and place the dutch oven in the oven. Cook for 20 minutes.After 20 minutes, remove from oven and add the cauliflower to the top of the pot. Cover, return to oven, and cook for another 10 minutes until cauliflower is just starting to softened. Remove from oven, set aside lid, and parmesan.Return the risotto to the oven, without the lid, and continue to cook for another 15 minutes or until the liquid has all been absorbed. Serve with an extra sprinkle of parmesan and fresh parsley if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-farro-risotto-with-cauliflower-692984', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}