{u'recipes': [{u'sourceName': u'Fit Foodie Finds', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/796596-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 796596, u'veryPopular': False, u'lowFodmap': False, u'title': u'Meal Prep Carnitas Burrito Bowls', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 238.7, u'creditText': u'Fit Foodie Finds', u'extendedIngredients': [{u'originalString': u'\xbd tablespoon apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoon'}, {u'originalString': u'Black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 16015, u'unit': u'servings'}, {u'originalString': u'2 tablespoons chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 can yellow sweet corn', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [u'sweet', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11168, u'unit': u'can'}, {u'originalString': u'3 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup green chiles', u'aisle': u'Produce', u'name': u'green chiles', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 31015, u'unit': u'cup'}, {u'originalString': u'1/3 cup lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 tablespoons lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'Lime wedges', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1 tablespoons orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1 pound pork loin', u'aisle': u'Meat', u'name': u'pork loin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10225, u'unit': u'pound'}, {u'originalString': u'1/3 cup red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'4-8 cups Romaine', u'aisle': u'Produce', u'name': u'romaine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 teaspoons smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoons'}, {u'originalString': u'1/3 cup cojita cheese, crumbled', u'aisle': u'?', u'name': u'cojita cheese', u'metaInformation': [u'crumbled'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'png', u'spoonacularScore': 98.0, u'sourceUrl': u'http://fitfoodiefinds.com/2016/08/meal-prep-carnitas-burrito-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place pork loin and minced garlic into your crock-pot and turn to high. Cook for 2 hours. (Alternatively, turn to low and slow cook for 6-8 hours).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'id': 10225, u'name': u'pork loin'}]}, {u'equipment': [], u'step': u'Remove pork loin and shred with 2 forks.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'id': 10225, u'name': u'pork loin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place shredded pork into a large bowl and add in the rest of the carnitas ingredients and mix.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix together all ingredients in a medium size bowl.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place about 2 cups of romaine lettuce on the bottom of your bowl. Then add  of the meat (4 oz.), about  cups cilantro lime brown rice,  cup street corn, and  cup black beans.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Serve with fresh lime and more cojita!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Argyle Reserve Pinot Noir. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 46, u'instructions': u'Place pork loin and minced garlic into your crock-pot and turn to high. Cook for 2 hours. (Alternatively, turn to low and slow cook for 6-8 hours). Remove pork loin and shred with 2 forks. Place shredded pork into a large bowl and add in the rest of the carnitas ingredients and mix.Mix together all ingredients in a medium size bowl.Place about 2 cups of romaine lettuce on the bottom of your bowl. Then add  of the meat (4 oz.), about  cups cilantro lime brown rice,  cup street corn, and  cup black beans.Serve with fresh lime and more cojita!', u'spoonacularSourceUrl': u'https://spoonacular.com/meal-prep-carnitas-burrito-bowls-796596', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}