{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/447896-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 165, u'id': 447896, u'veryPopular': False, u'lowFodmap': False, u'title': u"Grandma's Pea Soup", u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 54.83, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 teaspoon bouquet garni (mixed herbs)', u'aisle': u'Produce', u'name': u'bouquet garni', u'metaInformation': [u'mixed', u'( herbs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012023, u'unit': u'teaspoon'}, {u'originalString': u'1 medium carrot, chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery ribs, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'1/2 cup chopped celery leaves', u'aisle': u'Produce', u'name': u'celery leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'1/2 pound dried green split peas', u'aisle': u'Produce', u'name': u'green peas', u'metaInformation': [u'dried', u'split', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'pound'}, {u'originalString': u'1 meaty ham bone', u'aisle': u'Meat', u'name': u'ham bone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bone-ham.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 12011111, u'unit': u''}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 pound dried whole peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'dried', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 pound Johnsonville\xae Smoked Sausage, chopped, optional', u'aisle': u'Meat', u'name': u'smoked sausage', u'metaInformation': [u'smoked', u'chopped', u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7916, u'unit': u'pound'}, {u'originalString': u'1/3 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/grandma-s-pea-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cover peas with water and soak overnight.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Drain, rinse and place in a Dutch oven.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add ham bone, water and remaining soup ingredients except sausage and dumplings. Bring to a boil. Reduce heat; cover and simmer for 2 to 2-1/2 hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bone-ham.jpg', u'id': 12011111, u'name': u'ham bone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove ham bone and skim fat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bone-ham.jpg', u'id': 12011111, u'name': u'ham bone'}]}, {u'equipment': [], u'step': u'Remove meat from bone; dice.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add ham and sausage if desired to pan.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For dumplings, place flour in a small bowl; make a depression in the center of the flour; add egg and water and stir until smooth.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Place a colander with 3/16-in.-diameter holes over simmering soup; transfer dough to the colander and press through with a wooden spoon. Cook, uncovered, for 10-15 minutes. Discard bay leaf.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 37, u'instructions': u"Directions                                                                                Cover peas with water and soak overnight. Drain, rinse and place in a Dutch oven.                                                                                            Add ham bone, water and remaining soup ingredients except sausage and dumplings. Bring to a boil. Reduce heat; cover and simmer for 2 to 2-1/2 hours.                                                                                            Remove ham bone and skim fat. Remove meat from bone; dice. Add ham and sausage if desired to pan.                                                                                            For dumplings, place flour in a small bowl; make a depression in the center of the flour; add egg and water and stir until smooth.                                                                                             Place a colander with 3/16-in.-diameter holes over simmering soup; transfer dough to the colander and press through with a wooden spoon. Cook, uncovered, for 10-15 minutes. Discard bay leaf.                                        Yield: 4 quarts.                                                                                                     IF COOKING FOR TWO:  Prepare soup without dumplings and freeze in serving-size portions to enjoy for months to come.                                                                                                Originally published as Grandma's Pea Soup in  ReminisceSpring 1991, p37                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup (calculated without sausage) equals 155 calories, 2 g fat (1 g saturated fat), 20 mg cholesterol, 171 mg sodium, 26 g carbohydrate, 6 g fiber, 9 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/grandmas-pea-soup-447896', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}