{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/359188-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 359188, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple and Brie Quesadillas', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 157.11, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 strips bacon, cooked and crumbled', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 2.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'8 ounces brie cheese, sliced (rind removed)', u'aisle': u'Cheese', u'name': u'brie cheese', u'metaInformation': [u'sliced', u'(rind removed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1006, u'unit': u'ounces'}, {u'originalString': u'4 8-inch flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'8-inch'}, {u'originalString': u'1 Granny Smith apple, thinly sliced', u'aisle': u'Produce', u'name': u'granny smith apple', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-delicious-apples.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 1029003, u'unit': u''}, {u'originalString': u'1 tablespoon maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoon'}, {u'originalString': u'4 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon whole-grain mustard', u'aisle': u'Condiments', u'name': u'whole-grain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoon'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/apple-and-brie-quesadillas-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Preheat a grill pan over medium-high heat. Toss the apple slices with 2 teaspoons olive oil and cook, turning occasionally, until marked and tender, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Lay the tortillas on a cutting board. Top each with one-quarter each of the grilled apple and brie on one side, then fold the tortillas in half to cover the filling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat the remaining 2 teaspoons olive oil in a large nonstick skillet over medium heat. Working in batches, cook the quesadillas until golden brown and the cheese melts, about 2 minutes per side. Meanwhile, mix the mustard and maple syrup in a bowl. Slice each quesadilla into wedges.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Drizzle with the maple-mustard syrup and top with the bacon.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Photograph by Kat Teutsch', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 6, u'instructions': u'Preheat a grill pan over medium-high heat. Toss the apple slices with 2 teaspoons olive oil and cook, turning occasionally, until marked and tender, 3 to 4 minutes.                          Lay the tortillas on a cutting board. Top each with one-quarter each of the grilled apple and brie on one side, then fold the tortillas in half to cover the filling.                          Heat the remaining 2 teaspoons olive oil in a large nonstick skillet over medium heat. Working in batches, cook the quesadillas until golden brown and the cheese melts, about 2 minutes per side. Meanwhile, mix the mustard and maple syrup in a bowl. Slice each quesadilla into wedges. Drizzle with the maple-mustard syrup and top with the bacon.                          Photograph by Kat Teutsch', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-and-brie-quesadillas-359188', u'dishTypes': [u'fingerfood', u'antipasti', u'lunch', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u"hor d'oeuvre", u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}