{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600939-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 600939, u'veryPopular': False, u'lowFodmap': False, u'title': u'Olive Garden Hot Artichoke Dip', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 99.03, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 14 ounce can Progresso artichoke hearts, drained and coarsely chopped', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'drained', u'coarsely chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 93828, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon dried basil (or 1 tablespoon fresh basil)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'dried', u'fresh', u'(or 1 tablespoon basil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2044, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped spinach (frozen or steamed)', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'steamed', u'chopped', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11463, u'unit': u'cup'}, {u'originalString': u'1 clove garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/4 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1 8 ounce package light cream cheese (I like the texture better, but regular is fine)', u'aisle': u'Cheese', u'name': u'light cream cheese', u'metaInformation': [u'light', u'fine', u'(I like the texture better, but regular is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounce'}, {u'originalString': u'1/4 cup mayonnaise (do not use Miracle Whip)', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [u'(do not use Miracle Whip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/4 cup grated mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'1/4 cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/4 cup romano cheese (or you can use all parmesan)', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [u'canned', u'(or you can use all parmesan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.copykat.com/2009/02/02/olive-garden-hot-artichoke-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Allow cream cheese to come to room temperature. Cream together mayonnaise, Parmesan cheese, Romano cheese, garlic, basil, and garlic salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'romano cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Mix well.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Add the artichoke hearts and spinach (be careful to drain this well) and mix until blended. Store in a container until you are ready to use. Spray a pie pan with Pam, pour in dip, and top with cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}]}, {u'equipment': [], u'step': u'Bake at 350 degrees for 25 minutes or until the top is browned.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with toasted bread.Copy', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Kat.com has plenty of other recipes that taste just like the Olive Garden.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip can be paired with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 105, u'instructions': u'Allow cream cheese to come to room temperature. Cream together mayonnaise, Parmesan cheese, Romano cheese, garlic, basil, and garlic salt. Mix well. Add the artichoke hearts and spinach (be careful to drain this well) and mix until blended. Store in a container until you are ready to use. Spray a pie pan with Pam, pour in dip, and top with cheese. Bake at 350 degrees for 25 minutes or until the top is browned. Serve with toasted bread.CopyKat.com has plenty of other recipes that taste just like the Olive Garden.', u'spoonacularSourceUrl': u'https://spoonacular.com/olive-garden-hot-artichoke-dip-600939', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}