{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619841-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619841, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ground Beef Stuffed Acorn Squash', u'diets': [u'gluten free', u'whole 30'], u'pricePerServing': 289.2, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'2 medium acorn squash', u'aisle': u'Produce', u'name': u'acorn squash', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11482, u'unit': u''}, {u'originalString': u'3 cups baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'2 tbsp sliced blanched almonds, finely ground', u'aisle': u'Nuts;Savory Snacks', u'name': u'blanched almonds', u'metaInformation': [u'sliced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blanched-almonds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12062, u'unit': u'tbsp'}, {u'originalString': u'1 celery rib, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'1 tsp garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93663, u'unit': u'tsp'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp ghee (or make your own)', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [u'(or make your own)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tbsp'}, {u'originalString': u'1/2 green bell pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'750g (1.65lb) grass-fed ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [u'grass-fed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.65, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1/2 tsp ground Ceylon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}, {u'originalString': u'1 large jalape\xf1o pepper, seeded and finely chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'large', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 medium onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp Himalayan salt', u'aisle': u'Spices and Seasonings;Gourmet', u'name': u'pink himalayan salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/himalayan-pink-salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032047, u'unit': u'tsp'}, {u'originalString': u'1/4 cup tahini paste', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12698, u'unit': u'cup'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://thehealthyfoodie.com/ground-beef-stuffed-acorn-squash/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375F', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/broiler-pan.jpg', u'id': 404698, u'name': u'broiler pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Cut the squash in half and scoop out the guts and seeds with a spoon; place them in a broiler pan and drizzle with a generous amount of extra-virgin olive oil, then sprinkle liberally with salt and pepper.Turn the squash flesh side down and bake in the oven, uncovered, for about 20 minutes, until softened and the flesh can easily be pierced with the tip of a sharp knife. While the squash is baking, melt the ghee in a skillet set over medium heat.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}]}, {u'equipment': [], u'step': u'Add the chopped onion, garlic, jalapeo pepper and green bell pepper and cook until softened and fragrant, about 3 minutes.Throw in the ground beef, salt, pepper, garam masala, cinnamon and turmeric and cook until the meat is completely browned and cooked through, about 5-6 minutes.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 93663, u'name': u'garam masala'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add tahini and water and stir until well combined. Finally, toss the spinach leaves right in and stir delicately until its completely wilted and well distributed. Kill the heat and set aside. When the squash is fully cooked, remove it from the oven and allow it to cool for a few minutes until you can safely handle it, then scoop out most of the flesh with a spoon. Youll want to leave about half an inch of flesh over the skin.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'id': 12698, u'name': u'tahini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the flesh that you just scooped out to the beef mixture and delicately mix it in. Spoon that mixture right back into the acorn squash halves, sprinkle with the ground almonds and return to the oven for about 10 minutes, then set the oven to broil to finish browning the top.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'id': 11482, u'name': u'acorn squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 72, u'instructions': u'Preheat the oven to 375FCut the squash in half and scoop out the guts and seeds with a spoon; place them in a broiler pan and drizzle with a generous amount of extra-virgin olive oil, then sprinkle liberally with salt and pepper.Turn the squash flesh side down and bake in the oven, uncovered, for about 20 minutes, until softened and the flesh can easily be pierced with the tip of a sharp knife. While the squash is baking, melt the ghee in a skillet set over medium heat. Add the chopped onion, garlic, jalapeo pepper and green bell pepper and cook until softened and fragrant, about 3 minutes.Throw in the ground beef, salt, pepper, garam masala, cinnamon and turmeric and cook until the meat is completely browned and cooked through, about 5-6 minutes.Add tahini and water and stir until well combined. Finally, toss the spinach leaves right in and stir delicately until its completely wilted and well distributed. Kill the heat and set aside. When the squash is fully cooked, remove it from the oven and allow it to cool for a few minutes until you can safely handle it, then scoop out most of the flesh with a spoon. Youll want to leave about half an inch of flesh over the skin. Add the flesh that you just scooped out to the beef mixture and delicately mix it in. Spoon that mixture right back into the acorn squash halves, sprinkle with the ground almonds and return to the oven for about 10 minutes, then set the oven to broil to finish browning the top. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/ground-beef-stuffed-acorn-squash-619841', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}