{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/513900-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 513900, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pesto Stuffed Oven Baked Pork Chops', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 189.82, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 c. panko bread crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'c'}, {u'originalString': u'4 center-cut pork chops', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://wearychef.com/pesto-stuffed-oven-baked-pork-chops/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place a wire baking rack on a baking sheet, and spray the rack with cooking spray. (Line the baking sheet with foil to make cleanup easy.)Slice slits in pork chops almost all the way through but leaving the bottom of the meat intact. The slits should be about \xbe" apart and not extend all the way to the edges of the meat. Also cut a couple shallow slits in the fat on the outer edge of the meat to keep the pork chops from curling during baking.Using a small spoon, place about \xbd tsp. pesto (or however much will fit) into each slit. Press it into the meat with your fingers.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [], u'step': u'Spread an additional teaspoon of pesto all over both sides of the meat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add eggs to a shallow bowl, sprinkle with pepper, and lightly beat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add bread crumbs to another shallow bowl. Coat both sides of each pork chop with egg, and allow excess to drip off. Press both sides of the pork chops into the bread crumbs to evenly coat the meat, and press some crumbs onto the outer edges as well. (When you are dipping meat into the egg and bread crumbs, try to squeeze the cut side together a little to keep the pesto inside.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 145.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place your prepared pork chops on the wire rack, and bake in preheated oven for 15 minutes. Turn oven to broil, and cook for another 5 minutes, or until golden brown and internal temperature reaches 145 degrees F.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Riesling are great choices for Pork Chops. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 1907, u'instructions': u'Preheat oven to 400 degrees F. Place a wire baking rack on a baking sheet, and spray the rack with cooking spray. (Line the baking sheet with foil to make cleanup easy.)Slice slits in pork chops almost all the way through but leaving the bottom of the meat intact. The slits should be about \xbe" apart and not extend all the way to the edges of the meat. Also cut a couple shallow slits in the fat on the outer edge of the meat to keep the pork chops from curling during baking.Using a small spoon, place about \xbd tsp. pesto (or however much will fit) into each slit. Press it into the meat with your fingers. Spread an additional teaspoon of pesto all over both sides of the meat.Add eggs to a shallow bowl, sprinkle with pepper, and lightly beat. Add bread crumbs to another shallow bowl. Coat both sides of each pork chop with egg, and allow excess to drip off. Press both sides of the pork chops into the bread crumbs to evenly coat the meat, and press some crumbs onto the outer edges as well. (When you are dipping meat into the egg and bread crumbs, try to squeeze the cut side together a little to keep the pesto inside.)Place your prepared pork chops on the wire rack, and bake in preheated oven for 15 minutes. Turn oven to broil, and cook for another 5 minutes, or until golden brown and internal temperature reaches 145 degrees F.', u'spoonacularSourceUrl': u'https://spoonacular.com/pesto-stuffed-oven-baked-pork-chops-513900', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}