{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/443437-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 443437, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pineapple Chicken Kabobs', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 323.16, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 package (1 pound) sliced bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'pound'}, {u'originalString': u'32 cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 32.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'4 large green peppers', u'aisle': u'Produce', u'name': u'green peppers', u'metaInformation': [u'green', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 cans (one 20 ounces, one 8 ounces) unsweetened pineapple chunks', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'unsweetened', u'(one 20 ounces, one 8 ounces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 1029354, u'unit': u'cans'}, {u'originalString': u'8 boneless skinless chicken breast halves (4 ounces each)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast halves', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 1045062, u'unit': u'ounces'}, {u'originalString': u'2 large sweet onions', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1/3 cup Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 6971, u'unit': u'cup'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pineapple-chicken-kabobs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain pineapple, reserving juice; set pineapple aside. In a small bowl, combine Worcestershire sauce and reserved juice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}]}, {u'equipment': [], u'step': u'Cut each piece of chicken into four strips.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Pour 1 cup marinade into a large resealable plastic bag; add chicken. Seal bag and turn to coat; refrigerate for at least 1 hour. Cover and refrigerate remaining marinade for basting.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook bacon over medium heat until partially cooked but not crisp.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove to paper towels to drain; cut in half widthwise.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each onion into 16 wedges; cut each pepper into eight pieces.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and discard marinade. Wrap a piece of bacon around each chicken strip.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'On 16 metal or soaked wooden skewers, alternately thread the bacon-wrapped chicken, vegetables and pineapple. Grill, uncovered, over medium heat for 6-8 minutes on each side or until meat is no longer pink, basting frequently with reserved marinade.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}], u'name': u''}], u'aggregateLikes': 92, u'instructions': u'Directions                                                                                Drain pineapple, reserving juice; set pineapple aside. In a small bowl, combine Worcestershire sauce and reserved juice. Cut each piece of chicken into four strips. Pour 1 cup marinade into a large resealable plastic bag; add chicken. Seal bag and turn to coat; refrigerate for at least 1 hour. Cover and refrigerate remaining marinade for basting.                                                                                            In a large skillet, cook bacon over medium heat until partially cooked but not crisp. Remove to paper towels to drain; cut in half widthwise. Cut each onion into 16 wedges; cut each pepper into eight pieces. Drain and discard marinade. Wrap a piece of bacon around each chicken strip.                                                                                           On 16 metal or soaked wooden skewers, alternately thread the bacon-wrapped chicken, vegetables and pineapple. Grill, uncovered, over medium heat for 6-8 minutes on each side or until meat is no longer pink, basting frequently with reserved marinade.                                        Yield: 8 servings.                                                                                                                         Originally published as Pineapple Chicken Kabobs in  Taste of HomeJune/July 2007, p33                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-chicken-kabobs-443437', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}