{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520706-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 520706, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken with mixed berries and almonds', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 406.32, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'1/4 c. of sliced almonds, toasted in an oil-free pan', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'toasted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u'c'}, {u'originalString': u"4 to 6 chicken thigh fillets, about 250 g. (remove the skin if you want to; I didn't)", u'aisle': u'Meat', u'name': u'chicken thigh', u'metaInformation': [u"(remove the skin if you want to; I didn't)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 5091, u'unit': u'fillet'}, {u'originalString': u'1 tsp. of chili flakes', u'aisle': u'Spices and Seasonings', u'name': u'chili flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'chopped parsley for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'2 to 3 tbsps. of patis (fish sauce)', u'aisle': u'Ethnic Foods', u'name': u'patis', u'metaInformation': [u'(fish sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tbsps'}, {u'originalString': u'12 to 15 pearl onions (shallots can be substituted), peeled', u'aisle': u'Produce', u'name': u'pearl onions', u'metaInformation': [u'peeled', u'canned', u'(shallots can be substituted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 10111282, u'unit': u''}, {u'originalString': u'1 tbsp. of vegetable cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}, {u'originalString': u"3/4 c. of good white wine (any white wine you'd care to drink would be good)", u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white', u'good', u"(any wine you'd care to drink would be )"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14106, u'unit': u'c'}, {u'originalString': u'1 tbsp. of chopped or finely sliced ginger', u'aisle': u'?', u'name': u'of', u'metaInformation': [u'finely sliced', u'chopped'], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://casaveneracion.com/chicken-with-mixed-berries-and-almonds/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the chicken fillets into bite-size pieces.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the cooking oil in a wok or frying pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chicken to the hot oil and cook, stirring often, until most of the pinkness have disappeared.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the ginger and chili flakes. Season with fish sauce. Cook, stirring often, until fragrant, about two minutes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}, {u'equipment': [], u'step': u'Add the dried berries and pearl onions. Stir.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10111282, u'name': u'pearl onion'}]}, {u'equipment': [], u'step': u'Pour in the white wine. Allow to boil, uncovered, for about three minutes.Lower the heat, cover and simmer for 12 to 15 minutes or until the chicken is done and the sauce has reduced and thickened.Taste the sauce.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}]}, {u'equipment': [], u'step': u'Add more fish sauce if needed.Turn off the heat.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}, {u'equipment': [], u'step': u'Add the almonds and toss a couple of times.Sprinkle with chopped parsley and serve with hot rice.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Chehalem INOX Chardonnay. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'InstructionsCut the chicken fillets into bite-size pieces.Heat the cooking oil in a wok or frying pan.Add the chicken to the hot oil and cook, stirring often, until most of the pinkness have disappeared.Add the ginger and chili flakes. Season with fish sauce. Cook, stirring often, until fragrant, about two minutes.Add the dried berries and pearl onions. Stir.Pour in the white wine. Allow to boil, uncovered, for about three minutes.Lower the heat, cover and simmer for 12 to 15 minutes or until the chicken is done and the sauce has reduced and thickened.Taste the sauce. Add more fish sauce if needed.Turn off the heat. Add the almonds and toss a couple of times.Sprinkle with chopped parsley and serve with hot rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-with-mixed-berries-and-almonds-520706', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}