{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599444-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 599444, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesecake Factory Madeira Chicken', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 558.54, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'8 Asparagus Spears', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'2 cups Beef Stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cups'}, {u'originalString': u'1 tablespoon Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2 cups Sliced, Fresh Mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon Ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 cups Madeira Wine', u'aisle': u'Alcoholic Beverages', u'name': u'madeira wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 10014106, u'unit': u'cups'}, {u'originalString': u'4 Slices Mozzarella Cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'Slices', u'unitShort': u'Slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1026, u'unit': u'Slices'}, {u'originalString': u'2 tablespoons Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'4 Boneless, Skinless Chicken Breast Fillets', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'fillet'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.copykat.com/2009/05/19/cheese-cake-factory-madeira-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Heat 1 tablespoon of olive oil in a large skillet over medium heat. Flatten the chicken breast fillets by covering each fillet with plastic wrap and using a mallet to flatten the chicken to approximately 1/4 inch thick. Season each side of the fillet with salt and pepper.2)Saut\xe9 the chicken fillets on each side until the chicken has browned a little, about 4 to 6 minutes on each side. Set chicken aside wrapped in foil to keep them warm. Keep the pan of drippings from the chicken to start the Madeira sauce.3)On Medium heat, add 2 tablespoons of oil to the skillet.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 10014106, u'name': u'madeira'}]}, {u'equipment': [], u'step': u'Add mushrooms and saut\xe9 for a couple of minutes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Add Madeira wine, beef stock, butter and pepper and bring sauce to a boil. Reduce heat and simmer for about 20 minutes or until sauce has reduced to about 1/4 of the original volume. The sauce will thicken and turn a dark brown color when it is done. Depending on the temperature of your stove, this may take a little longer.4)In a medium saucepan, fill halfway with water and bring to a boil. Season water with salt and toss asparagus into the water and boil. Keep an eye on this step, you don't want to over cook your asparagus. Depending on the thickness of your spears, this could take up to 3 to 5 minutes. When finished, drop the asparagus in a bowl of ice water to stop the cooking. The asparagus should be slightly tender when done, not mushy.5)Set your oven to broil. Arrange the cooked chicken breast fillets on a baking pan and cross 2 asparagus spears over each fillet. Top with a slice of mozzarella cheese and broil for 3 to 4 minutes or until the cheese begins to slightly brown.6)", u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 10014106, u'name': u'madeira'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Serve by arranging 2 chicken breast fillets on each plate and spoon 3 to 4 tablespoons of Madeira sauce over the chicken.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 10014106, u'name': u'madeira'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 264, u'instructions': u"1)Heat 1 tablespoon of olive oil in a large skillet over medium heat. Flatten the chicken breast fillets by covering each fillet with plastic wrap and using a mallet to flatten the chicken to approximately 1/4 inch thick. Season each side of the fillet with salt and pepper.2)Saut\xe9 the chicken fillets on each side until the chicken has browned a little, about 4 to 6 minutes on each side. Set chicken aside wrapped in foil to keep them warm. Keep the pan of drippings from the chicken to start the Madeira sauce.3)On Medium heat, add 2 tablespoons of oil to the skillet. Add mushrooms and saut\xe9 for a couple of minutes. Add Madeira wine, beef stock, butter and pepper and bring sauce to a boil. Reduce heat and simmer for about 20 minutes or until sauce has reduced to about 1/4 of the original volume. The sauce will thicken and turn a dark brown color when it is done. Depending on the temperature of your stove, this may take a little longer.4)In a medium saucepan, fill halfway with water and bring to a boil. Season water with salt and toss asparagus into the water and boil. Keep an eye on this step, you don't want to over cook your asparagus. Depending on the thickness of your spears, this could take up to 3 to 5 minutes. When finished, drop the asparagus in a bowl of ice water to stop the cooking. The asparagus should be slightly tender when done, not mushy.5)Set your oven to broil. Arrange the cooked chicken breast fillets on a baking pan and cross 2 asparagus spears over each fillet. Top with a slice of mozzarella cheese and broil for 3 to 4 minutes or until the cheese begins to slightly brown.6)Serve by arranging 2 chicken breast fillets on each plate and spoon 3 to 4 tablespoons of Madeira sauce over the chicken.", u'spoonacularSourceUrl': u'https://spoonacular.com/cheesecake-factory-madeira-chicken-599444', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}