{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/690529-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 690529, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stuffed Pork Chops', u'diets': [u'dairy free'], u'pricePerServing': 377.38, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'4-5 cups spiced apple cider (or regular apple cider with 10 cloves and 1 tablespoon allspice)', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [u'with 10 cloves and 1 tablespoon allspice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1009016, u'unit': u'cups'}, {u'originalString': u'3-4 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'Fresh sage leaves, thinly sliced', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'leaves'}, {u'originalString': u'4 boneless thick-cut pork chops', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'thick-cut', u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'4 cups leftover stuffing like this one', u'aisle': u'Bakery/Bread;Pasta and Rice', u'name': u'stuffing', u'metaInformation': [u'leftover'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 18082, u'unit': u'cups'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.foodiecrush.com/stuffed-pork-chops-plus-10-more-ways-to-use-leftover-stuffing/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the pork chops to a large freezer bag with the spiced apple cider and bay leaves and refrigerate for 1 hour or overnight.When ready to cook, preheat the oven to 425 degrees F.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'id': 1009016, u'name': u'apple cider'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [], u'step': u'Drain the pork chops and pat dry. Make a slice in the center of each pork chop to make a large pocket. If the stuffing seems dry, drizzle with chicken broth and stir to liven it up. Stuff each chop with about  cup of the leftover stuffing.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'id': 18082, u'name': u'stuffing'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large cast iron skillets over medium-high heat and add 1 tablespoon of olive oil. Gently add 2 chops to the skillet and cook for 4 to 5 minutes, gently flipping the chops in the pan.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer the chops to a plate and tent with foil. Repeat with the other two chops.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add all of the chops to the pan with the stuffing side up and top each chop with another  cup of stuffing. Sprinkle with fresh chopped sage and drizzle with olive oil. Roast in the oven for 7-10 minutes depending on thickness or to 160 degrees.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'id': 18082, u'name': u'stuffing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [], u'step': u'Remove the chops and serve.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pork Chops on the menu? Try pairing with Chardonnay, Pinot Noir, and Riesling. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. You could try Raymond Reserve Selection Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 47, u'instructions': u'Add the pork chops to a large freezer bag with the spiced apple cider and bay leaves and refrigerate for 1 hour or overnight.When ready to cook, preheat the oven to 425 degrees F.Drain the pork chops and pat dry. Make a slice in the center of each pork chop to make a large pocket. If the stuffing seems dry, drizzle with chicken broth and stir to liven it up. Stuff each chop with about  cup of the leftover stuffing. Heat a large cast iron skillets over medium-high heat and add 1 tablespoon of olive oil. Gently add 2 chops to the skillet and cook for 4 to 5 minutes, gently flipping the chops in the pan. Transfer the chops to a plate and tent with foil. Repeat with the other two chops. Add all of the chops to the pan with the stuffing side up and top each chop with another  cup of stuffing. Sprinkle with fresh chopped sage and drizzle with olive oil. Roast in the oven for 7-10 minutes depending on thickness or to 160 degrees. Remove the chops and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-pork-chops-690529', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}