{u'recipes': [{u'sourceName': u'Inspiralized', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/564027-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 564027, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shaved Asparagus and Sausage Sweet Potato Noodle Pasta', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 278.96, u'creditText': u'Inspiralized', u'extendedIngredients': [{u'originalString': u'6 asparagus stalks', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'1 large garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 sweet Italian sausage links, decased, crumbled', u'aisle': u'Meat', u'name': u'italian sausage links', u'metaInformation': [u'sweet', u'italian', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 7036, u'unit': u''}, {u'originalString': u'1/2 cup low-sodium beef broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium beef broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10093741, u'unit': u'cup'}, {u'originalString': u'1.5-2 tablespoons of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'optional: grated parmigiano reggiano cheese, to garnish', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'2 tbsp freshly chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'1/4 tsp red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 large (350g+) sweet potato, peeled, Blade C', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'large', u'peeled', u'(350g+)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.inspiralized.com/2014/03/25/shaved-asparagus-and-sausage-sweet-potato-noodle-pasta/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/peeler.png', u'id': 404693, u'name': u'peeler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a large skillet over medium heat and add in the olive oil. Then, add in the sausage. Cook the sausage until browned, 5-7 minutes. Continue to crumble the sausage as it cooks. While the sausage is cooking, snap the bottoms off the asparagus and then shave with a vegetable peeler, starting from the bottom of the asparagus tips all the way down to the end of the stalk. When done shaving, chop off the tips and set aside. Set aside all shavings and tips.When the sausage is done, add in the sweet potato noodles, garlic, red pepper flakes and season with salt and pepper. Toss to combine and then add in the broth and parsley.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cook, stirring occasionally, for 6-8 minutes or until sweet potato noodles are cooked through and soften. After 5 minutes into the noodles cooking, add in the shaved asparagus and asparagus tips. Toss to combine and let the noodles finish cooking.When pasta is done, plate into bowls and garnish with optional grated cheese. Enjoy!', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 606, u'instructions': u'Place a large skillet over medium heat and add in the olive oil. Then, add in the sausage. Cook the sausage until browned, 5-7 minutes. Continue to crumble the sausage as it cooks. While the sausage is cooking, snap the bottoms off the asparagus and then shave with a vegetable peeler, starting from the bottom of the asparagus tips all the way down to the end of the stalk. When done shaving, chop off the tips and set aside. Set aside all shavings and tips.When the sausage is done, add in the sweet potato noodles, garlic, red pepper flakes and season with salt and pepper. Toss to combine and then add in the broth and parsley. Let cook, stirring occasionally, for 6-8 minutes or until sweet potato noodles are cooked through and soften. After 5 minutes into the noodles cooking, add in the shaved asparagus and asparagus tips. Toss to combine and let the noodles finish cooking.When pasta is done, plate into bowls and garnish with optional grated cheese. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/shaved-asparagus-and-sausage-sweet-potato-noodle-pasta-564027', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}