{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/444357-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 444357, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sole Thermidor', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 266.88, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons sherry or chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon dried tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried tarragon', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1-1/4 cups milk, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/8 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 teaspoons seasoned salt', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042047, u'unit': u'teaspoons'}, {u'originalString': u'1 cup (4 ounces) shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'8 sole fillets (4 ounces each)', u'aisle': u'Seafood', u'name': u'sole', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sole.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10115028, u'unit': u'ounces'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/sole-thermidor', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Brush fillets with melted butter; sprinkle with seasoned salt and pepper. Starting with a short side, roll up.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place seam side down in a greased 9-in. square baking pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour 1/2 cup milk over fillets.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 25-30 minutes or until fish flakes easily with a fork.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Meanwhile, in a small saucepan, melt butter. Stir in flour until smooth; gradually add remaining milk. Bring to a boil; cook and stir for 1 minute or until thickened. Reduce heat; stir in the cheese, sherry and tarragon.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain pan juices, reserving 1/4 cup; stir into cheese mixture.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Pour over fish; sprinkle with paprika. Broil 4 in. from the heat for 3-4 minutes or until lightly browned.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Luna Nuda Pinot Grigio. It has 4.4 out of 5 stars and a bottle costs about 14 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste.', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                Brush fillets with melted butter; sprinkle with seasoned salt and pepper. Starting with a short side, roll up. Place seam side down in a greased 9-in. square baking pan. Pour 1/2 cup milk over fillets. Bake, uncovered, at 350\xb0 for 25-30 minutes or until fish flakes easily with a fork.                                                                                           Meanwhile, in a small saucepan, melt butter. Stir in flour until smooth; gradually add remaining milk. Bring to a boil; cook and stir for 1 minute or until thickened. Reduce heat; stir in the cheese, sherry and tarragon.                                                                                           Drain pan juices, reserving 1/4 cup; stir into cheese mixture. Pour over fish; sprinkle with paprika. Broil 4 in. from the heat for 3-4 minutes or until lightly browned.                                        Yield: 8 servings.                                                                                                                         Originally published as Sole Thermidor in  ReminisceJune/July 2009, p48                                                                                                                                                                                                        Nutritional Facts                                                                             1 fillet with 2-1/2 tablespoons sauce equals 254 calories, 14 g fat (9 g saturated fat), 92 mg cholesterol, 528 mg sodium, 5 g carbohydrate, trace fiber, 26 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/sole-thermidor-444357', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}