{u'recipes': [{u'sourceName': u'Making Thyme for Health', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/542746-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 542746, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Stuffed Artichokes', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 192.1, u'creditText': u'Making Thyme for Health', u'extendedIngredients': [{u'originalString': u'4 artichokes', u'aisle': u'Produce', u'name': u'artichokes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11007, u'unit': u''}, {u'originalString': u'1/2 cup shredded parmesan or asiago cheese', u'aisle': u'Cheese', u'name': u'asiago cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001033, u'unit': u'cup'}, {u'originalString': u'1 tablespoon fresh rosemary, minced', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 cups seasoned Italian breadcrumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'italian seasoned breadcrumbs', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18376, u'unit': u'cups'}, {u'originalString': u'2 lemons', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1102047, u'unit': u'teaspoon'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://makingthymeforhealth.com/2013/12/15/italian-stuffed-artichokes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u'Cut stems off the bottom of each artichoke so that they are able to stand straight up on their own. Using kitchen scissors, cut off any thorny tips of the leaves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place all four of them in a large pot with just enough water to cover a half-inch of the bottoms of each artichoke. Bring to a boil then cover with a lid and steam for 30 minutes.Meanwhile, combine the breadcrumbs, minced garlic, salt & pepper and herbs in a medium-sized bowl and preheat the oven to 300\xb0F.When artichokes are done steaming, remove from the heat and allow to cool for a minute or two.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove from the pot and place on a baking sheet lined with foil then press down on the center of each so that they spread open like a flower.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle each one with the olive oil (about 1/2 tablespoon for each) then squeeze the juice from half a lemon in each.Fill each one with 1/2 cup of breadcrumb mixture and top with shredded cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the oven for ten minutes, until cheese is light golden brown, then serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Mazzei Chianti Classico Riserva Ser Lapo with a 4.1 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with violet nuances, this wine has bright aromas of fresh cherries mingle with notes of thyme and subtle smoky nuances. In the mouth, this wine has a bright acid structure providing a lively quality. Cranberry, raspberry and red cherry dominate with hints of leather, cedar and cocoa powder. Some earthiness in the finish and ripe soft tannins.Pasta with meat sauces, stews, grilled meats and mid-aged cheeses. View More', u'title': u'Mazzei Chianti Classico Riserva Ser Lapo', u'price': u'$26.99', u'id': 452096, u'link': u'https://www.wine.com/product/mazzei-chianti-classico-riserva-ser-lapo-2011/146710', u'imageUrl': u'https://spoonacular.com/productImages/452096-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Cut stems off the bottom of each artichoke so that they are able to stand straight up on their own. Using kitchen scissors, cut off any thorny tips of the leaves.Place all four of them in a large pot with just enough water to cover a half-inch of the bottoms of each artichoke. Bring to a boil then cover with a lid and steam for 30 minutes.Meanwhile, combine the breadcrumbs, minced garlic, salt & pepper and herbs in a medium-sized bowl and preheat the oven to 300\xb0F.When artichokes are done steaming, remove from the heat and allow to cool for a minute or two. Remove from the pot and place on a baking sheet lined with foil then press down on the center of each so that they spread open like a flower.Drizzle each one with the olive oil (about 1/2 tablespoon for each) then squeeze the juice from half a lemon in each.Fill each one with 1/2 cup of breadcrumb mixture and top with shredded cheese.Bake in the oven for ten minutes, until cheese is light golden brown, then serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-stuffed-artichokes-542746', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}