{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/270629-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 270629, u'veryPopular': False, u'lowFodmap': False, u'title': u'My Favorite Fruit Salad', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 100.25, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'2 medium apples, chopped', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'2 cups seedless green grapes, halved', u'aisle': u'Produce', u'name': u'green grapes', u'metaInformation': [u'green', u'seedless', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cups'}, {u'originalString': u'1 tsp. ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 cup vanilla low-fat yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat vanilla yogurt', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001119, u'unit': u'cup'}, {u'originalString': u'1/3 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/2 cup PLANTERS Dry Roasted Peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted peanuts', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16092, u'unit': u'cup'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/my-favorite-fruit-salad-57004.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat yogurt, orange juice and cinnamon in medium bowl with wire whisk until well blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Add remaining ingredients; mix lightly.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.  Or, cover and refrigerate until ready to serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Sauvignon Blanc, and Gruener Veltliner are my top picks for Fruit Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Chehalem INOX Chardonnay. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'chardonnay', u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 316, u'instructions': u'Beat yogurt, orange juice and cinnamon in medium bowl with wire whisk until well blended.                                            Add remaining ingredients; mix lightly.                                              Serve immediately.  Or, cover and refrigerate until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/my-favorite-fruit-salad-270629', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}