{u'recipes': [{u'sourceName': u'Nutmeg Nanny', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/586734-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 586734, u'veryPopular': True, u'lowFodmap': False, u'title': u'Goat Cheese and Blackberry Thyme Jam Crostini', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 83.46, u'creditText': u'Nutmeg Nanny', u'extendedIngredients': [{u'originalString': u'1 cup fresh blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9042, u'unit': u'cup'}, {u'originalString': u'12 small pieces of toasted bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'small', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18064, u'unit': u'pieces'}, {u'originalString': u'1/2 cup dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'3 sprigs fresh thyme, leaves removed', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'8 ounces soft goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'2-3 teaspoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tablespoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.nutmegnanny.com/2013/09/27/goat-cheese-and-blackberry-thyme-jam-crostini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For jam', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium sized sauce pan add blackberries. Smash with a potato masher until they are juicy and broken up.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}, {u'equipment': [], u'step': u'Add in brown sugar, lemon zest, lemon juice and thyme leaves. Cook on medium-high heat for about 15-20 minutes until the mixture starts to thicken. Cook until you reach desired consistency but know that the jam will get a little thicker as it cools and starts to set. Take off heat, set aside and cool. For crostini', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [], u'step': u'Toast bread and spread with goat cheese. Spoon jam on top of the goat cheese and sprinkle with a little more thyme.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Mumm Napa Cuvee M. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 20 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The naturally ripened fruit selected from more than 50 separate vineyards, reveals layers of crisp and creamy textures that are rich and lingering. Individually selected lots were kept separate during initial fermentation in order to highlight their vineyard differences and extract the quintessence of their specific strengths. The resulting blend is a soft and elegant wine that highlights the delicious and powerful ripe fruit flavors that characterize the world-class grapes of the Napa Valley.Cuv\xe9e M exhibits a graceful stream of very fine bubbles gently rising to a persistent mousse cordon with a light peach rose color. The aromas are elegant, rich and complex, showing fresh white and yellow stone fruits with subtle hints of wild strawberry. A light touch of fresh brioche, with hints of vanilla and honey add to the wine's complex bouquet. On the palate, full flavors of peach and pear combine with a creamy caramel character, which lingers into a long satisfying finish.Mumm Napa's Cuv\xe9e M is the perfect sparkling wine for champagne cocktails or as an ap\xe9ritif to pair with hors d'oeuvres. It is also a perfect match with creamy desserts and spicy foods. View More", u'title': u'Mumm Napa Cuvee M', u'price': u'$19.99', u'id': 451872, u'link': u'https://www.wine.com/product/mumm-napa-cuvee-m/80229', u'imageUrl': u'https://spoonacular.com/productImages/451872-312x231.jpg'}]}, u'aggregateLikes': 546, u'instructions': u'For jamIn a medium sized sauce pan add blackberries. Smash with a potato masher until they are juicy and broken up. Add in brown sugar, lemon zest, lemon juice and thyme leaves. Cook on medium-high heat for about 15-20 minutes until the mixture starts to thicken. Cook until you reach desired consistency but know that the jam will get a little thicker as it cools and starts to set. Take off heat, set aside and cool. For crostiniToast bread and spread with goat cheese. Spoon jam on top of the goat cheese and sprinkle with a little more thyme.', u'spoonacularSourceUrl': u'https://spoonacular.com/goat-cheese-and-blackberry-thyme-jam-crostini-586734', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}