{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/616075-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 616075, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tropical Pina Colada Poke Cake', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 558.64, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'1 20 ounce can crushed pineapple (DO NOT DRAIN)', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'canned', u'(DO NOT DRAIN)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'ounce'}, {u'originalString': u'2 cups shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cups'}, {u'originalString': u'1 cup cream of coconut (found in the liquor aisle)', u'aisle': u'Alcoholic Beverages;Ethnic Foods;Baking', u'name': u'cream of coconut', u'metaInformation': [u'(found in the liquor aisle)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93745, u'unit': u'cup'}, {u'originalString': u'Maraschino cherries and pineapple rings, for garnish', u'aisle': u'Canned and Jarred', u'name': u'pineapple rings', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-canned.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 1009354, u'unit': u'serving'}, {u'originalString': u'1 8 ounce container whipped topping, thawed (or make your own homemade)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'homemade', u'thawed', u'(or make your own )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounce'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://dailydishrecipes.com/tropical-pina-colada-poke-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 133, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/straw.jpg', u'id': 405924, u'name': u'drinking straws'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Follow the directions on the box to bake the cake in a 9 x 13 pan.Allow to cool slightly.Poke holes in slightly cooled cake with the handle of a wooden spoon or wide straw.In a bowl mix together the crushed pineapple and cream of coconut.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1019354, u'name': u'crushed pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-coconut.jpg', u'id': 93745, u'name': u'cream of coconut'}]}, {u'equipment': [], u'step': u'Pour over cake and spread pineapple over surface.Cover and refrigerate until chilled. About 1-2 hours.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread whipped topping over cake and sprinkle coconut over the top, garnish with maraschino cherries and pineapple rings.Store in refrigerator.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-canned.jpg', u'id': 1009354, u'name': u'pineapple rings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Follow the directions on the box to bake the cake in a 9 x 13 pan.Allow to cool slightly.Poke holes in slightly cooled cake with the handle of a wooden spoon or wide straw.In a bowl mix together the crushed pineapple and cream of coconut. Pour over cake and spread pineapple over surface.Cover and refrigerate until chilled. About 1-2 hours.Spread whipped topping over cake and sprinkle coconut over the top, garnish with maraschino cherries and pineapple rings.Store in refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/tropical-pina-colada-poke-cake-616075', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}