{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/225450-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 225450, u'veryPopular': True, u'lowFodmap': False, u'title': u'Thai pumpkin soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 25, u'pricePerServing': 203.49, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'400ml can coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'ml'}, {u'originalString': u'1 tbsp grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'1 lemongrass, bashed a little', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemongrass', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11972, u'unit': u''}, {u'originalString': u'lime juice and sugar, for seasoning', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'servings'}, {u'originalString': u'1 onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 red chilli, sliced, to serve (optional)', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1\xbd kg pumpkin or squash, peeled and roughly chopped', u'aisle': u'Produce', u'name': u'squash', u'metaInformation': [u'peeled', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 1.5, u'consistency': u'solid', u'id': 10011485, u'unit': u'kg'}, {u'originalString': u'4 tsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tsp'}, {u'originalString': u'3-4 tbsp Thai red curry paste', u'aisle': u'Ethnic Foods', u'name': u'thai red curry paste', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93605, u'unit': u'tbsp'}, {u'originalString': u'850ml vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 850.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/775669/thai-pumpkin-soup', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Toss the pumpkin or squash in a roastingtin with half the oil and seasoning, thenroast for 30 mins until golden and tender.Meanwhile, put the remaining oil in apan with the onion, ginger and lemongrass.Gently cook for 8-10 mins until softened.Stir in the curry paste for 1 min, followedby the roasted pumpkin, all but 3 tbsp ofthe coconut milk and the stock. Bring toa simmer, cook for 5 mins, then fish outthe lemongrass. Cool for a few mins, thenwhizz until smooth with a hand blender,or in a large blender in batches. Returnto the pan to heat through, seasoningwith salt, pepper, lime juice and sugar,if it needs it.', u'length': {u'number': 46, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'id': 93605, u'name': u'curry paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'id': 11972, u'name': u'lemon grass'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Serve drizzled with theremaining coconut milk and scatteredwith chilli, if you like.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Thai. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Essay Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 1340, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Toss the pumpkin or squash in a roastingtin with half the oil and seasoning, thenroast for 30 mins until golden and tender.Meanwhile, put the remaining oil in apan with the onion, ginger and lemongrass.Gently cook for 8-10 mins until softened.Stir in the curry paste for 1 min, followedby the roasted pumpkin, all but 3 tbsp ofthe coconut milk and the stock. Bring toa simmer, cook for 5 mins, then fish outthe lemongrass. Cool for a few mins, thenwhizz until smooth with a hand blender,or in a large blender in batches. Returnto the pan to heat through, seasoningwith salt, pepper, lime juice and sugar,if it needs it. Serve drizzled with theremaining coconut milk and scatteredwith chilli, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-pumpkin-soup-225450', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}