{u'recipes': [{u'sourceName': u'Roxanas Home Baking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547600-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 547600, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato tart with poppy seed crust and goat cheese', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 762.01, u'creditText': u'Roxanas Home Baking', u'extendedIngredients': [{u'originalString': u'1 1/2 cup (180grams) all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 180.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'7 tbsp (100 grams) cold butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cold', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'4-6 oz (113-168 grams) cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 113.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'grams'}, {u'originalString': u'3 oz (84 grams) goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 84.0, u'consistency': u'solid', u'id': 1159, u'unit': u'grams'}, {u'originalString': u'1 tsp ground dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'ground thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'tsp'}, {u'originalString': u'1 tbsp poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'tbsp'}, {u'originalString': u'1/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'6 medium size tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium size'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'2-3 tbsp icy-cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}], u'healthScore': 70.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://roxanashomebaking.com/tomato-tart-with-poppy-seed-crust-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 63, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Sift the flour and salt and add to the food processor bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the poppy seed and thyme and pulse once.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}]}, {u'equipment': [], u'step': u'Add the cubed butter and pulse until the mixture resembles breadcrumbs.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add 2 tbsp of icy-cold water and pulse a couple of times until the dough comes together. If needed add more water (few more drops up to a tablespoon) Take the dough out of the food processor and with your fingers press the dough into the baking pan. Cover with plastic foil and chill for about 1 hour. In the meantime, slice the medium size tomatoes and leave them on a board for the water to drain.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oven to 400F.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Placed the sliced tomatoes over the buttery crust in a zig-zag and fill the rest of the crust with the small cherry tomatoes. Crumble the goat cheese over the tomatoes, sprinkle some salt and pepper on top and bake for 40 minutes. Enjoy while warm or cold!', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Sift the flour and salt and add to the food processor bowl. Add the poppy seed and thyme and pulse once. Add the cubed butter and pulse until the mixture resembles breadcrumbs. Add 2 tbsp of icy-cold water and pulse a couple of times until the dough comes together. If needed add more water (few more drops up to a tablespoon) Take the dough out of the food processor and with your fingers press the dough into the baking pan. Cover with plastic foil and chill for about 1 hour. In the meantime, slice the medium size tomatoes and leave them on a board for the water to drain. Heat the oven to 400F. Placed the sliced tomatoes over the buttery crust in a zig-zag and fill the rest of the crust with the small cherry tomatoes. Crumble the goat cheese over the tomatoes, sprinkle some salt and pepper on top and bake for 40 minutes. Enjoy while warm or cold!', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-tart-with-poppy-seed-crust-and-goat-cheese-547600', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}