{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/245810-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 245810, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crab Bisque', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 579.85, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 carrot, roughly sliced or chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'roughly sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/8 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 celery stalk, roughly sliced or chopped', u'aisle': u'Produce', u'name': u'celery stalk', u'metaInformation': [u'roughly sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 \xbc lb or more of cooked crabmeat', u'aisle': u'Canned and Jarred', u'name': u'cooked crabmeat', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 15141, u'unit': u'lb'}, {u'originalString': u'4-6 cups crab shells', u'aisle': u'Seafood', u'name': u'crab', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 15136, u'unit': u'cups'}, {u'originalString': u'3/4 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 \xbc cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Several sprigs parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'sprig', u'unitShort': u'sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'sprigs'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup shallots, chopped', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}, {u'originalString': u'4 cups of shellfish stock', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cups'}, {u'originalString': u'2 sprigs of thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'2 Tbsp tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp butter, unsalted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'\xbc cup white rice', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}, {u'originalString': u'10-15 whole peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'whole peppercorns', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 1022030, u'unit': u''}, {u'originalString': u'1 large yellow onion, sliced or chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/crab_bisque/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Before making the bisque, you'll need to make the shellfish stock (see these instructions for details and photos).1 Break crab shells into smaller pieces by putting in a sealed, thick plastic bag and either rolling with a rolling pin or hitting with a meat hammer to crush. Don't crush too small. You can even skip this step if you want, if your shell pieces are already well broken up. Put in a large stock pot and cover with an inch (but no more than an inch) of water.2", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Put the stove temperature on medium high and slowly heat the shells in the water. As soon as you see that little bubbles are starting to come up to the surface, reduce the heat to medium. Do not let it boil. You want to maintain the temperature at just below a simmer, where the bubbles just occasionally come up to the surface. Do not stir the shells. Stirring will muddy up the stock. As the bubbles come up to the surface a film of foam will develop on the surface. Use a large slotted spoon to skim away this foam.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Let the shells cook like this for about an hour; skim the foam every few minutes. The foam comes from shells releasing impurities as their temperature increases.3', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}], u'step': u'Put the thyme, bay leaves, and parsley in cheese cloth. Secure with kitchen string to make a bouquet garni.4 Once the stock has stopped releasing foam, you can add the wine, onions, carrots, celery, tomato paste, herb bouquet garni, and peppercorns. Bring to a low simmer and reduce heat so that the stock continues to simmer, but not boil, for 30 minutes. If more foam comes to the surface, skim it off.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add salt and remove from heat.5 Dampen a few layers of cheesecloth and place over a large, fine mesh strainer, over a large pot or bowl.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u"Pour the stock into the strainer. Discard the solids. Either use the stock right away, or cool for future use. If you aren't going to use in a couple of days, freeze (remember to leave some head room at the top of your freezer container for the liquid to expand as it freezes.)Makes 2-3 quarts. Reserve 4 cups for the crab bisque, refrigerate or freeze the rest.Now on to the bisque...6 In a large, 4 or 6 quart saucepan, melt butter on medium heat, add the shallots and cook gently until translucent, about 5 minutes.7", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}]}, {u'equipment': [], u'step': u'Add the wine, stock, white rice, and tomato paste. Raise the heat and bring to a simmer; reduce heat to continue to simmer until rice is completely cooked, about 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220444, u'name': u'white rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Remove from heat and let cool for several minutes.8', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add about two thirds of the crab meat to the soup. Working in batches, ladle the soup into a blender and pur\xe9e until completely smooth. Return pur\xe9ed soup back to soup pan.9', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 10015136, u'name': u'crabmeat'}]}, {u'equipment': [], u'step': u'Add cream and gently heat soup until it is hot enough for serving.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the remaining one third of the crab meat.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 10015136, u'name': u'crabmeat'}]}, {u'equipment': [], u'step': u'Add salt and cayenne pepper to taste (about \xbd teaspoon salt and 1/8 teaspoon cayenne).', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Tiamo Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u"Light straw yellow color. Fresh and rich fruity aromas of apple and pear with a hint of citrus fruit that fade into the floral bouquet. Fresh and fruity, very clean and crisp.Tiamo Pinot Grigio pairs well with a wide array of lighter cuisine, especially fish/shellfish, poultry, pastas in cream sauce and softer cheeses. It's also an ideal aperitif.", u'title': u'Tiamo Pinot Grigio', u'price': u'$8.49', u'id': 438682, u'link': u'https://www.wine.com/product/tiamo-pinot-grigio-2008/98091', u'imageUrl': u'https://spoonacular.com/productImages/438682-312x231.jpg'}]}, u'aggregateLikes': 375, u'instructions': u"Before making the bisque, you'll need to make the shellfish stock (see these instructions for details and photos).1 Break crab shells into smaller pieces by putting in a sealed, thick plastic bag and either rolling with a rolling pin or hitting with a meat hammer to crush. Don't crush too small. You can even skip this step if you want, if your shell pieces are already well broken up. Put in a large stock pot and cover with an inch (but no more than an inch) of water.2 Put the stove temperature on medium high and slowly heat the shells in the water. As soon as you see that little bubbles are starting to come up to the surface, reduce the heat to medium. Do not let it boil. You want to maintain the temperature at just below a simmer, where the bubbles just occasionally come up to the surface. Do not stir the shells. Stirring will muddy up the stock. As the bubbles come up to the surface a film of foam will develop on the surface. Use a large slotted spoon to skim away this foam. Let the shells cook like this for about an hour; skim the foam every few minutes. The foam comes from shells releasing impurities as their temperature increases.3 Put the thyme, bay leaves, and parsley in cheese cloth. Secure with kitchen string to make a bouquet garni.4 Once the stock has stopped releasing foam, you can add the wine, onions, carrots, celery, tomato paste, herb bouquet garni, and peppercorns. Bring to a low simmer and reduce heat so that the stock continues to simmer, but not boil, for 30 minutes. If more foam comes to the surface, skim it off. Add salt and remove from heat.5 Dampen a few layers of cheesecloth and place over a large, fine mesh strainer, over a large pot or bowl. Pour the stock into the strainer. Discard the solids. Either use the stock right away, or cool for future use. If you aren't going to use in a couple of days, freeze (remember to leave some head room at the top of your freezer container for the liquid to expand as it freezes.)Makes 2-3 quarts. Reserve 4 cups for the crab bisque, refrigerate or freeze the rest.Now on to the bisque...6 In a large, 4 or 6 quart saucepan, melt butter on medium heat, add the shallots and cook gently until translucent, about 5 minutes.7 Add the wine, stock, white rice, and tomato paste. Raise the heat and bring to a simmer; reduce heat to continue to simmer until rice is completely cooked, about 25 minutes. Remove from heat and let cool for several minutes.8 Add about two thirds of the crab meat to the soup. Working in batches, ladle the soup into a blender and pur\xe9e until completely smooth. Return pur\xe9ed soup back to soup pan.9 Add cream and gently heat soup until it is hot enough for serving. Add the remaining one third of the crab meat. Add salt and cayenne pepper to taste (about \xbd teaspoon salt and 1/8 teaspoon cayenne).", u'spoonacularSourceUrl': u'https://spoonacular.com/crab-bisque-245810', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}