{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577511-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 577511, u'veryPopular': True, u'lowFodmap': False, u'title': u'Dark Chocolate Mint Crackle Cookie', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 22.01, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'1-1/2 cups All Purpose Flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon Baking Powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup Unsweetened Dark Chocolate Cocoa Powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'dark', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 cup loosely packed Fresh Mint Leaves,', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'loosely packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'7 ounces Semi-Sweet Chocolate, broken into pieces', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1/2 cup Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 tablespoon Unsalted Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon Real Vanilla Extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3 whole Eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.simplyscratch.com/2011/09/dark-chocolate-mint-crackle-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees and place rack in the middle of your oven.Sift together the flour, cocoa, baking powder and salt. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place mint and sugar into a food processor and blend until it resembles coarse wet sand.In a sauce pan over the lowest setting melt the chocolate and butter. Stir often to avoid scorching and remove when only a few lumps remain. Stir until completely melted then pour into a large bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Add the mint sugar to the chocolate and stir. When the chocolate has cooled a tad, gradually add eggs and vanilla and stir.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Add a third of the dry ingredients to the chocolate mixture, mix by hand. Repeat until all the dry ingredients are incorporated. Cover with plastic wrap and refrigerate for one hour.Using a tablespoon or small ice cream scoop, measure and roll into uniform balls.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Roll the cookie balls in granulated sugar and then powdered sugar, then place the cookie balls an inch apart on a lined or greased, rimmed baking sheet. Slide into oven and bake for 10-12 minutes depending on your oven.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and let cool on the pan for 5 minutes then remove to cooling rack to finish.  Makes 3 dozen cookies.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 441, u'instructions': u'Preheat oven to 350 degrees and place rack in the middle of your oven.Sift together the flour, cocoa, baking powder and salt. Set aside.Place mint and sugar into a food processor and blend until it resembles coarse wet sand.In a sauce pan over the lowest setting melt the chocolate and butter. Stir often to avoid scorching and remove when only a few lumps remain. Stir until completely melted then pour into a large bowl. Add the mint sugar to the chocolate and stir. When the chocolate has cooled a tad, gradually add eggs and vanilla and stir.Add a third of the dry ingredients to the chocolate mixture, mix by hand. Repeat until all the dry ingredients are incorporated. Cover with plastic wrap and refrigerate for one hour.Using a tablespoon or small ice cream scoop, measure and roll into uniform balls. Roll the cookie balls in granulated sugar and then powdered sugar, then place the cookie balls an inch apart on a lined or greased, rimmed baking sheet. Slide into oven and bake for 10-12 minutes depending on your oven. Remove and let cool on the pan for 5 minutes then remove to cooling rack to finish.  Makes 3 dozen cookies.', u'spoonacularSourceUrl': u'https://spoonacular.com/dark-chocolate-mint-crackle-cookie-577511', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}