{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507323-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 507323, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shortbread Cookies', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 39.51, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'3\xbd cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'6 to 7 ounces semisweet chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1 cup sugar, plus extra for sprinkling', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbe pound unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 1145, u'unit': u'pound'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.browneyedbaker.com/2010/03/03/shortbread-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.2. In the bowl of an electric mixer fitted with a paddle attachment, mix together the butter and 1 cup of sugar until they are just combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the vanilla. In a medium bowl, sift together the flour and salt, then add them to the butter-and-sugar mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix on low speed until the dough starts to come together. Dump onto a surface dusted with flour and shape into a flat disk. Wrap in plastic and chill for 30 minutes.3.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}], u'step': u'Roll the dough \xbd-inch thick and cut into 3 by 1-inch fingers, either using a cookie cutter, pastry wheel, or pizza cutter.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the cookies on an ungreased baking sheet and sprinkle with sugar.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake for 20 to 25 minutes, until the edges begin to brown. Allow to cool to room temperature.4. When the cookies are cool, place them on a baking sheet lined with parchment paper. Put 3 ounces of the chocolate in a glass bowl and microwave on high power for 30 seconds. Stir with a wooden spoon. Continue to heat and stir in 30-second increments until the chocolate is just melted.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u"Add the remaining chocolate and allow it to sit at room temperature, stirring often, until it's completely smooth. Stir vigorously until the chocolate is smooth and slightly cooled; stirring makes it glossier.5. Dip \xbd of each cookie into the chocolate to coat, letting the excess drip off. Set back on the parchment-lined sheet and let sit at room temperature until chocolate is set. Store at room temperature in a tin.", u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 688, u'instructions': u"1. Preheat the oven to 350 degrees F.2. In the bowl of an electric mixer fitted with a paddle attachment, mix together the butter and 1 cup of sugar until they are just combined. Add the vanilla. In a medium bowl, sift together the flour and salt, then add them to the butter-and-sugar mixture. Mix on low speed until the dough starts to come together. Dump onto a surface dusted with flour and shape into a flat disk. Wrap in plastic and chill for 30 minutes.3. Roll the dough \xbd-inch thick and cut into 3 by 1-inch fingers, either using a cookie cutter, pastry wheel, or pizza cutter. Place the cookies on an ungreased baking sheet and sprinkle with sugar. Bake for 20 to 25 minutes, until the edges begin to brown. Allow to cool to room temperature.4. When the cookies are cool, place them on a baking sheet lined with parchment paper. Put 3 ounces of the chocolate in a glass bowl and microwave on high power for 30 seconds. Stir with a wooden spoon. Continue to heat and stir in 30-second increments until the chocolate is just melted. Add the remaining chocolate and allow it to sit at room temperature, stirring often, until it's completely smooth. Stir vigorously until the chocolate is smooth and slightly cooled; stirring makes it glossier.5. Dip \xbd of each cookie into the chocolate to coat, letting the excess drip off. Set back on the parchment-lined sheet and let sit at room temperature until chocolate is set. Store at room temperature in a tin.", u'spoonacularSourceUrl': u'https://spoonacular.com/shortbread-cookies-507323', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}