{u'recipes': [{u'sourceName': u'Mother Rimmy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/531013-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 531013, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Breasts Stuffed with Chard, Spinach and Mushrooms', u'diets': [u'gluten free'], u'pricePerServing': 295.37, u'creditText': u'Mother Rimmy', u'extendedIngredients': [{u'originalString': u'4 large chicken breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 can fat free cream of chicken soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [u'fat free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'can'}, {u'originalString': u'4 cloves garlic, thinly sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd cup low fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1174, u'unit': u'cup'}, {u'originalString': u'\xbd cup low fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1179, u'unit': u'cup'}, {u'originalString': u'4 cups mushroom, sliced', u'aisle': u'Produce', u'name': u'mushroom', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'6 cups red chard, chopped', u'aisle': u'Produce', u'name': u'red chard', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11147, u'unit': u'cups'}, {u'originalString': u'4 cups spinach, chopped', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'2 tablespoons thyme, finely chopped', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoons'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://motherrimmy.com/you-cant-change-the-past-chicken-breasts-stuffed-with-healthy-greens/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Saute onion in olive oil in a large nonstick pan over medium heat for 3 - 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add mushrooms and cook another 3 - 5 minutes until tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a little water if pan becomes dry. Then add chard and spinach and cook for another few minutes until wilted.3. Pound chicken breasts to flatten to an even thickness, then cut a large slit through the middle to create a pocket. Stuff each chicken pocket with 1/4 of the chard mixture.4. Return to the pan over medium heat, sprayed with more cooking spray and brown on both sides.5.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine soup, sour cream, milk and thyme in a bowl and spoon over chicken breasts.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in oven and cook 15 - 20 minutes, dependent on how thick the chicken breasts are, until chicken is no longer pink in the middle.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Breast can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'1. Preheat oven to 350.2. Saute onion in olive oil in a large nonstick pan over medium heat for 3 - 5 minutes. Add mushrooms and cook another 3 - 5 minutes until tender. Add a little water if pan becomes dry. Then add chard and spinach and cook for another few minutes until wilted.3. Pound chicken breasts to flatten to an even thickness, then cut a large slit through the middle to create a pocket. Stuff each chicken pocket with 1/4 of the chard mixture.4. Return to the pan over medium heat, sprayed with more cooking spray and brown on both sides.5. Combine soup, sour cream, milk and thyme in a bowl and spoon over chicken breasts. Place in oven and cook 15 - 20 minutes, dependent on how thick the chicken breasts are, until chicken is no longer pink in the middle.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-breasts-stuffed-with-chard-spinach-and-mushrooms-531013', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}