{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220883-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 220883, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sherried turkey & ham bake', u'diets': [], u'pricePerServing': 143.23, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g butter, plus a little extra for greasing the dish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing the dish', u'plus a little extra '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'100g cheddar, grated', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1009, u'unit': u'g'}, {u'originalString': u'140g thickly sliced cooked ham, cut into strips', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'cooked', u'sliced', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'liquid', u'id': 10151, u'unit': u'g'}, {u'originalString': u'600ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 600.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'50g chopped mixed nuts, such as hazelnuts, almonds, and walnuts', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'mixed', u' such as hazelnuts, almonds, and walnuts', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12135, u'unit': u'g'}, {u'originalString': u'175g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'50g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'3 tbsp medium sherry', u'aisle': u'Alcoholic Beverages', u'name': u'sherry', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 10214106, u'unit': u'tbsp'}, {u'originalString': u'350g 12oz cooked turkey, cut into strips', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'cooked', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 5165, u'unit': u'g'}, {u'originalString': u'2 tsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tsp'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1141/sherried-turkey-and-ham-bake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat the oven to 200C/Gas 6/fan oven 180C.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix the turkey, ham and frozen peas in a buttered ovenproof dish.To make the sauce, put the butter, flour and milk in a saucepan and bring to the boil, whisking all the time, until the sauce is thickened and smooth. Stir in the sherry and mustard, season to taste and simmer for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [], u'step': u'Remove from the heat and stir in half the cheese.To finish the dish, pour the sauce over the ingredients in the dish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Mix the remaining cheese with the nuts and sprinkle on top. At this point, you can keep the bake in the fridge up to 5 hours, or freeze it. When ready, bake for 25-35 minutes until the topping is golden and the sauce is bubbling.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}]}], u'name': u''}], u'aggregateLikes': 54, u'instructions': u'Preheat the oven to 200C/Gas 6/fan oven 180C. Mix the turkey, ham and frozen peas in a buttered ovenproof dish.To make the sauce, put the butter, flour and milk in a saucepan and bring to the boil, whisking all the time, until the sauce is thickened and smooth. Stir in the sherry and mustard, season to taste and simmer for 1 minute. Remove from the heat and stir in half the cheese.To finish the dish, pour the sauce over the ingredients in the dish. Mix the remaining cheese with the nuts and sprinkle on top. At this point, you can keep the bake in the fridge up to 5 hours, or freeze it. When ready, bake for 25-35 minutes until the topping is golden and the sauce is bubbling.', u'spoonacularSourceUrl': u'https://spoonacular.com/sherried-turkey-ham-bake-220883', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}