{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223602-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 223602, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey mustard grilled salmon with Puy lentils', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 565.74, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'10 basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'175g cooked beetroot (not in vinegar), diced', u'aisle': u'Produce', u'name': u'beetroot', u'metaInformation': [u'diced', u'cooked', u'(not in vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 11080, u'unit': u'g'}, {u'originalString': u'1 tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'zest and juice 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'250g pack ready-to-eat puy lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 16069, u'unit': u'g'}, {u'originalString': u'2 tsp rapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'rapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'2 big handfuls rocket', u'aisle': u'Produce', u'name': u'rocket', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'handfuls'}, {u'originalString': u'2 skinless salmon fillets', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 2.0, u'consistency': u'solid', u'id': 15076, u'unit': u'fillet'}, {u'originalString': u'5 spring onions, sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 tsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/honey-mustard-grilled-salmon-puy-lentils', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Turn the grill to high and line a baking tray with foil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the lemon zest and juice, mustard and honey.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Put the salmon on the tray, brush with a little of the dressing, then grill for 5-7 mins – there is no need to turn the salmon over until it flakes easily when tested with a knife.Meanwhile, heat the oil in a wok and cook the spring onions and beetroot. Tip in the lentils with 4 tbsp water, cover the pan and cook for 2 mins to heat through. Tip into a bowl and toss with the remaining dressing, the basil and rocket.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve with the salmon.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Casa Catelli Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Turn the grill to high and line a baking tray with foil. Mix the lemon zest and juice, mustard and honey. Put the salmon on the tray, brush with a little of the dressing, then grill for 5-7 mins – there is no need to turn the salmon over until it flakes easily when tested with a knife.Meanwhile, heat the oil in a wok and cook the spring onions and beetroot. Tip in the lentils with 4 tbsp water, cover the pan and cook for 2 mins to heat through. Tip into a bowl and toss with the remaining dressing, the basil and rocket. Serve with the salmon.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-mustard-grilled-salmon-with-puy-lentils-223602', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}