{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/464419-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 464419, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chocolate Citrus Wedges', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 23.76, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 ounces dark chocolate candy coating, coarsely chopped', u'aisle': u'Baking', u'name': u'candy coating', u'metaInformation': [u'dark', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 98857, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup orange marmalade', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'orange marmalade', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-marmalade.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19303, u'unit': u'cup'}, {u'originalString': u'2 teaspoons shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4615, u'unit': u'teaspoons'}, {u'originalString': u'2 medium lemons or tangerines, peeled and separated into wedges', u'aisle': u'Produce', u'name': u'tangerines', u'metaInformation': [u'separated', u'medium', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1019218, u'unit': u''}, {u'originalString': u'1/4 cup finely chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/chocolate-citrus-wedges', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a microwave, heat marmalade for 15 seconds. Dip lemon wedges in marmalade; allow excess to drip off.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place on waxed paper; sprinkle with cinnamon. Refrigerate for 30 minutes or until set.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a microwave, melt chocolate and shortening; stir until smooth. Dip wedges in chocolate; allow excess to drip off.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Place on waxed paper; sprinkle with walnuts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [], u'step': u'Let stand until set.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Siduri Sta. Rita Hills Pinot Noir. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 33 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The 2014 Sta. Rita Hills Pinot Noir is a blend of fruit from the John Sebastiano, Clos Pepe, Cargasacchi, and Lindley Vineyards. The actual blend is 64% John Sebastiano Vineyard Pinot Noir, 22% Clos Pepe, 9% Lindley, and 6% Cargasacchi. Clonally, this wine is a blend of 8 different clones which also provides for a wide range of flavors within one wine. The 2014 Pinot Noir Sta. Rita Hills should be a classic expression of the region, showing lots of spice, red fruit and dried soils aromas and flavors. Balanced, polished and elegant with plenty of fruit, it should certainly be an outstanding wine, and at the price, is an excellent value in Pinot Noir.', u'title': u'Siduri Sta. Rita Hills Pinot Noir', u'price': u'$32.99', u'id': 454206, u'link': u'https://www.wine.com/product/siduri-sta-rita-hills-pinot-noir-2014/168102', u'imageUrl': u'https://spoonacular.com/productImages/454206-312x231.jpg'}]}, u'aggregateLikes': 117, u'instructions': u"Directions                                                                                In a microwave, heat marmalade for 15 seconds. Dip lemon wedges in marmalade; allow excess to drip off. Place on waxed paper; sprinkle with cinnamon. Refrigerate for 30 minutes or until set.                                                                                           In a microwave, melt chocolate and shortening; stir until smooth. Dip wedges in chocolate; allow excess to drip off. Place on waxed paper; sprinkle with walnuts. Let stand until set.                                        Yield: about 1-1/2 dozen.                                                                                                                         Originally published as Chocolate Citrus Wedges in  Taste of Home's Holiday & Celebrations CookbookAnnual 2010, p95                                                                                                                                                                                                        Nutritional Facts                                                                             1 citrus wedge equals 74 calories, 4 g fat (2 g saturated fat), trace cholesterol, 5 mg sodium, 11 g carbohydrate, trace fiber, 1 g protein. Diabetic Exchanges: 1/2 starch, 1/2 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-citrus-wedges-464419', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}