{u'recipes': [{u'sourceName': u'Sugar Dish Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/517890-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 517890, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cherry Bomb Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 230.61, u'creditText': u'Sugar Dish Me', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cups fresh cherries, pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'fresh', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9070, u'unit': u'cups'}, {u'originalString': u'10 chicken legs, skin-on (or the equivalent number of pieces; about 3 pounds)', u'aisle': u'Meat', u'name': u'chicken legs', u'metaInformation': [u'(or the equivalent number of pieces; 3 pounds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 5075, u'unit': u''}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'2 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'1 tablespoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 cup onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 Carolina Reaper pepper (see note)', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u''}, {u'originalString': u'2 Carolina Reaper peppers, coarsely chopped (or 3 Habanero chiles-- see note)', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'coarsely chopped', u'(or 3 Habanero chiles-- see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'\xbc cup rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022053, u'unit': u'cup'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 quart warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'quart'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.sugardishme.com/2013/06/28/cherry-bomb-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the pitted cherries, warm water, kosher salt, sugar, allspice, chili peppers, and garlic in the blender. Blend until you have frothy pink liquid.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chicken pieces in a large container or bowl, pour the brine over the chicken, cover, and refrigerate for 4-6 hours.While the chicken marinates, make the cherry pepper glaze.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Heat the oil and add the onion and salt. Continue cooking over medium heat for about 10 minutes, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the cherries and chili pepper and cook for another 2-3 minutes.Stir in the water, cornstarch, rice vinegar, honey, molasses, and sugar. Continue cooking over medium heat, stirring occasionally, for about 20 minutes. The mixture will be THICK and sticky!!', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place a fine mesh strainer over a bowl and pour the glaze through. You may need to press it with a spatula. This removes the cherry skins. You can skip this step if you're not particular.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat the grill to about 500.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the chicken from the brine and discard the liquid.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the chicken pieces on the HOT HOT grill for about 2 minutes. Flip them and cook for another minute or 2. Reduce the heat to medium, close the lid, and let them cook for about 10 minutes. Turn them again, close the lid and cook for 10 more minutes. (If you are cooking on a charcoal grill: Make a hot hot side and a less hot side by piling the coals to one side of the cook kettle. Sear the chicken on the hot hot side and then move the pieces to the other side, cover, cook, and continue)', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Brush each piece with the cherry pepper glaze. Cook for a few more minutes, turn, and glaze the other side.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Remove the chicken to a plate and serve.*****Degree of Doneness/Cook Time will depend on the size of your chicken pieces and whether or not there is a bone. Use a meat thermometer to check that the internal temperature at the thickest part is 165 degrees.*****', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 678, u'instructions': u"Place the pitted cherries, warm water, kosher salt, sugar, allspice, chili peppers, and garlic in the blender. Blend until you have frothy pink liquid.Place the chicken pieces in a large container or bowl, pour the brine over the chicken, cover, and refrigerate for 4-6 hours.While the chicken marinates, make the cherry pepper glaze. Heat the oil and add the onion and salt. Continue cooking over medium heat for about 10 minutes, stirring occasionally.Add the cherries and chili pepper and cook for another 2-3 minutes.Stir in the water, cornstarch, rice vinegar, honey, molasses, and sugar. Continue cooking over medium heat, stirring occasionally, for about 20 minutes. The mixture will be THICK and sticky!!Place a fine mesh strainer over a bowl and pour the glaze through. You may need to press it with a spatula. This removes the cherry skins. You can skip this step if you're not particular.Heat the grill to about 500. Remove the chicken from the brine and discard the liquid.Place the chicken pieces on the HOT HOT grill for about 2 minutes. Flip them and cook for another minute or 2. Reduce the heat to medium, close the lid, and let them cook for about 10 minutes. Turn them again, close the lid and cook for 10 more minutes. (If you are cooking on a charcoal grill: Make a hot hot side and a less hot side by piling the coals to one side of the cook kettle. Sear the chicken on the hot hot side and then move the pieces to the other side, cover, cook, and continue)Brush each piece with the cherry pepper glaze. Cook for a few more minutes, turn, and glaze the other side. Remove the chicken to a plate and serve.*****Degree of Doneness/Cook Time will depend on the size of your chicken pieces and whether or not there is a bone. Use a meat thermometer to check that the internal temperature at the thickest part is 165 degrees.*****", u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-bomb-chicken-517890', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}