{u'recipes': [{u'sourceName': u'Two Peas and Their Pod', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547674-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 547674, u'veryPopular': True, u'lowFodmap': False, u'title': u'Avocado Egg Salad', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 138.21, u'creditText': u'Two Peas and Their Pod', u'extendedIngredients': [{u'originalString': u'2 small avocados, pitted and peeled', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'pitted', u'small', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/4 teaspoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002046, u'unit': u'teaspoon'}, {u'originalString': u'2 hard boiled egg whites, chopped', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'hard', u'boiled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 hard boiled eggs, chopped', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'hard', u'boiled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons chopped green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon plain Greek yogurt (we use Chobani)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain', u'(we use Chobani)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'tablespoon'}, {u'originalString': u'Salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.twopeasandtheirpod.com/avocado-egg-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Spread between two slices of bread for an Avocado Egg Salad Sandwich. Eat with crackers, cut up veggies, on toast, or in a wrap. This salad is best eaten the day it's made.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u'In a medium bowl, combine the hard boiled eggs and egg whites, avocado, Greek yogurt, lemon juice, green onion, and mustard. Mash with a fork. Season with salt and pepper, to taste. Serving suggestions'}], u'aggregateLikes': 114888, u'instructions': u"1. In a medium bowl, combine the hard boiled eggs and egg whites, avocado, Greek yogurt, lemon juice, green onion, and mustard. Mash with a fork. Season with salt and pepper, to taste. Serving suggestions: Spread between two slices of bread for an Avocado Egg Salad Sandwich. Eat with crackers, cut up veggies, on toast, or in a wrap. This salad is best eaten the day it's made.", u'spoonacularSourceUrl': u'https://spoonacular.com/avocado-egg-salad-547674', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}