{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/795047-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 795047, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Watermelon Bites', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 176.1, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'\xbc cup agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'\xbc cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'8 large basil leaves, cut into chiffonade (see note above)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'large', u'cut into chiffonade (see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'24 medium basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'\xbc teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1-2 tablespoon extra virgin olive oil, for grilling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'for grilling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces goat cheese, sliced into 12 slices (use sharp wet knife to cut through the soft cheese)', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'soft', u'sliced into 12 slices (use sharp wet knife to cut through the  cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'6 slices prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}, {u'originalString': u'12 cubes watermelon, about 1 \xbd inch square', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'cubes', u'unitShort': u'cubes', u'amount': 12.0, u'consistency': u'solid', u'id': 9326, u'unit': u'cubes'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.afamilyfeast.com/grilled-watermelon-bites/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Begin by placing all glaze ingredients in a small sauce pan and reduce over medium heat by half, about five to ten minutes. Set aside.To prepare, slice each slice of prosciutto the long way so you have twelve long pieces.Take one of them and lay on your board.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [], u'step': u'Place a basil leaf in center and top with a cube of watermelon.Next lay a slice of goat cheese on top and finish with a second basil leaf.Fold the sides of the prosciutto up overlapping the top so that the cube is tight.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Place a toothpick through where the prosciutto overlaps, which should be directly over the top. (Each side will be grilled except the top where the cheese is).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a grilled rib pan over medium heat and when hot, brush the top with half the oil.Lay out cubes on their sides (a side with prosciutto) and grill for a minute or so or until slightly crispy. Turn to face up and repeat. Then flip on the other side and repeat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [], u'step': u'Remove to a serving platter and drizzle with the reserved glaze.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 58, u'instructions': u'Begin by placing all glaze ingredients in a small sauce pan and reduce over medium heat by half, about five to ten minutes. Set aside.To prepare, slice each slice of prosciutto the long way so you have twelve long pieces.Take one of them and lay on your board. Place a basil leaf in center and top with a cube of watermelon.Next lay a slice of goat cheese on top and finish with a second basil leaf.Fold the sides of the prosciutto up overlapping the top so that the cube is tight.Place a toothpick through where the prosciutto overlaps, which should be directly over the top. (Each side will be grilled except the top where the cheese is).Heat a grilled rib pan over medium heat and when hot, brush the top with half the oil.Lay out cubes on their sides (a side with prosciutto) and grill for a minute or so or until slightly crispy. Turn to face up and repeat. Then flip on the other side and repeat.Remove to a serving platter and drizzle with the reserved glaze. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-watermelon-bites-795047', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}