{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598905-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 598905, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cider-Basted Venison', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 791.28, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'3 cups apple cider', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1009016, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'1 1/2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'Zest from 1/2 orange, removed in strips with a vegetable peeler', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'with a vegetable peeler'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'strip', u'unitShort': u'strips', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'strips'}, {u'originalString': u'2 teaspoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'teaspoons'}, {u'originalString': u'4 6-ounce boneless venison loin steaks', u'aisle': u'Meat', u'name': u'venison loin', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/deer-back-backstrap-or-loin.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'liquid', u'id': 17345, u'unit': u'ounce'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://leitesculinaria.com/49403/recipes-cider-basted-venison.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, combine the apple cider, orange zest, and cinnamon stick and bring to a boil. Reduce the heat to medium and simmer, uncovered, until the mixture is slightly syrupy and has reduced to about 1/3 cup, 25 minutes or so.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'id': 1009016, u'name': u'apple cider'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove from the heat, discard the cinnamon and zest, and set aside.2. Season the venison steaks on both sides with salt and pepper. In a medium skillet, heat the oil over medium-high heat. When the oil is hot but not smoking, add the venison steaks and cook, without turning, until nicely browned, about 2 minutes. Turn and repeat on the other side.3. Leave the venison in the skillet and carefully add the butter and half of the cider reduction to the skillet. Continue to cook the venison, spooning the pan juices over the steaks every minute or so and turning the steaks once, for about 5 minutes more, until an instant-read thermometer inserted into the center of a steak registers 130\xb0F (57 \xb0C). Alternatively, if you pierce one steak (yours!) with the tip of a paring knife, it should appear medium-rare, meaning it will be vibrant red, but not raw, at the center.4.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the venison steaks to a cutting board and let rest for 5 minutes. Meanwhile, reduce the pan juices slightly until syrupy and of proper drizzling consistency. If you care to show off the bright red centers of the steaks, slice each steak the long way.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the steaks on plates and drizzle with the reduced pan juices and the remaining cider reduction.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 654, u'instructions': u'1. In a medium saucepan, combine the apple cider, orange zest, and cinnamon stick and bring to a boil. Reduce the heat to medium and simmer, uncovered, until the mixture is slightly syrupy and has reduced to about 1/3 cup, 25 minutes or so. Remove from the heat, discard the cinnamon and zest, and set aside.2. Season the venison steaks on both sides with salt and pepper. In a medium skillet, heat the oil over medium-high heat. When the oil is hot but not smoking, add the venison steaks and cook, without turning, until nicely browned, about 2 minutes. Turn and repeat on the other side.3. Leave the venison in the skillet and carefully add the butter and half of the cider reduction to the skillet. Continue to cook the venison, spooning the pan juices over the steaks every minute or so and turning the steaks once, for about 5 minutes more, until an instant-read thermometer inserted into the center of a steak registers 130\xb0F (57 \xb0C). Alternatively, if you pierce one steak (yours!) with the tip of a paring knife, it should appear medium-rare, meaning it will be vibrant red, but not raw, at the center.4. Transfer the venison steaks to a cutting board and let rest for 5 minutes. Meanwhile, reduce the pan juices slightly until syrupy and of proper drizzling consistency. If you care to show off the bright red centers of the steaks, slice each steak the long way. Place the steaks on plates and drizzle with the reduced pan juices and the remaining cider reduction.', u'spoonacularSourceUrl': u'https://spoonacular.com/cider-basted-venison-598905', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}