{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/214992-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 214992, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stollen buns', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 178.28, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'handful flaked almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'handful'}, {u'originalString': u'2 tbsp brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'tbsp'}, {u'originalString': u'500g strong white bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'g'}, {u'originalString': u'85g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'50g glac\xe9 cherries, roughly chopped', u'aisle': u'Produce;Baking', u'name': u'glace cherries', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-cherries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 93742, u'unit': u'g'}, {u'originalString': u'50g icing sugar, plus more to dust', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [u'plus more to dust'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'zest 1 orange and 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'3 tbsp light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'tbsp'}, {u'originalString': u'400g white marzipan', u'aisle': u'Baking', u'name': u'marzipan', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 93704, u'unit': u'g'}, {u'originalString': u'200ml milk, plus 1 tbsp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'25g mixed peel (optional)', u'aisle': u'Produce;Baking', u'name': u'mixed peel', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 9426, u'unit': u'g'}, {u'originalString': u'3 tsp mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'mixed spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1022035, u'unit': u'tsp'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tbsp black treacle', u'aisle': u'Baking', u'name': u'black treacle', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93774, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp sunflower oil or vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}, {u'originalString': u'7g sachet fast-action yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 18375, u'unit': u'g'}, {u'originalString': u'175g mix of sultanas and raisins', u'aisle': u'?', u'name': u'mix of sultanas and raisins', u'metaInformation': [], u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/69601/stollen-buns', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the first 5 ingredients into a largebowl and mix. Rub in the butter. Or youcan do this in a food processor. Put 200mlmilk, treacle and brandy into a pan andwarm until the treacle melts. Stir well.Beat one of the eggs and the oil into theliquid, then add the whole lot to the dryingredients and mix to a smooth dough.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let it sit for 10 mins, then knead for 1 minon a lightly floured surface until smoothand springy. Put into an oiled bowl, coverwith oiled cling film and leave to rise in awarm place until doubled in size. Leave itovernight in the fridge instead if you havetime – bring the dough back up to roomtemperature before step 3.Lightly flour the work surface. Tip thedough from its bowl and press out intoa rectangle about A4 size. Scatter overthe fruit and zest, knead in until even,then roll out the dough to a rectangleapproximately 50 x 15cm. Squash themarzipan into a cylinder, then roll intoa thick sausage the same length as thedough. Sit it in the middle of the dough,wet the dough a little around the edgesand roll it around the marzipan.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'id': 93704, u'name': u'marzipan'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6and line 3 baking sheets with bakingparchment. Dip a large sharp knife intosome flour and slice into 14 rounds,discarding the very end bits. Flatteneach bun and its marzipan middle alittle with your hand. You can freezethem at this stage. Put onto the sheetswell spaced, then cover with oiled clingfilm and leave to rise until about halftheir size again. Beat the second eggwith 1 tbsp milk and brush it all overthe buns. Sprinkle with almonds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marzipan-or-almond-paste.jpg', u'id': 93704, u'name': u'marzipan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6and bake for 15 mins or until risen andgolden. After a few mins cooling, lift ontoa cooling rack. Melt the icing sugar with4 tbsp just-boiled water, then brush thesyrup all over the buns – be generouswith it. Dust with a little more sugar toserve. Best eaten within 48 hrs.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Dornfelder and Riesling are my top picks for German. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 52, u'instructions': u'Put the first 5 ingredients into a largebowl and mix. Rub in the butter. Or youcan do this in a food processor. Put 200mlmilk, treacle and brandy into a pan andwarm until the treacle melts. Stir well.Beat one of the eggs and the oil into theliquid, then add the whole lot to the dryingredients and mix to a smooth dough.Let it sit for 10 mins, then knead for 1 minon a lightly floured surface until smoothand springy. Put into an oiled bowl, coverwith oiled cling film and leave to rise in awarm place until doubled in size. Leave itovernight in the fridge instead if you havetime – bring the dough back up to roomtemperature before step 3.Lightly flour the work surface. Tip thedough from its bowl and press out intoa rectangle about A4 size. Scatter overthe fruit and zest, knead in until even,then roll out the dough to a rectangleapproximately 50 x 15cm. Squash themarzipan into a cylinder, then roll intoa thick sausage the same length as thedough. Sit it in the middle of the dough,wet the dough a little around the edgesand roll it around the marzipan.Heat oven to 200C/180C fan/gas 6and line 3 baking sheets with bakingparchment. Dip a large sharp knife intosome flour and slice into 14 rounds,discarding the very end bits. Flatteneach bun and its marzipan middle alittle with your hand. You can freezethem at this stage. Put onto the sheetswell spaced, then cover with oiled clingfilm and leave to rise until about halftheir size again. Beat the second eggwith 1 tbsp milk and brush it all overthe buns. Sprinkle with almonds.Heat oven to 200C/180C fan/gas 6and bake for 15 mins or until risen andgolden. After a few mins cooling, lift ontoa cooling rack. Melt the icing sugar with4 tbsp just-boiled water, then brush thesyrup all over the buns – be generouswith it. Dust with a little more sugar toserve. Best eaten within 48 hrs.', u'spoonacularSourceUrl': u'https://spoonacular.com/stollen-buns-214992', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}