{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219526-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 219526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole Wheat Cinnamon Sticky Buns', u'diets': [u'dairy free'], u'pricePerServing': 58.67, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 tablespoon active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup light agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'1 cup amber agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'2 1/2 tablespoons unsweetened apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'liquid', u'id': 9016, u'unit': u'tablespoons'}, {u'originalString': u'1 large baking potato, peeled', u'aisle': u'Produce', u'name': u'baking potato', u'metaInformation': [u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'2 tablespoons unsalted butter or nonhydrogenated butter substitute, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter substitute', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4073, u'unit': u'tablespoons'}, {u'originalString': u'Extra melted butter or butter substitute, for brushing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter substitute', u'metaInformation': [u'melted', u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 4073, u'unit': u'servings'}, {u'originalString': u'2 tablespoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup raisins, soaked in 1 cup boiling water for 10 minutes and drained well', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'boiling', u'drained', u'for 10 minutes and  well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup nonfat dry milk or unsweetened soy milk powder', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [u'unsweetened', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16235, u'unit': u'cup'}, {u'originalString': u'1/2 cup 1 percent low-fat milk or unsweetened soy milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [u'unsweetened', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16235, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup walnuts, lightly toasted and finely ground in a food processor', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'lightly toasted', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'1/2 cup warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'4 to 5 cups sprouted whole wheat flour or whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'cups'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Whole-Wheat-Cinnamon-Sticky-Buns-367910', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the filling, in a large bowl, using an electric mixer, cream the butter with the agave nectar until smooth, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}]}, {u'equipment': [], u'step': u'Add the cinnamon and flour and mix well. Stir in the walnuts and raisins. Refrigerate to firm the mixture for a minimum of 2 hours.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [], u'step': u'Begin the dough by cooking the potato in boiling water for 25 to 30 minutes, until soft.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain, reserving 3/4 cup of the starchy water. Mash the potato and reserved water until smooth. Set aside and cool to room temperature.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the yeast, warm water, and 2 tablespoons of the agave nectar in a food processor. Pulse a few times to dissolve the yeast.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Let this mixture sit about 10 minutes, or until foamy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cooled mashed potato, milk, the remaining \xbc cup agave nectar, the melted butter, and salt. Pulse several times to mix.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the flour a little at a time, pulsing to blend until a soft dough forms.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the dough to a lightly floured surface. Gently knead by hand for approximately 1 minute, or until smooth and elastic.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the kneaded dough into a lightly oiled bowl.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let rest for 20 minutes. Punch down the dough and turn in the bowl to coat with oil. Cover the bowl with plastic wrap and place in a draft-free area to rise.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Let the dough rise until doubled in bulk, about 1 hour.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'While the dough is rising, prepare the glaze.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place all the glaze ingredients in a food processor and blend until smooth, about 1 minute. Refrigerate until ready to use. The mixture will thicken slightly when chilled.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'To prepare the sticky buns, line 2 rectangular jelly roll pans with parchment paper and lightly spray with canola oil spray. Gently punch the dough down.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out on a lightly floured work surface to form an 18- by 20-inch rectangle. (The dough will be sticky to work with.)', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the filling mixture over the dough, leaving a 1-inch border on all sides. Beginning from a long side, carefully roll the dough up to form a long log. Slice the log into 18 equal pieces.', u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the slices onto the prepared pans with the edges of the rolls lightly touching together. Fill 1 pan entirely before starting the next, so most rolls will fit snuggly together.', u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the tops with the melted butter. Cover with a damp kitchen cloth and place in a warm, draft-free area. Allow the rolls to rise for 40 to 45 minutes, until doubled in size.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 19, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375\xb0F.', u'number': 20, u'ingredients': []}, {u'equipment': [], u'step': u'When the rolls are fully risen, bake for 25 minutes, or until lightly golden.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 21, u'ingredients': []}, {u'equipment': [], u'step': u'Let the rolls cool on the pans for 10 to 15 minutes before drizzling with the glaze. Pull apart gently to serve. Best served warm.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 22, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Store the leftover rolls in the refrigerator and reheat in a 350\xb0F oven for 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 23, u'ingredients': []}, {u'equipment': [], u'step': u"Reprinted with permission from Baking with Agave Nectar: Over 100 Recipes Using Nature's Ultimate Sweetener by Ania Catalano. Copyright \xa9 2008 by Ania Catalano; photography \xa9 2008 by Lara Hata. Published by Celestial Arts, an imprint of the Crown Publishing Group, a division of Random House, Inc., New York.Ania Catalano is a graduate of the Natural Gourmet School of Cooking in New York and the owner of the Gourmet Whole Foods Catering and Cooking School in Milford, Connecticut.", u'number': 24, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 228, u'instructions': u"Preparation                                                        To make the filling, in a large bowl, using an electric mixer, cream the butter with the agave nectar until smooth, about 2 minutes. Add the cinnamon and flour and mix well. Stir in the walnuts and raisins. Refrigerate to firm the mixture for a minimum of 2 hours.                                                                Begin the dough by cooking the potato in boiling water for 25 to 30 minutes, until soft. Drain, reserving 3/4 cup of the starchy water. Mash the potato and reserved water until smooth. Set aside and cool to room temperature.                                                                Place the yeast, warm water, and 2 tablespoons of the agave nectar in a food processor. Pulse a few times to dissolve the yeast. Let this mixture sit about 10 minutes, or until foamy. Add the cooled mashed potato, milk, the remaining \xbc cup agave nectar, the melted butter, and salt. Pulse several times to mix. Add the flour a little at a time, pulsing to blend until a soft dough forms. Transfer the dough to a lightly floured surface. Gently knead by hand for approximately 1 minute, or until smooth and elastic. Place the kneaded dough into a lightly oiled bowl. Let rest for 20 minutes. Punch down the dough and turn in the bowl to coat with oil. Cover the bowl with plastic wrap and place in a draft-free area to rise. Let the dough rise until doubled in bulk, about 1 hour.                                                                While the dough is rising, prepare the glaze. Place all the glaze ingredients in a food processor and blend until smooth, about 1 minute. Refrigerate until ready to use. The mixture will thicken slightly when chilled.                                                                To prepare the sticky buns, line 2 rectangular jelly roll pans with parchment paper and lightly spray with canola oil spray. Gently punch the dough down. Roll out on a lightly floured work surface to form an 18- by 20-inch rectangle. (The dough will be sticky to work with.) Spread the filling mixture over the dough, leaving a 1-inch border on all sides. Beginning from a long side, carefully roll the dough up to form a long log. Slice the log into 18 equal pieces. Place the slices onto the prepared pans with the edges of the rolls lightly touching together. Fill 1 pan entirely before starting the next, so most rolls will fit snuggly together. Brush the tops with the melted butter. Cover with a damp kitchen cloth and place in a warm, draft-free area. Allow the rolls to rise for 40 to 45 minutes, until doubled in size.                                                                 Preheat the oven to 375\xb0F.                                                                When the rolls are fully risen, bake for 25 minutes, or until lightly golden. Let the rolls cool on the pans for 10 to 15 minutes before drizzling with the glaze. Pull apart gently to serve. Best served warm.                                                                Store the leftover rolls in the refrigerator and reheat in a 350\xb0F oven for 10 minutes before serving.                                                                            Reprinted with permission from Baking with Agave Nectar: Over 100 Recipes Using Nature's Ultimate Sweetener by Ania Catalano. Copyright \xa9 2008 by Ania Catalano; photography \xa9 2008 by Lara Hata. Published by Celestial Arts, an imprint of the Crown Publishing Group, a division of Random House, Inc., New York.Ania Catalano is a graduate of the Natural Gourmet School of Cooking in New York and the owner of the Gourmet Whole Foods Catering and Cooking School in Milford, Connecticut.", u'spoonacularSourceUrl': u'https://spoonacular.com/whole-wheat-cinnamon-sticky-buns-219526', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}