{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/720384-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 720384, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Chia Pudding', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 181.98, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'\xbc cup chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12006, u'unit': u'cup'}, {u'originalString': u'Sprinkle of cocoa powder, mini chocolate chips or finely chopped dark chocolate, toasted coconut, cinnamon, etc.', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'mini', u'toasted', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'servings'}, {u'originalString': u'6 large dates', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9087, u'unit': u''}, {u'originalString': u'Fresh fruit: berries, sliced bananas, chopped pineapple, etc.', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'fresh', u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9431, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u"⅔ cup raw cashews (if you don't have a high-powered blender, these will likely need to be soaked in water for 2 to 4 hours, then drained)", u'aisle': u'Nuts;Savory Snacks', u'name': u'raw cashews', u'metaInformation': [u'raw', u'drained', u'for 2 to 4 hours, then )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'Pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'\xbd teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://cookieandkate.com/2016/creamy-chia-pudding-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"In a liquid measuring cup, combine the water and chia seeds. Set aside until the mixture forms a gel, about 20 minutes.If your dates aren't soft and plump, place them in a bowl and pour hot water over them. Set aside for up to 20 minutes, or until the chia seeds are ready.", u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'id': 12006, u'name': u'chia seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Drain.Pit the dates. In a blender, combine the pitted dates with the cashews, cinnamon, vanilla and salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Pour in half or more of the chia gel (I prefer chia seeds in their blended state, so I poured in almost all of mine). Puree until smooth. If your pudding gets warm in the process, you'll need to chill it until cool.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'id': 12006, u'name': u'chia seeds'}]}, {u'equipment': [], u'step': u"Serve individual portions of pudding with any remaining chia gel swirled in. Top with any garnishes you'd like. Store leftovers in the refrigerator.", u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 491, u'instructions': u"In a liquid measuring cup, combine the water and chia seeds. Set aside until the mixture forms a gel, about 20 minutes.If your dates aren't soft and plump, place them in a bowl and pour hot water over them. Set aside for up to 20 minutes, or until the chia seeds are ready. Drain.Pit the dates. In a blender, combine the pitted dates with the cashews, cinnamon, vanilla and salt. Pour in half or more of the chia gel (I prefer chia seeds in their blended state, so I poured in almost all of mine). Puree until smooth. If your pudding gets warm in the process, you'll need to chill it until cool.Serve individual portions of pudding with any remaining chia gel swirled in. Top with any garnishes you'd like. Store leftovers in the refrigerator.", u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chia-pudding-720384', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}