{u'recipes': [{u'sourceName': u"So How's it Taste", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/495678-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 495678, u'veryPopular': False, u'lowFodmap': False, u'title': u'Soba Noodle Salad', u'diets': [u'dairy free'], u'pricePerServing': 357.28, u'creditText': u"So How's it Taste", u'extendedIngredients': [{u'originalString': u'3 tbsp. creamy almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12195, u'unit': u'tbsp'}, {u'originalString': u'1 bell pepper, thinly sliced', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'3 tbsp. black sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'black sesame seeds', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-sesame-seeds-or-chia-seeds.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10012023, u'unit': u'tbsp'}, {u'originalString': u'1 hothouse cucumber, peeled, halved lengthwise, thinly sliced', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'peeled', u'halved lengthwise', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 (1-inch) piece fresh ginger, peeled & coarsely chopped', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'peeled', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'1 tbsp. honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup fresh lime juice (from 2 large limes)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'large', u'(from 2 limes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'3 tbsp. reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'tbsp'}, {u'originalString': u'1 (1 1/2 lb.) head napa cabbage, cored & shredded', u'aisle': u'Produce', u'name': u'napa cabbage leaves', u'metaInformation': [u'shredded', u'cored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/napa-cabbage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10011970, u'unit': u'lb'}, {u'originalString': u'3 tbsp. extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'Salad', u'aisle': u'Produce', u'name': u'salad mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 21052, u'unit': u'servings'}, {u'originalString': u'3 scallions, white and green parts, thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'white', u'green', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tbsp. sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 43016, u'unit': u'servings'}, {u'originalString': u'1/2 cup slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012061, u'unit': u'cup'}, {u'originalString': u'8 oz. dried buckwheat soba noodles (use a brand that is 100% buckwheat for a gluten free meal)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'soba noodles', u'metaInformation': [u'dried', u'gluten free', u'100%', u'for a  meal)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20114, u'unit': u'oz'}, {u'originalString': u'2 tsp. wasabi paste', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'wasabi paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi-paste.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10011990, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}], u'healthScore': 65.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.sohowsittaste.com/2014/03/soba-noodle-salad.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of salted water to a boil over high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the noodles and cook, stirring occasionally, until tender but still firm to the bite, 4 to 5 minutes. Rinse well in cold water, drain, and put in a serving boil.2. For the dressing, in a blender or food processor combine all dressing ingredients. Blend until smooth.3. For the salad, pour the dressing over the pasta.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add all salad ingredients except for sesame seeds. Toss until all ingredients are coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [], u'step': u'Garnish with the sesame seeds and serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'1. Bring a large pot of salted water to a boil over high heat. Add the noodles and cook, stirring occasionally, until tender but still firm to the bite, 4 to 5 minutes. Rinse well in cold water, drain, and put in a serving boil.2. For the dressing, in a blender or food processor combine all dressing ingredients. Blend until smooth.3. For the salad, pour the dressing over the pasta. Add all salad ingredients except for sesame seeds. Toss until all ingredients are coated. Garnish with the sesame seeds and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/soba-noodle-salad-495678', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}