{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/550011-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 550011, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fontina Spinach and Artichoke Breakfast Pasta Hash', u'diets': [], u'preparationMinutes': 2, u'pricePerServing': 300.39, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'1 pound angle hair pasta', u'aisle': u'Pasta and Rice', u'name': u'angel hair pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angelhair.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10020420, u'unit': u'pound'}, {u'originalString': u'8 ounces cremini mushrooms, sliced', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11266, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried dill', u'aisle': u'Spices and Seasonings', u'name': u'dried dill', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2017, u'unit': u'teaspoon'}, {u'originalString': u'6-8 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 ounces fontina cheese, half diced, half shredded (or more!)', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'diced', u'shredded', u'(!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1020, u'unit': u'ounces'}, {u'originalString': u'16 ounces frozen chopped spinach, thawed', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'thawed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11463, u'unit': u'ounces'}, {u'originalString': u'2 cloves garlic minced or grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2-3 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'12 ounces marinated artichokes hearts, drained', u'aisle': u'Canned and Jarred', u'name': u'marinated artichokes', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 93828, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'lots of chopped parsley for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'6 slices thick cut bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick cut', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.halfbakedharvest.com/fontina-spinach-artichoke-breakfast-pasta-hash/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of salted water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pasta and prepare according to directions.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 374.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Drain and set aside. Preheat the oven to 374 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet (mine was 12 inches) over medium-high heat and cook bacon until crispy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove to a paper towel-lined plate.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove all but one tablespoon of bacon fat from the pan, then add the olive oil and heat over high heat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add garlic and saute for 30 seconds.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"Add the mushrooms in a single layer. Don't stir them!", u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Let them sizzle until they have caramelized on the bottom, about 2 minutes. When the bottoms are caramelized, toss them once and season with salt and pepper, to taste.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add the dill, oregano, crushed red pepper and pepper. Stir in the thawed spinach and artichokes and gently stir everything to combine. Cook another 2-3 minutes until heated through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Add half of the pasta, the cubes of fontina and a drizzle of olive oil, toss well, adding in more pasta if desired. Create small wells for the eggs and carefully crack the eggs into the wells. Sprinkle the eggs with salt and pepper and then add the remaining shredded cheese.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Drizzle the cream over the eggs.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the whole skillet in the oven and bake until the whites are just set but yolks are still runny, about 15 to 18 minutes. If you want to brown the cheese a bit more turn the broiler on for 30 seconds, but the eggs will probably not be runny anymore.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and add the crispy bacon.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Garnish with chopped parsley. EAT!', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1810, u'instructions': u"Bring a large pot of salted water to a boil. Add the pasta and prepare according to directions. Drain and set aside. Preheat the oven to 374 degrees F.Heat a large skillet (mine was 12 inches) over medium-high heat and cook bacon until crispy. Remove to a paper towel-lined plate. Remove all but one tablespoon of bacon fat from the pan, then add the olive oil and heat over high heat. Add garlic and saute for 30 seconds. Add the mushrooms in a single layer. Don't stir them! Let them sizzle until they have caramelized on the bottom, about 2 minutes. When the bottoms are caramelized, toss them once and season with salt and pepper, to taste. Add the dill, oregano, crushed red pepper and pepper. Stir in the thawed spinach and artichokes and gently stir everything to combine. Cook another 2-3 minutes until heated through.Add half of the pasta, the cubes of fontina and a drizzle of olive oil, toss well, adding in more pasta if desired. Create small wells for the eggs and carefully crack the eggs into the wells. Sprinkle the eggs with salt and pepper and then add the remaining shredded cheese. Drizzle the cream over the eggs. Place the whole skillet in the oven and bake until the whites are just set but yolks are still runny, about 15 to 18 minutes. If you want to brown the cheese a bit more turn the broiler on for 30 seconds, but the eggs will probably not be runny anymore. Remove from the oven and add the crispy bacon. Garnish with chopped parsley. EAT!", u'spoonacularSourceUrl': u'https://spoonacular.com/fontina-spinach-and-artichoke-breakfast-pasta-hash-550011', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}