{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577701-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 577701, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crispy Baked Onion Rings', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 77.44, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'3/4 cup All Purpose Flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Cajun Seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032028, u'unit': u'teaspoons'}, {u'originalString': u'2-3 Egg Whites,', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'Kosher Salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1-1/2 cups Panko', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cups'}, {u'originalString': u'2-3 Sweet Onions, Sliced', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.simplyscratch.com/2012/04/crispy-baked-onion-rings.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Preheat your oven to 400 degrees and line two rimmed sheet pans with parchment paper.Trim of the ends of two sweet onions and peel back any tough layers and discard. Slice into 1/2 inch rings and separate the rings. (You may not need a third onion, I always buy one more in case any slicing errors occur)Grab three shallow dishes; one for the flour, panko {seasonings if you're using any} and the egg whites. Dredge the onion rings first in the flour and shake off any excess. Then dip in the egg whites and toss in the panko.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'id': 11294, u'name': u'sweet onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}]}, {u'equipment': [], u'step': u'Place in a single layer on the rimmed sheets.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake in your preheated oven at 400 degrees for a total of twenty minutes. If you're baking two pans at the same time be sure to swap the pans on the racks at the ten minute mark (there is no need to flip the onion rings).", u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and season with a smidgen of salt before serving them with your favorite dipping condiment.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Villa Sandi Fresco Prosecco. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'This wine is featured at Starbucks\xae locations where their Evenings menu is offered.Very pale straw yellow and fine, persistent perlage. The aromais fruity and flowery with hints of ripe golden apple and smallmountain flowers. The dry, fresh and flavoursome sensation onthe palate is followed by a fruity and harmonious aftertaste.', u'title': u'Villa Sandi Fresco Prosecco', u'price': u'$12.99', u'id': 450027, u'link': u'https://www.wine.com/product/villa-sandi-fresco-prosecco/105669', u'imageUrl': u'https://spoonacular.com/productImages/450027-312x231.jpg'}]}, u'aggregateLikes': 981, u'instructions': u"Preheat your oven to 400 degrees and line two rimmed sheet pans with parchment paper.Trim of the ends of two sweet onions and peel back any tough layers and discard. Slice into 1/2 inch rings and separate the rings. (You may not need a third onion, I always buy one more in case any slicing errors occur)Grab three shallow dishes; one for the flour, panko {seasonings if you're using any} and the egg whites. Dredge the onion rings first in the flour and shake off any excess. Then dip in the egg whites and toss in the panko. Place in a single layer on the rimmed sheets. Bake in your preheated oven at 400 degrees for a total of twenty minutes. If you're baking two pans at the same time be sure to swap the pans on the racks at the ten minute mark (there is no need to flip the onion rings). Remove and season with a smidgen of salt before serving them with your favorite dipping condiment.", u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-baked-onion-rings-577701', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}