{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532939-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532939, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mini Mushroom and Arugula Quiches', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 159.1, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'2 Tbsp. chopped arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'Tbsp'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp. minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1 green onion, chopped', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 large mushrooms, sliced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u"1/2 lb. of your favorite pastry/pie dough (about the amount you'd need to make one regular sized pie shell)", u'aisle': u'Refrigerated;Frozen', u'name': u'pastry dough', u'metaInformation': [u'your favorite', u"( the amount you'd need to make one regular sized pie shell)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dough.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10018338, u'unit': u'lb'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup shredded white cheddar cheese (parmesan would work here, too)', u'aisle': u'Cheese', u'name': u'white cheddar cheese', u'metaInformation': [u'shredded', u'white', u'(parmesan would work here, too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1011009, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/mini-mushroom-and-arugula-quiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Press your dough into three 4-inch mini tart pans.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake according to recipe or package directions. When fully cooked, remove from oven and prepare filling.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together eggs, onion, garlic, arugula, salt, pepper, and milk. Stir in mushrooms and cheese.Fill quiche shells with egg mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake at 325 for 20-25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve alone or pair with an arugula, spinach and mushroom salad with a light vinaigrette. That combo made for a pretty great lunch. Just sayin’.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 454, u'instructions': u'Press your dough into three 4-inch mini tart pans. Bake according to recipe or package directions. When fully cooked, remove from oven and prepare filling.Whisk together eggs, onion, garlic, arugula, salt, pepper, and milk. Stir in mushrooms and cheese.Fill quiche shells with egg mixture.Bake at 325 for 20-25 minutes.Serve alone or pair with an arugula, spinach and mushroom salad with a light vinaigrette. That combo made for a pretty great lunch. Just sayin’.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-mushroom-and-arugula-quiches-532939', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}