{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/695177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 695177, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lahmahjoon Pizza', u'diets': [u'gluten free'], u'preparationMinutes': 45, u'pricePerServing': 110.44, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1/3 cup crumbled feta', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'2 tablespoons minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces ground lamb', u'aisle': u'Meat', u'name': u'ground lamb', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 17224, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tablespoon'}, {u'originalString': u'4 medium plum tomatoes, chopped', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'1 tablespoon pomegranate molasses, (see Shopping Tip)', u'aisle': u'Alcoholic Beverages', u'name': u'pomegranate molasses', u'metaInformation': [u'(see Shopping Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grenadine.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10042040, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/lahmahjoon_pizza.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Tips: Pomegranate molasses has a bright, tangy flavor. (Don't confuse it with sweet grenadine syrup, which contains little or no pomegranate juice.) Find it in Middle Eastern markets and some large supermarkets near the vinegar or molasses. To make your own: Simmer 4 cups pomegranate juice, uncovered, in a medium nonreactive saucepan over medium heat until thick enough to coat the back of a spoon, 45 to 50 minutes. (Do not let the syrup reduce too much or it will darken and become very sticky.) Makes about 1/2 cup (25 calories per tablespoon). Refrigerate the molasses in an airtight container for up to 3 months.To roll out pizza dough: When you're ready to get your pizzas on the grill, turn the dough out onto a lightly floured surface. Dust the top with flour; dimple with your fingertips to shape into a thick, flattened circledon't worry if it's not perfectly symmetrical. Then use a rolling pin to roll into a circle about 14 inches in diameter.Variations:Pizza on a charcoal grill: Light 6 quarts (about 1 large chimney starter full) of charcoal and burn until the coals are mostly white, about 20 minutes.", u'length': {u'number': 65, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 10042040, u'name': u'pomegranate molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grenadine.jpg', u'id': 10042040, u'name': u'grenadine'}]}, {u'equipment': [], u'step': u'Spread the coals in an even layer.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place a grate over the coals.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Let the coals burn until they are about medium-low. (Grill any toppings for the pizza while the coals are burning down.) To test the heat, hold your palm about 5 inches above the grill rack; if you can hold it there for about 8 seconds before you need to move it away, the fire is medium-low.', u'number': 4, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place a pizza stone on the lowest rack; preheat oven to 450F for at least 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll out the dough and place on a cornmeal-dusted pizza peel or inverted baking sheet, using enough cornmeal so that the dough slides easily. Slide the dough onto the preheated stone and cook until the bottom begins to crisp, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the crust from the oven using a large spatula and place it uncooked-side down on the peel or baking sheet, making sure the underside of the crust is completely coated with cornmeal. Quickly add the toppings and slide the pizza back onto the stone. Continue baking until the toppings are hot and the bottom of the crust has browned, 12 to 15 minutes.Individual variation: The dough can be turned into 4 or 6 personal-size pizzas. After kneading, divide the dough into 4 or 6 equal balls.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush with oil and place 3 inches apart on a baking sheet. Cover and set aside until doubled in size, about 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Roll each portion into a 6-to-8-inch circle.', u'number': 5, u'ingredients': []}], u'name': u'Transfer the crust to the grill rack, cover the grill and cook the crust, checking once or twice, until lightly browned, 3 to 4 minutes. Flip the crust, quickly add the toppings, cover the grill and cook until the toppings are hot and the bottom of the crust has browned, 5 to 8 minutes. If your crust browns faster than your toppings are cooking, slide a baking sheet under the pizza to keep the crust from burning while the toppings finish.Pizza in the oven'}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Cecchi Chianti Classico Riserva di Famiglia with a 4.1 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Chianti Classico Riserva di Famiglia is certainly the most representative wine of Cecchi. Produced only in years in which the grapes reach the quality desired it comes from the area of Castellina in Chianti. The color of excellent limpidity is of an intense ruby red. The aroma reveals broad and ethereal notes of ripe fruit and spices. The structure is elegant.', u'title': u'Cecchi Chianti Classico Riserva di Famiglia', u'price': u'$26.99', u'id': 459422, u'link': u'https://www.wine.com/product/cecchi-chianti-classico-riserva-di-famiglia-2014/240545', u'imageUrl': u'https://spoonacular.com/productImages/459422-312x231.jpg'}]}, u'aggregateLikes': 433, u'instructions': u"Tips: Pomegranate molasses has a bright, tangy flavor. (Don't confuse it with sweet grenadine syrup, which contains little or no pomegranate juice.) Find it in Middle Eastern markets and some large supermarkets near the vinegar or molasses. To make your own: Simmer 4 cups pomegranate juice, uncovered, in a medium nonreactive saucepan over medium heat until thick enough to coat the back of a spoon, 45 to 50 minutes. (Do not let the syrup reduce too much or it will darken and become very sticky.) Makes about 1/2 cup (25 calories per tablespoon). Refrigerate the molasses in an airtight container for up to 3 months.To roll out pizza dough: When you're ready to get your pizzas on the grill, turn the dough out onto a lightly floured surface. Dust the top with flour; dimple with your fingertips to shape into a thick, flattened circledon't worry if it's not perfectly symmetrical. Then use a rolling pin to roll into a circle about 14 inches in diameter.Variations:Pizza on a charcoal grill: Light 6 quarts (about 1 large chimney starter full) of charcoal and burn until the coals are mostly white, about 20 minutes. Spread the coals in an even layer. Place a grate over the coals. Let the coals burn until they are about medium-low. (Grill any toppings for the pizza while the coals are burning down.) To test the heat, hold your palm about 5 inches above the grill rack; if you can hold it there for about 8 seconds before you need to move it away, the fire is medium-low. Transfer the crust to the grill rack, cover the grill and cook the crust, checking once or twice, until lightly browned, 3 to 4 minutes. Flip the crust, quickly add the toppings, cover the grill and cook until the toppings are hot and the bottom of the crust has browned, 5 to 8 minutes. If your crust browns faster than your toppings are cooking, slide a baking sheet under the pizza to keep the crust from burning while the toppings finish.Pizza in the oven: Place a pizza stone on the lowest rack; preheat oven to 450F for at least 20 minutes. Roll out the dough and place on a cornmeal-dusted pizza peel or inverted baking sheet, using enough cornmeal so that the dough slides easily. Slide the dough onto the preheated stone and cook until the bottom begins to crisp, about 3 minutes. Remove the crust from the oven using a large spatula and place it uncooked-side down on the peel or baking sheet, making sure the underside of the crust is completely coated with cornmeal. Quickly add the toppings and slide the pizza back onto the stone. Continue baking until the toppings are hot and the bottom of the crust has browned, 12 to 15 minutes.Individual variation: The dough can be turned into 4 or 6 personal-size pizzas. After kneading, divide the dough into 4 or 6 equal balls. Brush with oil and place 3 inches apart on a baking sheet. Cover and set aside until doubled in size, about 1 hour. Roll each portion into a 6-to-8-inch circle.", u'spoonacularSourceUrl': u'https://spoonacular.com/lahmahjoon-pizza-695177', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}