{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/753527-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 753527, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Vegetables with Chipotle Cream', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 158.22, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 teaspoon light agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'teaspoon'}, {u'originalString': u'1 small (1-pound) butternut squash, peeled, seeded and diced into 1/2-inch cubes (3 cups)', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'diced', u'small', u'peeled', u'seeded', u'(3 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u'pound'}, {u'originalString': u'1 15-ounce can kidney beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16034, u'unit': u'ounce'}, {u'originalString': u'1 small canned chipotle pepper, finely diced', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper', u'metaInformation': [u'diced', u'canned', u'small', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup plain nonfat (0-percent) Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain', u'(0-percent)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 teaspoons dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'1 red bell pepper, cut into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'2 whole wheat pita breads', u'aisle': u'Bakery/Bread', u'name': u'whole wheat pita breads', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18042, u'unit': u''}, {u'originalString': u'2 medium zucchini, cut into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 64.0, u'imageType': u'jpeg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/roasted-vegetables-with-chipotle-cream.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the roasted vegetables: Position an oven rack in the center of the oven and preheat the oven to 425 degrees F. Spray a heavy baking sheet with vegetable oil cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, toss together the butternut squash, zucchini, bell peppers, kidney beans, oil, cumin, oregano and salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread the mixture in a single layer on the baking sheet. Roast until the vegetables are golden and tender, 25 to 30 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Split the pita breads in half horizontally to make 4 rounds. Arrange in a single layer on a heavy baking sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until crisp, 7 to 8 minutes. Set aside to cool.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the chipotle cream: In a small bowl, mix together the yogurt, lime juice, agave and chipotle pepper until smooth.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}]}, {u'equipment': [], u'step': u'Spoon the vegetable mixture on top of the crispy pitas and serve with a dollop of the chipotle cream.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1729, u'instructions': u'For the roasted vegetables: Position an oven rack in the center of the oven and preheat the oven to 425 degrees F. Spray a heavy baking sheet with vegetable oil cooking spray.                          In a medium bowl, toss together the butternut squash, zucchini, bell peppers, kidney beans, oil, cumin, oregano and salt. Spread the mixture in a single layer on the baking sheet. Roast until the vegetables are golden and tender, 25 to 30 minutes.                          Split the pita breads in half horizontally to make 4 rounds. Arrange in a single layer on a heavy baking sheet. Bake until crisp, 7 to 8 minutes. Set aside to cool.                          For the chipotle cream: In a small bowl, mix together the yogurt, lime juice, agave and chipotle pepper until smooth.                          Spoon the vegetable mixture on top of the crispy pitas and serve with a dollop of the chipotle cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-vegetables-with-chipotle-cream-753527', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}