{u'recipes': [{u'sourceName': u'She Wears Many Hats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/680994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 680994, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Piccata', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 244.17, u'creditText': u'She Wears Many Hats', u'extendedIngredients': [{u'originalString': u'3 tablespoons butter, divided, plus more as needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided', u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'4 (6-ounce) skinless, boneless chicken breast butterflied and pounded thin', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'boneless', u'skinless', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 5062, u'unit': u'ounce'}, {u'originalString': u'\xbd cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'\xbd cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'\xbc chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u''}, {u'originalString': u'1 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil, plus more as needed', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon minced shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://shewearsmanyhats.com/chicken-piccata-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add olive oil and 2 tablespoons butter and warm to a ripple. Test with a pinch of flour to see if it sizzles.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together flour, salt and pepper in a shallow dish.Lightly dredge chicken breast in flour; tap of excess.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to skillet. Work in batches if needed, cook about 3 minutes each side until done and golden, adding more oil and butter as needed.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Remove chicken and place on paper-towel lined plate. Cover.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add wine and minced shallot to skillet scraping any bits from bottom of pan, stir for 30 seconds. Stir in chicken broth, lemon juice, capers and fresh parsley, stirring occasionally, bring to a simmer and simmer for 4-5 more minutes. Sauce should reduce and slightly thicken.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in 1 tablespoon butter until smooth.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add cooked chicken back to pan coating both sides with sauce.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chicken Piccata works really well with Sauvignon Blanc and Gruener Veltliner. Both Gr\xfcner Veltliner and Sauvignon Blanc have citrus and herbal flavors that complement chicken piccata's lemon and parsley. The Prophecy Sauvignon Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 10 dollars per bottle.", u'pairedWines': [u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u"Prophecy Sauvignon Blanc showcases the best of New Zealand's renowned Marlborough region. Aromas of grapefruit, lychee and lime zest lead to flavors of mandarin orange and green apple, followed by delicate notes of mineral and white tea. View More", u'title': u'Prophecy Sauvignon Blanc', u'price': u'$9.99', u'id': 457486, u'link': u'https://www.wine.com/product/prophecy-sauvignon-blanc-2015/162378', u'imageUrl': u'https://spoonacular.com/productImages/457486-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Heat skillet over medium heat. Add olive oil and 2 tablespoons butter and warm to a ripple. Test with a pinch of flour to see if it sizzles.Whisk together flour, salt and pepper in a shallow dish.Lightly dredge chicken breast in flour; tap of excess. Add to skillet. Work in batches if needed, cook about 3 minutes each side until done and golden, adding more oil and butter as needed. Remove chicken and place on paper-towel lined plate. Cover.Add wine and minced shallot to skillet scraping any bits from bottom of pan, stir for 30 seconds. Stir in chicken broth, lemon juice, capers and fresh parsley, stirring occasionally, bring to a simmer and simmer for 4-5 more minutes. Sauce should reduce and slightly thicken. Whisk in 1 tablespoon butter until smooth.Add cooked chicken back to pan coating both sides with sauce.Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-piccata-680994', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}