{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/617224-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 617224, u'veryPopular': False, u'lowFodmap': False, u'title': u"Julia Child's Favorite Roast Chicken", u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 1227.55, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1/2 cup carrots, sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1/3 cup celery, finely diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'Handful of celery leaves', u'aisle': u'Produce', u'name': u'celery leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'Handful'}, {u'originalString': u'1 3 1/2- to 4-pound chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.5, u'consistency': u'solid', u'id': 1025006, u'unit': u'pound'}, {u'originalString': u'3/4 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'6 1/8-inch-thick lemon slices', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 6.125, u'consistency': u'solid', u'id': 9150, u'unit': u'inch'}, {u'originalString': u'1 tbsp fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'Handful of fresh parsley stems', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Handful'}, {u'originalString': u'Sea Salt and freshly ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'serving'}, {u'originalString': u'2 fresh thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'2 1/2 tbsp unsalted butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup of water (to help veggies from burning if needed)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(to help veggies from burning if needed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 96.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2014/10/julia-childs-favorite-roast-chicken.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 107, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 425. Melt 1 tablespoon of the butter in a skillet.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Add the diced carrots, onion, and celery then cook over medium heat until softened; add the thyme sprigs.Wash the chicken inside and out then pat dry. Pull the neck skin up over the breast and secure it to the back with a toothpick. Salt and pepper the cavity and spoon in the cooked vegetables, a handful of parsley stems, celery leaves, and the lemon slices. Massage the chicken all over with 1 tablespoon of the butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'id': 11143, u'name': u'celery leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a roasting rack in a roasting pan.  Salt the chicken all over and set it breast up on a rack in the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush the lemon juice over the chicken. If necessary, add 1/2 cup of water to the vegetables to prevent burning.* At 60 minutes: Baste the chicken with the pan juices. Test for doneness: The drumsticks should move easily in their sockets; their flesh should feel somewhat soft. If not, continue roasting, basting and testing every 7 to 8 minutes, until an instant-read thermometer registers 165.', u'length': {u'number': 67, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the chicken rest on a carving board for 15 minutes before slicing. Spoon all but 1 tablespoon of fat from the juices in the pan.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add the stock and boil until slightly syrupy, 5 minutes. Strain the sauce; you will have just enough to bathe each serving with a spoonful.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the sliced chicken and sauce with carrots and onions on the side. Enjoy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u'Brush the chicken with the remaining 1/2 tablespoon of butter. Scatter the sliced onion and carrot all around. Reduce the oven temperature to 350 degrees.* At 45 minutes'}, {u'steps': [], u'name': u'Place the chicken into the oven and Roast for about 1 hour and 15 minutes, as follows* At 15 minutes'}], u'winePairing': {u'pairingText': u'Roasted Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Preheat the oven to 425. Melt 1 tablespoon of the butter in a skillet. Add the diced carrots, onion, and celery then cook over medium heat until softened; add the thyme sprigs.Wash the chicken inside and out then pat dry. Pull the neck skin up over the breast and secure it to the back with a toothpick. Salt and pepper the cavity and spoon in the cooked vegetables, a handful of parsley stems, celery leaves, and the lemon slices. Massage the chicken all over with 1 tablespoon of the butter. Place a roasting rack in a roasting pan.  Salt the chicken all over and set it breast up on a rack in the pan. Place the chicken into the oven and Roast for about 1 hour and 15 minutes, as follows:* At 15 minutes: Brush the chicken with the remaining 1/2 tablespoon of butter. Scatter the sliced onion and carrot all around. Reduce the oven temperature to 350 degrees.* At 45 minutes: Brush the lemon juice over the chicken. If necessary, add 1/2 cup of water to the vegetables to prevent burning.* At 60 minutes: Baste the chicken with the pan juices. Test for doneness: The drumsticks should move easily in their sockets; their flesh should feel somewhat soft. If not, continue roasting, basting and testing every 7 to 8 minutes, until an instant-read thermometer registers 165.Let the chicken rest on a carving board for 15 minutes before slicing. Spoon all but 1 tablespoon of fat from the juices in the pan. Add the stock and boil until slightly syrupy, 5 minutes. Strain the sauce; you will have just enough to bathe each serving with a spoonful. Serve the sliced chicken and sauce with carrots and onions on the side. Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/julia-childs-favorite-roast-chicken-617224', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}