{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508009-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 508009, u'veryPopular': True, u'lowFodmap': False, u'title': u'Frozen Hot Chocolate', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 151.2, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'3 ounces chocolate (milk, semisweet or dark), finely chopped', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'finely chopped', u'(milk, semisweet or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'4\xbd teaspoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'3 cups ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cups'}, {u'originalString': u'1\xbd cups milk, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 teaspoons Ovaltine', u'aisle': u'Tea and Coffee', u'name': u'ovaltine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 14557, u'unit': u'teaspoons'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.browneyedbaker.com/2012/07/24/frozen-hot-chocolate-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chocolate in a medium bowl set over a saucepan with about 1 inch of barely simmering water (keep the heat on low). Stir the chocolate occasionally, until it is completely melted and smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the sugar and Ovaltine and whisk to combine completely.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder', u'id': 14557, u'name': u'ovaltine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from the heat and slowly whisk in \xbd cup of the milk until smooth. Allow to cool to room temperature.2. In a blender, place the remaining 1 cup of milk, the chocolate mixture and the ice. Blend on high speed until smooth and slushy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Pour into servings glasses and top with whipped cream and chocolate shavings.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 4795, u'instructions': u'1. Place the chocolate in a medium bowl set over a saucepan with about 1 inch of barely simmering water (keep the heat on low). Stir the chocolate occasionally, until it is completely melted and smooth. Add the sugar and Ovaltine and whisk to combine completely. Remove from the heat and slowly whisk in \xbd cup of the milk until smooth. Allow to cool to room temperature.2. In a blender, place the remaining 1 cup of milk, the chocolate mixture and the ice. Blend on high speed until smooth and slushy. Pour into servings glasses and top with whipped cream and chocolate shavings.', u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-hot-chocolate-508009', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}