{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/702143-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 702143, u'veryPopular': False, u'lowFodmap': False, u'title': u'Perfect Macaroni and Cheese', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 200.68, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'\xbc pound white American cheese (not cheese food but real cheese)', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [u'white', u'(not cheese food but real cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1253, u'unit': u'pound'}, {u'originalString': u'\xbc pound brie, with outer skinless and discarded', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [u'skinless', u'with outer  and discarded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1006, u'unit': u'pound'}, {u'originalString': u'\xbd tablespoon melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'⅛ teaspoon cayenne', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon fresh nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'fresh nutmeg', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 pound elbow macaroni noodles (we used Cellentani pasta which looks like a longer twisty elbow noodle)', u'aisle': u'Pasta and Rice', u'name': u'gluten-free elbow macaroni noodles', u'metaInformation': [u'(we used Cellentani pasta which looks like a longer twisty elbow noodle)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10398875, u'unit': u'pound'}, {u'originalString': u'\xbe cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup seasoned bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}, {u'originalString': u'1 pound sharp cheddar cheese shredded (use a good brand and not a cheaper supermarket brand – the extra cost pays off in much better flavor)', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded', u'good', u'(use a brand and not a cheaper supermarket brand - the extra cost pays off in much better flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'pound'}, {u'originalString': u'\xbc cup finely shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2032, u'unit': u'teaspoon'}, {u'originalString': u'3 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'\xbd teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.afamilyfeast.com/perfect-macaroni-and-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Preheat oven to 375 degrees F.Bring a large pot of water to a boil and keep at a simmer until you are ready to cook the pasta.In a medium sauce pan, bring milk and cream up to scalding but do not boil.While milk and cream are heating, in a large pot over medium, melt butter and add flour. Stir and cook for three minutes.Slowly add hot milk mixture to butter and flour mixture while whisking vigorously. If you cant pour and whisk then pour the milk in one third at a time whisking fast after each addition. The first one will be thick and by the end it will be loose. If lumps form, whisk and cook until they are gone.At this point, bring the water to a boil and add pasta. Cook pasta to three minutes under done. Whatever the package says, cook three minutes less. Pasta will be slightly hard and chewy but will finish in the oven.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add all three cheeses to the white sauce and stir with a wooden spoon until dissolved into the sauce.In a small cup or bowl, mix Worcestershire sauce with salt, pepper, mustard, cayenne, nutmeg and enough water (few drops) to make a slurry. (this is to avoid lumps from clumpy seasonings).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk this into the sauce.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the sauce from the heat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the pasta and add the hot pasta to the sauce and stir.In a small bowl, combine all topping ingredients and mix well.Butter or spray a 9x9x3-inch or equivalent casserole dish and pour in the pasta mixture.Sprinkle top with the crumb topping mixture and bake uncovered for 20-25 minutes or until hot and bubbly.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese on the menu? Try pairing with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. The L'Ecole 41 Chenin Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish. View More', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 129, u'instructions': u'Preheat oven to 375 degrees F.Bring a large pot of water to a boil and keep at a simmer until you are ready to cook the pasta.In a medium sauce pan, bring milk and cream up to scalding but do not boil.While milk and cream are heating, in a large pot over medium, melt butter and add flour. Stir and cook for three minutes.Slowly add hot milk mixture to butter and flour mixture while whisking vigorously. If you cant pour and whisk then pour the milk in one third at a time whisking fast after each addition. The first one will be thick and by the end it will be loose. If lumps form, whisk and cook until they are gone.At this point, bring the water to a boil and add pasta. Cook pasta to three minutes under done. Whatever the package says, cook three minutes less. Pasta will be slightly hard and chewy but will finish in the oven.Add all three cheeses to the white sauce and stir with a wooden spoon until dissolved into the sauce.In a small cup or bowl, mix Worcestershire sauce with salt, pepper, mustard, cayenne, nutmeg and enough water (few drops) to make a slurry. (this is to avoid lumps from clumpy seasonings). Whisk this into the sauce.Remove the sauce from the heat.Drain the pasta and add the hot pasta to the sauce and stir.In a small bowl, combine all topping ingredients and mix well.Butter or spray a 9x9x3-inch or equivalent casserole dish and pour in the pasta mixture.Sprinkle top with the crumb topping mixture and bake uncovered for 20-25 minutes or until hot and bubbly.', u'spoonacularSourceUrl': u'https://spoonacular.com/perfect-macaroni-and-cheese-702143', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}