{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/752531-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 752531, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Chile Salsa', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 40, u'pricePerServing': 86.12, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'6 28-ounce can whole tomatoes with juice', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'with juice', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 168.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups fresh cilantro leaves (or more to taste!)', u'aisle': u'Produce', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh', u'( to taste!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cups'}, {u'originalString': u'3 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3/4 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'3 whole jalapeno, quartered and sliced thin, with seeds and membrane', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'whole', u'with seeds and membrane', u'sliced', u'quartered', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 1/2 whole limes, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'whole', u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'3/4 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'18 roast poblano chiles', u'aisle': u'Produce', u'name': u'poblano chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}], u'healthScore': 39.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/roasted-chile-salsa.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Roast the poblano chiles one-by-one over the flame of your stovetop, using metal tongs to hold them, until the skin is totally charred. (If you don't have a gas stove, you can use an outdoor grill OR place them on a baking sheet directly under your oven's broiler.) When the skin is totally blackened, place the chiles in a large resealable plastic bag and seal the bag to allow the chiles to sweat for a good 20 minutes.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove the chiles and use a knife to scrape off most of the blackened skin. Slice the chiles in half lengthwise, and scrape out the seeds and membranes.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Divide the ingredients into 3 batches so they will fit into a 12-cup processor', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine whole tomatoes, roast chiles, cilantro, onions, garlic, jalapeno, cumin, salt, sugar and lime juice in a blender or food processor.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Pulse until you get the salsa to the consistency you'd like. I do about 10 to 15 pulses. Test seasonings with a tortilla chip and adjust as needed.", u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Refrigerate the salsa for at least an hour before serving.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 677, u'instructions': u"Watch how to make this recipe.                    Roast the poblano chiles one-by-one over the flame of your stovetop, using metal tongs to hold them, until the skin is totally charred. (If you don't have a gas stove, you can use an outdoor grill OR place them on a baking sheet directly under your oven's broiler.) When the skin is totally blackened, place the chiles in a large resealable plastic bag and seal the bag to allow the chiles to sweat for a good 20 minutes. Remove the chiles and use a knife to scrape off most of the blackened skin. Slice the chiles in half lengthwise, and scrape out the seeds and membranes.                          Divide the ingredients into 3 batches so they will fit into a 12-cup processor                          Combine whole tomatoes, roast chiles, cilantro, onions, garlic, jalapeno, cumin, salt, sugar and lime juice in a blender or food processor.                          Pulse until you get the salsa to the consistency you'd like. I do about 10 to 15 pulses. Test seasonings with a tortilla chip and adjust as needed.                          Refrigerate the salsa for at least an hour before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-chile-salsa-752531', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 36, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}