{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220929-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 220929, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy chicken soup', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 163.38, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'4 celery sticks, quartered', u'aisle': u'Produce', u'name': u'celery sticks', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1kg pack free-range chicken thighs, skinless', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 5091, u'unit': u'kg'}, {u'originalString': u'300ml pot double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'300ml dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}, {u'originalString': u'3 leeks, quartered', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'2 large onions, cut into large wedges', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'cut into  wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'40g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'2 sprigs thyme, plus extra leaves for sprinkling', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2138674/creamy-chicken-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the chicken thighs in a very large,heavy-based pan and fry for a few mins,turning frequently to lightly colour them.Providing the heat is low, there is noneed to add any oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}]}, {u'equipment': [], u'step': u'Pour in the wine,turn up the heat and boil rapidly toevaporate the alcohol. Pile in the vegand herbs, add 1 tsp salt and the whitepepper (or you can use black pepper).', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in 2 litres boiling water. Cover thepan and simmer for 45 mins until thechicken and veg are tender. Take out thebay leaves and thyme sprigs and coolfor about 30 mins.', u'length': {u'number': 75, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove chicken from the soup, thenstrip the meat from the bones. Put allbut 140g of the chicken back into thepan. Blitz the soup with a hand blenderor in batches in a food processor untilvery smooth, then return to the pan.Blend the flour and cream togetherwith a couple of ladles of the soup, thenstir the creamy mixture into the rest ofthe soup and heat, stirring continuouslyuntil thickened. You can blitz again if itlooks a little lumpy. Chop the remainingchicken and stir into the soup. Scatterwith thyme leaves, to serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u'Put the chicken thighs in a very large,heavy-based pan and fry for a few mins,turning frequently to lightly colour them.Providing the heat is low, there is noneed to add any oil. Pour in the wine,turn up the heat and boil rapidly toevaporate the alcohol. Pile in the vegand herbs, add 1 tsp salt and the whitepepper (or you can use black pepper).Pour in 2 litres boiling water. Cover thepan and simmer for 45 mins until thechicken and veg are tender. Take out thebay leaves and thyme sprigs and coolfor about 30 mins.Remove chicken from the soup, thenstrip the meat from the bones. Put allbut 140g of the chicken back into thepan. Blitz the soup with a hand blenderor in batches in a food processor untilvery smooth, then return to the pan.Blend the flour and cream togetherwith a couple of ladles of the soup, thenstir the creamy mixture into the rest ofthe soup and heat, stirring continuouslyuntil thickened. You can blitz again if itlooks a little lumpy. Chop the remainingchicken and stir into the soup. Scatterwith thyme leaves, to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-soup-220929', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}