{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/578345-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 578345, u'veryPopular': False, u'lowFodmap': False, u'title': u'BBQ Burger', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 305.23, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'8 slices bacon, cooked, for topping', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'6 ounces gouda cheese, smoked, coarsely chopped into about 12-16 pieces', u'aisle': u'Cheese', u'name': u'gouda cheese', u'metaInformation': [u'smoked', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gouda.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1022, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 pound ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1 jalape\xf1o pepper, ribs and seeds removed and remainder diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'diced', u'seeds removed and remainder '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 medium onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'8-10 saltine crackers, crumbled', u'aisle': u'Savory Snacks', u'name': u'saltine crackers', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18228, u'unit': u''}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons whiskey', u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14052, u'unit': u'tablespoons'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.foodfanatic.com/recipes/bbq-burger-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place onions, butter, and sugar in a medium-sized fry pan on low heat. Stir occasionally. (Tip: If you hear the onions begin to sizzle, turn the heat down.) Cook until soft and translucent in color (approx. 30 minutes).Meanwhile, place the ground beef, minced garlic, diced jalapeno, egg, and crumbled saltine crackers in a medium-sized mixing bowl. Gently stir ingredients until incorporated.Divide the hamburger mixture into 4 equal-sized portions. Using two hands, gently flatten one portion and then top with 1\xbd ounces smoked Gouda (about 3-4 small cubes). Carefully shape the mixture into a patty about \xbe-1” thick.Repeat with remaining portions of hamburger mixture. (Tip: One of the keys to a delicious burger is to work the meat as little as possible when making the burgers. The more you handle the meat, the tougher your burger will be.)Using your thumb, make a small indention in the middle of each burger. This will yield a perfectly-shaped burger as it grills.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'id': 18228, u'name': u'saltine crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the burgers on a grill over medium heat. Cook 3-5 minutes per side, depending on your preference. (Tip: Flip the burgers only once, and resist the urge to use your grill spatula as a press!)Once the burgers are almost done, transfer the onions from the fry pan into a small bowl.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the whiskey and stir to incorporate.Build the burgers, topping with BBQ sauce, whiskey onions, and bacon.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Finca La Malena Malbec with a 5 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'100% Malbec from eastern Mendoza. Limestone and clay soils, cool winters and warm summers provide great fruit concentration, and smooth tannins. Dark ruby in color reflecting light in an array of orange/purple hues. Pleasant nose filled with hints of red forest fruits and herbs. Young round tannins give it a silky sensuous texture that leads to a rich mouthfeel. Mouthwatering layers of red berries, plum, vanilla and spice open as it warms up, delivering a rich varietal character. A delicate finish that bridges the gap between drinks and lingers well after the last sip.', u'title': u'Finca La Malena Malbec', u'price': u'$13.99', u'id': 431374, u'link': u'https://www.amazon.com/2015-Finca-Malena-Malbec-750mL/dp/B01N9QTXGO', u'imageUrl': u'https://spoonacular.com/productImages/431374-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Place onions, butter, and sugar in a medium-sized fry pan on low heat. Stir occasionally. (Tip: If you hear the onions begin to sizzle, turn the heat down.) Cook until soft and translucent in color (approx. 30 minutes).Meanwhile, place the ground beef, minced garlic, diced jalapeno, egg, and crumbled saltine crackers in a medium-sized mixing bowl. Gently stir ingredients until incorporated.Divide the hamburger mixture into 4 equal-sized portions. Using two hands, gently flatten one portion and then top with 1\xbd ounces smoked Gouda (about 3-4 small cubes). Carefully shape the mixture into a patty about \xbe-1” thick.Repeat with remaining portions of hamburger mixture. (Tip: One of the keys to a delicious burger is to work the meat as little as possible when making the burgers. The more you handle the meat, the tougher your burger will be.)Using your thumb, make a small indention in the middle of each burger. This will yield a perfectly-shaped burger as it grills.Place the burgers on a grill over medium heat. Cook 3-5 minutes per side, depending on your preference. (Tip: Flip the burgers only once, and resist the urge to use your grill spatula as a press!)Once the burgers are almost done, transfer the onions from the fry pan into a small bowl. Add the whiskey and stir to incorporate.Build the burgers, topping with BBQ sauce, whiskey onions, and bacon.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-burger-578345', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}