{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/450850-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 105, u'id': 450850, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom Beef Skillet', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 262.69, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 cups beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'1 pound beef stew meat, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'beef stew meat', u'metaInformation': [u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'pound'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'Hot cooked rice', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'hot', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'1 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'2 to 3 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup sliced fresh mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/mushroom-beef-skillet-3', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Place the flour in a large resealable plastic bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add beef, a few pieces at a time, and shake to coat. In a skillet, cook the beef in butter over medium heat until browned.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onion and garlic; cook for 2-3 minutes or until onion is tender.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add broth, mushrooms, basil, salt and pepper. Bring to a boil. Reduce heat; cover and simmer 1-1/2 hours or until meat is tender, stirring occasionally.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Serve over rice.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 57, u'instructions': u'Directions                                                                                Place the flour in a large resealable plastic bag. Add beef, a few pieces at a time, and shake to coat. In a skillet, cook the beef in butter over medium heat until browned. Add onion and garlic; cook for 2-3 minutes or until onion is tender.                                                                                           Add broth, mushrooms, basil, salt and pepper. Bring to a boil. Reduce heat; cover and simmer 1-1/2 hours or until meat is tender, stirring occasionally. Serve over rice.                                        Yield: 2 servings.                                                                                                                         Originally published as Mushroom Beef Skillet in  ReminisceNovember/December 2004, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (8 ounces) equals 498 calories, 28 g fat (13 g saturated fat), 172 mg cholesterol, 1,121 mg sodium, 13 g carbohydrate, 1 g fiber, 47 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-beef-skillet-450850', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 115, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}