{u'recipes': [{u'sourceName': u'Fork Knife Swoon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/572214-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 572214, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lattice Top Strawberry Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 165.06, u'creditText': u'Fork Knife Swoon', u'extendedIngredients': [{u'originalString': u'1 tbsp apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp arrowroot starch*', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp good-quality balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tbsp'}, {u'originalString': u'butter, for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'optional: Demerara sugar, for sprinkling.', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [u'for sprinkling.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10019908, u'unit': u'servings'}, {u'originalString': u'optional: egg wash (1 egg yolk plus 1 tbsp cream or milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 tsp fine grain sea salt', u'aisle': u'Spices and Seasonings', u'name': u'fine grain sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'2-1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup + 1 tsp granulated sugar, divided', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tbsp granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'7-10 tbsp ice water', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup (packed) light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 9-inch pie crusts', u'aisle': u'Refrigerated', u'name': u'pie crusts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'9-inchs', u'unitShort': u'9-inch', u'amount': 2.0, u'consistency': u'solid', u'id': 18334, u'unit': u'9-inch'}, {u'originalString': u'1 tsp fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'5-6 cups strawberries, hulled and halved or quartered', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'hulled', u'halved', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'2 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.forkknifeswoon.com/food-drink/breads-pastries/2014/05/lattice-top-strawberry-pie-2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the butter into quarter-inch cubes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the butter in the freezer for at least ten minutes or until ready to use. Pulse together the flour, sugar and salt in a food processor, once or twice until just combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the butter cubes to the flour mixture and pulse 5 to 6 times until the butter is evenly distributed, with the largest butter bits about the size of large peas.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Remove one disk of dough from the fridge. Wait about 5 minutes for the dough to warm slightly and become pliable. Meanwhile, generously butter the pie pan. Set aside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place the dough in the center of a clean, lightly floured work surface. Using a rolling pin - I prefer to use a French (tapered) rolling pin - start in the center of the disk, and roll outwards, with firm but gentle pressure. Turn the dough and continue rolling towards the edges. As you work, don't be afraid to sprinkle additional flour on top of the dough and underneath, as well as on the rolling pin to avoid sticking.Continue rolling until the dough is about 2-inches larger in diameter than your pie pan and about 1/8-inch thick. As the dough gets larger, be careful to apply even pressure with the rolling pin across the entire surface of the dough.Gently transfer the dough to your buttered pie pan, being careful not to pull or tear the dough. Use your fingers to gently fit the dough against the sides and bottom of the pan. Using kitchen shears, trim the overhanging dough, leaving about an inch of excess (from the edge of the pan).", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place in the fridge.Prepare the filling: In a large mixing bowl, stir together the 1/2 cup sugar, brown sugar, balsamic vinegar, lemon juice, vanilla, salt and arrowroot starch.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u'Add the vinegar and ice water, pulsing once between each tablespoon addition. The dough is ready when it appears crumbly, but will easily hold together when pinched between two fingers.Turn the dough out onto a clean, lightly floured work surface and divide into two halves. Form each half into a round disk, working quickly and being careful not to over-handle the dough. Wrap each disk tightly in plastic wrap. Refrigerate the dough for at least 30 minutes prior to rolling it out. The pastry may be made in advance and stored for up to a day in the refrigerator or - if wrapped very tightly in plastic wrap - about a month in the freezer.Prepare the bottom crust'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Roll the second disk of dough out as directed above, to about 10-inches in diameter and 1/8-inch thick. Use a pastry cutter, sharp knife or pizza wheel to cut out 8-10 equal-width strips for the lattice top. Discard (munch on) the pie scraps. Set aside.Assemble the pie: Sprinkle the bottom crust with 1 tsp each sugar and flour. Fill the bottom crust with the strawberry mixture. Weave your lattice crust across the pie and crimp the edges. There is a great tutorial on weaving a lattice, complete with pictures, here.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Place the pie in the refrigerator to chill for 10-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake the pie: Preheat the oven to 400 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the pie pastry with the egg wash and sprinkle with demerara sugar (if using).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'id': 10019908, u'name': u'demerara sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 20-25 minutes on a nonstick or parchment paper lined rimmed sheet pan on the bottom rack of the oven until the crust is golden brown. Turn the oven temperature down to 375 degrees F., move the pie to the middle rack, and bake for an additional 30-35 minutes until the filling is bubbly and the pie is golden brown and cooked through. Use a pie crust shield or aluminum foil tent as necessary to prevent the crust from burning.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let the pie sit on a baking rack to cool to room temperature (at least an hour) before slicing. This will allow the filling to fully set up.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm or at room temperature with big scoops of vanilla ice cream. Will keep for up to a day at room temperature or up to week in the refrigerator.', u'number': 7, u'ingredients': []}], u'name': u'Add the strawberries and gently stir to combine. Set aside for at least ten minutes.Prepare the top crust'}], u'aggregateLikes': 223, u'instructions': u"Cut the butter into quarter-inch cubes. Place the butter in the freezer for at least ten minutes or until ready to use. Pulse together the flour, sugar and salt in a food processor, once or twice until just combined. Add the butter cubes to the flour mixture and pulse 5 to 6 times until the butter is evenly distributed, with the largest butter bits about the size of large peas. Add the vinegar and ice water, pulsing once between each tablespoon addition. The dough is ready when it appears crumbly, but will easily hold together when pinched between two fingers.Turn the dough out onto a clean, lightly floured work surface and divide into two halves. Form each half into a round disk, working quickly and being careful not to over-handle the dough. Wrap each disk tightly in plastic wrap. Refrigerate the dough for at least 30 minutes prior to rolling it out. The pastry may be made in advance and stored for up to a day in the refrigerator or - if wrapped very tightly in plastic wrap - about a month in the freezer.Prepare the bottom crust: Remove one disk of dough from the fridge. Wait about 5 minutes for the dough to warm slightly and become pliable. Meanwhile, generously butter the pie pan. Set aside.Place the dough in the center of a clean, lightly floured work surface. Using a rolling pin - I prefer to use a French (tapered) rolling pin - start in the center of the disk, and roll outwards, with firm but gentle pressure. Turn the dough and continue rolling towards the edges. As you work, don't be afraid to sprinkle additional flour on top of the dough and underneath, as well as on the rolling pin to avoid sticking.Continue rolling until the dough is about 2-inches larger in diameter than your pie pan and about 1/8-inch thick. As the dough gets larger, be careful to apply even pressure with the rolling pin across the entire surface of the dough.Gently transfer the dough to your buttered pie pan, being careful not to pull or tear the dough. Use your fingers to gently fit the dough against the sides and bottom of the pan. Using kitchen shears, trim the overhanging dough, leaving about an inch of excess (from the edge of the pan). Place in the fridge.Prepare the filling: In a large mixing bowl, stir together the 1/2 cup sugar, brown sugar, balsamic vinegar, lemon juice, vanilla, salt and arrowroot starch. Add the strawberries and gently stir to combine. Set aside for at least ten minutes.Prepare the top crust: Roll the second disk of dough out as directed above, to about 10-inches in diameter and 1/8-inch thick. Use a pastry cutter, sharp knife or pizza wheel to cut out 8-10 equal-width strips for the lattice top. Discard (munch on) the pie scraps. Set aside.Assemble the pie: Sprinkle the bottom crust with 1 tsp each sugar and flour. Fill the bottom crust with the strawberry mixture. Weave your lattice crust across the pie and crimp the edges. There is a great tutorial on weaving a lattice, complete with pictures, here. Place the pie in the refrigerator to chill for 10-15 minutes.Bake the pie: Preheat the oven to 400 degrees F. Brush the pie pastry with the egg wash and sprinkle with demerara sugar (if using). Bake for 20-25 minutes on a nonstick or parchment paper lined rimmed sheet pan on the bottom rack of the oven until the crust is golden brown. Turn the oven temperature down to 375 degrees F., move the pie to the middle rack, and bake for an additional 30-35 minutes until the filling is bubbly and the pie is golden brown and cooked through. Use a pie crust shield or aluminum foil tent as necessary to prevent the crust from burning.Remove from the oven and let the pie sit on a baking rack to cool to room temperature (at least an hour) before slicing. This will allow the filling to fully set up. Serve warm or at room temperature with big scoops of vanilla ice cream. Will keep for up to a day at room temperature or up to week in the refrigerator.", u'spoonacularSourceUrl': u'https://spoonacular.com/lattice-top-strawberry-pie-572214', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 115, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}