{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/394898-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 394898, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon Pork Chops', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 134.29, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 bone-in pork chops (7 ounces each)', u'aisle': u'Meat', u'name': u'bone-in pork chops', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chop-bone-in.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'liquid', u'id': 10036, u'unit': u'ounces'}, {u'originalString': u'1/4 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1 medium lemon, thinly sliced', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 medium onion, thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/lemon-pork-chops', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the pork chops in a 3-qt. slow cooker. Sprinkle with salt and pepper. Top with onion and lemon. Sprinkle with brown sugar; drizzle with ketchup.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Cover and cook on low for 6-8 hours or until meat is tender.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Riesling are my top picks for Pork Chops. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. One wine you could try is Ghost Pines Sonoma County Napa County Monterey County Chardonnay. It has 5 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 1012, u'instructions': u'Directions                                                                                Place the pork chops in a 3-qt. slow cooker. Sprinkle with salt and pepper. Top with onion and lemon. Sprinkle with brown sugar; drizzle with ketchup.                                                                                           Cover and cook on low for 6-8 hours or until meat is tender.                                        Yield: 4 servings.                                                                                                                         Originally published as Lemon Pork Chops in  Quick CookingMay/June 2002, p37                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 290 calories, 8 g fat (3 g saturated fat), 86 mg cholesterol, 543 mg sodium, 22 g carbohydrate, 1 g fiber, 31 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-pork-chops-394898', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 365, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}