{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/761549-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 761549, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smokey Black Bean Soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 71.35, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbd ripe avocado, cut into small dice', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'ripe', u'small', u'cut into  dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 \xbd cups black beans, soaked and drained', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16015, u'unit': u'cups'}, {u'originalString': u'14 \xbd-oz. can diced tomatoes, preferably fire-roasted', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1 stalk celery, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'2 chipotle chiles in adobo sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chiles in adobo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'3 corn tortillas, cut into \xbc-inch-wide strips', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'cut into \xbc-inch-wide strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd medium green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'Lime Cream', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'2 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 medium onion, finely chopped (1 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 tsp. dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'2 Tbs. sherry', u'aisle': u'Alcoholic Beverages', u'name': u'sherry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 10214106, u'unit': u'Tbs'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/smokey-black-bean-soup/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Variation: To make this soup in a pressure cooker, heat 1 Tbs. oil in pressure cooker.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, celery and green pepper. Cook, stirring often, over medium-low heat until vegetables are softened, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, cumin and oregano, and cook another few minutes, until fragrant.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add beans and 4 cups water, and cover. Bring to a boil, lock lid into place, and bring to high pressure. Cook over high pressure 15 minutes. Turn off heat, and let beans return to pressure naturally.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove lid, and add 1 1/2 tsp. salt. Proceed with Step 3, above.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 35, u'instructions': u'Variation: To make this soup in a pressure cooker, heat 1 Tbs. oil in pressure cooker. Add onion, celery and green pepper. Cook, stirring often, over medium-low heat until vegetables are softened, about 10 minutes. Add garlic, cumin and oregano, and cook another few minutes, until fragrant. Add beans and 4 cups water, and cover. Bring to a boil, lock lid into place, and bring to high pressure. Cook over high pressure 15 minutes. Turn off heat, and let beans return to pressure naturally. Remove lid, and add 1 1/2 tsp. salt. Proceed with Step 3, above.', u'spoonacularSourceUrl': u'https://spoonacular.com/smokey-black-bean-soup-761549', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}