{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'european', u'eastern european'], u'image': u'https://spoonacular.com/recipeImages/546109-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 546109, u'veryPopular': True, u'lowFodmap': False, u'title': u'VELVEETA\xc2\xae Cheesy Beef Stroganoff', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 146.85, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1/4 tsp. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 can (10-3/4 oz.) condensed cream of mushroom soup', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of mushroom soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-mushroom-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6147, u'unit': u'oz'}, {u'originalString': u'3 cups egg noodles, uncooked', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20409, u'unit': u'cups'}, {u'originalString': u'1 lb. ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1/2 lb. (8 oz.) VELVEETA, cut into 1/2-inch cubes', u'aisle': u'Cheese', u'name': u'velveeta', u'metaInformation': [u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1192, u'unit': u'oz'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/velveeta-cheesy-beef-stroganoff-57514.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brown meat in large skillet; drain.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Stir in water; bring to boil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add noodles; stir.  Cover; simmer on medium-low heat 8 min. or until noodles are tender.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add VELVEETA, soup and pepper; cook 5 min. or until VELVEETA is completely melted and mixture is well blended, stirring frequently.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1192, u'name': u'velveeta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Beef Stroganoff on the menu? Try pairing with Nero D Avola, Primitivo, and Shiraz. For a creamy, mushroomy beef stroganoff, you'll want a bold red to match. The Colosi Nero d'Avola with a 4.7 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'nero d avola', u'primitivo', u'shiraz'], u'productMatches': [{u'description': u'Color is intense ruby red. Intense blackberry aromas and a fresh and tannic palate.Its fresh flavors and well-balanced tannins make it the ideal accompaniment for red meats and game.', u'title': u"Colosi Nero d'Avola", u'price': u'$11.99', u'id': 443995, u'link': u'https://www.wine.com/product/colosi-nero-davola-2008/103130', u'imageUrl': u'https://spoonacular.com/productImages/443995-312x231.jpg'}]}, u'aggregateLikes': 3096, u'instructions': u'Brown meat in large skillet; drain.                                            Stir in water; bring to boil. Add noodles; stir.  Cover; simmer on medium-low heat 8 min. or until noodles are tender.                                            Add VELVEETA, soup and pepper; cook 5 min. or until VELVEETA is completely melted and mixture is well blended, stirring frequently.', u'spoonacularSourceUrl': u'https://spoonacular.com/velveeta-cheesy-beef-stroganoff-546109', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}