{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/311037-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 311037, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salted Caramel Pecan Pie', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 220.42, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'1 cup packed dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'1 deep-dish frozen piecrust', u'aisle': u'Refrigerated;Frozen', u'name': u'deep dish pie crust', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18945, u'unit': u''}, {u'originalString': u'3 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'1 tablespoon flaky sea salt, plus more for garnish', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tablespoon'}, {u'originalString': u'6 tablespoons unsalted butter, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpeg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/jamie-deen/salted-caramel-pecan-pie-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the piecrust on a baking sheet, prick with a fork and bake for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add the brown sugar, corn syrup, butter and salt to a medium saucepan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place over medium heat and stir while the mixture melts. Bring to a boil.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat and cool.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the eggs and the pecans.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add to the pie shell on the baking sheet and bake for 50 minutes. Cool completely before serving.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Madeira, Pedro Xim\xe9nez, and Tawny Port are my top picks for Pecan Pie. Sweet, nutty pecan pie deserves a wine to match - these dessert wines all have the right sweetness and the nutty notes. One wine you could try is Kenneth Volk El Pomar Junction Vineyard Verdelho. It has 1.7999999999999998 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'madeira', u'pedro ximenez', u'tawny port'], u'productMatches': [{u'description': u"Verdelho is a semi-aromatic white grape that was traditionally used in the production of the revered wines of the island of Madeira. Verdelho has found popularity with forward thinking vintners from around the world in the production of delicious table wines. This bottling is full bodied with tropical and citrus fruit aromas with grapefruit, melon and apple flavors. This refreshing wine can be enjoyed as an aperitif or served with seafoods or Pacific Rim cuisine. Verdelho's aroma and bouquet is unique and reminds me of citrus flowers and ripe Casaba melon.Its palate weight is more full-bodied than many other white wines.", u'title': u'Kenneth Volk El Pomar Junction Vineyard Verdelho', u'price': u'$11.99', u'id': 444264, u'link': u'https://www.wine.com/product/kenneth-volk-el-pomar-junction-vineyard-verdelho-2008/105981', u'imageUrl': u'https://spoonacular.com/productImages/444264-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Watch how to make this recipe.                    Preheat the oven to 350 degrees F.                          Place the piecrust on a baking sheet, prick with a fork and bake for 15 minutes.                          Add the brown sugar, corn syrup, butter and salt to a medium saucepan. Place over medium heat and stir while the mixture melts. Bring to a boil. Remove from the heat and cool. Whisk in the eggs and the pecans. Add to the pie shell on the baking sheet and bake for 50 minutes. Cool completely before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/salted-caramel-pecan-pie-311037', u'dishTypes': [u'dessert'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}