{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/479970-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 479970, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sweet and Spicy Asian Veggie Tacos', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 223.41, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'15 halved grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 10111529, u'unit': u''}, {u'originalString': u'\xbd green bell pepper, sliced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'3 Tablespoons mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93830, u'unit': u'Tablespoons'}, {u'originalString': u'8 ounces mushrooms, sliced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'Pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'\xbd red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 Tablespoons soy sauce (I used gluten free Tamari)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'gluten free', u'(I used Tamari)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tablespoons'}, {u'originalString': u'1 teaspoon sriracha', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}, {u'originalString': u'Tortillas, cilantro, green onion, sour cream, and additional sriracha, for serving', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'sour', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 18364, u'unit': u'servings'}, {u'originalString': u'1 small zucchini, in thick julienne slices', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'thick', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'slices'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2013/08/sweet-and-spicy-asian-veggie-tacos.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a small measuring cup, whisk together soy sauce, mirin, sriracha, and minced garlic.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a skillet over medium high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add red onion and saute for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}, {u'equipment': [], u'step': u'Add mushrooms and green peppers and saute for another 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add the zucchini and cherry tomatoes and saute for a final 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour soy sauce mixture over the veggies and stir until coated. Sprinkle with salt and pepper.If desired, warm your tortillas in the microwave or in a skillet. To serve, place vegetables in the tortillas, top with sour cream, cilantro, green onion, and additional sriracha to taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Tacos works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Garnet Monterey Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine.", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 1129, u'instructions': u'In a small measuring cup, whisk together soy sauce, mirin, sriracha, and minced garlic.Heat olive oil in a skillet over medium high heat.Add red onion and saute for about 2 minutes. Add mushrooms and green peppers and saute for another 2 minutes.Add the zucchini and cherry tomatoes and saute for a final 2 minutes.Pour soy sauce mixture over the veggies and stir until coated. Sprinkle with salt and pepper.If desired, warm your tortillas in the microwave or in a skillet. To serve, place vegetables in the tortillas, top with sour cream, cilantro, green onion, and additional sriracha to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-spicy-asian-veggie-tacos-479970', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}