{u'recipes': [{u'sourceName': u'Not Eating Out In New York', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/5052-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 5052, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apricot-glazed Salmon With Bokchoy', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 78.95, u'creditText': u'Not Eating Out In New York', u'extendedIngredients': [{u'originalString': u'1 tablespoon apricot preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot preserves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19719, u'unit': u'tablespoon'}, {u'originalString': u'1 Tbsp apricot preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot preserves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19719, u'unit': u'Tbsp'}, {u'originalString': u'2 tablespoons and 1 teaspoon vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'2 Tbsps and 1 tsp vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbsps'}, {u'originalString': u'steamed rice for serving', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'steamed', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'2 large clove garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2 salmon steaks (preferably wild-caught from Alaska)', u'aisle': u'Seafood', u'name': u'salmon steaks', u'metaInformation': [u'wild-caught', u'(preferably from Alaska)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10015076, u'unit': u''}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 teaspoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoons'}, {u'originalString': u'3 tsps soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tsps'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://noteatingoutinny.com/2010/09/19/apricot-glazed-salmon-with-bok-choy/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Cook the rice. Preheat oven to 375 degrees. In a small bowl, combine the apricot preserves, remaining teaspoon of soy sauce and 1 teaspoon of oil and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot preserves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat about 1 tablespoon of the oil in a wide, heavy-bottomed, oven-safe saucepan and add the garlic once it just begins to pop.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the bok choy and stir-fry for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan and clean thoroughly.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add another tablespoon of oil and place salmon steaks down skin side-up.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 10015076, u'name': u'salmon steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Let brown for 1-2 minutes. Flip, and brush the apricot sauce on the browned side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to the oven to cook through, about 5 minutes (depending on the size of the steaks).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve alongside the bokchoy on the steamed rice.Cost Calculator(for 2 servings)2 salmon steaks (about 1 lb, at $198/12 lbs): $16.501 head bok choy (at $2.50/bunch of 3 from Phillips Farm): $0.841 tablespoon apricot preserves (at $6/small jar): $0.801 clove garlic, soy sauce, oil, salt, pepper, rice for serving: $1.00Total: $19.14Health Factor', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot preserves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 10015076, u'name': u'salmon steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220445, u'name': u'cooked rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Six brownie points: This dish will certainly wet your whistle if youre looking to eat meat, as its rich and fatty, with lots of flavor. Thats just the nature of wild sockeye salmon, but along with it comes lots of protein and the highest concentration of omega-3 fatty acids as far as seafood goes, where this valuable nutrient is prevalent. The mild bok choy will help level out all the cholesterol, too, with its plentiful Vitamin C, Vitamin A and calcium. Especially when you prepare this with more bok choy than the fish, or anything else on the plate.Green Factor', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Six maple leaves: If youre not from the Pacific Northwest, you can still get freshly-caught salmon. But this region is the only sustainably-maintained fishery for the species according to Seafood Watch. Most salmon is farmed today, which can lead to all sorts of health and food-safety red flags (in addition to not tasting as good). Youll notice the steep pricetag for this salmon, because it isnt. While the garlic and bok choy were local farmers market finds, the rest were purely (non-local) pantry items, like dried rice.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Proverb Pinot Grigio Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pear , Apple , Lime', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Cook the rice. Preheat oven to 375 degrees. In a small bowl, combine the apricot preserves, remaining teaspoon of soy sauce and 1 teaspoon of oil and set aside.Heat about 1 tablespoon of the oil in a wide, heavy-bottomed, oven-safe saucepan and add the garlic once it just begins to pop. Add the bok choy and stir-fry for about 2 minutes. Remove from pan and clean thoroughly. Add another tablespoon of oil and place salmon steaks down skin side-up. Let brown for 1-2 minutes. Flip, and brush the apricot sauce on the browned side. Transfer to the oven to cook through, about 5 minutes (depending on the size of the steaks). Serve alongside the bokchoy on the steamed rice.Cost Calculator(for 2 servings)2 salmon steaks (about 1 lb, at $198/12 lbs): $16.501 head bok choy (at $2.50/bunch of 3 from Phillips Farm): $0.841 tablespoon apricot preserves (at $6/small jar): $0.801 clove garlic, soy sauce, oil, salt, pepper, rice for serving: $1.00Total: $19.14Health FactorSix brownie points: This dish will certainly wet your whistle if youre looking to eat meat, as its rich and fatty, with lots of flavor. Thats just the nature of wild sockeye salmon, but along with it comes lots of protein and the highest concentration of omega-3 fatty acids as far as seafood goes, where this valuable nutrient is prevalent. The mild bok choy will help level out all the cholesterol, too, with its plentiful Vitamin C, Vitamin A and calcium. Especially when you prepare this with more bok choy than the fish, or anything else on the plate.Green FactorSix maple leaves: If youre not from the Pacific Northwest, you can still get freshly-caught salmon. But this region is the only sustainably-maintained fishery for the species according to Seafood Watch. Most salmon is farmed today, which can lead to all sorts of health and food-safety red flags (in addition to not tasting as good). Youll notice the steep pricetag for this salmon, because it isnt. While the garlic and bok choy were local farmers market finds, the rest were purely (non-local) pantry items, like dried rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/apricot-glazed-salmon-with-bokchoy-5052', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}