{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537627-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 537627, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom and Swiss Pockets', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 133.12, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'5 cups (22.5 ounces) bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 22.5, u'consistency': u'solid', u'id': 10120129, u'unit': u'ounces'}, {u'originalString': u'1 pound crimini mushrooms', u'aisle': u'Produce', u'name': u'crimini mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'1 tablespoon fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoon instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10118375, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'1 cup milk, room temp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 scallions, diced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'8 ounces swiss cheese, grated', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1040, u'unit': u'ounces'}, {u'originalString': u'3/4 cup water, room temp', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.macheesmo.com/2012/03/mushroom-and-swiss-pockets/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Add a large spoonful of filling to one side of the dough and top with about an ounce (or more) of grated cheese.8) Fold dough over and press out any air, then press the outer edge to seal the hot pocket. Crimp around the edges.9) When you're done with all the hot pockets, add them to baking sheets lined with parchment paper. 10)", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Cut a few slits in the top of each pocket so steam can escape and bake the hot pockets at 350 degrees for 20-25 minutes.11) The pockets are done when they are golden brown on the outside.12) Either serve them immediately or let them cool completely, wrap them in foil, and store them in freezer-safe plastic bags.13) To reheat frozen hot pocket, cook in microwave on high for 2-3 minutes.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 127, u'instructions': u"Directions1) You can use store-bought pizza dough to make these, but if you want to make your own dough, it isn't so hard. Start by stirring all ingredients together in a large bowl or the bowl of a stand mixer.2) If you're using a mixer, fit with dough hook and mix on low for 4-5 minutes, then let dough rest for 5 minutes, then mix again on medium-low for another 2-3 minutes. If you're mixing by hand, stir the dough with a large spoon until the ingredients come together then dip your hand in water and vigorously work the dough until it forms a soft ball of dough that's slightly sticky and soft.3) In either case, if the dough is very sticky, mix in a bit more flour by the tablespoon. If it's very dry, then mix in more water by the tablespoon.4) Once dough is formed, coat a large bowl with oil and roll the dough around to cover it with oil. Cover the bowl and let rise for 2 hours. Punch down the dough and then let it rise again for an hour. Proceed with the recipe.5) TO make the filling, wash and slice mushrooms. In a large skillet, add olive oil over medium heat. Once hot, add mushrooms and cook until they start to lose their liquid, about 5 minutes. Then add scallions, thyme, and a pinch of salt and pepper. Continue to cook for another few minutes until mushrooms are soft and water is evaporated from pan. Set aside to cool.6) To make a hot pocket, weigh out 4-4.5 ounces of dough and roll it into a large six to eight inch circle. Flour the surface lightly so the dough doesn't stick to your counter.7) Add a large spoonful of filling to one side of the dough and top with about an ounce (or more) of grated cheese.8) Fold dough over and press out any air, then press the outer edge to seal the hot pocket. Crimp around the edges.9) When you're done with all the hot pockets, add them to baking sheets lined with parchment paper. 10) Cut a few slits in the top of each pocket so steam can escape and bake the hot pockets at 350 degrees for 20-25 minutes.11) The pockets are done when they are golden brown on the outside.12) Either serve them immediately or let them cool completely, wrap them in foil, and store them in freezer-safe plastic bags.13) To reheat frozen hot pocket, cook in microwave on high for 2-3 minutes.", u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-and-swiss-pockets-537627', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}