{u'recipes': [{u'sourceName': u'Kirbie Cravings', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612325-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 612325, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Spice Latte Mug Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 3, u'pricePerServing': 51.32, u'creditText': u'Kirbie Cravings', u'extendedIngredients': [{u'originalString': u'1/4 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'2 tbsp (30g) canned pumpkin puree', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 11424, u'unit': u'g'}, {u'originalString': u'1/4 tsp espresso powder', u'aisle': u'Tea and Coffee', u'name': u'espresso powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 10014214, u'unit': u'tsp'}, {u'originalString': u'2 tbsp (30ml) fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'ml'}, {u'originalString': u'4 tbsp (30g) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'2 tbsp (25g) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1/2 tsp pumpkin spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'1/2 tbsp (7.5ml) vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 7.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'ml'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://kirbiecravings.com/2014/09/pumpkin-spice-latte-mug-cake-2.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all ingredients in an oversized microwave-safe mug.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix with a small whisk until batter is smooth.2. Cook in microwave for approximately 1 minute 30 seconds. If cake is not done, heat an additional 15 seconds.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let cake cool a few minutes before eating. Cake is best consumed while still warm or within a few hours of it being cooked.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u'1. Combine all ingredients in an oversized microwave-safe mug. Mix with a small whisk until batter is smooth.2. Cook in microwave for approximately 1 minute 30 seconds. If cake is not done, heat an additional 15 seconds. Let cake cool a few minutes before eating. Cake is best consumed while still warm or within a few hours of it being cooked.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-spice-latte-mug-cake-612325', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 4, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}