{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [u'asian', u'korean'], u'image': u'https://spoonacular.com/recipeImages/837197-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 837197, u'veryPopular': True, u'lowFodmap': False, u'title': u'Korean Beef Rice Bowls', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 216.91, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'3 cups cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20041, u'unit': u'cups'}, {u'originalString': u'1 small sliced cucumber, skin on', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 teaspoon fresh grated ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons Gochujang, or more if desired*', u'aisle': u'Ethnic Foods', u'name': u'gochujang', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1016973, u'unit': u'tablespoons'}, {u'originalString': u'1 pound 93% lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'93%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'2 teaspoons light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup low sodium soy sauce*', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 sliced scallions, white and green parts', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'white', u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 teaspoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoon'}, {u'originalString': u'1/2 tablespoon sesame seeds, plus more for topping', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'plus more for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup chopped yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.skinnytaste.com/korean-beef-rice-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the soy sauce, 2 tablespoons water, brown sugar, sesame oil and red pepper flakes in a small bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large deep nonstick skillet over high heat, spray with oil and add the ground beef. Cook, breaking the meat up with a wooden spoon until cooked through, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, garlic and ginger and cook 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the sauce over the beef, cover and simmer on low heat 10 minutes.To assemble the bowls, place 3/4 cup rice in each bowl, top with scant 2/3 cup beef, cucumbers, Gochujong, sesame seeds and scallions.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Essay Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 16685, u'instructions': u'Combine the soy sauce, 2 tablespoons water, brown sugar, sesame oil and red pepper flakes in a small bowl.Heat a large deep nonstick skillet over high heat, spray with oil and add the ground beef. Cook, breaking the meat up with a wooden spoon until cooked through, about 5 minutes.Add the onion, garlic and ginger and cook 1 minute.Pour the sauce over the beef, cover and simmer on low heat 10 minutes.To assemble the bowls, place 3/4 cup rice in each bowl, top with scant 2/3 cup beef, cucumbers, Gochujong, sesame seeds and scallions.', u'spoonacularSourceUrl': u'https://spoonacular.com/korean-beef-rice-bowls-837197', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}