{u'recipes': [{u'sourceName': u'The Little Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/530729-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 530729, u'veryPopular': True, u'lowFodmap': True, u'title': u'Pork Chops with Parmesan Sage Sauce', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'pricePerServing': 278.99, u'creditText': u'The Little Kitchen', u'extendedIngredients': [{u'originalString': u'1 to 1.5 Tablespooons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u''}, {u'originalString': u'1/8 teaspoon McCormick ground sage (plus 2 pinches)', u'aisle': u'Spices and Seasonings', u'name': u'ground sage', u'metaInformation': [u'(plus 2 pinches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002038, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup half & half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons parmesan cheese, grated', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tablespoons'}, {u'originalString': u'1 pound pork chops (bone-in, 2 pieces), rinsed with water & patted dry with paper towels', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'bone-in', u'dry', u'with water & patted  with paper towels', u'rinsed', u'(, 2 pieces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10010062, u'unit': u'pound'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.thelittlekitchen.net/2012/11/16/pork-chops-with-parmesan-sage-sauce-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, melt butter on medium-low heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add half & half and allow to simmer to cook and reduce for 1 to 2 minutes, stirring with a wooden spoon constantly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}]}, {u'equipment': [], u'step': u'Add cheese and allow to melt. Continuing to stir the sauce, add the ground sage.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'id': 1002038, u'name': u'ground sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat and set aside.Season both sides of pork chops with salt, pepper and a couple of pinches of ground sage.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'id': 1002038, u'name': u'ground sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a cast iron skillet at medium high heat for about 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add pork chops to skillet and cook for 5 to 8 minutes on each side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pork chops from skillet and put onto a plate and allow to rest for at least 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove skillet from heat and add parmesan sage sauce to the skillet and stir, be sure to scrape bits from the bottom of the skillet.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [], u'step': u'Serve pork chops with sauce on top.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pork Chops works really well with Chardonnay, Pinot Noir, and Riesling. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. One wine you could try is Chehalem INOX Chardonnay. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 1149, u'instructions': u'In a small saucepan, melt butter on medium-low heat. Add half & half and allow to simmer to cook and reduce for 1 to 2 minutes, stirring with a wooden spoon constantly. Add cheese and allow to melt. Continuing to stir the sauce, add the ground sage. Remove pan from heat and set aside.Season both sides of pork chops with salt, pepper and a couple of pinches of ground sage. Heat a cast iron skillet at medium high heat for about 3 to 5 minutes. Add pork chops to skillet and cook for 5 to 8 minutes on each side. Remove pork chops from skillet and put onto a plate and allow to rest for at least 5 minutes.Remove skillet from heat and add parmesan sage sauce to the skillet and stir, be sure to scrape bits from the bottom of the skillet. Serve pork chops with sauce on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-chops-with-parmesan-sage-sauce-530729', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}