{u'recipes': [{u'sourceName': u'Bunky Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575236-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1860, u'id': 575236, u'veryPopular': False, u'lowFodmap': False, u'title': u'Short Rib Rag\xf9 with Pappardelle', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 709.27, u'creditText': u'Bunky Cooks', u'extendedIngredients': [{u'originalString': u'3 1/2 cups homemade beef stock (I used organic beef broth)', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [u'organic', u'homemade', u'(I used beef broth)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 6170, u'unit': u'cups'}, {u'originalString': u'4 small carrots, diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 stalks celery, diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 dried bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'dried bay leaf', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'2 sprigs fresh flat-leaf parsley', u'aisle': u'Produce', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'sprigs'}, {u'originalString': u'2 sprigs fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprigs'}, {u'originalString': u'5 sprigs fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 5.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'1/2 head garlic, cloves separated and peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'separated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 pound pappardelle or other long, flat pasta', u'aisle': u'Pasta and Rice', u'name': u'pappardelle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Pappardelle.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10120409, u'unit': u'pound'}, {u'originalString': u'Parmigiano-Reggiano, for garnish (or Pecorino Romano)', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'for garnish (or pecorino romano)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1/2 cup ruby port', u'aisle': u'Alcoholic Beverages', u'name': u'port', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/port.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10114057, u'unit': u'cup'}, {u'originalString': u'2 cups red wine (I used Cabernet - you want a big red wine for this dish)', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red', u'for this dish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cups'}, {u'originalString': u'2 medium shallots, diced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3 1/2 to 4 pounds short ribs', u'aisle': u'Meat', u'name': u'short ribs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-short-ribs.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.5, u'consistency': u'solid', u'id': 10013147, u'unit': u'pounds'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'2 Tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'Tablespoons'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.bunkycooks.com/2014/01/short-rib-ragu-with-pappardelle/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 55, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pre-heat oven to 325 degrees F.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Place a 5-quart Dutch oven over medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add oil, and heat until it is almost smoking. Season short ribs generously with Kosher salt and pepper. Sear the short ribs on one side, then turn to brown the other.  You may need to do this in two batches.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-short-ribs.jpg', u'id': 10013147, u'name': u'beef short ribs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Remove the ribs from the Dutch oven, and transfer to a large plate. Set aside.3. Meanwhile, prepare the bouquet garni.  In the center of a square piece of cheesecloth, add the bay leaf, rosemary, thyme, and parsley. Bring the edges together and tie with kitchen string. Set bouquet garni aside.4. To the hot Dutch oven add carrots, celery, onion, and shallots and cook over medium heat, stirring occasionally, until vegetables are softened and golden, about 10 minutes.5.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add the flour and tomato paste and stir to combine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add ruby port; stir with wooden spoon until all browned bits have been scraped from the pan and the bottom of the casserole is clean.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the red wine, and simmer until the liquid is reduced by half.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add garlic, beef stock, and the reserved bouquet garni.6. Return the seared ribs to the pot and bring the liquid to a simmer over medium-high heat. Cover the Dutch oven and place it in the oven. Cook until the short ribs are very tender, about 3 hours.7.  (* One option is to prepare this the same day you serve it, but I prefer cooling the dish and placing it in the refrigerator overnight.  This will allow you to easily remove the layer of fat from the top of the rag.) Once the fat is skimmed from the top, slowly warm up the rag and take the cooked ribs from pot and remove the bouquet garni.  Take the meat off the bones and shred into small pieces. Discard the bones and fat and return the shredded meat back into the pot.  Bring to a slow simmer to reduce sauce to a nice, thick consistency.8. Fill a large pot with water and add a few tablespoons of salt. Set over high heat, and bring to a boil. Salt well and add pasta. Cook until pasta is al dente.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-short-ribs.jpg', u'id': 10013147, u'name': u'beef short ribs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain pasta, and serve with short-rib rag, sprinkle with chopped parsley, if desired.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve with freshly grated Parmigiano-Reggiano or Percorino Romano.', u'number': 10, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 82, u'instructions': u'1. Pre-heat oven to 325 degrees F.2. Place a 5-quart Dutch oven over medium heat. Add oil, and heat until it is almost smoking. Season short ribs generously with Kosher salt and pepper. Sear the short ribs on one side, then turn to brown the other.  You may need to do this in two batches.  Remove the ribs from the Dutch oven, and transfer to a large plate. Set aside.3. Meanwhile, prepare the bouquet garni.  In the center of a square piece of cheesecloth, add the bay leaf, rosemary, thyme, and parsley. Bring the edges together and tie with kitchen string. Set bouquet garni aside.4. To the hot Dutch oven add carrots, celery, onion, and shallots and cook over medium heat, stirring occasionally, until vegetables are softened and golden, about 10 minutes.5. Add the flour and tomato paste and stir to combine. Add ruby port; stir with wooden spoon until all browned bits have been scraped from the pan and the bottom of the casserole is clean. Add the red wine, and simmer until the liquid is reduced by half. Add garlic, beef stock, and the reserved bouquet garni.6. Return the seared ribs to the pot and bring the liquid to a simmer over medium-high heat. Cover the Dutch oven and place it in the oven. Cook until the short ribs are very tender, about 3 hours.7.  (* One option is to prepare this the same day you serve it, but I prefer cooling the dish and placing it in the refrigerator overnight.  This will allow you to easily remove the layer of fat from the top of the rag.) Once the fat is skimmed from the top, slowly warm up the rag and take the cooked ribs from pot and remove the bouquet garni.  Take the meat off the bones and shred into small pieces. Discard the bones and fat and return the shredded meat back into the pot.  Bring to a slow simmer to reduce sauce to a nice, thick consistency.8. Fill a large pot with water and add a few tablespoons of salt. Set over high heat, and bring to a boil. Salt well and add pasta. Cook until pasta is al dente. Drain pasta, and serve with short-rib rag, sprinkle with chopped parsley, if desired. Serve with freshly grated Parmigiano-Reggiano or Percorino Romano.', u'spoonacularSourceUrl': u'https://spoonacular.com/short-rib-rag-with-pappardelle-575236', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}