{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/286206-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 150, u'id': 286206, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Cheesecake', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 379.48, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 (9-inch) prepared graham cracker crust', u'aisle': u'Baking', u'name': u'graham cracker crust', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 9.0, u'consistency': u'solid', u'id': 18942, u'unit': u'inch'}, {u'originalString': u'1 orange, juiced', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u''}, {u'originalString': u'1 orange, zested', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1 (15-ounce) can peaches, juice reserved and peaches chopped', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1 (15-ounce) container ricotta', u'aisle': u'Cheese', u'name': u'ricotta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'ounce'}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 18.0, u'imageType': u'jpeg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/sandra-lee/slow-cooker-cheesecake-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 44, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Puree ricotta in a food processor until smooth. Scraping down the sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [], u'step': u'Add the sugar and puree for approximately 1 minute so that it is not grainy.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the eggs, vanilla, orange zest and salt. Puree until smooth and combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a small bowl in the bottom of a 5 quart slow cooker and place a small plate on top of the bowl.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place pie crust on top of the plate and pour the filling into the pie crust.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place 4 paper towels over the top of slow cooker bowl making sure not to let the towels touch the top of the cheesecake. Secure with lid and cook on high setting for 1 1/2 hours, or until set.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Remove from slow cooker and let sit for 30 minutes, then refrigerate for 30 minutes or until chilled.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a small pot whisk together the reserved peach juice, orange juice, cornstarch, sugar and salt. Stir in the chopped peaches and heat over medium heat. Cook until liquid thickens about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from heat and serve warm over a slice of cheesecake.', u'number': 10, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the pie crust into a baking dish or roasting pan large enough to accommodate the pie tin.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the filling into the crust.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add about 1-inch of warm water into the bottom of the baking dish and cover with foil. Using a skewer, pierce about 12 holes into the foil to allow steam to vent.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 50 minutes to 1 hour or until cheesecake set.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove cheesecake from water bath and let rest on the counter for 30 minutes. Then place in the refrigerator for 30 minutes or until chilled.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u'Oven Instructions'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Watch how to make this recipe.                    Puree ricotta in a food processor until smooth. Scraping down the sides. Add the sugar and puree for approximately 1 minute so that it is not grainy. Add the eggs, vanilla, orange zest and salt. Puree until smooth and combined.                          Place a small bowl in the bottom of a 5 quart slow cooker and place a small plate on top of the bowl. Place pie crust on top of the plate and pour the filling into the pie crust. Place 4 paper towels over the top of slow cooker bowl making sure not to let the towels touch the top of the cheesecake. Secure with lid and cook on high setting for 1 1/2 hours, or until set. Remove from slow cooker and let sit for 30 minutes, then refrigerate for 30 minutes or until chilled.                          In a small pot whisk together the reserved peach juice, orange juice, cornstarch, sugar and salt. Stir in the chopped peaches and heat over medium heat. Cook until liquid thickens about 5 minutes. Remove from heat and serve warm over a slice of cheesecake.                          Oven Instructions:                          Preheat oven to 325 degrees F.                          Place the pie crust into a baking dish or roasting pan large enough to accommodate the pie tin. Pour the filling into the crust. Add about 1-inch of warm water into the bottom of the baking dish and cover with foil. Using a skewer, pierce about 12 holes into the foil to allow steam to vent. Bake for 50 minutes to 1 hour or until cheesecake set. Remove cheesecake from water bath and let rest on the counter for 30 minutes. Then place in the refrigerator for 30 minutes or until chilled.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-cheesecake-286206', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 160, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}