{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/600811-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 600811, u'veryPopular': False, u'lowFodmap': False, u'title': u'Onion Raita – Roasted Onion Raita', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 104.43, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Cilantro – 1 tablespoon, chopped finely', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'Green chili – 1, chopped finely', u'aisle': u'Produce', u'name': u'green chili', u'metaInformation': [u'green', u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'Onion – 1 medium', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt –to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Yogurt – 1 cup', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.spiceupthecurry.com/onion-raita-recipe-roasted-onion-raita/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Take whole onion and roast it directly on the flame. Keep the flame medium-low.Keep turning while you roast the onion. As you roast juice will start to ooze out. . And roast it till skin gets black from all the sides. Make sure to roast on medium-low heat, otherwise skin gets burn fast but onion will not cook from inside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove it from the flame and let it cool to touch.Mean while onion is getting cool, let’s prepare yogurt for raita. Take whisked yogurt in a bowl, add chopped green chilies, cilantro and salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raita-or-tzaziki.png', u'id': 1001116, u'name': u'raita'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix it and keep it aside.Once it cools down remove the out skin.And chop the onion. It will be little difficult to chop the onion as it will slip from your hand as you chop. So you won’t get perfect chop, so chop it roughly. You will feel how juicy it is from inside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add chopped onion with its juice to the yogurt mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Mix it well. And keep refrigerated until you serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Raita works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 47, u'instructions': u'Take whole onion and roast it directly on the flame. Keep the flame medium-low.Keep turning while you roast the onion. As you roast juice will start to ooze out. . And roast it till skin gets black from all the sides. Make sure to roast on medium-low heat, otherwise skin gets burn fast but onion will not cook from inside.Remove it from the flame and let it cool to touch.Mean while onion is getting cool, let’s prepare yogurt for raita. Take whisked yogurt in a bowl, add chopped green chilies, cilantro and salt. Mix it and keep it aside.Once it cools down remove the out skin.And chop the onion. It will be little difficult to chop the onion as it will slip from your hand as you chop. So you won’t get perfect chop, so chop it roughly. You will feel how juicy it is from inside.Add chopped onion with its juice to the yogurt mixture.Mix it well. And keep refrigerated until you serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/onion-raita-roasted-onion-raita-600811', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}