{u'recipes': [{u'sourceName': u'Will Cook for Smiles', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/626371-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 626371, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta E Fagioli Soup II', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 184.43, u'creditText': u'Will Cook for Smiles', u'extendedIngredients': [{u'originalString': u'2 medium carrots, diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 cup diced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1\xbd cups uncooked ditalini pasta (cooked separately)', u'aisle': u'Pasta and Rice', u'name': u'ditalini pasta', u'metaInformation': [u'uncooked', u'cooked', u'( separately)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ditalini.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020499, u'unit': u'cups'}, {u'originalString': u'1 14.5 oz can of tomatoes (I prefer fire roasted)', u'aisle': u'Canned and Jarred', u'name': u'fire roasted canned tomatoes', u'metaInformation': [u'fire roasted', u'canned', u'(I prefer )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 98849, u'unit': u'oz'}, {u'originalString': u'2 tsp fresh basil, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tsp'}, {u'originalString': u'1 tsp fresh rosemary, minced', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tsp'}, {u'originalString': u'1 tsp fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'3 large garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'Grated Parmesan cheese for topping', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'salt, fresh cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 15-oz can of cannelloni beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16033, u'unit': u'oz'}, {u'originalString': u'4 oz tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'4 cups of vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 medium Vidalia onion, diced', u'aisle': u'Produce', u'name': u'vidalia onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.willcookforsmiles.com/2015/01/pasta-e-fagioli-soup-ii.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Cook ditalini, drain and set aside.Preheat olive oil in a large pot, over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ditalini.png', u'id': 10020499, u'name': u'ditalini'}]}, {u'equipment': [], u'step': u'Add diced onion, diced carrots and diced celery.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Saute until vegetable start to soften.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add minced garlic and saute until fragrant.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Add can of tomatoes (don't drain), make sure they are diced as well. Stir well.", u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain beans and add them to the pot as well.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add stock and tomato sauce, stir well. Raise heat to medium-high and bring soup to boil. Once it starts to boil, lower heat back to medium.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add salt, pepper, thyme, basil and rosemary. Stir, cover and cook for 10-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cooked pasta and cook for another 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add some grated Parmesan cheese on top of each bowl as you serve it.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Castello di Volpaia Chianti Classico Riserva with a 4.1 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Color: Ruby red with a trace of garnet Nose: Elegant and intense with hints of spices connected with fruity scents Taste: Good structure with evident tannins and long persistence', u'title': u'Castello di Volpaia Chianti Classico Riserva', u'price': u'$23.99', u'id': 439055, u'link': u'https://www.wine.com/product/castello-di-volpaia-chianti-classico-riserva-2003/92756', u'imageUrl': u'https://spoonacular.com/productImages/439055-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u"Cook ditalini, drain and set aside.Preheat olive oil in a large pot, over medium heat.Add diced onion, diced carrots and diced celery. Saute until vegetable start to soften.Add minced garlic and saute until fragrant.Add can of tomatoes (don't drain), make sure they are diced as well. Stir well.Drain beans and add them to the pot as well.Add stock and tomato sauce, stir well. Raise heat to medium-high and bring soup to boil. Once it starts to boil, lower heat back to medium.Add salt, pepper, thyme, basil and rosemary. Stir, cover and cook for 10-15 minutes.Add cooked pasta and cook for another 5 minutes.Add some grated Parmesan cheese on top of each bowl as you serve it.", u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-e-fagioli-soup-ii-626371', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 7, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}