{u'recipes': [{u'sourceName': u'Just a Taste', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/516115-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 516115, u'veryPopular': True, u'lowFodmap': False, u'title': u'Apple Pie Panini', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 95.21, u'creditText': u'Just a Taste', u'extendedIngredients': [{u'originalString': u'4 tablespoons (1/2 stick) butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'8 slices cinnamon raisin bread, sliced from a dense a bakery loaf', u'aisle': u'Bakery/Bread', u'name': u'cinnamon raisin bread', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-raisin-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18047, u'unit': u'slices'}, {u'originalString': u'1 Granny Smith or other firm apple, cored and thinly sliced', u'aisle': u'Produce', u'name': u'granny smith apple', u'metaInformation': [u'firm', u'cored', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-delicious-apples.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 1029003, u'unit': u''}, {u'originalString': u'2 teaspoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'2 Tablespoons light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 cup mascarpone cheese', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93820, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.justataste.com/2013/09/apple-pie-panini-press-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Either in a small bowl with a whisk or in a mini food processor, whip the mascarpone and honey together until it’s well combined and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Spread butter on two slices of bread to flavor the outside of the sandwich. Flip over both slices of bread and spread 1 tablespoon sweetened mascarpone on each. Top one slice of bread with a layer of apples and close the sandwich with the other slice, buttered side up. Sprinkle some brown sugar on top.Grill two panini at a time, with the lid closed, until the fillings are warmed and the bread is toasted, with a sweet crust, 3 to 5 minutes. Top each sandwich with a scoop of vanilla bean ice cream (optional) and serve.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u'Heat the panini press to medium-high heat.For each sandwich'}], u'aggregateLikes': 64763, u'instructions': u'Either in a small bowl with a whisk or in a mini food processor, whip the mascarpone and honey together until it’s well combined and fluffy.Heat the panini press to medium-high heat.For each sandwich: Spread butter on two slices of bread to flavor the outside of the sandwich. Flip over both slices of bread and spread 1 tablespoon sweetened mascarpone on each. Top one slice of bread with a layer of apples and close the sandwich with the other slice, buttered side up. Sprinkle some brown sugar on top.Grill two panini at a time, with the lid closed, until the fillings are warmed and the bread is toasted, with a sweet crust, 3 to 5 minutes. Top each sandwich with a scoop of vanilla bean ice cream (optional) and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-pie-panini-516115', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}