{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213355-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 210, u'id': 213355, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fig & honey Christmas cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 336.4, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'\xbd tsp bicarbonate of soda', u'aisle': u'Baking', u'name': u'bicarbonate of soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'100g blanched whole almonds, roughly chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'blanched almonds', u'metaInformation': [u'whole', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blanched-almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12062, u'unit': u'g'}, {u'originalString': u'3 tbsp brandy, plus extra to feed', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'tbsp'}, {u'originalString': u'250g lightly salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2 tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'200g dried figs, roughly chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 9094, u'unit': u'g'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100g glac\xe9 cherries, well rinsed and quartered', u'aisle': u'Produce;Baking', u'name': u'glace cherries', u'metaInformation': [u'rinsed', u'quartered', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-cherries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93742, u'unit': u'g'}, {u'originalString': u'1 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'750g mixed dried fruits', u'aisle': u'Produce', u'name': u'kiwi fruits', u'metaInformation': [u'mixed', u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 750.0, u'consistency': u'solid', u'id': 9148, u'unit': u'g'}, {u'originalString': u'zest 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'250g light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u'100g chopped peel', u'aisle': u'Produce', u'name': u'lime peel', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'g'}, {u'originalString': u'1 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'1 tsp grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'300g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 tbsp black treacle', u'aisle': u'Baking', u'name': u'black treacle', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93774, u'unit': u'tbsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/13381/fig-and-honey-christmas-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 140.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 140C/120C fan/gas 1.Line the base and sides of a 20cm caketin first with a double layer of brownpaper, then with a double layer of bakingparchment. In a large bowl, mix the fruit,almonds, peel, figs and cherries. Turn welland add the flour, spices and lemon zest.In a separate bowl, cream the butter andsugar thoroughly, then add the vanillaextract, honey and treacle. Still beating,incorporate the eggs, then stir in the fruitand flour mixture. Dissolve the bicarbonateof soda in the milk and stir in thoroughly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}], u'step': u'Add the brandy by the spoonful, until youhave a soft dropping consistency.Turn the batter into the cake tin andmake a dip in the middle using the backof a spoon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake for 3\xbd hrs, then insert askewer – if it comes out clean, it’s ready.If there is any cake mix on the skewer,give it 10 mins more and test again.When it’s done, remove the cake from theoven and leave to cool in its tin. The nextday, remove from the tin, wrap in freshgreaseproof paper, then put it into anairtight tin or wrap tightly in foil. The usualthing is to keep the cake for at least amonth before icing it, and to unwrap andsprinkle it occasionally with more brandy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 271, u'instructions': u'Heat oven to 140C/120C fan/gas 1.Line the base and sides of a 20cm caketin first with a double layer of brownpaper, then with a double layer of bakingparchment. In a large bowl, mix the fruit,almonds, peel, figs and cherries. Turn welland add the flour, spices and lemon zest.In a separate bowl, cream the butter andsugar thoroughly, then add the vanillaextract, honey and treacle. Still beating,incorporate the eggs, then stir in the fruitand flour mixture. Dissolve the bicarbonateof soda in the milk and stir in thoroughly.Add the brandy by the spoonful, until youhave a soft dropping consistency.Turn the batter into the cake tin andmake a dip in the middle using the backof a spoon. Bake for 3\xbd hrs, then insert askewer – if it comes out clean, it’s ready.If there is any cake mix on the skewer,give it 10 mins more and test again.When it’s done, remove the cake from theoven and leave to cool in its tin. The nextday, remove from the tin, wrap in freshgreaseproof paper, then put it into anairtight tin or wrap tightly in foil. The usualthing is to keep the cake for at least amonth before icing it, and to unwrap andsprinkle it occasionally with more brandy.', u'spoonacularSourceUrl': u'https://spoonacular.com/fig-honey-christmas-cake-213355', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}