{u'recipes': [{u'sourceName': u'Joanne Eats Well with Others', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/562722-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 562722, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Stout Waffles with Chocolate-Peanut Butter Syrup #DivineInNYC', u'diets': [], u'pricePerServing': 144.78, u'creditText': u'Joanne Eats Well with Others', u'extendedIngredients': [{u'originalString': u'2 cups all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'4 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'5.3 oz bittersweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.3, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'\xbc cup cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1/3 cup smooth peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 16150, u'unit': u'cup'}, {u'originalString': u'1 cup chocolate stout beer', u'aisle': u'Alcoholic Beverages', u'name': u'stout beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93619, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tablespoons'}, {u'originalString': u'5 Tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://joanne-eatswellwithothers.com/2013/10/chocolate-stout-waffles-with-chocolate-peanut-butter-syrup-divineinnyc.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, whisk together the flour, cocoa powder, salt, baking powder, and sugar. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine the butter and milk in a pot and simmer until butter is melted.Make a well in the center of the flour mixture and pour in the milk/butter mix, vanilla extract, beer, and eggs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until just combined.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let rest in the refrigerator for 20 minutes.In the meantime, make the chocolate sauce.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Combine the chocolate and peanut butter in a microwave-safe bowl. Microwave in 30-second increments, stirring after each one, until chocolate and peanut butter are melted into each other. Stir in the sea salt, to taste.When the waffle batter is done resting, preheat a waffle iron. Cook according to manufacturer's directions.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Drizzle with the chocolate-peanut butter syrup.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1284, u'instructions': u"In a large bowl, whisk together the flour, cocoa powder, salt, baking powder, and sugar. Set aside.Combine the butter and milk in a pot and simmer until butter is melted.Make a well in the center of the flour mixture and pour in the milk/butter mix, vanilla extract, beer, and eggs. Whisk until just combined. Let rest in the refrigerator for 20 minutes.In the meantime, make the chocolate sauce. Combine the chocolate and peanut butter in a microwave-safe bowl. Microwave in 30-second increments, stirring after each one, until chocolate and peanut butter are melted into each other. Stir in the sea salt, to taste.When the waffle batter is done resting, preheat a waffle iron. Cook according to manufacturer's directions. Drizzle with the chocolate-peanut butter syrup.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-stout-waffles-with-chocolate-peanut-butter-syrup-divineinnyc-562722', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}