{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/518005-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 518005, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pizza Pinwheels', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 65.99, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup 2% Greek Yogurt (see tips below)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'2%', u'(see tips below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'3/4 cup shredded Italian cheese blend (or mixed mozzarella & Parmesan), divided', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'mixed', u'shredded', u'italian', u'divided', u'(or mozzarella & Parmesan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93651, u'unit': u'cup'}, {u'originalString': u'pizza or smooth marinara sauce, warmed', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'servings'}, {u'originalString': u'3/4 cup chopped pepperoni', u'aisle': u'Meat', u'name': u'pepperoni', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 7057, u'unit': u'cup'}, {u'originalString': u'3 tablespoons prepared pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoons'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup Gold Medal\xae Self-Rising Flour', u'aisle': u'Baking', u'name': u'self-rising flour', u'metaInformation': [u'gold medal\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20129, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.recipegirl.com/2013/01/17/pizza-pinwheels/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.  Line a baking sheet with parchment paper or a silpat mat (or spray with nonstick spray).2.  In a medium bowl, whisk together the flour, sugar and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in the yogurt and continue to stir and mix until the ingredients are well-combined and forming a dough.  Turn out the dough onto a well-floured surface.  Knead a bit until the dough comes together well, sprinkling in more flour if needed.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Roll the dough into a rectangle (about 9x14-inches).3.  Spoon the pesto onto the rolled out dough, using the bottom of a spoon to spread it out evenly.  Sprinkle with the chopped pepperoni.  Top with 1/2 cup cheese.  4.  Carefully roll up the dough into a log.  It will be a little soft and precarious.  Use a sharp knife to cut about 1/2-inch slices.  Hold the sliced roll together with your fingers while you transfer it to the prepared baking sheet.  Repeat with the remaining slices.5.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'id': 7057, u'name': u'pepperoni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Bake 20 minutes, or until cooked through and lightly browned.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm with sauce.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Madsen Family Cellars Sangiovese Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 26 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This wine has a pronounced nose with a hint of coffee while your mouth is invaded with spices; clove, licorice, and cinnamon.The palate features cherries and notes of clove which continue on to a smooth, long finish with subtle oak, slight pepper and berry flavors. The tartness of the wine works well with food as Sangiovese is a food wine, but can be enjoyed on its own as well. Columbia Valley AVA from the vineyards of Jordan Reed.', u'title': u'Madsen Family Cellars Sangiovese Wine', u'price': u'$26.0', u'id': 431618, u'link': u'https://www.amazon.com/2009-Madsen-Family-Cellars-Sangiovese/dp/B00I0F3FJA', u'imageUrl': u'https://spoonacular.com/productImages/431618-312x231.jpg'}]}, u'aggregateLikes': 28707, u'instructions': u'1.  Preheat the oven to 350 degrees F.  Line a baking sheet with parchment paper or a silpat mat (or spray with nonstick spray).2.  In a medium bowl, whisk together the flour, sugar and salt.  Mix in the yogurt and continue to stir and mix until the ingredients are well-combined and forming a dough.  Turn out the dough onto a well-floured surface.  Knead a bit until the dough comes together well, sprinkling in more flour if needed.  Roll the dough into a rectangle (about 9x14-inches).3.  Spoon the pesto onto the rolled out dough, using the bottom of a spoon to spread it out evenly.  Sprinkle with the chopped pepperoni.  Top with 1/2 cup cheese.  4.  Carefully roll up the dough into a log.  It will be a little soft and precarious.  Use a sharp knife to cut about 1/2-inch slices.  Hold the sliced roll together with your fingers while you transfer it to the prepared baking sheet.  Repeat with the remaining slices.5.  Bake 20 minutes, or until cooked through and lightly browned.  Serve warm with sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/pizza-pinwheels-518005', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}