{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/672259-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 672259, u'veryPopular': False, u'lowFodmap': False, u'title': u'Madeira Cake Truffles', u'diets': [u'gluten free'], u'preparationMinutes': 480, u'pricePerServing': 2551.41, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'3 tablespoons apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19719, u'unit': u'tablespoons'}, {u'originalString': u'Gold Leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'Leaf', u'unitShort': u'Leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u'Leaf'}, {u'originalString': u'2 tablespoons finely chopped candied orange peel', u'aisle': u'Produce;Baking', u'name': u'candied orange peel', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9426, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces (about 3 cups) Madeira cake crumbs, or any white or yellow cake, with the outside crust edges removed', u'aisle': u'Alcoholic Beverages', u'name': u'madeira', u'metaInformation': [u'white', u'yellow', u'or any  or  cake, with the outside crust edges removed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 10014106, u'unit': u'cups'}, {u'originalString': u'1 tablespoon shortening (optional, not used if tempering chocolate)', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [u'(optional, not used if tempering chocolate)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons whipping (heavy) cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [u'(heavy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces white chocolate, melted and cooled', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 19087, u'unit': u'ounces'}, {u'originalString': u'6 ounces white chocolate', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19087, u'unit': u'ounces'}, {u'originalString': u'Gold Disco Dust', u'aisle': u'Produce', u'name': u'yukon gold', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'serving'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://thebakingpan.com/recipes/candy/madeira-cake-truffles/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 117, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, combine cake crumbs and candied orange peel.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'id': 9426, u'name': u'candied orange peel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the apricot jam in a small saucepan over low heat or in the microwave for 10 to 20 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot jam'}]}, {u'equipment': [], u'step': u'Add warmed apricot jam, whipping cream and melted white chocolate to cake mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot jam'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix with a rubber spatula, wooden spoon, or your hands to thoroughly combine ingredients.Shape mixture into small balls, using about 2 teaspoons of mixture for each ball. Tip: A small ice cream scoop is ideal for making uniform-sized candies.The balls will be moist and sticky until they sit and dry out a bit. Cover the cake balls and refrigerate until well chilled, 1 to 2 hours or overnight to firm up and loose some of their stickiness.In top of a double boiler over hot water, melt chocolate. Stir in the shortening. Set aside to cool. Tip: Create a double boiler by filling a saucepan with 2 inches of water and bringing it to a simmer. Turn the heat off and place a stainless steel, ceramic, or glass bowl on top of the hot water, the upper pan should not touch the water.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the cooled bowl of chocolate over a pan of hot water to keep the chocolate a liquid consistency for dipping.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place one truffle at a time in the chocolate, gently turn it over with a fork or candy dipping fork. Use the fork to lift the truffle out of the chocolate and tap the fork on the rim of the bowl to allow excess chocolate to drip back into the pan, and then draw the underside of the fork over the rim of the pan to remove any drips of chocolate. Gently place the chocolate coated truffles on the prepared baking pan, pushing the truffle off the fork with another fork.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Let truffles sit until the chocolate is dry and firm. Tip: refrigerate chocolate coated truffles about 30 minutes for the chocolate to become firm. However, if the chocolate has been tempered the balls do not need to be refrigerated as the chocolate should set quickly.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Place small bits of gold leaf on the top of each truffle, and then sprinkle with gold disco dust. The gold leaf is very delicate and needs to be applied carefully, in a room with no drafts.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Place the truffles on a work surface close-by to the gold leaf. Touch the tip of a small artist paintbrush to a corner of the gold leaf and lift a small piece of piece of gold leaf onto each truffle. Use a second paintbrush if necessary to push the gold leaf off the first paintbrush. Dont worry if the gold leaf tears, just place it randomly on top of the truffles, and smooth it down with the paintbrush. Static will cause the gold leaf to adhere to the paintbrush bristles. Try not to breathe on the gold leaf before it is on the truffles, it will blow away into the air.Store in an airtight container in the refrigerator up to 1 week. Makes about 38 truffles.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'In a large mixing bowl, combine cake crumbs and candied orange peel.Heat the apricot jam in a small saucepan over low heat or in the microwave for 10 to 20 seconds. Add warmed apricot jam, whipping cream and melted white chocolate to cake mixture. Mix with a rubber spatula, wooden spoon, or your hands to thoroughly combine ingredients.Shape mixture into small balls, using about 2 teaspoons of mixture for each ball. Tip: A small ice cream scoop is ideal for making uniform-sized candies.The balls will be moist and sticky until they sit and dry out a bit. Cover the cake balls and refrigerate until well chilled, 1 to 2 hours or overnight to firm up and loose some of their stickiness.In top of a double boiler over hot water, melt chocolate. Stir in the shortening. Set aside to cool. Tip: Create a double boiler by filling a saucepan with 2 inches of water and bringing it to a simmer. Turn the heat off and place a stainless steel, ceramic, or glass bowl on top of the hot water, the upper pan should not touch the water.Place the cooled bowl of chocolate over a pan of hot water to keep the chocolate a liquid consistency for dipping.Place one truffle at a time in the chocolate, gently turn it over with a fork or candy dipping fork. Use the fork to lift the truffle out of the chocolate and tap the fork on the rim of the bowl to allow excess chocolate to drip back into the pan, and then draw the underside of the fork over the rim of the pan to remove any drips of chocolate. Gently place the chocolate coated truffles on the prepared baking pan, pushing the truffle off the fork with another fork. Let truffles sit until the chocolate is dry and firm. Tip: refrigerate chocolate coated truffles about 30 minutes for the chocolate to become firm. However, if the chocolate has been tempered the balls do not need to be refrigerated as the chocolate should set quickly.Place small bits of gold leaf on the top of each truffle, and then sprinkle with gold disco dust. The gold leaf is very delicate and needs to be applied carefully, in a room with no drafts. Place the truffles on a work surface close-by to the gold leaf. Touch the tip of a small artist paintbrush to a corner of the gold leaf and lift a small piece of piece of gold leaf onto each truffle. Use a second paintbrush if necessary to push the gold leaf off the first paintbrush. Dont worry if the gold leaf tears, just place it randomly on top of the truffles, and smooth it down with the paintbrush. Static will cause the gold leaf to adhere to the paintbrush bristles. Try not to breathe on the gold leaf before it is on the truffles, it will blow away into the air.Store in an airtight container in the refrigerator up to 1 week. Makes about 38 truffles.', u'spoonacularSourceUrl': u'https://spoonacular.com/madeira-cake-truffles-672259', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 480, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}