{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/73721-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 73721, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crunchy Garden-Style Dogs', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 87.66, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1/3 cup chopped cucumbers', u'aisle': u'Produce', u'name': u'cucumbers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'1 green onion, sliced', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'5 hot dog buns', u'aisle': u'Bakery/Bread', u'name': u'hot dog buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10018350, u'unit': u''}, {u'originalString': u'2 plum tomatoes, chopped', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'2 Tbsp. KRAFT Light Red Wine Vinaigrette Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinaigrette dressing', u'metaInformation': [u'light', u'red', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4135, u'unit': u'Tbsp'}, {u'originalString': u'5 OSCAR MAYER Jumbo Wieners', u'aisle': u'Meat', u'name': u'wieners', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 21118, u'unit': u''}, {u'originalString': u'1/3 cup chopped yellow peppers', u'aisle': u'Produce', u'name': u'yellow peppers', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11951, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/crunchy-garden-style-dogs-64861.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill wieners 7 to 9 min. or until heated through, turning occasionally.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}]}, {u'equipment': [], u'step': u'Combine vegetables and dressing.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Fill buns with wieners and vegetable mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Gewurztraminer, and ros\xe9 Wine are great choices for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. The Pacific Rim Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'Portraying bright crispness, subtle sweetness and aromas of jasmine, pear and apple, Pacific Rim Riesling exemplifies the harmony of Riesling. The sweetness plays wonderfully with fiery fare (from Thai to Mexican), while the natural acidity stands up to richer foods (from French to German). View More', u'title': u'Pacific Rim Riesling', u'price': u'$11.99', u'id': 446903, u'link': u'https://www.wine.com/product/pacific-rim-riesling-2011/119629', u'imageUrl': u'https://spoonacular.com/productImages/446903-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Heat grill to medium heat.                                            Grill wieners 7 to 9 min. or until heated through, turning occasionally.                                              Combine vegetables and dressing.                                             Fill buns with wieners and vegetable mixture.', u'spoonacularSourceUrl': u'https://spoonacular.com/crunchy-garden-style-dogs-73721', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}