{u'recipes': [{u'sourceName': u'Dessert for Two', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547152-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 547152, u'veryPopular': True, u'lowFodmap': False, u'title': u'Jam Cocktails: Pumpkin Butter + Wheat Whiskey', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 26.71, u'creditText': u'Dessert for Two', u'extendedIngredients': [{u'originalString': u'\xbc cup pumpkin butter', u'aisle': u'Produce', u'name': u'butter nut pumpkin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11485, u'unit': u'cup'}, {u'originalString': u'\xbc cup caramel sauce (or 10 caramels, melted in microwave)', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'melted', u'(or 10 caramels, in microwave)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19364, u'unit': u'cup'}, {u'originalString': u'4 shots wheat whiskey', u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 14052, u'unit': u''}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.dessertfortwo.com/2013/10/jam-cocktails-pumpkin-butter-wheat-whiskey/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour caramel sauce in a shallow bowl that will fit the rim of the serving glass. Dip each glass in caramel, and put them in the fridge for 10 minutes to set.Fill a martini shaker with ice.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}]}, {u'equipment': [], u'step': u'Add all remaining ingredients and shake, shake, shake. Strain and serve in glasses.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 444, u'instructions': u'Pour caramel sauce in a shallow bowl that will fit the rim of the serving glass. Dip each glass in caramel, and put them in the fridge for 10 minutes to set.Fill a martini shaker with ice. Add all remaining ingredients and shake, shake, shake. Strain and serve in glasses.', u'spoonacularSourceUrl': u'https://spoonacular.com/jam-cocktails-pumpkin-butter-+-wheat-whiskey-547152', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}