{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/463814-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 463814, u'veryPopular': False, u'lowFodmap': False, u'title': u"Pork 'n' Shrimp Spring Rolls", u'diets': [u'dairy free'], u'preparationMinutes': 60, u'pricePerServing': 56.53, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (8 ounces) bamboo shoots, drained and chopped', u'aisle': u'Ethnic Foods', u'name': u'bamboo shoots', u'metaInformation': [u'drained', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11028, u'unit': u'ounces'}, {u'originalString': u'1 can (14 ounces) bean sprouts, drained', u'aisle': u'Produce;Ethnic Foods', u'name': u'bean sprouts', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 11043, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'4 green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 pound ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10219, u'unit': u'pound'}, {u'originalString': u'1 can (4 ounces) mushroom stems and pieces, drained and chopped', u'aisle': u'Produce', u'name': u'mushroom', u'metaInformation': [u'drained', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'Oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 64.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1/2 pound cooked medium shrimp, peeled, deveined and finely chopped', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'cooked', u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'3 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'Sweet-and-sour sauce', u'aisle': u'Ethnic Foods', u'name': u'sweet soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 64.0, u'consistency': u'liquid', u'id': 10016124, u'unit': u'servings'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'2 packages (12 ounces each) wonton wrappers', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pork--n--shrimp-spring-rolls', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook pork over medium heat until no longer pink; drain. Stir in the bean sprouts, bamboo shoots, shrimp, mushrooms and onions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'id': 11028, u'name': u'bamboo shoots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'id': 11043, u'name': u'bean sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, whisk the cornstarch, soy sauce, water, garlic powder and oil until smooth; stir into skillet. Bring to a boil; cook and stir for 1 minute or until thickened.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Remove from the heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Position a wonton wrapper with one point toward you. (Keep remaining wrappers covered with a damp paper towel until ready to use.)', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place 2 heaping teaspoons of filling in the center of wrapper. Fold bottom corner over filling; fold sides toward center over filling.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Roll toward the remaining point. Moisten top corner with water; press to seal. Repeat with remaining wrappers and filling.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In an electric skillet or deep-fat fryer, heat oil to 375\xb0. Fry spring rolls, a few at a time, for 1-2 minutes on each side or until golden brown.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm with sweet-and-sour sauce.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Spring Rolls. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u"Directions                                                                                In a large skillet, cook pork over medium heat until no longer pink; drain. Stir in the bean sprouts, bamboo shoots, shrimp, mushrooms and onions.                                                                                            In a small bowl, whisk the cornstarch, soy sauce, water, garlic powder and oil until smooth; stir into skillet. Bring to a boil; cook and stir for 1 minute or until thickened. Remove from the heat.                                                                                           Position a wonton wrapper with one point toward you. (Keep remaining wrappers covered with a damp paper towel until ready to use.) Place 2 heaping teaspoons of filling in the center of wrapper. Fold bottom corner over filling; fold sides toward center over filling. Roll toward the remaining point. Moisten top corner with water; press to seal. Repeat with remaining wrappers and filling.                                                                                            In an electric skillet or deep-fat fryer, heat oil to 375\xb0. Fry spring rolls, a few at a time, for 1-2 minutes on each side or until golden brown. Drain on paper towels. Serve warm with sweet-and-sour sauce.                                        Yield: about 5 dozen.                                                                                                                         Originally published as Pork 'n' Shrimp Spring Rolls in  Taste of HomeDecember/January 2008, p53                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/pork-n-shrimp-spring-rolls-463814', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 64, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}