{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/433963-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 600, u'id': 433963, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Northern White Bean Bacon Chowder', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 132.65, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'6 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 carrot, chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stalk celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'3 (14.5 ounce) cans low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'low-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 43.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups dried great Northern beans, rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dried great northern beans', u'metaInformation': [u'dried', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16024, u'unit': u'cups'}, {u'originalString': u'1/8 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 potato - peeled and cubed', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'cubed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1 teaspoon Italian-style seasoning', u'name': u'seasoning', u'metaInformation': [u'italian-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'teaspoon'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Slow-Cooker-Northern-White-Bean-Bacon-Chowder/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place beans in a large bowl with the water, cover, and soak overnight.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet over medium to medium high heat, fry the bacon until crispy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Drain the bacon fat and crumble the bacon; set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a slow cooker, combine the carrot, celery, onion, potato, Italian- style seasoning, ground black pepper, reserved beans and crumbled bacon.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour the broth over all.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cover and cook on low setting for 7 1/2 to 9 hours, or until beans are crisp to tender.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer 2 cups at a time to a blender or food processor and puree until smooth. Return all to slow cooker, add the milk, cover and heat on high for about 10 to 15 minutes, or until heated through.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chowder works really well with Chardonnay, Riesling, and Sauvignon Blanc. Chowder can benefit from a crisp white to cut through the rich, creamy broth - or you can go big or go home with a rich, buttery chardonnay. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'riesling', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 75, u'instructions': u'Place beans in a large bowl with the water, cover, and soak overnight.                            In a large skillet over medium to medium high heat, fry the bacon until crispy. Drain the bacon fat and crumble the bacon; set aside.                            In a slow cooker, combine the carrot, celery, onion, potato, Italian- style seasoning, ground black pepper, reserved beans and crumbled bacon. Pour the broth over all.                            Cover and cook on low setting for 7 1/2 to 9 hours, or until beans are crisp to tender.                            Transfer 2 cups at a time to a blender or food processor and puree until smooth. Return all to slow cooker, add the milk, cover and heat on high for about 10 to 15 minutes, or until heated through.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-northern-white-bean-bacon-chowder-433963', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 630, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}