{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/467600-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 467600, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bean and Meat Loaf', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 135.46, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2-1/2 pounds lean ground beef (90% lean)', u'aisle': u'Meat', u'name': u'90% lean ground beef', u'metaInformation': [u'90%', u'lean', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23562, u'unit': u'pounds'}, {u'originalString': u'1 can (16 ounces) kidney beans, rinsed, drained and mashed', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'rinsed', u'mashed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16034, u'unit': u'ounces'}, {u'originalString': u'1 celery rib, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'2 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-1/2 cups ketchup, divided', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'cups'}, {u'originalString': u'1 teaspoon salt-free lemon-pepper seasoning', u'aisle': u'Spices and Seasonings', u'name': u'lemon-pepper seasoning', u'metaInformation': [u'salt-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012030, u'unit': u'teaspoon'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup seasoned bread crumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'seasoned bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18376, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon seasoned salt', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1042047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoons'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/bean-and-meat-loaf', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the eggs, 1 cup ketchup, beans, bread crumbs, onion, celery, Worcestershire sauce, lemon-pepper and seasoned salt; crumble beef over mixture and mix well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Shape into two loaves.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place in a 13-in. x 9-in. baking dish coated with cooking spray.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, combine water and remaining ketchup; pour over meat loaves.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake, uncovered, at 325\xb0 for 70 minutes or until meat is no longer pink and a meat thermometer reads 160\xb0.', u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Meatloaf works really well with Cabernet Sauvignon and Zinfandel. Meatloaf will work with many red wines. We recommend something bold and fruity, like a Cabernet Sauvignon or Zinfandel. One wine you could try is Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc. It has 4.2 out of 5 stars and a bottle costs about 8 dollars.", u'pairedWines': [u'cabernet sauvignon', u'zinfandel'], u'productMatches': [{u'description': u'Cabernet Sauvignon 100%', u'title': u"Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc", u'price': u'$7.99', u'id': 454922, u'link': u'https://www.wine.com/product/vincent-bouquet-cabernet-sauvignon-vin-de-pays-doc-2006/101798', u'imageUrl': u'https://spoonacular.com/productImages/454922-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Directions                                                                                In a large bowl, combine the eggs, 1 cup ketchup, beans, bread crumbs, onion, celery, Worcestershire sauce, lemon-pepper and seasoned salt; crumble beef over mixture and mix well.                                                                                            Shape into two loaves. Place in a 13-in. x 9-in. baking dish coated with cooking spray.                                                                                           In a bowl, combine water and remaining ketchup; pour over meat loaves. Bake, uncovered, at 325\xb0 for 70 minutes or until meat is no longer pink and a meat thermometer reads 160\xb0.                                        Yield: 12 servings.                                                                                                                         Originally published as Deluxe Meat Loaf in  Light & TastyDecember/January 2002, p27                                                                                                                                                                                                        Nutritional Facts                                                                             One serving equals 267 calories, 10 g fat (4 g saturated fat), 70 mg cholesterol, 853 mg sodium, 21 g carbohydrate, 2 g fiber, 24 g protein. Diabetic Exchanges: 3 lean meat, 1-1/2 starch.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/bean-and-meat-loaf-467600', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}