{u'recipes': [{u'sourceName': u'Perrys Plate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556916-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 556916, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brussels, Sausage, & Apple Hash', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 130.01, u'creditText': u'Perrys Plate', u'extendedIngredients': [{u'originalString': u'1 apple, cored and diced', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'diced', u'cored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 Tablespoon apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'Tablespoon'}, {u'originalString': u'1 pound Brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'pound'}, {u'originalString': u"1 pre-cooked chicken sausage link, diced (I used Aidell's Chicken & Apple Sausage)", u'aisle': u'Meat', u'name': u'chicken sausage', u'metaInformation': [u'diced', u'pre-cooked', u"(I used Aidell's Chicken & Apple Sausage)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93668, u'unit': u''}, {u'originalString': u'2 Tablespoons coconut oil or butter, divided', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tablespoons'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon whole grain mustard', u'aisle': u'Condiments', u'name': u'whole grain mustard', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'teaspoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.perrysplate.com/2012/10/brussels-sausage-apple-hash-a-peek-into-my-real-life.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Trim ends off of the Brussels and discard them with any wilted-looking leaves. Slice them in half, and quarter them if they're particularly large, to make similarly-sized pieces.Melt 1 Tablespoon of oil in a medium skillet over medium heat. Make sure the pan is really hot before putting in the sprouts (you'll want them to brown before they cook too much). Cook them for about 5 minutes. Toss them around every so often until you start to see dark, caramelized spots.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer them to a bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the other Tablespoon of oil to the skillet with the chopped apple and sausage. Cook for about 4-5 minutes until the apples begin to soften slightly and the sausage is heated through and has a few dark spots.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the mustard and the vinegar to the skillet; stir to combine.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the sprouts back to the skillet and cook for another minute or so. Season to taste with a pinch or two of salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'aggregateLikes': 461, u'instructions': u"Trim ends off of the Brussels and discard them with any wilted-looking leaves. Slice them in half, and quarter them if they're particularly large, to make similarly-sized pieces.Melt 1 Tablespoon of oil in a medium skillet over medium heat. Make sure the pan is really hot before putting in the sprouts (you'll want them to brown before they cook too much). Cook them for about 5 minutes. Toss them around every so often until you start to see dark, caramelized spots. Transfer them to a bowl.Add the other Tablespoon of oil to the skillet with the chopped apple and sausage. Cook for about 4-5 minutes until the apples begin to soften slightly and the sausage is heated through and has a few dark spots. Add the mustard and the vinegar to the skillet; stir to combine. Add the sprouts back to the skillet and cook for another minute or so. Season to taste with a pinch or two of salt and pepper.", u'spoonacularSourceUrl': u'https://spoonacular.com/brussels-sausage-apple-hash-556916', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}