{u'recipes': [{u'sourceName': u'Shugary Sweets', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/558060-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 28, u'id': 558060, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Pie Bars', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 70.22, u'creditText': u'Shugary Sweets', u'extendedIngredients': [{u'originalString': u'1/2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'4 oz cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 tsp kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1/2 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 can (21oz) Strawberry Pie Filling', u'aisle': u'Baking', u'name': u'strawberry pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-pie-filling.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 99183, u'unit': u'oz'}, {u'originalString': u'1/2 cup unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.shugarysweets.com/2013/08/strawberry-pie-bars', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, beat butter and sugar until creamy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in eggs, one at a time, beating after each addition.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add in flour, salt, baking powder and vanilla.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread batter into a 13x9 baking dish. Top with strawberry pie filling.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-pie-filling.png', u'id': 99183, u'name': u'strawberry pie filling'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake pie bars in a 350 degree oven for about 28-32 minutes, until edges begin to brown. Allow to cool before adding the glaze.For the glaze, beat cream cheese with powdered sugar and vanilla until smooth and creamy. Spoon into a ziploc bag and cut off the tip. Pipe lines of glaze onto cooled bars.', u'length': {u'number': 32, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Serve warm or refrigerate and enjoy cold.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Snake River Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Made from the grapes left to hang on the vine in our estate Arena Valley Vineyard, Late Harvest Riesling is our original dessert wine. Our 2011 has a limeade nose with a hint of minerals and a honey finish. Enjoy this wine with fruit based desserts or as a refreshing aperitif.', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 19150, u'instructions': u'In a large mixing bowl, beat butter and sugar until creamy. Add in eggs, one at a time, beating after each addition. Add in flour, salt, baking powder and vanilla. Spread batter into a 13x9 baking dish. Top with strawberry pie filling.Bake pie bars in a 350 degree oven for about 28-32 minutes, until edges begin to brown. Allow to cool before adding the glaze.For the glaze, beat cream cheese with powdered sugar and vanilla until smooth and creamy. Spoon into a ziploc bag and cut off the tip. Pipe lines of glaze onto cooled bars. Serve warm or refrigerate and enjoy cold.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-pie-bars-558060', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 38, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}