{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/622312-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 622312, u'veryPopular': False, u'lowFodmap': False, u'title': u'Festive Pomegranate Guacamole', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 336.64, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'4 medium ripe avocados, pitted and diced', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'diced', u'pitted', u'ripe', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'Entirely optional: \xbd cup crumbled feta', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'\xbc cup fresh cilantro, mostly leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, pressed or minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 to 2 jalape\xf1os (or 1 serrano pepper), seeded and chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 tablespoons fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'1 medium pomegranate, deseeded (about 1 cup worth of pomegranate arils)', u'aisle': u'Produce', u'name': u'pomegranate', u'metaInformation': [u'medium', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009286, u'unit': u''}, {u'originalString': u'\xbd medium red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 50.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://cookieandkate.com/2014/festive-pomegranate-guacamole/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'With a spoon, scoop the avocado flesh into a medium-sized mixing bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u"Add the lime juice, garlic and salt. Mash the ingredients together with a large fork or potato masher until the avocado is nice and creamy.To ensure that the onion flavor doesn't overpower the guacamole, rinse the chopped onion under running water (I used a fine mesh colander). Pat the onion dry with a paper towel.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the onion, chopped cilantro and jalapeo to the bowl and mix well. Gently stir in  of the pomegranate arils. For extra presentation points, transfer the guacamole to an appropriately sized serving bowl now. Sprinkle remaining pomegranate arils over guacamole, along with some feta, if you'd like.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 163, u'instructions': u"With a spoon, scoop the avocado flesh into a medium-sized mixing bowl. Add the lime juice, garlic and salt. Mash the ingredients together with a large fork or potato masher until the avocado is nice and creamy.To ensure that the onion flavor doesn't overpower the guacamole, rinse the chopped onion under running water (I used a fine mesh colander). Pat the onion dry with a paper towel.Add the onion, chopped cilantro and jalapeo to the bowl and mix well. Gently stir in  of the pomegranate arils. For extra presentation points, transfer the guacamole to an appropriately sized serving bowl now. Sprinkle remaining pomegranate arils over guacamole, along with some feta, if you'd like. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/festive-pomegranate-guacamole-622312', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}