{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/629394-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 629394, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberries ‘n Cream Chocolate Cups', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 337.87, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 cup Pascha Organic Chocolate Chips (55%, 85% or 100%) or Chopped Chocolate Bars (55%, 70% or 85%)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate candy bars', u'metaInformation': [u'55%', u'85%', u'100%', u'70%', u'organic', u'chopped', u'(, or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019904, u'unit': u'cup'}, {u'originalString': u'Chocolate shavings, optional for garnish (I used a peeler to make shavings of the 85% chocolate bar for contrast)', u'aisle': u'Baking', u'name': u'chocolate shavings', u'metaInformation': [u'85%', u'for garnish (i used a peeler to make shavings of the  chocolate bar for contrast)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 10219903, u'unit': u'servings'}, {u'originalString': u'1\xbd cups chilled coconut cream (see note below)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'coconut cream', u'metaInformation': [u'chilled', u'(see note below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12115, u'unit': u'cups'}, {u'originalString': u'1 cup freeze-dried strawberries', u'aisle': u'Dried Fruits', u'name': u'freeze-dried strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freeze-dried-strawberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98946, u'unit': u'cup'}, {u'originalString': u'6 tablespoons organic powdered sugar, or to taste', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'organic', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'Generous pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon non-hydrogenated shortening (I used Nutiva)', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [u'(I used Nutiva)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/strawberry-cream-chocolate-cups', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Melt the chocolate with the shortening, preferably using this method.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Brush half of the chocolate on the sides and bottoms of silicone mini-muffin cup or candy molds (these will provide the easiest release, I do not recommend paper liners or metal tins!). Chill while you prepare the strawberry cream.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the strawberries in a spice grinder and whiz until powdered. If there are a few little specks remaining, not a worry.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Place the chilled coconut cream in a mixing bowl (chilled if possible), along with the powdered strawberries, sugar, vanilla and salt. Beat with a hand mixer until fully incorporated, thick and just a little fluffy. Cover and chill while you finish the chocolate cups.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'id': 12115, u'name': u'coconut cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Brush the rest of the chocolate on the chocolate cups to make them a little thicker / stronger, and return to the refrigerator for 10 minutes.Scoop the strawberry cream into a piping bag and pipe into the chocolate cups. If desired, garnish with chocolate shavings. Cover and chill until ready to serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'id': 10219903, u'name': u'chocolate shavings'}]}], u'name': u''}], u'aggregateLikes': 1189, u'instructions': u'Melt the chocolate with the shortening, preferably using this method.Brush half of the chocolate on the sides and bottoms of silicone mini-muffin cup or candy molds (these will provide the easiest release, I do not recommend paper liners or metal tins!). Chill while you prepare the strawberry cream.Place the strawberries in a spice grinder and whiz until powdered. If there are a few little specks remaining, not a worry.Place the chilled coconut cream in a mixing bowl (chilled if possible), along with the powdered strawberries, sugar, vanilla and salt. Beat with a hand mixer until fully incorporated, thick and just a little fluffy. Cover and chill while you finish the chocolate cups.Brush the rest of the chocolate on the chocolate cups to make them a little thicker / stronger, and return to the refrigerator for 10 minutes.Scoop the strawberry cream into a piping bag and pipe into the chocolate cups. If desired, garnish with chocolate shavings. Cover and chill until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberries-n-cream-chocolate-cups-629394', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}