{u'recipes': [{u'sourceName': u'Beantown Baker', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/509919-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 509919, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Bean Soup with Andouille and Collard Greens', u'diets': [u'dairy free'], u'pricePerServing': 154.65, u'creditText': u'Beantown Baker', u'extendedIngredients': [{u'originalString': u'12 oz andouille sausage links, halved lengthwise and sliced crosswise', u'aisle': u'Meat', u'name': u'andouille sausage', u'metaInformation': [u'halved lengthwise', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 7064, u'unit': u'oz'}, {u'originalString': u'bread for serving', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 18064, u'unit': u'servings'}, {u'originalString': u'2 cans white beans (such as cannellini or great Northern)', u'aisle': u'Canned and Jarred', u'name': u'canned white beans', u'metaInformation': [u'white', u'(such as cannellini or great Northern)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 16051, u'unit': u'cans'}, {u'originalString': u'1 lb celery (about 12 stalks), chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped', u'( 12 stalks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'lb'}, {u'originalString': u'1 bunch collard greens, stems discarded and leaves cut into bite-size pieces (about 8 cups)', u'aisle': u'Produce', u'name': u'collard greens', u'metaInformation': [u'cut into bite-size pieces ( 8 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11161, u'unit': u'bunch'}, {u'originalString': u'4 sprigs fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'kosher salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'8 cups low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.beantownbaker.com/2012/01/white-bean-soup-with-andouille-and.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a 5 or 6-quart stock pot, heat the olive oil on medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion, celery, and thyme. Cook until translucent, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add the andouille sausage and cook for two more minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'id': 7064, u'name': u'andouille sausage'}]}, {u'equipment': [], u'step': u'Add the chicken broth and beans. Cover and simmer for 10-15 minutes.Check seasoning and add more salt and pepper if needed. Stir in the collard greens and cook two minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'id': 11161, u'name': u'collard greens'}]}, {u'equipment': [], u'step': u'Serve immediately with bread of your choice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Southern can be paired with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. You could try Columbia Winery Cellarmaster's Riesling. Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 134, u'instructions': u'In a 5 or 6-quart stock pot, heat the olive oil on medium-high heat. Add the onion, celery, and thyme. Cook until translucent, about 5 minutes.Add the andouille sausage and cook for two more minutes. Add the chicken broth and beans. Cover and simmer for 10-15 minutes.Check seasoning and add more salt and pepper if needed. Stir in the collard greens and cook two minutes.Serve immediately with bread of your choice.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-bean-soup-with-andouille-and-collard-greens-509919', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}