{u'recipes': [{u'sourceName': u'Life Made Simple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611326-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 611326, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pumpkin Pancakes with Buttered Pecan Maple Syrup', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 180.59, u'creditText': u'Life Made Simple', u'extendedIngredients': [{u'originalString': u'1 tsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'3 tbsp. brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. (1/4 stick) butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(1/4 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 c. + 2 tbsp. buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'c'}, {u'originalString': u'1\xbd tsp. cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 c. pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'c'}, {u'originalString': u'1 c. chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'c'}, {u'originalString': u'1 tsp. pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'\xbe c. pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11424, u'unit': u'c'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbe tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1\xbc c. all-purpose or whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20080, u'unit': u'c'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://lifemadesimplebakes.com/2014/09/pumpkin-pancakes-buttered-pecan-maple-syrup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a medium size mixing bowl, add the pumpkin puree, buttermilk, egg, brown sugar and vanilla extract, whisk until combined.In a large mixing bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, and pumpkin pie spice.Make a small "nest" or well in the center of the dry ingredients and pour the wet ingredients in. Using a large whisk or spatula, stir together until only very small lumps remain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a large skillet over medium-high heat and melt a small amount of butter in the pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour  c. of batter into the pan (I can do 2 at a time in my large skillet) and allow the pancake(s) to cook for 2 minutes, then flip and continue cooking for an additional 2 minutes. Repeat with the remaining batter, buttering the pan between each batch.To make the syrup, in a small saucepan, dry toast the chopped pecans until fragrant, taking care not to burn.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat, carefully add the butter, then the syrup. Return to the heat and cook on low for 2-3 minutes, serve over hot pancakes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 510, u'instructions': u'In a medium size mixing bowl, add the pumpkin puree, buttermilk, egg, brown sugar and vanilla extract, whisk until combined.In a large mixing bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, and pumpkin pie spice.Make a small "nest" or well in the center of the dry ingredients and pour the wet ingredients in. Using a large whisk or spatula, stir together until only very small lumps remain.Place a large skillet over medium-high heat and melt a small amount of butter in the pan. Pour  c. of batter into the pan (I can do 2 at a time in my large skillet) and allow the pancake(s) to cook for 2 minutes, then flip and continue cooking for an additional 2 minutes. Repeat with the remaining batter, buttering the pan between each batch.To make the syrup, in a small saucepan, dry toast the chopped pecans until fragrant, taking care not to burn. Remove the pan from the heat, carefully add the butter, then the syrup. Return to the heat and cook on low for 2-3 minutes, serve over hot pancakes.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-pancakes-with-buttered-pecan-maple-syrup-611326', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 19, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}