{u'recipes': [{u'sourceName': u"Oven Lovin'", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603757-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 603757, u'veryPopular': False, u'lowFodmap': False, u'title': u'Killer garden salad with bright lemon dressing', u'diets': [], u'pricePerServing': 150.22, u'creditText': u"Oven Lovin'", u'extendedIngredients': [{u'originalString': u'1 avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/2 bag baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'bags', u'unitShort': u'bag', u'amount': 0.5, u'consistency': u'solid', u'id': 11457, u'unit': u'bag'}, {u'originalString': u'1/2 head broccoli', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11090, u'unit': u'head'}, {u'originalString': u'1/4 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/4 cup shredded carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2 celery stalks', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1/4 cup cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1041009, u'unit': u'cup'}, {u'originalString': u'2-4 slices of ciabatta bread', u'aisle': u'Bakery/Bread', u'name': u'ciabatta bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 93655, u'unit': u'slices'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'servings'}, {u'originalString': u'2 lemons', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2027, u'unit': u'servings'}, {u'originalString': u'3 large radishes', u'aisle': u'Produce', u'name': u'radishes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11429, u'unit': u''}, {u'originalString': u'1/2 small red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/2 heart of romaine', u'aisle': u'Produce', u'name': u'romaine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10111251, u'unit': u''}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 handful watercress', u'aisle': u'Produce', u'name': u'watercress', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11591, u'unit': u'handful'}, {u'originalString': u'1/2 bag argula', u'aisle': u'?', u'name': u'argula', u'metaInformation': [], u'unitLong': u'bags', u'unitShort': u'bag', u'amount': 0.5, u'unit': u'bag'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://ovenlovinblog.com/killer-garden-salad-with-bright-lemon-dressing/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Preheat brolier. Using a serrated knife, slice bread into smallish cubes. Toss with melted butter and lay out bread cubes in a single layer on a rimmed baking sheet. Sprinkle with garlic powder and oregano.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake for 5-10 minutes until toasted.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from baking sheet and set aside.Chop romaine, baby spinach, arugula and watercress into bite-sized pieces and add to a large bowl. Chop the ends off the celery, slice the stalk down the middle and then chop into pieces. Chop the ends of the radishes, slice in half and then chop into thin slices.  Slice the ends off the tomato and then slice into pieces or slices.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 11457, u'name': u'baby spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'id': 11591, u'name': u'watercress'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'id': 11429, u'name': u'radish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Remove the stalk from broccoli and chop the head into florets. Peel the red onion and slice. Chop the ends of the scallions and chop until you get into the green.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add all the veggies to the bowl of lettuce. Chill until just before serving time.Zest one of the lemons and juice both of them.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine zest, juice, olive oil, minced garlic, sugar, salt and pepper in a small bowl and whisk to combine. Chill until just before serving time.Just before serving, slice open the avocado, remove the pit, peel the skins away and chop into pieces.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add to the bowl, along with the cheese and croutons.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Pour dressing on top and toss well to combine.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Preheat brolier. Using a serrated knife, slice bread into smallish cubes. Toss with melted butter and lay out bread cubes in a single layer on a rimmed baking sheet. Sprinkle with garlic powder and oregano. Bake for 5-10 minutes until toasted. Remove from baking sheet and set aside.Chop romaine, baby spinach, arugula and watercress into bite-sized pieces and add to a large bowl. Chop the ends off the celery, slice the stalk down the middle and then chop into pieces. Chop the ends of the radishes, slice in half and then chop into thin slices.  Slice the ends off the tomato and then slice into pieces or slices. Remove the stalk from broccoli and chop the head into florets. Peel the red onion and slice. Chop the ends of the scallions and chop until you get into the green. Add all the veggies to the bowl of lettuce. Chill until just before serving time.Zest one of the lemons and juice both of them. Combine zest, juice, olive oil, minced garlic, sugar, salt and pepper in a small bowl and whisk to combine. Chill until just before serving time.Just before serving, slice open the avocado, remove the pit, peel the skins away and chop into pieces. Add to the bowl, along with the cheese and croutons. Pour dressing on top and toss well to combine.', u'spoonacularSourceUrl': u'https://spoonacular.com/killer-garden-salad-with-bright-lemon-dressing-603757', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}