{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/296797-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 14580, u'id': 296797, u'veryPopular': False, u'lowFodmap': False, u'title': u'Corned Beef', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 302.51, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 bay leaves, crumbled', u'aisle': u'Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 (4 to 5 pound) beef brisket, trimmed', u'aisle': u'Meat', u'name': u'beef brisket', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-brisket.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'liquid', u'id': 13023, u'unit': u'pound'}, {u'originalString': u'1 teaspoon black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 large carrot, coarsely chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'large', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stalk celery, coarsely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 cinnamon stick, broken into several pieces', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'pounds'}, {u'originalString': u'12 whole juniper berries', u'aisle': u'Spices and Seasonings', u'name': u'juniper berries', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/juniper-berries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 93613, u'unit': u''}, {u'originalString': u'1 cup kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'cup'}, {u'originalString': u'1 teaspoon mustard seeds', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoon'}, {u'originalString': u'1 small onion, quartered', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 quarts water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'quarts'}, {u'originalString': u'8 whole allspice berries', u'aisle': u'Spices and Seasonings', u'name': u'whole allspice berries', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-berries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1002001, u'unit': u''}, {u'originalString': u'2 tablespoons saltpeter', u'aisle': u'?', u'name': u'saltpeter', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'unit': u'tablespoons'}], u'healthScore': 26.0, u'imageType': u'jpeg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/alton-brown/corned-beef-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the water into a large 6 to 8 quart stockpot along with salt, sugar, saltpeter, cinnamon stick, mustard seeds, peppercorns, cloves, allspice, juniper berries, bay leaves and ginger. Cook over high heat until the salt and sugar have dissolved.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/juniper-berries.jpg', u'id': 93613, u'name': u'juniper berries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat and add the ice. Stir until the ice has melted. If necessary, place the brine into the refrigerator until it reaches a temperature of 45 degrees F. Once it has cooled, place the brisket in a 2-gallon zip top bag and add the brine. Seal and lay flat inside a container, cover and place in the refrigerator for 10 days. Check daily to make sure the beef is completely submerged and stir the brine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'After 10 days, remove from the brine and rinse well under cool water.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the brisket into a pot just large enough to hold the meat, add the onion, carrot and celery and cover with water by 1-inch. Set over high heat and bring to a boil. Reduce the heat to low, cover and gently simmer for 2 1/2 to 3 hours or until the meat is fork tender.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove from the pot and thinly slice across the grain.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 113, u'instructions': u'Watch how to make this recipe.                    Place the water into a large 6 to 8 quart stockpot along with salt, sugar, saltpeter, cinnamon stick, mustard seeds, peppercorns, cloves, allspice, juniper berries, bay leaves and ginger. Cook over high heat until the salt and sugar have dissolved. Remove from the heat and add the ice. Stir until the ice has melted. If necessary, place the brine into the refrigerator until it reaches a temperature of 45 degrees F. Once it has cooled, place the brisket in a 2-gallon zip top bag and add the brine. Seal and lay flat inside a container, cover and place in the refrigerator for 10 days. Check daily to make sure the beef is completely submerged and stir the brine.                          After 10 days, remove from the brine and rinse well under cool water. Place the brisket into a pot just large enough to hold the meat, add the onion, carrot and celery and cover with water by 1-inch. Set over high heat and bring to a boil. Reduce the heat to low, cover and gently simmer for 2 1/2 to 3 hours or until the meat is fork tender. Remove from the pot and thinly slice across the grain.', u'spoonacularSourceUrl': u'https://spoonacular.com/corned-beef-296797', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 14600, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}