{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532479-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532479, u'veryPopular': True, u'lowFodmap': False, u'title': u'Goat Cheese Stuffed Fig, Melon and Prosciutto Salad', u'diets': [u'gluten free'], u'pricePerServing': 696.54, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'4 cups baby arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cups'}, {u'originalString': u'2 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'6-8 fresh figs', u'aisle': u'Dried Fruits;Produce', u'name': u'fresh figs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-fresh.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9089, u'unit': u''}, {u'originalString': u'fresh herbs for garnish', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'servings'}, {u'originalString': u'5.5 ounces goat cheese, at room temperature', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.5, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons honey, or more to taste', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'chopped basil and mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'servings'}, {u'originalString': u'6-8 slices aged prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'sliced melons, or chunks if you prefer', u'aisle': u'Health Foods', u'name': u'soy chunks', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tvp.png', u'unitLong': u'chunk', u'unitShort': u'chunks', u'amount': 1.0, u'consistency': u'solid', u'id': 98854, u'unit': u'chunks'}, {u'originalString': u'2 tablespoons minced fresh savory herbs like thyme, rosemary, parsley or chives', u'aisle': u'Produce;Spices and Seasonings', u'name': u'herbs', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002044, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon Slide Ridge Honey Wine Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2068, u'unit': u'tablespoon'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodiecrush.com/2013/08/goat-cheese-stuffed-fig-melon-and-prosciutto-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix the minced herbs into the goat cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1002044, u'name': u'herbs'}]}, {u'equipment': [], u'step': u"Remove the stem from the figs and then slice halfway down the fruit into quarters, but don't slice all the way through. Spoon about a tablespoon of the goat cheese into each of the figs and set aside.. Meanwhile, dress the arugula with the vinaigrette and place half of it on a plate with half of the thin slices or chunks of melon and 3-4 slices of prosciutto. Season with kosher salt and freshly cracked black pepper and fresh herbs if desired.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1012024, u'name': u'fresh herbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-fresh.jpg', u'id': 9089, u'name': u'figs'}]}, {u'equipment': [], u'step': u'Add 3-4 figs, drizzle with more vinaigrette or a great aged balsamic vinegar and serve. Repeat with remaining ingredients to serve a friend.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-fresh.jpg', u'id': 9089, u'name': u'figs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine the extra virgin olive oil and the white balsamic vinegar in a mixing bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}, {u'equipment': [], u'step': u'Add more honey to taste until the sweetness takes the edge off the vinegar.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add a few pinches of salt a little at a time until the vinaigrette tastes balanced.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the chopped herbs and allow to sit for thirty minutes to infuse.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1002044, u'name': u'herbs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 7008, u'instructions': u"Mix the minced herbs into the goat cheese. Remove the stem from the figs and then slice halfway down the fruit into quarters, but don't slice all the way through. Spoon about a tablespoon of the goat cheese into each of the figs and set aside.. Meanwhile, dress the arugula with the vinaigrette and place half of it on a plate with half of the thin slices or chunks of melon and 3-4 slices of prosciutto. Season with kosher salt and freshly cracked black pepper and fresh herbs if desired. Add 3-4 figs, drizzle with more vinaigrette or a great aged balsamic vinegar and serve. Repeat with remaining ingredients to serve a friend.Combine the extra virgin olive oil and the white balsamic vinegar in a mixing bowl. Add more honey to taste until the sweetness takes the edge off the vinegar. Add a few pinches of salt a little at a time until the vinaigrette tastes balanced. Add the chopped herbs and allow to sit for thirty minutes to infuse.", u'spoonacularSourceUrl': u'https://spoonacular.com/goat-cheese-stuffed-fig-melon-and-prosciutto-salad-532479', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}