{u'recipes': [{u'sourceName': u'Yummy Healthy Easy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603799-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 603799, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crusted Pecan Chicken with Apple Cream Sauce', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 186.42, u'creditText': u'Yummy Healthy Easy', u'extendedIngredients': [{u'originalString': u'1 Tbsp. apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'Tbsp'}, {u'originalString': u'\xbe cup apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 9016, u'unit': u'cup'}, {u'originalString': u'1 Tbsp. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'\xbe cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 Tbsp. chopped green onions or shallot', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbsp'}, {u'originalString': u'1 cup (half pint container) heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'(half pint container)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 Tbsp. honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbsp'}, {u'originalString': u'\xbd cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 Tbsp. oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'\xbe cup pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'\xbc tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'6 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 tsp. thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'\xbd c. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'c'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.yummyhealthyeasy.com/2014/06/pecan-chicken-with-apple-cream-sauce.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For sauce: Melt butter and olive oil in medium saucepan over low heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onions or shallot and stir until softened.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add apple juice and water.Increase heat to high and boil until reduced to about \xbd cup. Reduce heat to medium.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 9016, u'name': u'apple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the cream. Cook about 5 minutes (careful not to boil the cream over).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the salt, pepper honey and vinegar.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Heat for a few more minutes, or until thickened a bit more.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Remove from heat and keep warm.Meanwhile, blend together flour, pecans, thyme, salt and pepper in a food processor. Dump pecan mixture onto a large plate.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour milk into a medium sized bowl.In a large skillet, heat butter and oil over medium heat. Dip each chicken breast one at a time into the milk and then the pecan mixture. Pat to help adhere to the chicken.Cook chicken in prepared skillet, turning once until golden brown on both sides.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve with apple cream sauce. Enjoy!', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 217, u'instructions': u'For sauce: Melt butter and olive oil in medium saucepan over low heat. Add onions or shallot and stir until softened. Add apple juice and water.Increase heat to high and boil until reduced to about \xbd cup. Reduce heat to medium. Add the cream. Cook about 5 minutes (careful not to boil the cream over).Add the salt, pepper honey and vinegar. Heat for a few more minutes, or until thickened a bit more. Remove from heat and keep warm.Meanwhile, blend together flour, pecans, thyme, salt and pepper in a food processor. Dump pecan mixture onto a large plate. Pour milk into a medium sized bowl.In a large skillet, heat butter and oil over medium heat. Dip each chicken breast one at a time into the milk and then the pecan mixture. Pat to help adhere to the chicken.Cook chicken in prepared skillet, turning once until golden brown on both sides. Serve with apple cream sauce. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/crusted-pecan-chicken-with-apple-cream-sauce-603799', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}