{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/755490-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 755490, u'veryPopular': False, u'lowFodmap': False, u'title': u'Teriyaki Chicken Rice Bowl', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 288.03, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 cups baby spinach (about 2 ounces)', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 11457, u'unit': u'ounces'}, {u'originalString': u'2 cups cooked brown rice (thawed if frozen)', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'frozen', u'thawed', u'cooked', u'( if )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'1 10-ounce container yellow and/or red cocktail tomatoes, quartered', u'aisle': u'Produce', u'name': u'cocktail tomatoes', u'metaInformation': [u'red', u'yellow', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'ounce'}, {u'originalString': u'1/2 cup fresh basil leaves, thinly sliced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 orange bell pepper, cut into strips', u'aisle': u'Produce', u'name': u'orange bell pepper', u'metaInformation': [u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'2 tablespoons peanut oil (preferably roasted)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'(preferably roasted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup salted roasted cashews, roughly chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted cashews', u'metaInformation': [u'salted', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12085, u'unit': u'cup'}, {u'originalString': u'2 cups shredded rotisserie chicken (skinless)', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded', u'skinless', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'4 scallions, thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'8 ounces sugar snap peas, trimmed and halved', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [u'trimmed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10011300, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons teriyaki sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 6112, u'unit': u'tablespoons'}], u'healthScore': 99.0, u'imageType': u'jpeg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/teriyaki-chicken-rice-bowl.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the teriyaki sauce, peanut oil and 1/4 cup water in a large bowl until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6112, u'name': u'teriyaki sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'id': 4042, u'name': u'peanut oil'}]}, {u'equipment': [], u'step': u'Add the spinach, snap peas, bell pepper, tomatoes, scallions, basil, chicken and cashews; toss to combine and season with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'id': 10011300, u'name': u'sugar snap peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Warm the rice in the microwave.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve topped with the chicken-vegetable salad.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Photograph by Justin Walker', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'pineapple , guava , apricot', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 293, u'instructions': u'Whisk the teriyaki sauce, peanut oil and 1/4 cup water in a large bowl until smooth. Add the spinach, snap peas, bell pepper, tomatoes, scallions, basil, chicken and cashews; toss to combine and season with salt and pepper.                          Warm the rice in the microwave. Serve topped with the chicken-vegetable salad.                          Photograph by Justin Walker', u'spoonacularSourceUrl': u'https://spoonacular.com/teriyaki-chicken-rice-bowl-755490', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}