{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522355-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 522355, u'veryPopular': False, u'lowFodmap': False, u'title': u'Meatball sliders', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 255.69, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'baby arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'servings'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/2 tsp. of grated garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1/4 k. of ground beef (I used sirloin)', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [u'(I used sirloin)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'liquid', u'id': 10023572, u'unit': u''}, {u'originalString': u'1/4 k. of ground pork (mine had about 30% fat)', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [u'30%', u'(mine had fat)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10219, u'unit': u''}, {u'originalString': u'1/4 c. of finely chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'c'}, {u'originalString': u'1/4 c. of panko', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10018079, u'unit': u'c'}, {u'originalString': u'1 tsp. of chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tsp'}, {u'originalString': u'4 pan de sal, split and lightly toasted', u'aisle': u'Produce', u'name': u'patty pan squash', u'metaInformation': [u'split', u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pattypan-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11475, u'unit': u''}, {u'originalString': u'1/2 tsp. of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp. of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'grated sharp cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'servings'}, {u'originalString': u'1 1/2 c. of homemade tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11549, u'unit': u'c'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://casaveneracion.com/meatball-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix all the ingredients for the meatballs. Form into balls about 2 and 1/2 inches in diameter (I had four balls).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a non-stick frying pan. Cook the meatballs over medium-high heat until lightly browned. Unless your meat has too little fat, the meatballs should render enough fat to brown in. Otherwise, you may have to brown them in a little olive oil. You’re not cooking the meatballs through at this point but just browning them. As soon as they brown, scoop them out.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place several baby arugula leaves on the bottom halves of the toasted pan de sal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'baby arugula'}]}, {u'equipment': [], u'step': u'Place the meatballs on top of the leaves. Spoon a little sauce over them. Sprinkle with grated cheese and finely sliced parsley.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u'Heat the tomato sauce in the same pan in which the meatballs were browned. When bubbly, return the meatballs to the pan. Cook over medium-low heat, uncovered, for seven to 10 minutes, rolling them in the sauce often. The sauce should have considerably reduced and thickened by the end of the cooking time.To serve'}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try MYX Fusions Myxotica Moscato ( half-bottle). Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 12 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"This limited edition Myxotica Moscato was released in promotion of Nicki Minaj's third album The Pink Print. A delicious passion fruit flavored moscato in a pink autographed bottle.", u'title': u'MYX Fusions Myxotica Moscato ( half-bottle)', u'price': u'$11.99', u'id': 439091, u'link': u'https://www.wine.com/product/myx-fusions-myxotica-moscato-375ml-half-bottle/140093', u'imageUrl': u'https://spoonacular.com/productImages/439091-312x231.jpg'}]}, u'aggregateLikes': 48, u'instructions': u'InstructionsMix all the ingredients for the meatballs. Form into balls about 2 and 1/2 inches in diameter (I had four balls).Heat a non-stick frying pan. Cook the meatballs over medium-high heat until lightly browned. Unless your meat has too little fat, the meatballs should render enough fat to brown in. Otherwise, you may have to brown them in a little olive oil. You’re not cooking the meatballs through at this point but just browning them. As soon as they brown, scoop them out.Heat the tomato sauce in the same pan in which the meatballs were browned. When bubbly, return the meatballs to the pan. Cook over medium-low heat, uncovered, for seven to 10 minutes, rolling them in the sauce often. The sauce should have considerably reduced and thickened by the end of the cooking time.To serve: Place several baby arugula leaves on the bottom halves of the toasted pan de sal. Place the meatballs on top of the leaves. Spoon a little sauce over them. Sprinkle with grated cheese and finely sliced parsley.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatball-sliders-522355', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}