{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556558-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 556558, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chipotle Chicken and Andouille Sausage Sliders', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 189.7, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'Chipotle Aioli', u'aisle': u'Gourmet;Condiments', u'name': u'aioli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/aioli.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 93758, u'unit': u'servings'}, {u'originalString': u'\xbe pound cajun andouille sausage', u'aisle': u'Meat', u'name': u'andouille sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 7064, u'unit': u'pound'}, {u'originalString': u'1 cup arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'4 oz Jalapeno White Cheddar', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'oz'}, {u'originalString': u'\xbd tsp chile powder', u'aisle': u'Spices and Seasonings', u'name': u'chile powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'\xbd large chipotle in adobo pepper', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper in adobo', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'2 tsp ground garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 cup greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 pound ground chicken', u'aisle': u'Meat', u'name': u'ground chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 5332, u'unit': u'pound'}, {u'originalString': u'\xbd a lime, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'\xbc tsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Salt and Pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8 mini Cauliflower buns', u'aisle': u'Bakery/Bread', u'name': u'sub buns', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'\xbd tsp ground oregano', u'aisle': u'?', u'name': u'ground oregano', u'metaInformation': [], u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'unit': u'tsp'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/chipotle-chicken-andouille-sausage-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Make cauliflower buns per Lexi's instructions, but make into mini slider buns._For the Burgers:_", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add ground chicken, sausage and spices in a large bowl. Gently mix until just combined then form into eight equal patties.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 5332, u'name': u'ground chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium-high heat and add the patties and cook until brown on both sides, about 5 minutes per side. Reduce the heat to low, top each burger with the cheese and cover.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Let sit for 1 minute until the cheese melted.While burgers are cooking, make the Chipotle Aioli. In a blender, mix the greek yogurt, lime juice, chipotle pepper, salt and pepper until smooth and pepper is fully pureed.Turn broiler on low; cut buns in half, and add to broiler until toasted. Keep an eye on them as they toast fast!Once buns are toasted, add chipotle aioli to bottom bun, top with burger, arugula and top bun.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/aioli.jpg', u'id': 93758, u'name': u'aioli'}]}, {u'equipment': [], u'step': u'Serve!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood on the menu? Try pairing with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Nicolas Feuillatte Blanc de Blancs. It has 4.4 out of 5 stars and a bottle costs about 65 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Subtle glints of lime-blossom green, with delicate, abundant bubbles. The wine offers aromas of white flowers, such ashawthorn and acacia, as well as more subtle scents of citrus fruits, pears and even limeblossom. Very generous on the palate. Lively, fresh and powerful on the attack.', u'title': u'Nicolas Feuillatte Blanc de Blancs', u'price': u'$64.99', u'id': 442400, u'link': u'https://www.wine.com/product/nicolas-feuillatte-blanc-de-blancs-2005/127127', u'imageUrl': u'https://spoonacular.com/productImages/442400-312x231.jpg'}]}, u'aggregateLikes': 971, u'instructions': u"Make cauliflower buns per Lexi's instructions, but make into mini slider buns._For the Burgers:_ Add ground chicken, sausage and spices in a large bowl. Gently mix until just combined then form into eight equal patties. Heat a large skillet over medium-high heat and add the patties and cook until brown on both sides, about 5 minutes per side. Reduce the heat to low, top each burger with the cheese and cover. Let sit for 1 minute until the cheese melted.While burgers are cooking, make the Chipotle Aioli. In a blender, mix the greek yogurt, lime juice, chipotle pepper, salt and pepper until smooth and pepper is fully pureed.Turn broiler on low; cut buns in half, and add to broiler until toasted. Keep an eye on them as they toast fast!Once buns are toasted, add chipotle aioli to bottom bun, top with burger, arugula and top bun. Serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-chicken-and-andouille-sausage-sliders-556558', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}