{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/520086-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 520086, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spiced Apple Pie Smoothie (vegan, gluten-free)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 3, u'pricePerServing': 38.16, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 1/2 cups apple cider or apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 9016, u'unit': u'cups'}, {u'originalString': u'1 medium ripe banana (previously frozen is ideal but not required)', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen', u'ripe', u'medium', u'(previously is ideal but not required)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup milk or non-dairy nut milk, optional (omit for a thicker smoothie)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [u'for a thicker smoothie)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 cups ice, optional and as necessary', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cups'}, {u'originalString': u'pinch nutmeg and/or cardamom, optional', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'1 cup yogurt (vanilla, plain, or apple cinnamon; use regular, vegan, soy, coconut milk, or your favorite yogurt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain yogurt', u'metaInformation': [u'plain', u'your favorite', u'(vanilla, , or apple cinnamon; use regular, vegan, soy, coconut milk, or yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}, {u'originalString': u'sugar or sweetener (agave, stevia, maple syrup, etc.) optional and to taste', u'aisle': u'Baking', u'name': u'swerve sweetener', u'metaInformation': [u'to taste', u'(agave, stevia, maple syrup, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-substitute.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 99084, u'unit': u'c'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.averiecooks.com/2012/02/spiced-apple-pie-smoothie.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine all ingredients, except ice, in a large blender or Vita-', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}, {u'steps': [], u'name': u'Mix and blend until smooth and creamy, taking care any sweetener used has dissolved and is well incorporated. If desired, pour over ice or blend ice into the smoothie noting that this will water it down a bit; if time permits refrigerating or freezing smoothie to chill is recommending. Tips'}, {u'steps': [{u'equipment': [], u'step': u'Add 1 to 2 ounces of Rum, Vodka, Marshmallow Vodka, Apple Vodka, Apple Schnapps, Gran Marnier or similar, per smoothie portion, or to taste.  Or add 1 to 2 scoops of vanilla or plain protein powder.  Use caramel sauce in the mixture or drizzled over the top before drinking.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u'Pour excess portion(s) into glasses and freeze ahead for later (30 seconds in the microwave is what I do to thaw in a hurry); pour excess into bowls and freeze for apple pie frozen yogurt; or pour into Popsicle molds, paper cups, or ice cube trays and freeze for homemade frozen treats. Optional'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 11372, u'instructions': u'Combine all ingredients, except ice, in a large blender or Vita-Mix and blend until smooth and creamy, taking care any sweetener used has dissolved and is well incorporated. If desired, pour over ice or blend ice into the smoothie noting that this will water it down a bit; if time permits refrigerating or freezing smoothie to chill is recommending. Tips: Pour excess portion(s) into glasses and freeze ahead for later (30 seconds in the microwave is what I do to thaw in a hurry); pour excess into bowls and freeze for apple pie frozen yogurt; or pour into Popsicle molds, paper cups, or ice cube trays and freeze for homemade frozen treats. Optional: Add 1 to 2 ounces of Rum, Vodka, Marshmallow Vodka, Apple Vodka, Apple Schnapps, Gran Marnier or similar, per smoothie portion, or to taste.  Or add 1 to 2 scoops of vanilla or plain protein powder.  Use caramel sauce in the mixture or drizzled over the top before drinking.', u'spoonacularSourceUrl': u'https://spoonacular.com/spiced-apple-pie-smoothie-vegan-gluten-free-520086', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 3, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}