{u'recipes': [{u'sourceName': u'Damn Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719920-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 719920, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Mushroom Fettuccine', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 163.57, u'creditText': u'Damn Delicious', u'extendedIngredients': [{u'originalString': u'2 cups baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'1 pound cremini mushrooms, thinly sliced', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon dried dill', u'aisle': u'Spices and Seasonings', u'name': u'dried dill', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2017, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces fettuccine', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped fresh parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 cup half and half, or more, as needed*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 cup freshly grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://damndelicious.net/2015/04/11/creamy-mushroom-fettuccine/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot of boiling salted water, cook pasta according to package instructions; drain well.Melt butter in a large skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add garlic, mushrooms and onion. Cook, stirring occasionally, until tender, about 3-4 minutes. Stir in thyme and dill until fragrant, about 1 minute; season with salt and pepper, to taste.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in flour until lightly browned, about 1 minute. Gradually whisk in vegetable broth, and cook, whisking constantly, until incorporated, about 1-2 minutes. Stir in half and half until slightly thickened, about 1-2 minutes.Stir in baby spinach and Parmesan until the spinach has wilted, about 2 minutes. If the mixture is too thick, add more half and half as needed.Stir in pasta and gently toss to combine.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 11457, u'name': u'baby spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Serve immediately, garnished with parsley, if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 84187, u'instructions': u'In a large pot of boiling salted water, cook pasta according to package instructions; drain well.Melt butter in a large skillet over medium heat. Add garlic, mushrooms and onion. Cook, stirring occasionally, until tender, about 3-4 minutes. Stir in thyme and dill until fragrant, about 1 minute; season with salt and pepper, to taste.Whisk in flour until lightly browned, about 1 minute. Gradually whisk in vegetable broth, and cook, whisking constantly, until incorporated, about 1-2 minutes. Stir in half and half until slightly thickened, about 1-2 minutes.Stir in baby spinach and Parmesan until the spinach has wilted, about 2 minutes. If the mixture is too thick, add more half and half as needed.Stir in pasta and gently toss to combine.Serve immediately, garnished with parsley, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-mushroom-fettuccine-719920', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}