{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/10235-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 42, u'id': 10235, u'veryPopular': False, u'lowFodmap': True, u'title': u'Asian-Style Cobb Salad with Sesame Grilled Chicken', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 276.87, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'3 Tbsp. PLANTERS Sliced Almonds, toasted', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'toasted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12061, u'unit': u'Tbsp'}, {u'originalString': u'2/3 cup KRAFT Asian Toasted Sesame Dressing, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'asian toasted sesame dressing', u'metaInformation': [u'divided', u'toasted', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-toasted-sesame-dressing.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 4016, u'unit': u'cup'}, {u'originalString': u'1 head bok choy cabbage, cut lengthwise in half', u'aisle': u'Produce', u'name': u'bok choy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11116, u'unit': u'head'}, {u'originalString': u'2 carrots, shredded', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 cup pea pods, cut diagonally in half', u'aisle': u'Produce', u'name': u'pea pods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11300, u'unit': u'cup'}, {u'originalString': u'1 red pepper, quartered', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'4 small boneless skinless chicken breasts (1 lb.)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/asian-style-cobb-salad-sesame-114098.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pour 1/4 cup dressing over chicken in shallow dish; turn to coat both sides of each breast.  Refrigerate 30 min. to marinate.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat greased grill to medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush bok choy and peppers with 2 Tbsp. of the remaining dressing.  Grill bok choy 1 min. or until slightly wilted and peppers 4 min. or until crisp-tender, turning occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 11116, u'name': u'bok choy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from grill; set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove chicken from marinade; discard marinade. Grill chicken 3 to 4 min. on each side or until done (165F), turning occasionally.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Trim core from bok choy; discard. Chop remaining bok choy into bite-size pieces.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 11116, u'name': u'bok choy'}]}, {u'equipment': [], u'step': u'Cut red pepper into small chunks and chicken into thin strips. Arrange bok choy, peppers, chicken, pea pods and carrots in rows on plate; top with nuts and remaining dressing.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 11116, u'name': u'bok choy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'id': 11300, u'name': u'snow peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cobb Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 75, u'instructions': u'Pour 1/4 cup dressing over chicken in shallow dish; turn to coat both sides of each breast.  Refrigerate 30 min. to marinate.                                            Heat greased grill to medium-high heat.  Brush bok choy and peppers with 2 Tbsp. of the remaining dressing.  Grill bok choy 1 min. or until slightly wilted and peppers 4 min. or until crisp-tender, turning occasionally.  Remove from grill; set aside.                                             Remove chicken from marinade; discard marinade. Grill chicken 3 to 4 min. on each side or until done (165F), turning occasionally.                                            Trim core from bok choy; discard. Chop remaining bok choy into bite-size pieces.  Cut red pepper into small chunks and chicken into thin strips. Arrange bok choy, peppers, chicken, pea pods and carrots in rows on plate; top with nuts and remaining dressing.', u'spoonacularSourceUrl': u'https://spoonacular.com/asian-style-cobb-salad-with-sesame-grilled-chicken-10235', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 57, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}