{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/416290-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 416290, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cubed Steak Stroganoff', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 584.46, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 teaspoon beef bouillon granules', u'aisle': u'Canned and Jarred', u'name': u'beef bouillon granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1006076, u'unit': u'teaspoon'}, {u'originalString': u'2 beef cubed steaks (6 ounces each)', u'aisle': u'Meat', u'name': u'beef tenderloin steaks', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10023583, u'unit': u'ounces'}, {u'originalString': u'1 to 2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'Hot cooked egg noodles', u'aisle': u'Pasta and Rice', u'name': u'cooked egg noodles', u'metaInformation': [u'hot', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 20410, u'unit': u'servings'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'3 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 can (4 ounces) mushroom stems and pieces, drained', u'aisle': u'Produce', u'name': u'mushroom', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'7 to 8 tablespoons sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cubed-steak-stroganoff', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'In a large resealable plastic bag, combine the flour and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cubed steaks, one at a time. Seal bag and shake to coat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook the steaks in oil over medium heat for 4-5 minutes on each side or until browned and tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Remove and keep warm.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In the same skillet, saute mushrooms and onions until tender.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the water, bouillon and pepper; cook and stir until mixture comes to a boil, scraping up browned bits from bottom of pan. Reduce heat; stir in sour cream and heat through (do not boil). Return meat to pan; heat through.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve with noodles.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 265, u'instructions': u'Directions                                                                                In a large resealable plastic bag, combine the flour and salt. Add cubed steaks, one at a time. Seal bag and shake to coat.                                                                                            In a large skillet, cook the steaks in oil over medium heat for 4-5 minutes on each side or until browned and tender. Remove and keep warm.                                                                                           In the same skillet, saute mushrooms and onions until tender. Add the water, bouillon and pepper; cook and stir until mixture comes to a boil, scraping up browned bits from bottom of pan. Reduce heat; stir in sour cream and heat through (do not boil). Return meat to pan; heat through. Serve with noodles.                                        Yield: 2 servings.                                                                                                                         Originally published as Cubed Steak Stroganoff in  ReminisceJuly/August 2005, p50                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cubed-steak-stroganoff-416290', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}