{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600285-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 600285, u'veryPopular': False, u'lowFodmap': False, u'title': u'Singapore Carrot Cake', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 276.89, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 large handful bean sprouts', u'aisle': u'Produce;Ethnic Foods', u'name': u'bean sprouts', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11043, u'unit': u'handful'}, {u'originalString': u'1 1/2 to 2 pounds (1 large) daikon radish, peeled', u'aisle': u'Produce', u'name': u'daikon radish', u'metaInformation': [u'(1 large)', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/daikon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11430, u'unit': u'pounds'}, {u'originalString': u'3 large eggs, lightly beaten with a pinch of salt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'with a pinch of salt', u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup fresh cilantro leaves', u'aisle': u'Produce', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 green onions, white and green parts, cut into 1-inch lengths', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'cut into 1-inch lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 1/2 tablespoons kecap manis', u'aisle': u'Ethnic Foods', u'name': u'kecap manis', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 10016124, u'unit': u'tablespoons'}, {u'originalString': u'1 small onion, thinly sliced in half moons', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'sliced in half moons'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 1/2 cups white rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'rice flour', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20061, u'unit': u'cups'}, {u'originalString': u'1 1/4 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon soy sauce or tamari', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://leitesculinaria.com/80521/recipes-singapore-carrot-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404778, u'name': u'box grater'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make the steamed radish cakes1. Grate the daikon either on the large holes of a box grater or with the grating attachment of a food processor. Measure 4 cups of grated radish—do not use more—and add it to a saucepan with 1 teaspoon of the salt and the water. Cover the pan and turn the heat to medium, peeking occasionally. When the water starts to steam, lower the heat to medium-low and cook, covered, stirring occasionally, until the radish is translucent, about 25 minutes.2. Generously oil a 9-inch round cake pan. In bowl, stir together the rice flour, the remaining 1/4 teaspoon salt, and the sugar. Strain the radish in a sieve set over a large measuring cup. Press down on the radish with a large spoon to remove most of the liquid.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20061, u'name': u'rice flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/daikon.jpg', u'id': 11430, u'name': u'daikon radish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'Add enough cold water to the measuring cup to equal 1 cup and let the liquid cool to lukewarm. Set the radish aside.3. Stir the barely warm radish cooking liquid into the rice flour and mix until smooth. Then add the radish and stir to combine. The batter should look like tapioca pudding.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20061, u'name': u'rice flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the batter to the prepared pan. (If the liquid is too hot, it will start to cook the rice flour, forming more of a dough-like than pudding-like consistency. If this happens, it’s okay; you’ll just need to use your hands or a wooden spoon to spread the batter evenly in the pan.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20061, u'name': u'rice flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Place the cake pan in a steamer or on a wire rack in a wok, cover the steamer or wok, and steam over simmering water for 1 hour. Check occasionally to make sure the water does not run dry, adding more if needed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Remove the cake pan from the steamer with tongs and let cool to room temperature.4. Run a thin knife around the edge of the radish cake and invert the pan onto a plate to remove the cake. (If the radish cake sticks to the pan, cut out a small piece of radish cake and then remove the rest with a spatula. It’s not a big deal as you will eventually cut it into pieces anyway.) Cover and refrigerate the radish cake for at least 4 hours or up to 1 week.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut half the cake into 1-inch cubes for the Singapore carrot cake.Make the Singapore carrot cake5. In a large nonstick skillet, heat 1 tablespoon of the oil over medium-high heat. Pat the cake cubes dry with paper towels or a clean kitchen towel.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the cubes to the skillet in a single layer, without crowding them, working in batches if need be. Cook the cake cubes, turning them occasionally, until well browned, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the radish cakes to a plate.6.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 2 tablespoons oil in the same skillet over medium-high heat.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, garlic, and green onions and cook, stirring occasionally, until the vegetables start to wilt, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the bean sprouts and cook 1 minute more. Move the vegetables to the side of the skillet and pour the eggs in the center.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'id': 11043, u'name': u'bean sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the eggs set for about 30 seconds without stirring, and then scramble them into the vegetables. Return the browned radish cakes to the pan and add the kecap manis, soy sauce, and salt. Cook, tossing almost constantly, until everything is heated through, about 1 minute. Stir in the cilantro and serve the Singapore carrot cake hot.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10016124, u'name': u'kecap manis'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 59, u'instructions': u'Make the steamed radish cakes1. Grate the daikon either on the large holes of a box grater or with the grating attachment of a food processor. Measure 4 cups of grated radish—do not use more—and add it to a saucepan with 1 teaspoon of the salt and the water. Cover the pan and turn the heat to medium, peeking occasionally. When the water starts to steam, lower the heat to medium-low and cook, covered, stirring occasionally, until the radish is translucent, about 25 minutes.2. Generously oil a 9-inch round cake pan. In bowl, stir together the rice flour, the remaining 1/4 teaspoon salt, and the sugar. Strain the radish in a sieve set over a large measuring cup. Press down on the radish with a large spoon to remove most of the liquid. Add enough cold water to the measuring cup to equal 1 cup and let the liquid cool to lukewarm. Set the radish aside.3. Stir the barely warm radish cooking liquid into the rice flour and mix until smooth. Then add the radish and stir to combine. The batter should look like tapioca pudding. Transfer the batter to the prepared pan. (If the liquid is too hot, it will start to cook the rice flour, forming more of a dough-like than pudding-like consistency. If this happens, it’s okay; you’ll just need to use your hands or a wooden spoon to spread the batter evenly in the pan.) Place the cake pan in a steamer or on a wire rack in a wok, cover the steamer or wok, and steam over simmering water for 1 hour. Check occasionally to make sure the water does not run dry, adding more if needed. Remove the cake pan from the steamer with tongs and let cool to room temperature.4. Run a thin knife around the edge of the radish cake and invert the pan onto a plate to remove the cake. (If the radish cake sticks to the pan, cut out a small piece of radish cake and then remove the rest with a spatula. It’s not a big deal as you will eventually cut it into pieces anyway.) Cover and refrigerate the radish cake for at least 4 hours or up to 1 week.  Cut half the cake into 1-inch cubes for the Singapore carrot cake.Make the Singapore carrot cake5. In a large nonstick skillet, heat 1 tablespoon of the oil over medium-high heat. Pat the cake cubes dry with paper towels or a clean kitchen towel. Add the cubes to the skillet in a single layer, without crowding them, working in batches if need be. Cook the cake cubes, turning them occasionally, until well browned, 6 to 8 minutes. Transfer the radish cakes to a plate.6. Heat the remaining 2 tablespoons oil in the same skillet over medium-high heat. Add the onion, garlic, and green onions and cook, stirring occasionally, until the vegetables start to wilt, about 1 minute. Add the bean sprouts and cook 1 minute more. Move the vegetables to the side of the skillet and pour the eggs in the center. Let the eggs set for about 30 seconds without stirring, and then scramble them into the vegetables. Return the browned radish cakes to the pan and add the kecap manis, soy sauce, and salt. Cook, tossing almost constantly, until everything is heated through, about 1 minute. Stir in the cilantro and serve the Singapore carrot cake hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/singapore-carrot-cake-600285', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}