{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225675-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 225675, u'veryPopular': False, u'lowFodmap': False, u'title': u'Minced beef pie & minty mushy peas', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 207.39, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'500g pack lean minced beef', u'aisle': u'Frozen;Meat', u'name': u'beef', u'metaInformation': [u'lean', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 23572, u'unit': u'g'}, {u'originalString': u'350ml beef stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 350.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'ml'}, {u'originalString': u'350g carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 11124, u'unit': u'g'}, {u'originalString': u'3 celery sticks, chopped', u'aisle': u'Produce', u'name': u'celery sticks', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tbsp mint sauce', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'350g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'2 tbsp tomato pur\xe9e', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11547, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tbsp'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2257637/minced-beef-pie-and-minty-mushy-peas', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Fry the onion, carrots and celery in theoil in a large frying pan until softened.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Addthe mince, increase heat and cook for5 mins or until well browned. Stir in thetomato pur\xe9e, Worcestershire sauce andstock. Simmer for 5 mins until the saucehas thickened slightly. Cool for 10 mins.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Spoon the mixture into 4 individual piedishes or one large dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the dishrims with egg, then lay the pastry on topand trim. Seal edges with a fork and brushthe pastry with more egg. Poke a little holein the top and cook for 25-30 mins or untilthe pastry is golden and risen.Meanwhile, cook the peas in boilingwater, then drain and mash with themint sauce.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve the pies with the hotpeas on the side.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is McFadden Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'apricot , apple , honey', u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u'Fry the onion, carrots and celery in theoil in a large frying pan until softened. Addthe mince, increase heat and cook for5 mins or until well browned. Stir in thetomato pur\xe9e, Worcestershire sauce andstock. Simmer for 5 mins until the saucehas thickened slightly. Cool for 10 mins.Heat oven to 200C/180C fan/gas 6.Spoon the mixture into 4 individual piedishes or one large dish. Brush the dishrims with egg, then lay the pastry on topand trim. Seal edges with a fork and brushthe pastry with more egg. Poke a little holein the top and cook for 25-30 mins or untilthe pastry is golden and risen.Meanwhile, cook the peas in boilingwater, then drain and mash with themint sauce. Serve the pies with the hotpeas on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/minced-beef-pie-minty-mushy-peas-225675', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}