{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/597169-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 597169, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mint Julep Panna Cotta', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 112.36, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 cup packed fresh mint leaves, plus more for garnish', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'packed', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons unflavored gelatin powder (we prefer Knox brand)', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'unflavored', u'(we prefer Knox brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19177, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'3 tablespoons room-temperature water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'room-temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup Kentucky bourbon or Tennessee whiskey', u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14052, u'unit': u'cup'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon lightly flavored oil, such as canola', u'aisle': u'?', u'name': u'lightly oil', u'metaInformation': [u' such as canola', u'flavored'], u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://leitesculinaria.com/37439/recipes-mint-julep-panna-cotta.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Stir the gelatin into the water in a small bowl, making sure there are no lumps, and set the concoction aside to soften.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Drizzle a paper towel with the oil and coat the ramekins or dishes, being careful to really get into where the sides meet the bottom so the panna cotta will release easily.2.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the milk, cream, and sugar in a small saucepan, drop in the mint leaves, and heat over low heat, stirring occasionally. Once the mixture boils, after about 30 minutes (really, it will take nearly  half an hour) remove the pan from the heat. Fish out the mint leaves and toss. Set the pan aside.3. Bring the bourbon to a boil in a medium saucepan over medium heat and let roil for 30 seconds.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour in the mint-infused cream mixture and warm just until the mixture reaches 175\xb0 F (80\xb0C).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat, scoop in the gelatin, and stir until dissolved.4.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour the panna cotta mixture into a large measuring cup, pour it into the oiled dishes, and refrigerate until set, about 1 1/2 hours. (If not serving the panna cotta the same day, press small squares of plastic wrap against the surface of the desserts, and refrigerate for up to 2 days.)5. Carefully run a thin knife around each dish to loosen the panna cotta and then invert each onto a serving plate with a quick rap.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately with a flourish of mint leaves on the side.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Panna Cotta works really well with Cream Sherry, Chianti, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 86, u'instructions': u'1. Stir the gelatin into the water in a small bowl, making sure there are no lumps, and set the concoction aside to soften. Drizzle a paper towel with the oil and coat the ramekins or dishes, being careful to really get into where the sides meet the bottom so the panna cotta will release easily.2. Pour the milk, cream, and sugar in a small saucepan, drop in the mint leaves, and heat over low heat, stirring occasionally. Once the mixture boils, after about 30 minutes (really, it will take nearly  half an hour) remove the pan from the heat. Fish out the mint leaves and toss. Set the pan aside.3. Bring the bourbon to a boil in a medium saucepan over medium heat and let roil for 30 seconds. Pour in the mint-infused cream mixture and warm just until the mixture reaches 175\xb0 F (80\xb0C). Remove the pan from the heat, scoop in the gelatin, and stir until dissolved.4. Pour the panna cotta mixture into a large measuring cup, pour it into the oiled dishes, and refrigerate until set, about 1 1/2 hours. (If not serving the panna cotta the same day, press small squares of plastic wrap against the surface of the desserts, and refrigerate for up to 2 days.)5. Carefully run a thin knife around each dish to loosen the panna cotta and then invert each onto a serving plate with a quick rap. Serve immediately with a flourish of mint leaves on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/mint-julep-panna-cotta-597169', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}