{u'recipes': [{u'sourceName': u'Your Homebased Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/692924-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 692924, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Crescent Rolls', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 180, u'pricePerServing': 20.18, u'creditText': u'Your Homebased Mom', u'extendedIngredients': [{u'originalString': u'2\xbc tsp active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}, {u'originalString': u'4-5 C all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'C'}, {u'originalString': u'6 Tbsp butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'melted butter for tops of rolls', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'for tops of rolls'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'\xbd C finely chopped dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9079, u'unit': u'C'}, {u'originalString': u'2 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'lemon zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'\xbd C 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'C'}, {u'originalString': u'1\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3 Tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}, {u'originalString': u'\xbd C water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'C'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.yourhomebasedmom.com/cranberry-crescent-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Warm the milk and  C water in pan on the stovetop or in the microwave until warm, about 110 degrees F.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour milk mixture into stand mixer bowl and combine with sugar, yeast and 1 C flour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Mix until lumpy.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand until mixture is bubbly, about 15 minutes', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add in the butter, salt and 2 C flour.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix until smooth and elastic', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add in the eggs and mix until combined.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add in 1 C flour and the cranberries and lemon zest.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Mix until dough is smooth and begins to form a ball, about 4 minutes. Dough will be slightly sticky.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add remaining flour until you have a nice smooth dough.Oil a bowl and place dough into the bowl, turn to coat both sides.Cover with a towel and let rise in a warm place until doubled in size. About 1 hour.Coat 2 baking sheets with cooking spray. Divide dough into two pieces', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Place dough onto a floured surface.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out into a 12 inch round circle, about  inch thick.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into 12 pie shaped pieces and roll up starting at the wide end. Repeat with other piece of dough.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place rolls on a greased baking sheet and bake at 375 degrees F for 12-15 minutes or until rolls are golden brown.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 61, u'instructions': u'Warm the milk and  C water in pan on the stovetop or in the microwave until warm, about 110 degrees F.Pour milk mixture into stand mixer bowl and combine with sugar, yeast and 1 C flour. Mix until lumpy.Let stand until mixture is bubbly, about 15 minutesAdd in the butter, salt and 2 C flour. Mix until smooth and elasticAdd in the eggs and mix until combined. Add in 1 C flour and the cranberries and lemon zest.Mix until dough is smooth and begins to form a ball, about 4 minutes. Dough will be slightly sticky.Add remaining flour until you have a nice smooth dough.Oil a bowl and place dough into the bowl, turn to coat both sides.Cover with a towel and let rise in a warm place until doubled in size. About 1 hour.Coat 2 baking sheets with cooking spray. Divide dough into two piecesPlace dough onto a floured surface. Roll out into a 12 inch round circle, about  inch thick.Cut into 12 pie shaped pieces and roll up starting at the wide end. Repeat with other piece of dough.Place rolls on a greased baking sheet and bake at 375 degrees F for 12-15 minutes or until rolls are golden brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-crescent-rolls-692924', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 195, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}