{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/494089-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 494089, u'veryPopular': True, u'lowFodmap': False, u'title': u'Philly Cheese Steak Sandwiches', u'diets': [], u'pricePerServing': 878.87, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 rib-eye or flat iron steak (about 3/4 pounds), sliced thinly across the grain and then roughly chopped*', u'aisle': u'Meat', u'name': u'flat iron steak', u'metaInformation': [u'sliced', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/boneless-chuck-or-top-blade-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'liquid', u'id': 23059, u'unit': u'pounds'}, {u'originalString': u'4 slices Havarti cheese (Provolone or Muenster would work as well)', u'aisle': u'Cheese', u'name': u'havarti cheese', u'metaInformation': [u'well', u'(Provolone or Muenster would work as )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taleggio-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 93838, u'unit': u'slices'}, {u'originalString': u'salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'*It sometimes helps to freeze the steak for 15-20 minutes before slicing; the slightly frozen meat will be easier to slice super-thin.', u'aisle': u'Meat', u'name': u'steak', u'metaInformation': [u'frozen', u'for 15-20 minutes before slicing; the slightly  meat will be easier to slice super-thin.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 23232, u'unit': u'servings'}, {u'originalString': u'2 hoagie rolls, split', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'1/2 large white onion, cut in half and thinly sliced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'large', u'thinly sliced', u'cut in half and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2013/05/philly-cheesesteak-sandwiches.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 250.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 250 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a non-stick skillet with 1 tablespoon butter on medium high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onions and cook for 5 to 8 minutes or until onions are softened and translucent. Season the steak pieces with salt & pepper.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to the skillet and cook for 2 to 4 minutes or until just a little bit of pink remains. Divide the mixture in half, pushing each half to one side of the skillet.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place 2 slices of cheese on top of each half; cover and let melt for 1 to 2 minutes.Carefully transfer each half of the meat mixture to the inside of the split hoagie rolls. Wrap tightly with aluminum foil; place on a baking sheet and bake for 10 to 15 minutes or until warmed through.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak on the menu? Try pairing with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try NV The Big Kahuna Merlot. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 7 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'A ripe and rounded Merlot with notes of plum, blackberry, and hint of spice .', u'title': u'NV The Big Kahuna Merlot', u'price': u'$6.99', u'id': 430475, u'link': u'https://www.amazon.com/Big-Kahuna-Merlot-Red-Wine/dp/B01F5XPTUW', u'imageUrl': u'https://spoonacular.com/productImages/430475-312x231.jpg'}]}, u'aggregateLikes': 18727, u'instructions': u'Preheat oven to 250 degrees F.Heat a non-stick skillet with 1 tablespoon butter on medium high heat. Add onions and cook for 5 to 8 minutes or until onions are softened and translucent. Season the steak pieces with salt & pepper. Add to the skillet and cook for 2 to 4 minutes or until just a little bit of pink remains. Divide the mixture in half, pushing each half to one side of the skillet. Place 2 slices of cheese on top of each half; cover and let melt for 1 to 2 minutes.Carefully transfer each half of the meat mixture to the inside of the split hoagie rolls. Wrap tightly with aluminum foil; place on a baking sheet and bake for 10 to 15 minutes or until warmed through. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/philly-cheese-steak-sandwiches-494089', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}