{u'recipes': [{u'sourceName': u'Laa Loosh', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548563-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 548563, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spinach, Ham and Egg Whites Frittata – 2 Points', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 157.4, u'creditText': u'Laa Loosh', u'extendedIngredients': [{u'originalString': u'1 5oz bag fresh baby spinach, washed and chopped', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh', u'washed and chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'1/2 cup lean ham, diced', u'aisle': u'Meat', u'name': u'diced ham', u'metaInformation': [u'diced', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/diced-ham.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 99186, u'unit': u'cup'}, {u'originalString': u'2 tsp fresh dill, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tsp'}, {u'originalString': u'1 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'2 leeks, white and light green parts only, diced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'light', u'diced', u'white', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1/tsp fresh lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'2 cups liquid egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'liquid egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93833, u'unit': u'cups'}, {u'originalString': u'1/4 tsp freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'3/4 cup reduced fat smoked Gouda cheese, shredded', u'aisle': u'Cheese', u'name': u'reduced fat cheese', u'metaInformation': [u'smoked', u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1168, u'unit': u'cup'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.laaloosh.com/2011/04/11/spinach-ham-and-egg-whites-frittata-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat to 450\xb0F and position oven rack in upper third of oven', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk egg whites, salt, pepper and garlic powder in a medium bowl. Spray a frittata pan or a large ovenproof nonstick skillet with nonfat cooking spray and set over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add fresh dill lemon zest and leeks; cook, stirring, until softened, about 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'fresh dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add spinach and ham; cook, stirring, until the spinach is wilted, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the egg mixture over the vegetables and cook, lifting the edges of the frittata so uncooked egg can flow underneath, until the bottom is light golden, 2 to 3 minutes.Sprinkle cheese on top, transfer the pan to the oven and bake until the eggs are set, about 8 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let rest for about 3 minutes before serving. Slice into 6 equally sized portions.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frittata works really well with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. One wine you could try is Perrier-Jouet Belle Epoque. It has 4.4 out of 5 stars and a bottle costs about 129 dollars.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'The 1996 vintage was superb for the Champagne region, yielding ripe, balanced, clean fruit with excellent flavors. A blend of approximately half Chardonnay and half Pinot Noir this crystal bright, light-bodied Champagne is elegant and distinctive. Opening with aromas of fresh pineapple, lemon and white florals, warming into complex scents of pear. A rich bouquet of white fruits end in subtle notes of honey and vanilla. The bead is intense with brisk effervescence, swirling up into a generous and persistent mousse. It is a balanced, extremely refined wine that, if properly stored, should keep for years, especially if bottled in magnums or jeroboams.Beyond the toasts and ship launchings, Champagne has a place at every dinner table. The 1996 Fleur de Champagne pairs is the perfect wine to serve with smoked oysters, game hens, delicate Japanese fish dishes, Fettuccini Alfredo or risotto. After a patient search for a master glassmaker capable of reproducing a bottle with the 1902 Gall\xe9 design, Perrier Jou\xebt launched in 1969, its famous "flower bottle" with an arabesque design of anemones. The first bottles of Fleur de Champagne revealed a Champagne of vivacious delicacy, the epitome of the refined and engaging style of the Art Nouveau movement.  Since then, it has been the signature Champagne of Perrier Jou\xebt and is considered one of the world\'s most celebrated Champagnes. View More', u'title': u'Perrier-Jouet Belle Epoque', u'price': u'$129.0', u'id': 433586, u'link': u'https://www.wine.com/product/perrier-jouet-belle-epoque-1996/7383', u'imageUrl': u'https://spoonacular.com/productImages/433586-312x231.jpg'}]}, u'aggregateLikes': 3896, u'instructions': u'InstructionsPreheat to 450\xb0F and position oven rack in upper third of ovenWhisk egg whites, salt, pepper and garlic powder in a medium bowl. Spray a frittata pan or a large ovenproof nonstick skillet with nonfat cooking spray and set over medium heat.Add fresh dill lemon zest and leeks; cook, stirring, until softened, about 3-4 minutes.Add spinach and ham; cook, stirring, until the spinach is wilted, about 1 minute.Pour the egg mixture over the vegetables and cook, lifting the edges of the frittata so uncooked egg can flow underneath, until the bottom is light golden, 2 to 3 minutes.Sprinkle cheese on top, transfer the pan to the oven and bake until the eggs are set, about 8 minutes.Let rest for about 3 minutes before serving. Slice into 6 equally sized portions.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-ham-and-egg-whites-frittata-2-points-548563', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}