{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758518-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758518, u'veryPopular': True, u'lowFodmap': False, u'title': u'Noodles and Vegetables with Sesame Dipping Sauce', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 286.79, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 Tbs. agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'Tbs'}, {u'originalString': u'4 baby bok choy, quartered lengthwise', u'aisle': u'Produce', u'name': u'baby bok choy', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 93636, u'unit': u''}, {u'originalString': u'4 large carrots, peeled, thinly sliced on sharp diagonal', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 Tbs. hot chile sauce, such as sambal oelek', u'aisle': u'Ethnic Foods', u'name': u'chile garlic sauce', u'metaInformation': [u' such as sambal oelek', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 93749, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs. minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'Tbs'}, {u'originalString': u'4 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 Tbs. lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'Tbs'}, {u'originalString': u'8 oz. thin rice noodles (rice vermicelli)', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice noodles', u'metaInformation': [u'thin', u'(rice vermicelli)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20133, u'unit': u'oz'}, {u'originalString': u'2 Tbs. rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'Tbs'}, {u'originalString': u'1 \xbd tsp. toasted sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 12023, u'unit': u'tsp'}, {u'originalString': u'8 oz. snow peas, trimmed', u'aisle': u'Produce', u'name': u'snow peas', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11300, u'unit': u'oz'}, {u'originalString': u'\xbc cup low-sodium tamari', u'aisle': u'Ethnic Foods', u'name': u'tamari', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10116124, u'unit': u'cup'}, {u'originalString': u'1 14-oz. pkg. firm tofu, drained, patted dry, and cut into 2- x \xbd-inch pieces', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'dry', u'firm', u'drained', u'cut into 2- x \xbd-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16162, u'unit': u'oz'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/noodles-and-vegetables-with-sesame-dipping-sauce/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make Sesame Dipping Sauce: Blend all ingredients in blender until smooth. Set aside. 2. To make Noodles and Vegetables: Set steamer rack in large skillet, and add 1 cup water to bottom of skillet. Bring water to boil over high heat. Arrange bok choy on rack, reduce heat to medium-low, cover, and steam bok choy 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add carrots, snow peas, and tofu to rack, and steam 2 minutes more. 3. Meanwhile, bring large pot of water to a boil. Cook rice noodles in boiling water 3 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-rice-noodles.jpg', u'id': 20133, u'name': u'rice noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'id': 11300, u'name': u'snow peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Remove noodles from cooking water with fork or tongs (this helps prevent them from sticking together), and divide among 6 bowls. Divide vegetables and tofu among bowls, arranging around noodles. Sprinkle with green onions and sesame seeds. Divide Sesame Dipping Sauce among bowls (2 Tbs. per serving), and serve with noodles. Dip vegetables, tofu, and noodles into sauce while eating.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1807, u'instructions': u'1. To make Sesame Dipping Sauce: Blend all ingredients in blender until smooth. Set aside. 2. To make Noodles and Vegetables: Set steamer rack in large skillet, and add 1 cup water to bottom of skillet. Bring water to boil over high heat. Arrange bok choy on rack, reduce heat to medium-low, cover, and steam bok choy 1 minute. Add carrots, snow peas, and tofu to rack, and steam 2 minutes more. 3. Meanwhile, bring large pot of water to a boil. Cook rice noodles in boiling water 3 minutes. Remove noodles from cooking water with fork or tongs (this helps prevent them from sticking together), and divide among 6 bowls. Divide vegetables and tofu among bowls, arranging around noodles. Sprinkle with green onions and sesame seeds. Divide Sesame Dipping Sauce among bowls (2 Tbs. per serving), and serve with noodles. Dip vegetables, tofu, and noodles into sauce while eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/noodles-and-vegetables-with-sesame-dipping-sauce-758518', u'dishTypes': [u'side dish'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}