{u'recipes': [{u'sourceName': u'Texanerin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/480309-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 480309, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lighter Pumpkin Cheesecake Bars', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 47.39, u'creditText': u'Texanerin', u'extendedIngredients': [{u'originalString': u'\xbc cup (54 grams) plain full-fat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'0% fat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 54.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'grams'}, {u'originalString': u'\xbc teaspoon allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup (56 grams) melted butter or refined coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'grams'}, {u'originalString': u'1\xbd cups (172 grams) Biscoff cookie crumbs (about 20 cookies)', u'aisle': u'Sweet Snacks', u'name': u'cookie crumbs', u'metaInformation': [u'( 20 cookies)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 172.0, u'consistency': u'solid', u'id': 10018192, u'unit': u'grams'}, {u'originalString': u'8 ounces (225 grams) cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 1017, u'unit': u'grams'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd teaspoon ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd teaspoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'\xbc teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.texanerin.com/2013/11/lighter-pumpkin-cheesecake-bars.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat the oven to 300\xb0F (150\xb0C).In a medium bowl, mix together the Biscoff cookie crumbs and the butter.Line an 8" x 8" pan with parchment paper and pat the crust on top of that (just over the bottom of the pan - not up the sides).With an electric mixer, beat the cream cheese and sugar until fluffy.', u'number': 1, u'ingredients': [{u'image': None, u'id': 10018192, u'name': u'cookie crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add the eggs and mix until combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the remaining cheesecake ingredients and mix just until combined.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the filling over the crust and bake for 35 minutes or until the middle of the cheesecake bars appears set and no longer jiggles when you move the pan.Open the oven door and let the bars cool completely before removing from the oven. This is to prevent the cheesecake  from cracking.Cover and store the bars in the refrigerator for up to 5 days.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 374, u'instructions': u'Preheat the oven to 300\xb0F (150\xb0C).In a medium bowl, mix together the Biscoff cookie crumbs and the butter.Line an 8" x 8" pan with parchment paper and pat the crust on top of that (just over the bottom of the pan - not up the sides).With an electric mixer, beat the cream cheese and sugar until fluffy.Add the eggs and mix until combined.Add the remaining cheesecake ingredients and mix just until combined.Pour the filling over the crust and bake for 35 minutes or until the middle of the cheesecake bars appears set and no longer jiggles when you move the pan.Open the oven door and let the bars cool completely before removing from the oven. This is to prevent the cheesecake  from cracking.Cover and store the bars in the refrigerator for up to 5 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/lighter-pumpkin-cheesecake-bars-480309', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}