{u'recipes': [{u'sourceName': u'Oh My Veggies', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/495136-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 495136, u'veryPopular': True, u'lowFodmap': False, u'title': u'Smoked Cheddar Grits with Broiled Heirloom Tomatoes', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 76.98, u'creditText': u'Oh My Veggies', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 cup grits', u'aisle': u'Cereal;Baking', u'name': u'grits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8160, u'unit': u'cup'}, {u'originalString': u'4 slices heirloom tomatoes', u'aisle': u'Produce', u'name': u'heirloom tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'slices'}, {u'originalString': u'2 cups reduced-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'cups'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2/3 cup shredded smoked cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'smoked', u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://ohmyveggies.com/recipe-smoked-cheddar-grits-with-broiled-heirloom-tomatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring the water and milk to a boil in a large saucepan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the grits, cover, and reduce heat to low. Stir often and cook until thick and creamy, 30-45 minutes.Preheat broiler.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 8160, u'name': u'grits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Remove saucepan from heat and whisk in the cheese, garlic, and butter, then season to taste with salt and pepper. Divide the grits into four large ramekins that have been sprayed with oil or cooking spray. (If you don't have large ramekins or mini cocottes, about 6 small ramekins will work.) Top each ramekin with a slice of tomato, lightly spray the tomato with oil, then sprinkle a little additional salt and pepper on top.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 8160, u'name': u'grits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Place ramekins on a baking sheet and broil for 5-10 minutes, or until the tomato is softened and starting to blister.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern works really well with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Concrete Old Vine Zinfandel with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'This Zinfandel is a luscious, smooth, full-bodied wine with aromas of blackberry, bramble berry and Allspice. Deliciously mouth-filling, the wine opens up to sweet vanilla and toasty oak flavors, then follows with a concentrated core of well-balanced acidity, soft, but firm tannins and a lingering finish on the palate.Concrete Old Vine Zinfandel is an excellent partner to spicy BBQ, zesty pasta and pizza, or juicy burgers.  View More', u'title': u'Concrete Old Vine Zinfandel', u'price': u'$17.99', u'id': 439670, u'link': u'https://www.wine.com/product/concrete-old-vine-zinfandel-2013/304339', u'imageUrl': u'https://spoonacular.com/productImages/439670-312x231.jpg'}]}, u'aggregateLikes': 11076, u'instructions': u"Bring the water and milk to a boil in a large saucepan. Whisk in the grits, cover, and reduce heat to low. Stir often and cook until thick and creamy, 30-45 minutes.Preheat broiler. Remove saucepan from heat and whisk in the cheese, garlic, and butter, then season to taste with salt and pepper. Divide the grits into four large ramekins that have been sprayed with oil or cooking spray. (If you don't have large ramekins or mini cocottes, about 6 small ramekins will work.) Top each ramekin with a slice of tomato, lightly spray the tomato with oil, then sprinkle a little additional salt and pepper on top. Place ramekins on a baking sheet and broil for 5-10 minutes, or until the tomato is softened and starting to blister.", u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-cheddar-grits-with-broiled-heirloom-tomatoes-495136', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}