{u'recipes': [{u'sourceName': u'Dessert Now Dinner Later', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/506113-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 506113, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ham and Cheese Pasta Bake', u'diets': [], u'pricePerServing': 112.06, u'creditText': u'Dessert Now Dinner Later', u'extendedIngredients': [{u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 lb (about 2 to 3 cups) fully cooked ham, cubed', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'cubed', u'fully cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 7214, u'unit': u'cups'}, {u'originalString': u'2 cups (8oz) Cabot Extra Sharp White Cheddar, shredded', u'aisle': u'Cheese', u'name': u'extra sharp cheddar cheese', u'metaInformation': [u'shredded', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1021009, u'unit': u'oz'}, {u'originalString': u'1/4 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'2 cups 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/4 cup shredded Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/2 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 (10oz) bag fresh spinach, thinly sliced', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'oz'}, {u'originalString': u'1 (16oz) box Ziti', u'aisle': u'Pasta and Rice', u'name': u'ziti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ziti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11520420, u'unit': u'oz'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.dessertnowdinnerlater.com/2014/04/ham-cheese-pasta-bake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Prepare ziti according to package directions.  Meanwhile, in a large stock pot, melt butter.  Stir in flour until smooth; gradually add milk.  Bring to a boil; cook and stir for 2 minutes or until thickened.  Reduce heat, stir in the cheeses, garlic powder, and pepper; cook and stir until cheese is melted.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ziti.jpg', u'id': 11520420, u'name': u'ziti'}]}, {u'equipment': [], u'step': u'Drain ziti; add to sauce mixture.  Stir in ham and spinach; cook until spinach welts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ziti.jpg', u'id': 11520420, u'name': u'ziti'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to a greased 13x9-inch baking dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake uncovered at 375 degrees Fahrenheit for 20 to 25 minutes or until heated through.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 689, u'instructions': u'Prepare ziti according to package directions.  Meanwhile, in a large stock pot, melt butter.  Stir in flour until smooth; gradually add milk.  Bring to a boil; cook and stir for 2 minutes or until thickened.  Reduce heat, stir in the cheeses, garlic powder, and pepper; cook and stir until cheese is melted.Drain ziti; add to sauce mixture.  Stir in ham and spinach; cook until spinach welts.  Transfer to a greased 13x9-inch baking dish.Bake uncovered at 375 degrees Fahrenheit for 20 to 25 minutes or until heated through.', u'spoonacularSourceUrl': u'https://spoonacular.com/ham-and-cheese-pasta-bake-506113', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}