{u'recipes': [{u'sourceName': u'The Culinary Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575264-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 575264, u'veryPopular': False, u'lowFodmap': False, u'title': u'Candy for Beginners: Easy Chocolate Truffles', u'diets': [u'gluten free'], u'pricePerServing': 89.97, u'creditText': u'The Culinary Life', u'extendedIngredients': [{u'originalString': u'6 ounces bittersweet chocolate, chopped fine', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'\xbe cup heavy cream (fresh will make a big difference here)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'fresh', u'( will make a big difference here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Small foil cups for packaging (available from a craft or cooking store)', u'aisle': u'Sweet Snacks', u'name': u'pb cups', u'metaInformation': [u'small', u'for packaging (available from a craft or cooking store)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19150, u'unit': u'cups'}, {u'originalString': u'6 ounces semisweet chocolate, chopped fine', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon pre-made strong black coffee', u'aisle': u'Tea and Coffee', u'name': u'strong coffee', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.theculinarylife.com/2009/basic-chocolate-truffles-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Fill the bottom of your double boiler with a few inches of water, and set it to boil. Have the chopped chocolate waiting in the top of your double boiler but not yet set over the heat.In a small saucepan, bring the heavy cream just to a boil, then pour it over your chocolate. Gently mix the two and set them over the heat, stirring until the chocolate is completely melted. Stir in vanilla and coffee, then cover and refrigerate until firm enough to handle (about 2 hours).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/melon-baller.jpg', u'id': 404680, u'name': u'melon baller'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Rolling out your easy chocolate truffles recipe: I do this in a two-part process to keep the cocoa from soaking into overly sticky truffles. After your chocolate has firmed up, grab yourself a parchment-lined cookie sheet and a melon baller or two teaspoons. Scoop about a teaspoonful of chocolate and then working as quickly as possible, roll it into a sphere shape with your hands. Try to make sure your hands are as cool as possible, or your truffles will melt as you roll them. It might be a good idea to keep a paper towel or two nearby, so that if your hands get caked with chocolate you can wipe them off. Set the rolled truffles on the lined cookie sheet, and keep going until you’ve finished all of your chocolate.Your truffle may look a little sticky at first. That’s fine, we’ll smooth them out in a second.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [], u'step': u'Let your chocolate truffles sit for about 10 minutes at room temperature, or stick them in the fridge if it’s a warm day (say, above 70F).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add cocoa powder to a small round-bottomed bowl and keep it within reach. One at a time, pick up your truffles and roll them between your hands for a few seconds to barely warm the surface, then drop them in the bowl of cocoa. Toss the bowl a bit until the truffle is completely covered in cocoa, then set it back on the cookie sheet. If you end up with a too much cocoa on your truffles, don’t shake them off until after they have firmed up again.Once you’re done, put the cookie sheet full of truffles in the fridge for half an hour. Once they’re firm again, shake off any excess cocoa powder and put them in little foil cups for decoration.These chocolate truffles will keep in the fridge for two weeks, but can be kept at room temperature for a few days. I like them a little softer, so I pull them out of the fridge a few hours before serving.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 51, u'instructions': u'Fill the bottom of your double boiler with a few inches of water, and set it to boil. Have the chopped chocolate waiting in the top of your double boiler but not yet set over the heat.In a small saucepan, bring the heavy cream just to a boil, then pour it over your chocolate. Gently mix the two and set them over the heat, stirring until the chocolate is completely melted. Stir in vanilla and coffee, then cover and refrigerate until firm enough to handle (about 2 hours).Rolling out your easy chocolate truffles recipe: I do this in a two-part process to keep the cocoa from soaking into overly sticky truffles. After your chocolate has firmed up, grab yourself a parchment-lined cookie sheet and a melon baller or two teaspoons. Scoop about a teaspoonful of chocolate and then working as quickly as possible, roll it into a sphere shape with your hands. Try to make sure your hands are as cool as possible, or your truffles will melt as you roll them. It might be a good idea to keep a paper towel or two nearby, so that if your hands get caked with chocolate you can wipe them off. Set the rolled truffles on the lined cookie sheet, and keep going until you’ve finished all of your chocolate.Your truffle may look a little sticky at first. That’s fine, we’ll smooth them out in a second.Let your chocolate truffles sit for about 10 minutes at room temperature, or stick them in the fridge if it’s a warm day (say, above 70F). Add cocoa powder to a small round-bottomed bowl and keep it within reach. One at a time, pick up your truffles and roll them between your hands for a few seconds to barely warm the surface, then drop them in the bowl of cocoa. Toss the bowl a bit until the truffle is completely covered in cocoa, then set it back on the cookie sheet. If you end up with a too much cocoa on your truffles, don’t shake them off until after they have firmed up again.Once you’re done, put the cookie sheet full of truffles in the fridge for half an hour. Once they’re firm again, shake off any excess cocoa powder and put them in little foil cups for decoration.These chocolate truffles will keep in the fridge for two weeks, but can be kept at room temperature for a few days. I like them a little softer, so I pull them out of the fridge a few hours before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/candy-for-beginners-easy-chocolate-truffles-575264', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}