{u'recipes': [{u'sourceName': u'Inspiralized', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618031-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 618031, u'veryPopular': False, u'lowFodmap': False, u'title': u'Miso-Ginger Glazed Taro Noodles and Shrimp with Scallions and Pea Shoots', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 1330.6, u'creditText': u'Inspiralized', u'extendedIngredients': [{u'originalString': u'cilantro leaves, to garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'leaves'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1.5 teaspoon freshly minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'1.25 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons white miso paste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16112, u'unit': u'tablespoons'}, {u'originalString': u"2 cups pea shoots (or watercress, if you can't find pea shoots)", u'aisle': u'Produce;Ethnic Foods', u'name': u'pea shoots', u'metaInformation': [u"(or watercress, if you can't find pea shoots)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-pea-sprouts-or-pea-shoots.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 98945, u'unit': u'cups'}, {u'originalString': u'2 tablespoons rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd cup diced scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'12 medium shrimp, defrosted, deshelled, deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'1 tablespoon low sodium soy sauce or tamari sauce', u'aisle': u'Ethnic Foods', u'name': u'tamari soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'tablespoon'}, {u'originalString': u'2 medium taro roots, peeled, Blade C, noodles trimmed', u'aisle': u'Produce', u'name': u'taro', u'metaInformation': [u'medium', u'trimmed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taro-root.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11518, u'unit': u''}, {u'originalString': u'1.5 tablespoon water + more to thin if needed', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.inspiralized.com/2014/11/09/miso-ginger-glazed-taro-noodles-and-shrimp-with-scallions-and-pea-shoots/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Combine all of the ingredients for the miso-sauce into a food processor and pulse until creamy. Taste and adjust to your preferences. Set aside.Season the shrimp with salt and pepper and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a large skillet over medium heat and add in the oil. Once oil heats, add in the garlic and scallions and let cook for 2-3 minutes or until scallions soften.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add in the taro noodles, pour in the miso sauce, toss to combine and then add in the shrimp. Cover the skillet and cook for 3-5 minutes or until tarot noodles soften and the shrimp are opaque and cooked through. Prepare your plates. Fill each plate with 1 cup of pea shoots and top with even amounts of the taro and shrimp noodles.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-pea-sprouts-or-pea-shoots.png', u'id': 98945, u'name': u'pea shoots'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taro-root.jpg', u'id': 11518, u'name': u'taro root'}]}, {u'equipment': [], u'step': u'Garnish with cilantro and serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Maso Canali Pinot Grigio. It has 4.6 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'Combine all of the ingredients for the miso-sauce into a food processor and pulse until creamy. Taste and adjust to your preferences. Set aside.Season the shrimp with salt and pepper and set aside.Place a large skillet over medium heat and add in the oil. Once oil heats, add in the garlic and scallions and let cook for 2-3 minutes or until scallions soften.Add in the taro noodles, pour in the miso sauce, toss to combine and then add in the shrimp. Cover the skillet and cook for 3-5 minutes or until tarot noodles soften and the shrimp are opaque and cooked through. Prepare your plates. Fill each plate with 1 cup of pea shoots and top with even amounts of the taro and shrimp noodles. Garnish with cilantro and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/miso-ginger-glazed-taro-noodles-and-shrimp-with-scallions-and-pea-shoots-618031', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}