{u'recipes': [{u'sourceName': u'Culicurious', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/616114-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 616114, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Salmon Deviled Eggs', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 30.09, u'creditText': u'Culicurious', u'extendedIngredients': [{u'originalString': u'2 tablespoons capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup of Petite Creme', u'aisle': u'Beverages', u'name': u'creme soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14130, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dried dill', u'aisle': u'Spices and Seasonings', u'name': u'dried dill', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2017, u'unit': u'teaspoon'}, {u'originalString': u'12 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup thinly sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 tray of ice cubes (for cooling the eggs once they are done)', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [u'(for cooling the eggs once they are done)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u''}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons fresh lemon juice (about one medium-sized lemon)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh', u'medium-sized', u'( one lemon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 tablespoon finely chopped shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tablespoon'}, {u'originalString': u'2 oz smoked salmon, finely chopped', u'aisle': u'Seafood', u'name': u'smoked salmon', u'metaInformation': [u'smoked', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 15077, u'unit': u'oz'}, {u'originalString': u'3 quarts water, room temperature', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'quarts'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.culicurious.com/smoked-salmon-deviled-eggs-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place eggs and water in a gallon size pot and turn the burner heat up to high. Once the water comes near boiling, set a timer for 10 minutes.While the eggs are cooking, measure all other ingredients under for filling and add to the bowl of a stand mixer. Use a regular mixing bowl if you dont have a stand mixer.When the 10 minutes are up, shut off the heat and rinse the eggs in cool water until all of the hot water is out of the pot.Once you have the pot filled with cooler water, add the ice to further chill the eggs. This will stop the cooking process and prevent your eggs from overcooking.Gently peel the eggs, rinse them and lay them out to dry as you peel the remaining eggs.Once done with the peeling, cut each egg in half length-wise and pop the yolks into the mixing bowl.Once you have all of the yolks removed and in the mixing bowl, line up the egg white halves on a platter for serving.After all the yolks are in the mixing bowl, use the paddle attachment and whip up the egg yolk mixture really well. This may take 2-3 minutes. Be sure to stop the mixer periodically and scrape down the sides into the bowl. If you are doing this by hand, I recommend using a whisk to help aerate the mixture.Once well mixed, place the yolk mixture into a piping bag with a star tip. If you dont have a piping bag or a star tip, place the mixture in a quart ziploc-type bag and snip one of the corners off with a pair of scissors.Proceed to fill each egg with approximately one tablespoon of the mixture.Chill for two hours before serving and keep under refrigeration until ready to serve.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Casa Catelli Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 61, u'instructions': u'Place eggs and water in a gallon size pot and turn the burner heat up to high. Once the water comes near boiling, set a timer for 10 minutes.While the eggs are cooking, measure all other ingredients under for filling and add to the bowl of a stand mixer. Use a regular mixing bowl if you dont have a stand mixer.When the 10 minutes are up, shut off the heat and rinse the eggs in cool water until all of the hot water is out of the pot.Once you have the pot filled with cooler water, add the ice to further chill the eggs. This will stop the cooking process and prevent your eggs from overcooking.Gently peel the eggs, rinse them and lay them out to dry as you peel the remaining eggs.Once done with the peeling, cut each egg in half length-wise and pop the yolks into the mixing bowl.Once you have all of the yolks removed and in the mixing bowl, line up the egg white halves on a platter for serving.After all the yolks are in the mixing bowl, use the paddle attachment and whip up the egg yolk mixture really well. This may take 2-3 minutes. Be sure to stop the mixer periodically and scrape down the sides into the bowl. If you are doing this by hand, I recommend using a whisk to help aerate the mixture.Once well mixed, place the yolk mixture into a piping bag with a star tip. If you dont have a piping bag or a star tip, place the mixture in a quart ziploc-type bag and snip one of the corners off with a pair of scissors.Proceed to fill each egg with approximately one tablespoon of the mixture.Chill for two hours before serving and keep under refrigeration until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-salmon-deviled-eggs-616114', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 165, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}