{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/415102-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 415102, u'veryPopular': False, u'lowFodmap': False, u'title': u'Frozen Sundae Pie', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 58.74, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup sliced banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9040, u'unit': u'cup'}, {u'originalString': u'1 tablespoon caramel ice cream topping, warmed', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel ice cream topping', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19364, u'unit': u'tablespoon'}, {u'originalString': u'9 chocolate wafers', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 10118157, u'unit': u''}, {u'originalString': u'1 tablespoon dry roasted peanuts, chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'dry roasted peanuts', u'metaInformation': [u'dry', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16090, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon hot fudge ice cream topping, warmed', u'aisle': u'Frozen;Condiments', u'name': u'fudge ice cream topping', u'metaInformation': [u'hot', u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19348, u'unit': u'tablespoon'}, {u'originalString': u'2 cups vanilla ice cream, softened', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/frozen-sundae-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Arrange wafers in a 7-in. pie plate, breaking wafers as necessary.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread ice cream into crust. Freeze for at least 2 hours or until firm.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Drizzle fudge topping over pie; top with banana slices.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'id': 10019348, u'name': u'hot fudge sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Drizzle with caramel topping; sprinkle with peanuts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie on the menu? Try pairing with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 179, u'instructions': u'Directions                                                                                Arrange wafers in a 7-in. pie plate, breaking wafers as necessary. Spread ice cream into crust. Freeze for at least 2 hours or until firm.                                                                                           Drizzle fudge topping over pie; top with banana slices. Drizzle with caramel topping; sprinkle with peanuts. Serve immediately.                                        Yield: 4 servings.                                                                                                                         Originally published as Frozen Sundae Pie in  Cooking for 2Summer 2009, p63                                                                                                                                                                                                        Nutritional Facts                                                                             1 piece equals 250 calories, 11 g fat (5 g saturated fat), 29 mg cholesterol, 174 mg sodium, 36 g carbohydrate, 1 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-sundae-pie-415102', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}