{u'recipes': [{u'sourceName': u'Amys Healthy Baking', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/592633-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 592633, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skinny Peanut Butter Brownie Parfaits', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 102.15, u'creditText': u'Amys Healthy Baking', u'extendedIngredients': [{u'originalString': u'2 tsp agave', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tsp'}, {u'originalString': u'3 tsp creamy peanut butter, divided', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'tsp'}, {u'originalString': u'1 c plain nonfat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'c'}, {u'originalString': u'1 tsp powdered peanut butter (such as PB2)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'powdered peanut butter', u'metaInformation': [u'(such as PB2)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 99089, u'unit': u'tsp'}, {u'originalString': u'1 \xbc tsp Truvia (or other sweetener, to taste)', u'aisle': u'Baking', u'name': u'truvia', u'metaInformation': [u'to taste', u'(or other sweetener, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'2 tbsp unsweetened cocoa powder (measured correctly)', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'(measured correctly)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1/8 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 tbsp water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}, {u'originalString': u'1 \xbd tbsp whole wheat flour (measured correctly)', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat', u'(measured correctly)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 20080, u'unit': u'tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://amyshealthybaking.com/blog/2014/05/02/skinny-peanut-butter-brownie-parfaits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'To prepare the brownie, lightly coat a 1-cup ramekin with nonstick cooking spray, and set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the cocoa powder and flour in a small bowl. In a separate bowl, stir together the water, Greek yogurt, agave, and vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add in the flour mixture, stirring just until incorporated.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Spread into the prepared ramekin, and microwave on 40% power for 2 minutes 15 seconds (2:15).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let it cool completely before slicing into cubes.While the brownie cooks and cools, prepare the yogurt. Stir together the yogurt, 2 teaspoons of creamy peanut butter, powdered peanut butter, and Truvia.', u'number': 5, u'ingredients': [{u'image': None, u'id': 99089, u'name': u'powdered peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 10116098, u'name': u'creamy peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'id': 93628, u'name': u'stevia'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Spread \xbc cup of the peanut butter yogurt into the bottom of 2 small glass ramekins. Top with most of the brownie chunks.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Spread the remaining peanut butter yogurt on top, and sprinkle with the remaining brownie chunks.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add the remaining 1 teaspoons of creamy peanut butter to a small zip-topped bag, and microwave on HIGH for 20-30 seconds, or until slightly melted. Snip off one corner, and drizzle the top of each parfait with the melted peanut butter.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 10116098, u'name': u'creamy peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Parfait. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'To prepare the brownie, lightly coat a 1-cup ramekin with nonstick cooking spray, and set aside. Whisk together the cocoa powder and flour in a small bowl. In a separate bowl, stir together the water, Greek yogurt, agave, and vanilla. Add in the flour mixture, stirring just until incorporated. Spread into the prepared ramekin, and microwave on 40% power for 2 minutes 15 seconds (2:15). Let it cool completely before slicing into cubes.While the brownie cooks and cools, prepare the yogurt. Stir together the yogurt, 2 teaspoons of creamy peanut butter, powdered peanut butter, and Truvia.Spread \xbc cup of the peanut butter yogurt into the bottom of 2 small glass ramekins. Top with most of the brownie chunks. Spread the remaining peanut butter yogurt on top, and sprinkle with the remaining brownie chunks. Add the remaining 1 teaspoons of creamy peanut butter to a small zip-topped bag, and microwave on HIGH for 20-30 seconds, or until slightly melted. Snip off one corner, and drizzle the top of each parfait with the melted peanut butter.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-peanut-butter-brownie-parfaits-592633', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}