{u'recipes': [{u'sourceName': u'Table for Two Blog', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/594155-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 594155, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker White Turkey Chili', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 250.27, u'creditText': u'Table for Two Blog', u'extendedIngredients': [{u'originalString': u'2 avocados, pitted and cut into \xbd inch pieces', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'pitted', u'cut into \xbd inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'3 (15 oz) cans cannellini beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned cannellini beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'oz'}, {u'originalString': u'6 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tsp. ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'4 tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 can (15 oz) white or yellow hominy, drained and rinsed', u'aisle': u'Canned and Jarred;Produce', u'name': u'hominy', u'metaInformation': [u'white', u'yellow', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-white.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 20030, u'unit': u'oz'}, {u'originalString': u'4 jalape\xf1os, stemmed, seeded and minced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'minced', u'stemmed', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 cup onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 pounds leftover turkey meat, shredded', u'aisle': u'Meat', u'name': u'turkey meat', u'metaInformation': [u'shredded', u'leftover'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5166, u'unit': u'pounds'}, {u'originalString': u'3 cups low sodium turkey stock', u'aisle': u'Canned and Jarred', u'name': u'turkey stock', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1006172, u'unit': u'cups'}, {u'originalString': u'2 tbsp. vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.tablefortwoblog.com/slow-cooker-white-turkey-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, puree 2 cups of turkey stock with the can of hominy until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006172, u'name': u'turkey stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-white.png', u'id': 20030, u'name': u'hominy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into the crockpot insert.In a large skillet, turn heat on to medium high and add vegetable oil to the skillet. Saut\xe9 onions, jalape\xf1os, garlic, cumin, and coriander until soft and tender. Stir in remaining 1 cup of turkey stock, scraping the bottom of the skillet for any browned pieces left behind. Carefully pour into crockpot.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006172, u'name': u'turkey stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the cannellini beans, turkey meat, salt, and pepper. Carefully stir together with a spatula to make sure everything is evenly distributed.Cover and cook on low for 4 hours or high for 2 hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5166, u'name': u'turkey meat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with avocado pieces on top and garnish with cilantro (optional).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Turkey Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Juve Y Camps Brut Nature Reserva de la Familia Cava. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 16 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats.', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 120, u'instructions': u'In a blender, puree 2 cups of turkey stock with the can of hominy until smooth. Pour into the crockpot insert.In a large skillet, turn heat on to medium high and add vegetable oil to the skillet. Saut\xe9 onions, jalape\xf1os, garlic, cumin, and coriander until soft and tender. Stir in remaining 1 cup of turkey stock, scraping the bottom of the skillet for any browned pieces left behind. Carefully pour into crockpot.Add the cannellini beans, turkey meat, salt, and pepper. Carefully stir together with a spatula to make sure everything is evenly distributed.Cover and cook on low for 4 hours or high for 2 hours.Serve with avocado pieces on top and garnish with cilantro (optional).', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-white-turkey-chili-594155', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}