{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/545985-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 545985, u'veryPopular': True, u'lowFodmap': False, u'title': u'Carrot Cake Cupcakes', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 22.42, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1/4 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 pkg. (8 oz.) PHILADELPHIA Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 pkg. (2-layer size) carrot cake mix', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'(2-layer size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'pkg'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 tsp. vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/carrot-cake-cupcakes-163133.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'PREPARE cake batter and bake as directed on package for 24 cupcakes. Cool in pans 10 min.; remove to wire racks. Cool completely.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'BEAT next 4 ingredients with mixer until well blended; spread onto cupcakes.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'HOW TO STORE: Keep refrigerated.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 696, u'instructions': u'PREPARE cake batter and bake as directed on package for 24 cupcakes. Cool in pans 10 min.; remove to wire racks. Cool completely.                                             BEAT next 4 ingredients with mixer until well blended; spread onto cupcakes.                                             HOW TO STORE: Keep refrigerated.', u'spoonacularSourceUrl': u'https://spoonacular.com/carrot-cake-cupcakes-545985', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}