{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577817-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 577817, u'veryPopular': True, u'lowFodmap': False, u'title': u'Garlicky Spinach, Millet, and Eggs', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 227.75, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'black pepper, to top', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'to top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'serving'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3-4 tablespoons hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup millet', u'aisle': u'Health Foods', u'name': u'millet', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/millet-bowl.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20031, u'unit': u'cup'}, {u'originalString': u'olive oil, to top', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'to top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'serving'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'2-3 handfuls spinach, shredded', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'handfuls'}, {u'originalString': u'\xbd tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://naturallyella.com/2014/02/02/garlicky-spinach-millet-and-eggs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a dry sauce pan, add millet and toast, over medium-low heat, for 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/millet-bowl.jpg', u'id': 20031, u'name': u'millet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour 1 cup water into the pot, bring to a boil, reduce to low, cover, and let cook until the majority of water is absorbed; roughly 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat, still covered, and let sit while preparing remaining parts of the meal.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat butter in a skillet over low heat and add minced garlic. Cook for 1-2 minutes until garlic is fragrant.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add spinach and turn off the heat. Stir and let sit until spinach is mostly wilted. Stir in millet and transfer to plates.In the same skillet, fry eggs to liking (over-easy, over-hard, sunny-side up) and place on top of millet.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/millet-bowl.jpg', u'id': 20031, u'name': u'millet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve with a dollop of hummus, drizzle of olive oil, and sprinkle of black pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2095, u'instructions': u'In a dry sauce pan, add millet and toast, over medium-low heat, for 3-4 minutes. Pour 1 cup water into the pot, bring to a boil, reduce to low, cover, and let cook until the majority of water is absorbed; roughly 15 minutes. Remove from heat, still covered, and let sit while preparing remaining parts of the meal.Heat butter in a skillet over low heat and add minced garlic. Cook for 1-2 minutes until garlic is fragrant. Add spinach and turn off the heat. Stir and let sit until spinach is mostly wilted. Stir in millet and transfer to plates.In the same skillet, fry eggs to liking (over-easy, over-hard, sunny-side up) and place on top of millet. Serve with a dollop of hummus, drizzle of olive oil, and sprinkle of black pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/garlicky-spinach-millet-and-eggs-577817', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}