{u'recipes': [{u'sourceName': u'Dessert Now Dinner Later', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626166-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 626166, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raspberry Shortcake Sheet Cake', u'diets': [u'gluten free'], u'pricePerServing': 63.91, u'creditText': u'Dessert Now Dinner Later', u'extendedIngredients': [{u'originalString': u'4 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 (8oz) pkg neufchatel cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 (8oz) tub light cool whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'\xbd cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 (12oz) pkg frozen raspberries (may use fresh as well; about 2\xbd to 3 cups)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'frozen', u'well', u'(may use as ; 2\xbd to 3 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9302, u'unit': u'oz'}, {u'originalString': u'1 (4.75oz) box Raspberry Danish Dessert (see photo in post for reference; find in aisle with Jell-O/gelatin dessert)', u'aisle': u'Baking', u'name': u'raspberry gelatin dessert mix', u'metaInformation': [u'with jell-o/gelatin dessert)', u'for reference; find in aisle '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-jello.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.75, u'consistency': u'solid', u'id': 10319172, u'unit': u'oz'}, {u'originalString': u'1\xbe cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.dessertnowdinnerlater.com/2015/01/raspberry-shortcake-sheet-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees Fahrenheit and prepare cake batter according to box directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour batter into a large 13x18x1-inch lightly greased cookie sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake for 12 to 15 minutes. When toothpick placed in center comes out clean you know it is done. Cool cake completely.Meanwhile, prepare whipped cream cheese frosting by beating the cream cheese with the butter until light and fluffy with no lumps, using a hand mixer. Beat in the powdered sugar. Then beat in the cool whip. Set aside.Prepare the raspberry glaze by whisking the Danish Dessert with 1 cups cold water in a small saucepan.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Heat until boiling and thick, whisking constantly. Immediately stir in the the frozen (or fresh) raspberries. Allow to cool completely; since I used frozen raspberries, it cooled pretty quickly. You may need to place the glaze in the refrigerator on a hot pad, but don't let it set up in the saucepan, just refrigerate it until cool enough to spread on the cream cheese layer.Once the cake is cool, dollop the whipped cream cheese frosting over the cake and smooth together with an offset spatula, being careful not to pull up the crumbs of the cake. (Hint: Keep the tip of the offset spatula down in the frosting while spreading.)Once the glaze is cool, gently spread it over the cream cheese layer. Refrigerate cake for 2 hours to overnight to set up the glaze. (If you don't refrigerate it for very long, the glaze will be runny like my photos suggest.)", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 70, u'instructions': u"Preheat oven to 350 degrees Fahrenheit and prepare cake batter according to box directions. Pour batter into a large 13x18x1-inch lightly greased cookie sheet. Bake for 12 to 15 minutes. When toothpick placed in center comes out clean you know it is done. Cool cake completely.Meanwhile, prepare whipped cream cheese frosting by beating the cream cheese with the butter until light and fluffy with no lumps, using a hand mixer. Beat in the powdered sugar. Then beat in the cool whip. Set aside.Prepare the raspberry glaze by whisking the Danish Dessert with 1 cups cold water in a small saucepan. Heat until boiling and thick, whisking constantly. Immediately stir in the the frozen (or fresh) raspberries. Allow to cool completely; since I used frozen raspberries, it cooled pretty quickly. You may need to place the glaze in the refrigerator on a hot pad, but don't let it set up in the saucepan, just refrigerate it until cool enough to spread on the cream cheese layer.Once the cake is cool, dollop the whipped cream cheese frosting over the cake and smooth together with an offset spatula, being careful not to pull up the crumbs of the cake. (Hint: Keep the tip of the offset spatula down in the frosting while spreading.)Once the glaze is cool, gently spread it over the cream cheese layer. Refrigerate cake for 2 hours to overnight to set up the glaze. (If you don't refrigerate it for very long, the glaze will be runny like my photos suggest.)", u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-shortcake-sheet-cake-626166', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}