{u'recipes': [{u'sourceName': u'Mountain Mama Cooks', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/486598-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 486598, u'veryPopular': True, u'lowFodmap': False, u'title': u'Smoked Salmon Wonton Tacos', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'pricePerServing': 26.31, u'creditText': u'Mountain Mama Cooks', u'extendedIngredients': [{u'originalString': u'1 cup small diced cucumber', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'1 lime, zested and halved', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'\xbd - \xbe lbs smoked salmon lox, separate into small pieces', u'aisle': u'Seafood', u'name': u'lox', u'metaInformation': [u'smoked', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 15077, u'unit': u''}, {u'originalString': u'\xbd cup thinly sliced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.mountainmamacooks.com/2013/12/smoked-salmon-wonton-tacos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat enough oil in a large skillet to fry the wontons.  Fold wonton skins in half diagonally, then fry in the oil in a taco shape. (Be sure to keep the wontons open enough for stuffing with the seafood and condiments)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on a paper towel lined baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine cr\xe8me Fraiche, chopped cilantro, lime zest and squeeze of lime juice, enough to make the cr\xe8me Fraiche saucy; mix well.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}]}, {u'equipment': [], u'step': u'Place in the frig until ready to use. Next lightly toss together the cabbage and cucumber.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}, {u'equipment': [], u'step': u'Place the wonton shells on a platter and stuff with the smoked salmon, cabbage and cucumber and then top with the sliced onion.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'id': 15077, u'name': u'smoked salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drizzle the spicy sauce over each taco and serve. For an alternative to the Sriracha, use a \xbc teaspoon or more of chipotle chili powder.  Makes an excellent substitute.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2629, u'instructions': u'Heat enough oil in a large skillet to fry the wontons.  Fold wonton skins in half diagonally, then fry in the oil in a taco shape. (Be sure to keep the wontons open enough for stuffing with the seafood and condiments) Drain on a paper towel lined baking sheet.Combine cr\xe8me Fraiche, chopped cilantro, lime zest and squeeze of lime juice, enough to make the cr\xe8me Fraiche saucy; mix well. Place in the frig until ready to use. Next lightly toss together the cabbage and cucumber. Place the wonton shells on a platter and stuff with the smoked salmon, cabbage and cucumber and then top with the sliced onion. Drizzle the spicy sauce over each taco and serve. For an alternative to the Sriracha, use a \xbc teaspoon or more of chipotle chili powder.  Makes an excellent substitute.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-salmon-wonton-tacos-486598', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}