{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/543489-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 543489, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Browned Butter Chocolate Chip Cookie Dough Bites', u'diets': [], u'pricePerServing': 58.69, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'10 Tbsp salted butter, diced', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'salted', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 10.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'12 oz chocolate coating or chocolate, melted or 1/3 cup semi-sweet chocolate chips or chopped chocolate (if drizzling rather than dipping. I used Ghirardelli chocolate coating)', u'aisle': u'Baking', u'name': u'chocolate coating', u'metaInformation': [u'melted', u'chopped', u'(if drizzling rather than dipping. I used Ghirardelli chocolate coating)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 98857, u'unit': u'oz'}, {u'originalString': u'coarse sea salt, for garnish**', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [u'for garnish**'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 28.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 Tbsp heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'Tbsp'}, {u'originalString': u'1 cup packed light-brown sugar', u'aisle': u'Baking', u'name': u'light-brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 - 2 Tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tbsp'}, {u'originalString': u'1/4 tsp fine sea salt*', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1/2 cup mini semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'seeds 1/2 large vanilla bean', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'1/2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.cookingclassy.com/2013/03/salted-browned-butter-chocolate-chip-cookie-dough-truffles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Brown butter along with vanilla bean seeds in a small saucepan over medium heat (make sure to brown it long enough).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and pour brown butter and seeds, scrapping out any excess, into a heat proof 1 quart storage container. Cover with lid and freeze 30 minutes, or until cool. Once cool pour browned butter and vanilla bean seeds, scrapping out excess, into the bowl of an electric stand mixer fitted with paddle attachment.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add light-brown sugar, cream, vanilla and salt and whip mixture on medium speed until light and fluffy, about 2 minutes. Stir in flour and 1 Tbsp milk and blend until combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'id': 19334, u'name': u'light brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in chocolate chips.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}], u'step': u"Add additional milk 1/2 Tbsp at a time as needed to create a soft dough that will roll into a ball, yet that is firm enough to hold it's shape. Scoop dough out about 1 Tbsp at a time and shape into a balls. Dip in melted chocolate and sprinkle very lightly with coarse sea salt (a little goes a long way) before chocolate sets (or alternately pour the 1/3 cup chocolate that has been melted into a Ziploc bag or piping bag, cut tip and drizzle over tops and sprinkle with salt) then refrigerate to set chocolate. Store in an airtight container in refrigerator. *I just placed 1/4 tsp coarse sea salt in a ziploc bag and crushed it with the flat side of a meat mallet until finely crushed. Regular table salt would work fine though too.**I've found the chunks are too large in the coarse sea salt I've been buying lately so I crush those down slightly as well. Recipe Source: Cooking Classy", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'coarse sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'table salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 396, u'instructions': u"Brown butter along with vanilla bean seeds in a small saucepan over medium heat (make sure to brown it long enough). Remove from heat and pour brown butter and seeds, scrapping out any excess, into a heat proof 1 quart storage container. Cover with lid and freeze 30 minutes, or until cool. Once cool pour browned butter and vanilla bean seeds, scrapping out excess, into the bowl of an electric stand mixer fitted with paddle attachment. Add light-brown sugar, cream, vanilla and salt and whip mixture on medium speed until light and fluffy, about 2 minutes. Stir in flour and 1 Tbsp milk and blend until combined. Mix in chocolate chips. Add additional milk 1/2 Tbsp at a time as needed to create a soft dough that will roll into a ball, yet that is firm enough to hold it's shape. Scoop dough out about 1 Tbsp at a time and shape into a balls. Dip in melted chocolate and sprinkle very lightly with coarse sea salt (a little goes a long way) before chocolate sets (or alternately pour the 1/3 cup chocolate that has been melted into a Ziploc bag or piping bag, cut tip and drizzle over tops and sprinkle with salt) then refrigerate to set chocolate. Store in an airtight container in refrigerator. *I just placed 1/4 tsp coarse sea salt in a ziploc bag and crushed it with the flat side of a meat mallet until finely crushed. Regular table salt would work fine though too.**I've found the chunks are too large in the coarse sea salt I've been buying lately so I crush those down slightly as well. Recipe Source: Cooking Classy", u'spoonacularSourceUrl': u'https://spoonacular.com/salted-browned-butter-chocolate-chip-cookie-dough-bites-543489', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 28, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}