{u'recipes': [{u'sourceName': u'Dizzy Busy and Hungry', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/556269-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 556269, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shrimp Fettuccine Alfredo', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 171.69, u'creditText': u'Dizzy Busy and Hungry', u'extendedIngredients': [{u'originalString': u'12 ounces fettuccine (I cooked the entire 16 ounce box and saved \xbc of the cooked pasta for a side dish later in the week!)', u'aisle': u'Pasta and Rice', u'name': u'cooked fettuccine', u'metaInformation': [u'cooked', u'for a side dish later in the week!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10020410, u'unit': u'ounces'}, {u'originalString': u'8 wedges Laughing Cow Cream Cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u''}, {u'originalString': u'\xbd tablespoon finely minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pound fresh shrimp (small)', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'fresh', u'small', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'\xbc cup chicken broth or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.dizzybusyandhungry.com/shrimp-fettuccine-alfredo/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to package directions, and set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the cream cheese wedges in a microwave-safe bowl, warm in the microwave for 30 seconds at a time and stir in between, until melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the Parmesan cheese, garlic, and broth, and mix until combined. Set aside.Spray a large skillet with olive oil spray and heat on medium-high.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Add the shrimp and cook until almost done, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Add the sauce and stir, cooking about 1-2 more minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pasta and toss to coat.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chopped parsley (if desired) and toss.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Fettuccine Alfredo on the menu? Try pairing with Pinot Grigio and Unoaked Chardonnay. Creamy, cheesy, buttery alfredo dishes can pair beautifully with an unoaked chardonnay or a pinot grigio. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'pinot grigio', u'unoaked chardonnay'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 382, u'instructions': u'Cook pasta according to package directions, and set aside.Place the cream cheese wedges in a microwave-safe bowl, warm in the microwave for 30 seconds at a time and stir in between, until melted.Add the Parmesan cheese, garlic, and broth, and mix until combined. Set aside.Spray a large skillet with olive oil spray and heat on medium-high.Add the shrimp and cook until almost done, about 3 minutes.Add the sauce and stir, cooking about 1-2 more minutes.Add the pasta and toss to coat.Add the chopped parsley (if desired) and toss.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-fettuccine-alfredo-556269', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}