{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213290-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 213290, u'veryPopular': False, u'lowFodmap': False, u'title': u'Secret green sauce spaghetti', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 138.46, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g bag baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 11457, u'unit': u'g'}, {u'originalString': u'small bunch basil, leaves picked, 3 reserved to serve', u'aisle': u'Produce', u'name': u'basil', u'metaInformation': [u'leaves picked', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'bunch'}, {u'originalString': u'3 tbsp green pesto', u'aisle': u'Pasta and Rice', u'name': u'green pesto', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tbsp'}, {u'originalString': u'50g Parmesan (or vegetarian alternative), grated, plus a little extra to serve', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated', u'plus a little extra to serve', u'(or vegetarian alternative)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'140g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'150ml pot single cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'single cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1052, u'unit': u'ml'}, {u'originalString': u'400g spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'g'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipe/secret-green-sauce-spaghetti', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cook the spaghetti following packinstructions. Meanwhile, boil the kettle,put the spinach and peas in a bowl,and cover with boiling water. Leave forabout 3 mins until the peas are tender,then drain well. Tip the veg into a foodprocessor or blender, add the basil,pesto, cream and Parmesan, andwhizz to make a smooth sauce.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the pasta, reserving a little ofthe cooking water, and return to the pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Pour over the sauce and return to a lowheat to cook for a few mins, until thesauce clings to the spaghetti.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [], u'step': u'Add a littlepasta water if it looks too dry, season totaste and serve with extra Parmesan andscattered with basil leaves, if you like.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 180, u'instructions': u'Cook the spaghetti following packinstructions. Meanwhile, boil the kettle,put the spinach and peas in a bowl,and cover with boiling water. Leave forabout 3 mins until the peas are tender,then drain well. Tip the veg into a foodprocessor or blender, add the basil,pesto, cream and Parmesan, andwhizz to make a smooth sauce.Drain the pasta, reserving a little ofthe cooking water, and return to the pan.Pour over the sauce and return to a lowheat to cook for a few mins, until thesauce clings to the spaghetti. Add a littlepasta water if it looks too dry, season totaste and serve with extra Parmesan andscattered with basil leaves, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/secret-green-sauce-spaghetti-213290', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 17, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}