{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223623-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 223623, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti with lemon & olives', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 187.51, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'good pinch dried chilli flakes', u'aisle': u'Spices and Seasonings', u'name': u'dried chilli flakes', u'metaInformation': [u'dried', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'handful parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'5 fat garlic cloves, peeled', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'100g pitted green olives, chopped if liked', u'aisle': u'Canned and Jarred', u'name': u'green olives', u'metaInformation': [u'green', u'pitted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-olives---sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1029195, u'unit': u'g'}, {u'originalString': u'2 lemons', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'5 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'5 tbsp grated fresh parmesan (or vegetarian alternative), plus extra to serve', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'fresh', u'grated', u'(or vegetarian alternative)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tbsp'}, {u'originalString': u'50g pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12147, u'unit': u'g'}, {u'originalString': u'500g bag fresh or dried spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'g'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2277/spaghetti-with-lemon-and-olives', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put a large pan of water on to the boil for the pasta. Meanwhile, put the oil and nuts in a small pan and warm over a low heat. Crush the garlic into the pan and sprinkle in the chilli. Continue warming until the nuts are lightly toasted, checking to make sure the garlic doesn’t burn.Finely grate the zest from both lemons then cut one in half and squeeze out the juice. Roughly chop the parsley. Once the pasta water is boiling, add a generous amount of salt and the spaghetti and cook, according to packet instructions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the spaghetti and tip into a serving bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [], u'step': u'Pour over the garlicky oil and toss well with the lemon zest and juice, parsley, olives, Parmesan and plenty of salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Add more lemon juice to taste – it should be fresh but not overly lemony.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with extra Parmesan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 24, u'instructions': u'Put a large pan of water on to the boil for the pasta. Meanwhile, put the oil and nuts in a small pan and warm over a low heat. Crush the garlic into the pan and sprinkle in the chilli. Continue warming until the nuts are lightly toasted, checking to make sure the garlic doesn’t burn.Finely grate the zest from both lemons then cut one in half and squeeze out the juice. Roughly chop the parsley. Once the pasta water is boiling, add a generous amount of salt and the spaghetti and cook, according to packet instructions.Drain the spaghetti and tip into a serving bowl. Pour over the garlicky oil and toss well with the lemon zest and juice, parsley, olives, Parmesan and plenty of salt and pepper. Add more lemon juice to taste – it should be fresh but not overly lemony. Serve with extra Parmesan.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-with-lemon-olives-223623', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}