{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/701258-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 701258, u'veryPopular': False, u'lowFodmap': False, u'title': u'Maple Walnut Butterballs', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 17.03, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'8 tablespoons butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'1 cup walnuts, processed in the food processor until finely chopped', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.framedcooks.com/2015/12/maple-walnut-butterballs.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 300 and line cookie sheets with parchment paper or silicone baking mats.Put butter into mixer and mix at medium high speed until creamed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add syrup, followed by flour, salt and vanilla. Stir in walnuts.Chill the dough for at least one hour until firm. Scoop out dough to roll into 1 inch balls and place on cookie sheets.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 40 minutes.As soon as the cookies are cool enough to handle roll them in the powdered sugar. If you like, you can give them another coating of sugar once they are totally cool. Make sure to save some for the cook!', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'aggregateLikes': 48, u'instructions': u'Preheat the oven to 300 and line cookie sheets with parchment paper or silicone baking mats.Put butter into mixer and mix at medium high speed until creamed. Add syrup, followed by flour, salt and vanilla. Stir in walnuts.Chill the dough for at least one hour until firm. Scoop out dough to roll into 1 inch balls and place on cookie sheets. Bake for 40 minutes.As soon as the cookies are cool enough to handle roll them in the powdered sugar. If you like, you can give them another coating of sugar once they are totally cool. Make sure to save some for the cook!', u'spoonacularSourceUrl': u'https://spoonacular.com/maple-walnut-butterballs-701258', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 40, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}