{u'recipes': [{u'sourceName': u'The Roasted Root', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512636-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 512636, u'veryPopular': True, u'lowFodmap': False, u'title': u'Zucchini Basil and Kale Frittata', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 208.19, u'creditText': u'The Roasted Root', u'extendedIngredients': [{u'originalString': u'3 cups baby spinach leaves (or chopped chard or spinach/chard/kale leaves)', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [u'chopped', u'(or chard or spinach/chard/kale leaves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'12 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup loosely packed fresh basil leaves, chopped', u'aisle': u'Produce', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'loosely packed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'5 stalks green onion, chopped', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u'stalks'}, {u'originalString': u'\xbd cup jack cheese (or cheddar)', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'(or cheddar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups zucchini, shredded (1 large or 2 small zucchinis)', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'shredded', u'small', u'large', u'(1 or 2 zucchinis)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cups'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.theroastedroot.net/zucchini-basil-and-kale-frittata/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Shred the zucchini and place it in a fine strainer. Placing the strainer on top of a bowl or over the sink, use your hands to squeeze the water out of the zucchini. Its okay if you dont squeeze all of the water out, but try to get the majority of it. Set shredded zucchini aside.Preheat oven to 350 degrees F.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a 10 to 12 cast-iron (or oven-safe) skillet to medium.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add spinach (or chard/kale leaves) and stir until greens begins to soften. Cover the skillet to allow greens to cook and soften, about 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Add the green onion and chopped basil and saut another minute or two.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Remove from heat and allow the greens to cool completely.In a mixing bowl, beat the eggs. Stir in the shredded zucchini, salt, and cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour in the green mixture and mix everything well.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the egg and veggie mixture into the same skillet you were using to saut the greens, making sure the mixture is evenly distributed.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the skillet in the oven and bake for 15 to 18 minutes or until cooked all the way through.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2281, u'instructions': u'Shred the zucchini and place it in a fine strainer. Placing the strainer on top of a bowl or over the sink, use your hands to squeeze the water out of the zucchini. Its okay if you dont squeeze all of the water out, but try to get the majority of it. Set shredded zucchini aside.Preheat oven to 350 degrees F.Heat olive oil in a 10 to 12 cast-iron (or oven-safe) skillet to medium.Add spinach (or chard/kale leaves) and stir until greens begins to soften. Cover the skillet to allow greens to cook and soften, about 1 to 2 minutes.Add the green onion and chopped basil and saut another minute or two. Remove from heat and allow the greens to cool completely.In a mixing bowl, beat the eggs. Stir in the shredded zucchini, salt, and cheese. Pour in the green mixture and mix everything well.Pour the egg and veggie mixture into the same skillet you were using to saut the greens, making sure the mixture is evenly distributed.Place the skillet in the oven and bake for 15 to 18 minutes or until cooked all the way through.', u'spoonacularSourceUrl': u'https://spoonacular.com/zucchini-basil-and-kale-frittata-512636', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': True, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}