{u'recipes': [{u'sourceName': u'Chocolate and Zucchini', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/546637-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 546637, u'veryPopular': False, u'lowFodmap': False, u'title': u'Buckwheat Speculoos Cookies', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 3.43, u'creditText': u'Chocolate and Zucchini', u'extendedIngredients': [{u'originalString': u'250 grams (8 3/4 ounces, about 2 scant cups; see note) buckwheat flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'buckwheat flour', u'metaInformation': [u'(8 3/4 ounces, 2 scant cups; see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buckwheat-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20011, u'unit': u'grams'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'250 grams (8 3/4 ounces, about 2 scant cups; see note) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'(8 3/4 ounces, 2 scant cups; see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'2 teaspoons speculoos spice mix (mine is from the wonderful \xc9picerie de Bruno and contains Ceylan cinnamon, aniseed, star anise, ginger, mace, coriander, and allspice) or pumpkin pie spice mix', u'aisle': u'Baking', u'name': u'pumpkin pie mix', u'metaInformation': [u'(mine is from the wonderful \xc9picerie de Bruno and contains Ceylan cinnamon, aniseed, star anise, ginger, mace, coriander, and allspice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11426, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'150 grams (1/2 cup plus 2 tablespoons) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(1/2 cup plus 2 tablespoons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 1145, u'unit': u'grams'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://chocolateandzucchini.com/recipes/cookies-small-cakes/buckwheat-speculoos-cookies-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of a mixer or working by hand, cream together the sugar and butter.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the egg, and mix again.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Add in the flours, spices, and salt (if you're using an open mixer such as a Kitchen", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Aid, fold them in with a spatula first so they don't go flying everywhere), and mix just until the dough comes together, without overmixing. If you find the dough is too dry to come together, add a little milk or water, tablespoon by tablespoon, until it does.Turn the dough out on the counter and divide it in two.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u"Roll each half of the dough into a log, then pat it on opposing sides so the section becomes rectangular. Each log should be about 20 cm (4 inches) in length, 5 cm (2 inches) in width, and 2.5 cm (1 inch) in height.Wrap separately in plastic and refrigerate for at least 2 hours, or overnight.Preheat the oven to 180\xb0C (360\xb0F) and line a baking sheet with parchment paper or a silicone baking mat.Slice the prepared logs into 3-mm (1/10-inch) slices, and transfer to the prepared baking sheet; they won't expand much in the baking.", u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 10 to 12 minutes, until the speculoos start to brown around the edges.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Transfer to a rack to cool completely.Preheat the oven to 180\xb0C (360\xb0F) and line a baking sheet with parchment paper or a silicon baking mat.Sprinkle a little flour into each mold, and shake lightly to encourage the flour to enter every crevice of the pattern. Flip the mold over a bowl (so you can reuse the flour) and tap the back of the mold to remove excess flour.Take a piece of the dough and press it into the mold, keeping the shape of the pattern in mind to make sure you pack the dough well into every part. Don\'t worry about it being pretty at this point; it won\'t be.Run a thin knife blade flat along the surface of the mold -- sharp edge toward the dough and away from you -- to slice off the excess dough. If your molds are not very deep, you may need to keep your hand gently pressed over the dough to prevent it from following along as the blade works its way through. If your molds have pointy details (such as the beak and wing tips of my stork), it works best if the knife pushes "into them" (i.e. from top of stork head toward tip of beak), rather than against them.Invert the mold onto the prepared baking sheet, and tap it firmly against the sheet to dislodge the dough; if you\'ve floured the molds properly, the dough will pop right out. If not, tap again, or nudge it out with the tip of the knife. If it still doesn\'t unmold, remove the dough and start over.Once you\'ve filled the baking sheet, insert it into the oven and bake for 10 to 12 minutes, until the speculoos start to brown around the edges.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Transfer to a rack to cool completely.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 348, u'instructions': u'In the bowl of a mixer or working by hand, cream together the sugar and butter. Add the egg, and mix again.Add in the flours, spices, and salt (if you\'re using an open mixer such as a KitchenAid, fold them in with a spatula first so they don\'t go flying everywhere), and mix just until the dough comes together, without overmixing. If you find the dough is too dry to come together, add a little milk or water, tablespoon by tablespoon, until it does.Turn the dough out on the counter and divide it in two. Roll each half of the dough into a log, then pat it on opposing sides so the section becomes rectangular. Each log should be about 20 cm (4 inches) in length, 5 cm (2 inches) in width, and 2.5 cm (1 inch) in height.Wrap separately in plastic and refrigerate for at least 2 hours, or overnight.Preheat the oven to 180\xb0C (360\xb0F) and line a baking sheet with parchment paper or a silicone baking mat.Slice the prepared logs into 3-mm (1/10-inch) slices, and transfer to the prepared baking sheet; they won\'t expand much in the baking.Bake for 10 to 12 minutes, until the speculoos start to brown around the edges.Transfer to a rack to cool completely.Preheat the oven to 180\xb0C (360\xb0F) and line a baking sheet with parchment paper or a silicon baking mat.Sprinkle a little flour into each mold, and shake lightly to encourage the flour to enter every crevice of the pattern. Flip the mold over a bowl (so you can reuse the flour) and tap the back of the mold to remove excess flour.Take a piece of the dough and press it into the mold, keeping the shape of the pattern in mind to make sure you pack the dough well into every part. Don\'t worry about it being pretty at this point; it won\'t be.Run a thin knife blade flat along the surface of the mold -- sharp edge toward the dough and away from you -- to slice off the excess dough. If your molds are not very deep, you may need to keep your hand gently pressed over the dough to prevent it from following along as the blade works its way through. If your molds have pointy details (such as the beak and wing tips of my stork), it works best if the knife pushes "into them" (i.e. from top of stork head toward tip of beak), rather than against them.Invert the mold onto the prepared baking sheet, and tap it firmly against the sheet to dislodge the dough; if you\'ve floured the molds properly, the dough will pop right out. If not, tap again, or nudge it out with the tip of the knife. If it still doesn\'t unmold, remove the dough and start over.Once you\'ve filled the baking sheet, insert it into the oven and bake for 10 to 12 minutes, until the speculoos start to brown around the edges.Transfer to a rack to cool completely.', u'spoonacularSourceUrl': u'https://spoonacular.com/buckwheat-speculoos-cookies-546637', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 42, u'servings': 100, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}