{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/792664-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 792664, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppery Peach Sauce', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 18.53, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'\xbc cup apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 5\xbd ounce can guava nectar (or peach or apricot)', u'aisle': u'Beverages', u'name': u'guava nectar', u'metaInformation': [u'canned', u'(or peach or apricot)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guava-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 9435, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'4 pounds fresh peaches (see note)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 9236, u'unit': u'pounds'}, {u'originalString': u'1\xbd cup fresh raspberries (1 6-ounce package)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'(1 6-ounce package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'1 fresh hot red chile pepper (we used a red jalapeno), seeded and very finely chopped (approximately 1 tablespoon)', u'aisle': u'Produce', u'name': u'red chile pepper', u'metaInformation': [u'fresh', u'red', u'hot', u'seeded', u'very finely chopped', u'(we used a jalapeno)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.afamilyfeast.com/peppery-peach-sauce/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash, peel and pit fresh peaches.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place half of the peaches into the bowl of a food processor and process until pureed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour processed peaches into a heavy-bottomed 6 quart saucepan. Repeat with remaining peaches. (This should yield approximately 5 cups of peach puree.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add sugar, nectar, apple cider vinegar, lemon juice, chile pepper, salt and garlic to the saucepan with the peach puree. Bring contents to a rolling boil. Reduce heat and simmer uncovered, stirring occasionally, for 15 to 20 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'id': 2048, u'name': u'apple cider vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u"Remove from heat and skim off any foam that may be on top of the mixture. Stir in raspberries.While the peach sauce is simmering, sterilize 6 to 8 1-cup (half-pint) canning jars, lids and covers. Ladle the hot peach sauce into the jars, filling to  below the top of each jar. Wipe jar rims clean and cover with lids and rings. Process in a boiling water bath for 15 minutes. (Click here for canning how-to's.)", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Remove jars from boiling water and allow to cool.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 122, u'instructions': u"Wash, peel and pit fresh peaches. Place half of the peaches into the bowl of a food processor and process until pureed. Pour processed peaches into a heavy-bottomed 6 quart saucepan. Repeat with remaining peaches. (This should yield approximately 5 cups of peach puree.)Add sugar, nectar, apple cider vinegar, lemon juice, chile pepper, salt and garlic to the saucepan with the peach puree. Bring contents to a rolling boil. Reduce heat and simmer uncovered, stirring occasionally, for 15 to 20 minutes. Remove from heat and skim off any foam that may be on top of the mixture. Stir in raspberries.While the peach sauce is simmering, sterilize 6 to 8 1-cup (half-pint) canning jars, lids and covers. Ladle the hot peach sauce into the jars, filling to  below the top of each jar. Wipe jar rims clean and cover with lids and rings. Process in a boiling water bath for 15 minutes. (Click here for canning how-to's.) Remove jars from boiling water and allow to cool.", u'spoonacularSourceUrl': u'https://spoonacular.com/peppery-peach-sauce-792664', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 60, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}