{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/437913-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 437913, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blueberry Almond Snickerdoodles', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 20.14, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup chopped almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u"1/4 cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup dried blueberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried blueberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93686, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 to 2 teaspoons 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4615, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup plus 2 tablespoons sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/blueberry-almond-snickerdoodles', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, cream the butter, shortening and 1/3 cup sugar until light and fluffy. Beat in egg.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Combine the flour, cream of tartar, baking soda and salt; gradually add to creamed mixture and mix well. Stir in almonds and blueberries.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine cinnamon and remaining sugar. Shape dough into 1-1/2-in. balls; roll in cinnamon mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place 2 in. apart on baking sheets coated with cooking spray.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 10-12 minutes or until edges begin to brown. Cool for 2 minutes before removing from pans to wire racks to cool completely.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"For icing, combine confectioners' sugar and enough milk to achieve desired consistency.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Drizzle over cookies. Store in an airtight container.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 182, u'instructions': u"Directions                                                                                In a large bowl, cream the butter, shortening and 1/3 cup sugar until light and fluffy. Beat in egg. Combine the flour, cream of tartar, baking soda and salt; gradually add to creamed mixture and mix well. Stir in almonds and blueberries.                                                                                           In a small bowl, combine cinnamon and remaining sugar. Shape dough into 1-1/2-in. balls; roll in cinnamon mixture. Place 2 in. apart on baking sheets coated with cooking spray.                                                                                           Bake at 350\xb0 for 10-12 minutes or until edges begin to brown. Cool for 2 minutes before removing from pans to wire racks to cool completely.                                                                                           For icing, combine confectioners' sugar and enough milk to achieve desired consistency. Drizzle over cookies. Store in an airtight container.                                        Yield: about 1-1/4 dozen.                                                                                                                         Originally published as Blueberry Almond Snickerdoodles in  Cooking for 2Spring 2009, p19                                                                                                                                                                                                        Nutritional Facts                                                                             1 cookie equals 109 calories, 5 g fat (2 g saturated fat), 18 mg cholesterol, 56 mg sodium, 16 g carbohydrate, 1 g fiber, 2 g protein. Diabetic Exchanges: 1 starch, 1 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-almond-snickerdoodles-437913', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}