{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/700858-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 700858, u'veryPopular': False, u'lowFodmap': False, u'title': u'Maple Cream Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 119.25, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter, cut into cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'2 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon maple extract', u'aisle': u'Baking', u'name': u'maple extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 12111111, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup plus 1 tablespoon pure maple syrup, divided', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1\xbe cups milk, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 fully baked pie crust, cooled', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'cooled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'2 tablespoons powdered sugar (optional)', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012061, u'unit': u'cup'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.tasteandtellblog.com/maple-cream-pie-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a large saucepan, whisk together the cornstarch and the salt. Slowly whisk in  cup of the milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Whisk in the rest of the milk and  cup of maple syrup. Cook over medium heat until thickened, then reduce the heat and continue to cook for 2 minutes, stirring constantly.Turn off the heat, then slowly whisk in some of the hot mixture into the egg yolks, whisking constantly. Stir the egg mixture back into the saucepan and return the pan to the heat, cooking and stirring constantly for 2 more minutes. Turn off the heat and whisk in the cubes of butter, one at a time, until fully incorporated and melted. Stir in the maple extract.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 12111111, u'name': u'maple extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let the mixture come to room temperature.Whip the whipping cream until it starts to thicken, then slowly add in the powdered sugar (if using). Continue to whip until soft peaks form. When the pudding mixture is just at room temperature, fold in  cup of the whipped cream.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the pudding into the baked pie crust.Stir the remaining 1 tablespoon of maple syrup into the remaining cream and spread over the top of the pudding. Refrigerate the pie for a few hours or overnight.To make the almonds, combine the almonds and the sugar in a skillet over medium heat. Cook, stirring constantly, until the sugar is melted and coats the almonds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour out onto a sheet of waxed paper into a single layer. Allow the almonds to cool completely, then break up the almonds.Just before serving, top the pie with the sugared almonds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is McFadden Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'apricot , apple , honey', u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u'In a large saucepan, whisk together the cornstarch and the salt. Slowly whisk in  cup of the milk. Whisk in the rest of the milk and  cup of maple syrup. Cook over medium heat until thickened, then reduce the heat and continue to cook for 2 minutes, stirring constantly.Turn off the heat, then slowly whisk in some of the hot mixture into the egg yolks, whisking constantly. Stir the egg mixture back into the saucepan and return the pan to the heat, cooking and stirring constantly for 2 more minutes. Turn off the heat and whisk in the cubes of butter, one at a time, until fully incorporated and melted. Stir in the maple extract. Let the mixture come to room temperature.Whip the whipping cream until it starts to thicken, then slowly add in the powdered sugar (if using). Continue to whip until soft peaks form. When the pudding mixture is just at room temperature, fold in  cup of the whipped cream. Pour the pudding into the baked pie crust.Stir the remaining 1 tablespoon of maple syrup into the remaining cream and spread over the top of the pudding. Refrigerate the pie for a few hours or overnight.To make the almonds, combine the almonds and the sugar in a skillet over medium heat. Cook, stirring constantly, until the sugar is melted and coats the almonds. Pour out onto a sheet of waxed paper into a single layer. Allow the almonds to cool completely, then break up the almonds.Just before serving, top the pie with the sugared almonds.', u'spoonacularSourceUrl': u'https://spoonacular.com/maple-cream-pie-700858', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}