{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/177265-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 177265, u'veryPopular': False, u'lowFodmap': False, u'title': u'Huck Finn Teddy Bear Raft Snacks', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 55.96, u'extendedIngredients': [{u'originalString': u'12 ready-to-eat baby-cut carrots, cut in half lengthwise', u'aisle': u'Produce', u'name': u'baby cut carrots', u'metaInformation': [u'cut in half lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11960, u'unit': u''}, {u'originalString': u'6 pieces celery (about 3 inches each)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'inches', u'unitShort': u'inches', u'amount': 18.0, u'consistency': u'solid', u'id': 11143, u'unit': u'inches'}, {u'originalString': u'6 teddy bear-shaped vanilla or cinnamon graham snacks', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'bear-shaped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 2010, u'unit': u''}, {u'originalString': u'1/2 cup small fish-shaped crackers', u'aisle': u'Savory Snacks', u'name': u'crackers', u'metaInformation': [u'small', u'fish-shaped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18621, u'unit': u'cup'}, {u'originalString': u'1/2 cup whipped cream cheese (from 8-oz container)', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'(from 8-oz container)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1017, u'unit': u'cup'}, {u'originalString': u'6 pretzel sticks (about 3x1/4-inch each)', u'aisle': u'Savory Snacks', u'name': u'pretzel sticks', u'metaInformation': [u'( 3x1/4-inch each)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-sticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10119047, u'unit': u''}, {u'originalString': u'6 miniature ranch-flavored tortilla chips (from 2 5/8-oz bag)', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [u'miniature', u' ranch-flavored', u'(from 2 5/8-oz bag)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 19056, u'unit': u''}, {u'originalString': u'12 big square baked cheese snack crackers', u'aisle': u'?', u'name': u'big square baked cheese snack crackers', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/huck-finn-teddy-bear-raft-snacks/55b5e9aa-e6ba-4240-9747-b94ef9a95966', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'For each snack, fill indentation of celery piece with about 1 tablespoon cream cheese, mounding slightly in center.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Place on small plate, cream cheese up. Press 4 carrot halves, flat side up, across celery to make flat surface on celery to resemble raft.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place tiny amount of cream cheese on one edge of 1 tortilla chip; attach to one end of 1 pretzel stick to resemble flag on pole. Push end of pretzel into cream cheese between 2 carrot halves.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place tiny amount of cream cheese on opposite edges of each of 2 cheese snack crackers. Press cream cheese-covered edges of crackers to carrot surface, leaning crackers together to resemble tent. Attach teddy bear to raft near flag with small amount of cream cheese. Scatter fish-shaped crackers on plate around raft.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14, u'instructions': u'1                               For each snack, fill indentation of celery piece with about 1 tablespoon cream cheese, mounding slightly in center. Place on small plate, cream cheese up. Press 4 carrot halves, flat side up, across celery to make flat surface on celery to resemble raft.                                                          2                               Place tiny amount of cream cheese on one edge of 1 tortilla chip; attach to one end of 1 pretzel stick to resemble flag on pole. Push end of pretzel into cream cheese between 2 carrot halves.                                                          3                               Place tiny amount of cream cheese on opposite edges of each of 2 cheese snack crackers. Press cream cheese-covered edges of crackers to carrot surface, leaning crackers together to resemble tent. Attach teddy bear to raft near flag with small amount of cream cheese. Scatter fish-shaped crackers on plate around raft.', u'spoonacularSourceUrl': u'https://spoonacular.com/huck-finn-teddy-bear-raft-snacks-177265', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}