{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/672094-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 672094, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Chocolate Peppermint Brownies', u'diets': [], u'preparationMinutes': 180, u'pricePerServing': 114.28, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup plus 2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'\xbe to 1 cup soft peppermint candies, coarsely chopped', u'aisle': u'Sweet Snacks', u'name': u'peppermint candies', u'metaInformation': [u'soft', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 98859, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (2 sticks) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'5 squares (1 ounce each) unsweetened baking chocolate, coarsely chopped', u'aisle': u'Baking', u'name': u'unsweetened baking chocolate', u'metaInformation': [u'unsweetened', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'2 cups white chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://thebakingpan.com/recipes/cookie/white-chocolate-peppermint-brownies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a small mixing bowl, combine the flour and salt; whisk together to mix. Set aside.In a small heavy saucepan over low heat, combine butter and chocolate; stir constantly with a rubber spatula or wooden spoon until melted so mixture does not burn.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat and cool slightly. Or, place the chocolate and butter in a microwave-safe bowl, microwave at 50% power and stir frequently just until the chocolate is melted; do not overheat as mixture will burn easily. Set aside to cool slightly. Or, place butter in a bowl set over a pan of simmering water, the bottom of the bowl should not touch the water. When the butter is almost melted add the chocolate. After one minute remove the bowl from the heat and let sit until the chocolate is completely melted, stirring occasionally. Set aside to cool slightly.In a large mixing bowl, lightly whisk the eggs with a wire whisk to break them up.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the sugar and continue whisking to mix together.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the warm butter and chocolate mixture and vanilla and stir with the whisk until blended. Dont over-whisk, you are not trying to add air into the mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the flour in 3 additions, blending with the whisk or wooden spoon just until blended.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the batter into the prepared pan, smoothing the top with the back of a spoon.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 28 to 30 minutes, or until a toothpick inserted into the center has just a few moist crumbs that cling to the toothpick. Do not overbake.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven. Immediately sprinkle white chocolate chips onto the hot baked brownie and let sit until the chips are melted, about 5 minutes. Using an offset spatula, smooth the chocolate evenly over the top of the brownie. Sprinkle chopped peppermint candies evenly over warm chocolate.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 98859, u'name': u'peppermint candy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place pan on a wire cooling rack to cool completely, from 2 to 4 hours, before cutting. When cool, use the foil overhang to lift brownie from the pan, and cut into 2 inch squares. Tip: My favorite tool to cut brownies is a stainless steel dough scraper; simply push the dough scraper straight down into the brownie for straight cuts. Or use a pizza cutter or small kitchen knife to cut the brownie into squares.', u'number': 4, u'ingredients': []}], u'name': u'Bake'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 67, u'instructions': u'In a small mixing bowl, combine the flour and salt; whisk together to mix. Set aside.In a small heavy saucepan over low heat, combine butter and chocolate; stir constantly with a rubber spatula or wooden spoon until melted so mixture does not burn. Remove from heat and cool slightly. Or, place the chocolate and butter in a microwave-safe bowl, microwave at 50% power and stir frequently just until the chocolate is melted; do not overheat as mixture will burn easily. Set aside to cool slightly. Or, place butter in a bowl set over a pan of simmering water, the bottom of the bowl should not touch the water. When the butter is almost melted add the chocolate. After one minute remove the bowl from the heat and let sit until the chocolate is completely melted, stirring occasionally. Set aside to cool slightly.In a large mixing bowl, lightly whisk the eggs with a wire whisk to break them up. Add the sugar and continue whisking to mix together. Add the warm butter and chocolate mixture and vanilla and stir with the whisk until blended. Dont over-whisk, you are not trying to add air into the mixture.Add the flour in 3 additions, blending with the whisk or wooden spoon just until blended.Bake: Pour the batter into the prepared pan, smoothing the top with the back of a spoon. Bake for 28 to 30 minutes, or until a toothpick inserted into the center has just a few moist crumbs that cling to the toothpick. Do not overbake.Remove from oven. Immediately sprinkle white chocolate chips onto the hot baked brownie and let sit until the chips are melted, about 5 minutes. Using an offset spatula, smooth the chocolate evenly over the top of the brownie. Sprinkle chopped peppermint candies evenly over warm chocolate.Place pan on a wire cooling rack to cool completely, from 2 to 4 hours, before cutting. When cool, use the foil overhang to lift brownie from the pan, and cut into 2 inch squares. Tip: My favorite tool to cut brownies is a stainless steel dough scraper; simply push the dough scraper straight down into the brownie for straight cuts. Or use a pizza cutter or small kitchen knife to cut the brownie into squares.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-peppermint-brownies-672094', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 210, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}