{u'recipes': [{u'sourceName': u'White Lights On Wednesday', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/593156-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 593156, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mango Old Fashioned', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 264.24, u'creditText': u'White Lights On Wednesday', u'extendedIngredients': [{u'originalString': u'3 dashes Angostura bitters', u'aisle': u'Alcoholic Beverages', u'name': u'angostura bitters', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 93653, u'unit': u'dashes'}, {u'originalString': u'2 tablespoons mango, diced', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9176, u'unit': u'tablespoons'}, {u'originalString': u'1 slice \xbd orange, peeled', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 9200, u'unit': u'slice'}, {u'originalString': u'1 teaspoon Zulka sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u"2 ounces Jack Daniel's Whiskey", u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 14052, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'png', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.whitelightsonwednesday.com/2013/05/mango-old-fashioned/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Add orange slice, mango, and sugar to a rocks glass. Muddled until mango is completely broken down.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour in whiskey and bitters. Stir to combine.Fill an old fashioned (or rocks) glass to the top with ice. Strain cocktail over ice. Rub the glass between your hands a few times to melt the ice a little. Enjoy!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 93653, u'name': u'bitters'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 77, u'instructions': u'Add orange slice, mango, and sugar to a rocks glass. Muddled until mango is completely broken down. Pour in whiskey and bitters. Stir to combine.Fill an old fashioned (or rocks) glass to the top with ice. Strain cocktail over ice. Rub the glass between your hands a few times to melt the ice a little. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-old-fashioned-593156', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}