{u'recipes': [{u'sourceName': u'Health Starts in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609320-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 609320, u'veryPopular': False, u'lowFodmap': False, u'title': u'Parslied Smoked Gruyere Sweet Potato Pasta', u'diets': [u'gluten free'], u'pricePerServing': 386.39, u'creditText': u'Health Starts in the Kitchen', u'extendedIngredients': [{u'originalString': u'1 cup of unsweetened plain almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'plain', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'6 slices of bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 tbsp. bacon fat', u'aisle': u'Meat', u'name': u'bacon fat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4609, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp. grass-fed, organic, pasture-raised butter (I adore Kerrygold)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'organic', u'grass-fed', u'(I adore Kerrygold)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp. minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tbsp'}, {u'originalString': u'* 2 cups of grated or shaved smoked gruyere cheese *', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'smoked', u'grated', u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1023, u'unit': u'cups'}, {u'originalString': u'1 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'7 cups spiralized or very thinly sliced New Jersey (or regular) sweet potato (about 5-6 sweet potatoes of 4-5 New Jersey white sweet potatoes)', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'white', u'very thinly sliced', u'(or regular)', u'( 5-6 sweet potatoes of 4-5 New Jersey sweet potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'solid', u'id': 11507, u'unit': u'cups'}, {u'originalString': u'1 \xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.healthstartsinthekitchen.com/2014/08/20/parslied-smoked-gruyere-sweet-potato-pasta/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Spiralize, thinly slice, or julienne sweet potato after removing the skin. You should have about 7 cups, but note that sweet potato will shrink significantly when cooking. Set aside.Cook bacon strips until crispy. Reserve 1 tbsp. of bacon grease.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 4609, u'name': u'bacon drippings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Let bacon cool, and slice into small crumbles. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add water and sliced sweet potato to a separate large pot. Cover with lid and let steam on low-medium heat until potato is cooked thoroughly but still a tiny bit firm, approximately 25 minutes. Stir every few minutes to make sure that all potato pieces are cooking evenly.While potato is cooking, make sauce. In a saucepan, brown garlic and chopped parsley in olive oil and bacon fat until garlic is golden in color and fragrant.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 4609, u'name': u'bacon drippings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add almond milk to saucepan. Bring mixture to a simmer, and add butter.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Let butter melt completely. After butter has melted, add grated or shaved cheese to the almond milk mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Whisk cheese frequently in mixture to avoid any scalding or burning while cheese is melting. This is now your “pasta” sauce.Once the sweet potatoes are done cooking, turn off heat and add sauce to the large pot.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Add bacon crumbles. Stir sauce and cooked sweet potatoes together until all sweet potato strands are evenly coated with sauce.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Serve immediately and garnish with parsley, if desired.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 9, u'instructions': u'Spiralize, thinly slice, or julienne sweet potato after removing the skin. You should have about 7 cups, but note that sweet potato will shrink significantly when cooking. Set aside.Cook bacon strips until crispy. Reserve 1 tbsp. of bacon grease. Let bacon cool, and slice into small crumbles. Set aside.Add water and sliced sweet potato to a separate large pot. Cover with lid and let steam on low-medium heat until potato is cooked thoroughly but still a tiny bit firm, approximately 25 minutes. Stir every few minutes to make sure that all potato pieces are cooking evenly.While potato is cooking, make sauce. In a saucepan, brown garlic and chopped parsley in olive oil and bacon fat until garlic is golden in color and fragrant. Add almond milk to saucepan. Bring mixture to a simmer, and add butter. Let butter melt completely. After butter has melted, add grated or shaved cheese to the almond milk mixture. Whisk cheese frequently in mixture to avoid any scalding or burning while cheese is melting. This is now your “pasta” sauce.Once the sweet potatoes are done cooking, turn off heat and add sauce to the large pot. Add bacon crumbles. Stir sauce and cooked sweet potatoes together until all sweet potato strands are evenly coated with sauce.Serve immediately and garnish with parsley, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/parslied-smoked-gruyere-sweet-potato-pasta-609320', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}