{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/771417-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 771417, u'veryPopular': False, u'lowFodmap': False, u'title': u'Southwestern Egg Bake', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'ketogenic'], u'preparationMinutes': 5, u'pricePerServing': 175.55, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 (8-ounce) can mild green chiles, drained and stemmed', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [u'green', u'stemmed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11819, u'unit': u'ounce'}, {u'originalString': u'12 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 pound Monterey jack cheese, coarsely grated', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'pound'}, {u'originalString': u'Salsa, additional sour cream, and guacamole for serving, optional', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'sour', u'for serving, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'servings'}, {u'originalString': u'2 cups sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpeg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/southwestern-egg-bake-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Cut the chiles in half lengthwise and remove the seeds. Arrange in 1 layer on the bottom of a buttered 13 by 9-inch baking dish. Cover with the cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the eggs with the sour cream in a large bowl until blended. Season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour the eggs over the cheese, smooth the top, and bake in the middle of the oven until golden, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve with salsa, sour cream and guacamole on the side, if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Coarsely mash 1 peeled, pitted ripe avocado, preferably Hass.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add some fresh lime juice, chopped cilantro leaves, chopped cherry tomatoes, 1 small minced garlic clove, 1/2 serrano chile, or jalapeno, minced, and kosher salt, to taste.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 163, u'instructions': u'Preheat the oven to 350 degrees F.                          Cut the chiles in half lengthwise and remove the seeds. Arrange in 1 layer on the bottom of a buttered 13 by 9-inch baking dish. Cover with the cheese. Whisk the eggs with the sour cream in a large bowl until blended. Season with salt and pepper. Pour the eggs over the cheese, smooth the top, and bake in the middle of the oven until golden, about 45 minutes. Serve with salsa, sour cream and guacamole on the side, if desired.                          Coarsely mash 1 peeled, pitted ripe avocado, preferably Hass. Add some fresh lime juice, chopped cilantro leaves, chopped cherry tomatoes, 1 small minced garlic clove, 1/2 serrano chile, or jalapeno, minced, and kosher salt, to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/southwestern-egg-bake-771417', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': True, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}