{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611494-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 611494, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Noodle Soup Casserole', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 231.42, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'2 tbsp. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'2 carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'4 ribs celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'ribs', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'1\xbd c. chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'c'}, {u'originalString': u'2 tbsp. flour (use rice flour for gluten free)', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten free flour', u'metaInformation': [u'gluten free', u'for )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93620, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'12 oz. bite-sized pasta (I used gluten-free pasta made with corn and rice)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'gluten-free', u'with corn and rice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20420, u'unit': u'oz'}, {u'originalString': u'1 tsp. poultry seasoning', u'aisle': u'Spices and Seasonings', u'name': u'poultry seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2034, u'unit': u'tsp'}, {u'originalString': u'\xbe lb. boneless, skinless chicken breasts, diced', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'diced', u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'1 small sweet onion, diced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'4-6 slices swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1040, u'unit': u'slices'}, {u'originalString': u'4 oz. white mushrooms, chopped', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://wearychef.com/chicken-noodle-soup-casserole/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of lightly salted water to a boil. Preheat oven to 350 degrees F. Spray a 9 x 13" baking dish with cooking spray and set aside.Cook pasta the minimum amount of time listed in the package directions, and drain.While pasta cooks, melt butter in a large skillet over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add onion, carrots, celery, mushrooms, chicken, salt, and poultry seasoning. Stir fry chicken and vegetables in butter until chicken is cooked through and vegetables are slightly tender (about 10 minutes).Stir in flour, and stir in  c. broth until smooth. Stir in the remaining broth, and bring to a low boil. Simmer a couple minutes longer until broth starts to thicken.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'id': 2034, u'name': u'poultry seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Place pasta in prepared baking dish. Carefully pour chicken mixture evenly over the noodles. Gently stir to make sure there's no dry pasta in the house.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place an even layer of swiss cheese over the top of the casserole, and bake in preheated oven for 15 minutes, until cheese is evenly melted.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 1097, u'instructions': u'Bring a large pot of lightly salted water to a boil. Preheat oven to 350 degrees F. Spray a 9 x 13" baking dish with cooking spray and set aside.Cook pasta the minimum amount of time listed in the package directions, and drain.While pasta cooks, melt butter in a large skillet over medium-high heat. Add onion, carrots, celery, mushrooms, chicken, salt, and poultry seasoning. Stir fry chicken and vegetables in butter until chicken is cooked through and vegetables are slightly tender (about 10 minutes).Stir in flour, and stir in  c. broth until smooth. Stir in the remaining broth, and bring to a low boil. Simmer a couple minutes longer until broth starts to thicken.Place pasta in prepared baking dish. Carefully pour chicken mixture evenly over the noodles. Gently stir to make sure there\'s no dry pasta in the house. Place an even layer of swiss cheese over the top of the casserole, and bake in preheated oven for 15 minutes, until cheese is evenly melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-noodle-soup-casserole-611494', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}