{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/212940-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 212940, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coconut panna cotta with pineapple salsa', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 121.2, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'handful coconut chips, toasted', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'handful'}, {u'originalString': u'2 x 400ml cans coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u''}, {u'originalString': u'400ml full-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'full-fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'2 x 12g sachets powdered gelatine', u'aisle': u'Baking', u'name': u'gelatine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 19177, u'unit': u''}, {u'originalString': u'25g fresh root ginger, thinly sliced', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 11216, u'unit': u'g'}, {u'originalString': u'250g fresh pineapples, cut into small pieces', u'aisle': u'Produce', u'name': u'pineapples', u'metaInformation': [u'fresh', u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 9266, u'unit': u'g'}, {u'originalString': u'1 red chilli, deseeded and finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'deseeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'85g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1 vanilla pod', u'aisle': u'Baking', u'name': u'vanilla pod', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/4984/coconut-panna-cotta-with-pineapple-salsa', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the coconut milk and milk into a saucepan, then add the sugar. Split the vanilla pod in half and scrape out the seeds,then add to the pan with the empty pod. Bring to the boil, then remove from the heat and leave to infuse for 5 mins.Spoon 200ml of the hot mixture into a small bowl. Shake over the gelatine and whisk into the mixture until dissolved. If you have difficulty dissolving the gelatine, return the mixture to a gentle heat for 1-2 mins. See know-how below).Stir into the rest of the coconut mixture, discarding the vanilla pod.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour into 6 x 200ml metal dariole moulds and place in the fridge for at least 2 hrs until firm with a slight wobble. Can be made up to 2 days ahead.For the salsa, tip the sugar and ginger slices into a small saucepan and pour over 100ml water. Bring to the boil, then reduce the heat to a simmer and cook for another 5-10 mins until it turns slightly syrupy and light golden. Leave to cool, then discard the ginger slices. The syrup can be made up to 1 week in advance. To serve, dip each dariole mould into boiling water for a moment to loosen the panna cotta, then turn onto a serving late. Arrange the sliced pineapple beside each panna cotta and scatter with chopped chilli.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Drizzle with ginger syrup to finish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}], u'name': u''}], u'aggregateLikes': 31, u'instructions': u'Pour the coconut milk and milk into a saucepan, then add the sugar. Split the vanilla pod in half and scrape out the seeds,then add to the pan with the empty pod. Bring to the boil, then remove from the heat and leave to infuse for 5 mins.Spoon 200ml of the hot mixture into a small bowl. Shake over the gelatine and whisk into the mixture until dissolved. If you have difficulty dissolving the gelatine, return the mixture to a gentle heat for 1-2 mins. See know-how below).Stir into the rest of the coconut mixture, discarding the vanilla pod. Pour into 6 x 200ml metal dariole moulds and place in the fridge for at least 2 hrs until firm with a slight wobble. Can be made up to 2 days ahead.For the salsa, tip the sugar and ginger slices into a small saucepan and pour over 100ml water. Bring to the boil, then reduce the heat to a simmer and cook for another 5-10 mins until it turns slightly syrupy and light golden. Leave to cool, then discard the ginger slices. The syrup can be made up to 1 week in advance. To serve, dip each dariole mould into boiling water for a moment to loosen the panna cotta, then turn onto a serving late. Arrange the sliced pineapple beside each panna cotta and scatter with chopped chilli. Drizzle with ginger syrup to finish.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-panna-cotta-with-pineapple-salsa-212940', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}