{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214749-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 214749, u'veryPopular': False, u'lowFodmap': False, u'title': u'Choc-peanut fondants with chocolate soil & cherries', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 212.48, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g butter, softened, plus extra melted butter for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'softened', u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'6 cherries with stalks, to serve', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'with stalks, to serve'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9070, u'unit': u''}, {u'originalString': u'big jar cherry compote', u'aisle': u'Produce', u'name': u'cherry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'jar'}, {u'originalString': u'1 bought chocolate loaf cake (un-iced), about 250g', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [u'bought', u'(un-iced)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99040, u'unit': u''}, {u'originalString': u'85g crunchy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'crunchy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 10016098, u'unit': u'g'}, {u'originalString': u'300g dark chocolate, broken into chunks and melted', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'175g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'85g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'6 scoops vanilla ice cream, to serve', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'scoops', u'unitShort': u'scoops', u'amount': 6.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'scoops'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3020686/chocpeanut-fondants-with-chocolate-soil-and-cherri', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the soil first.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to180C/160C fan/gas 4. Thinly slice thechocolate cake and lay on baking trayslined with baking parchment.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Bake for30 mins, turning the slices halfway, untilcrisp to the touch. Put in a food processorand whizz to crunchy crumbs. Will keepwell for up to a week in an airtight tin.Make the fondants by brushing 6dariole moulds well with melted butter.Chill for 1 min, then brush again. Put aspoon of cocoa powder in one and shakeabout so the whole inside is coated, thentip out the rest into the next and tap thebottom of the dariole to get out anyexcess. Repeat with all the darioles.Beat together the softened butter,peanut butter, sugar and vanilla tocream them, then beat in the eggs,followed by the flour. Stir in the meltedchocolate and divide between thedarioles. Chill for up to 24 hrs.To serve, heat oven to 200C/180C fan/gas 6.', u'length': {u'number': 31, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake the fondants for 10-12 mins –the top will be set, but you should feel asoft middle when you prod it.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add a smallpile of soil to each plate and top with acherry – or put the soil in a mini bucketor flowerpot.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add a spoon of cherrycompote to each plate and top witha scoop of vanilla ice cream. Finally,carefully turn each chocolate fondant outonto the plate – they should come outeasily.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'vanilla ice cream'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 25, u'instructions': u'Make the soil first. Heat oven to180C/160C fan/gas 4. Thinly slice thechocolate cake and lay on baking trayslined with baking parchment. Bake for30 mins, turning the slices halfway, untilcrisp to the touch. Put in a food processorand whizz to crunchy crumbs. Will keepwell for up to a week in an airtight tin.Make the fondants by brushing 6dariole moulds well with melted butter.Chill for 1 min, then brush again. Put aspoon of cocoa powder in one and shakeabout so the whole inside is coated, thentip out the rest into the next and tap thebottom of the dariole to get out anyexcess. Repeat with all the darioles.Beat together the softened butter,peanut butter, sugar and vanilla tocream them, then beat in the eggs,followed by the flour. Stir in the meltedchocolate and divide between thedarioles. Chill for up to 24 hrs.To serve, heat oven to 200C/180C fan/gas 6. Bake the fondants for 10-12 mins –the top will be set, but you should feel asoft middle when you prod it. Add a smallpile of soil to each plate and top with acherry – or put the soil in a mini bucketor flowerpot. Add a spoon of cherrycompote to each plate and top witha scoop of vanilla ice cream. Finally,carefully turn each chocolate fondant outonto the plate – they should come outeasily. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/choc-peanut-fondants-with-chocolate-soil-cherries-214749', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}