{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/448316-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 448316, u'veryPopular': False, u'lowFodmap': False, u'title': u'Birch Pretzel Logs', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 31.1, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 pound white candy coating, coarsely chopped', u'aisle': u'Baking', u'name': u'candy coating', u'metaInformation': [u'white', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 98857, u'unit': u'pound'}, {u'originalString': u'1 package (10 ounces) pretzel rods', u'aisle': u'Savory Snacks', u'name': u'pretzel rods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-rods.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10019047, u'unit': u'ounces'}, {u'originalString': u'1/2 cup semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 small heavy-duty resealable plastic bag', u'aisle': u'Tea and Coffee', u'name': u'tea bag', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111111, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/birch-pretzel-logs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a microwave, melt candy coating; stir until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into an ungreased 8-in. square pan or a tall glass.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Roll or dip pretzels in coating, leaving 1 in. of space on the end you are holding; allow excess to drip off.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on waxed paper-lined baking sheets; let stand until set.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a microwave, melt chocolate chips; stir until smooth.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Pour into a small resealable plastic bag. Carefully cut a very small hole in the bottom corner of the bag. Pipe stripe markings across the pretzel rods to resemble birch trees. Allow to set. Store in an airtight container.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-rods.jpg', u'id': 10019047, u'name': u'pretzel rods'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 35, u'instructions': u'Directions                                                                                In a microwave, melt candy coating; stir until smooth. Pour into an ungreased 8-in. square pan or a tall glass. Roll or dip pretzels in coating, leaving 1 in. of space on the end you are holding; allow excess to drip off. Place on waxed paper-lined baking sheets; let stand until set.                                                                                            In a microwave, melt chocolate chips; stir until smooth. Pour into a small resealable plastic bag. Carefully cut a very small hole in the bottom corner of the bag. Pipe stripe markings across the pretzel rods to resemble birch trees. Allow to set. Store in an airtight container.                                        Yield: about 2 dozen.                                                                                                                         Originally published as Birch Pretzel Logs in  Country WomanSeptember/October 1996, p32                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/birch-pretzel-logs-448316', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}