{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610430-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 610430, u'veryPopular': False, u'lowFodmap': False, u'title': u'Watermelon, Feta and Arugula Salad', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 100.62, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'5 ounces baby arugula (mixed greens may be substituted)', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [u'mixed', u'( greens may be substituted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11959, u'unit': u'ounces'}, {u'originalString': u'1/4 to 1/3 cup crumbled feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 tablespoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'4 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup pine nuts, toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'1 tablespoon red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tablespoon'}, {u'originalString': u'salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 to 3 cups seeded watermelon chunks', u'aisle': u'Produce', u'name': u'watermelon chunks', u'metaInformation': [u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9326, u'unit': u'cups'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.recipegirl.com/2014/09/01/watermelon-feta-and-arugula-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Prepare the vinaigrette:  In a small bowl, whisk together the lemon juice and vinegar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the olive oil slowly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add salt and pepper, to taste.2.  Assemble the salad:  In a large bowl, toss the arugula with the watermelon.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}, {u'equipment': [], u'step': u"Add the vinaigrette (as much as you'd like, to taste), and toss.  Sprinkle in the feta cheese and pine nuts and gently toss again.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 324, u'instructions': u"1.  Prepare the vinaigrette:  In a small bowl, whisk together the lemon juice and vinegar.  Whisk in the olive oil slowly.  Add salt and pepper, to taste.2.  Assemble the salad:  In a large bowl, toss the arugula with the watermelon. Add the vinaigrette (as much as you'd like, to taste), and toss.  Sprinkle in the feta cheese and pine nuts and gently toss again.  Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/watermelon-feta-and-arugula-salad-610430', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}