{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/739431-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 330, u'id': 739431, u'veryPopular': False, u'lowFodmap': False, u'title': u'Corn Ice Pops', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 52.86, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 cup agave', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'4 ears corn, kernels removed, cobs reserved', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'Pinch sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1/2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/katie-lee/corn-ice-pops.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Special equipment: ice-pop molds or small paper cups and ice-pop sticks', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, heat the milk, corn and corn cobs over medium heat until bubbly. Turn down the heat to low and simmer for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Let cool about 10 minutes; discard the cobs. Use a slotted spoon to remove about 1 cup of the kernels and reserve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, combine the remaining corn and milk mixture, the yogurt, agave, vanilla and salt and puree until smooth.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the reserved corn and pulse once on low.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Freeze in ice-pop molds or in small paper cups with ice-pop sticks.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 197, u'instructions': u'Special equipment: ice-pop molds or small paper cups and ice-pop sticks              In a medium saucepan, heat the milk, corn and corn cobs over medium heat until bubbly. Turn down the heat to low and simmer for 20 minutes. Let cool about 10 minutes; discard the cobs. Use a slotted spoon to remove about 1 cup of the kernels and reserve.                          In a blender, combine the remaining corn and milk mixture, the yogurt, agave, vanilla and salt and puree until smooth. Add the reserved corn and pulse once on low.                          Freeze in ice-pop molds or in small paper cups with ice-pop sticks.', u'spoonacularSourceUrl': u'https://spoonacular.com/corn-ice-pops-739431', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 345, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}