{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/445070-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 445070, u'veryPopular': False, u'lowFodmap': True, u'title': u'Lemony Green Beans', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 37.88, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1-1/2 pounds fresh green beans, trimmed', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'fresh', u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11052, u'unit': u'pounds'}, {u'originalString': u'Lemon wedges', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'3/4 teaspoon lemon-pepper seasoning', u'aisle': u'Spices and Seasonings', u'name': u'lemon-pepper seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1012030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/lemony-green-beans', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, heat chicken broth and oil over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Add green beans; cook and stir until crisp-tender. Sprinkle with lemon-pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [], u'step': u'Serve with lemon wedges.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}]}], u'name': u''}], u'aggregateLikes': 302, u'instructions': u'Directions                                                                                In a large skillet, heat chicken broth and oil over medium-high heat. Add green beans; cook and stir until crisp-tender. Sprinkle with lemon-pepper. Serve with lemon wedges.                                        Yield: 6 servings.                                                                                                                         Originally published as Lemony Green Beans in  Taste of HomeDecember/January 2013, p29                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/lemony-green-beans-445070', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}