{u'recipes': [{u'sourceName': u'Cup Cake Project', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621724-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 621724, u'veryPopular': False, u'lowFodmap': False, u'title': u'Copycat Pirouette Cookies (Nutella-filled Cigar Cookies)', u'diets': [], u'pricePerServing': 10.77, u'creditText': u'Cup Cake Project', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020129, u'unit': u'cup'}, {u'originalString': u'2 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/3 cup Nutella, for filling', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [u'for filling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19125, u'unit': u'cup'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 tablespoons unsalted butter, melted and cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.cupcakeproject.com/2014/12/copycat-pirouette-cookies-nutella-filled-cigar-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 F.In a small mixing bowl, mix egg white and sugar together with a fork until smooth and blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the melted butter, cake flour, and extracts and mix until all of the flour is incorporated.  The mixture will be smooth and shiny.Line a baking sheet with parchment paper.  Pencil no more than six 5" x 2" rectangles on the parchment.Flip the parchment paper upside-down so that the batter will not directly touch the pencil marks.Using about 2 teaspoons of batter per rectangle, spread batter to fill the rectangles on the parchment.  They should be thin enough to see through.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10020129, u'name': u'cake flour'}]}, {u'equipment': [], u'step': u'Bake just until the edges of the cookies start to brown (about 9 minutes).', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and very quickly (within 15 seconds) roll up one cookie to look like a cigar.  If you are super fast, you can pipe a line of Nutella before rolling (you may need to thin it a little with water to get it to go through the piping bag).  Dust cooled cookie with a little cocoa powder.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the rest of the tray in the oven for a minute so that the next cookie will be soft enough to roll.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chopsticks.jpg', u'id': 405596, u'name': u'chopsticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u"Remove, roll, dust, and repeat until the whole tray is done.Continue making cookie sheets of batter until you have used all of the batter.If you were unable to fill the cookies prior to rolling, cover a chopstick or wooden skewer with Nutella, slide it into cooled cookies, and wiggle it around to coat the inside edges of the cookie.Store uncovered and eat within two days.  They won't be bad after two days - they just won't be crispy.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Preheat oven to 350 F.In a small mixing bowl, mix egg white and sugar together with a fork until smooth and blended.Add the melted butter, cake flour, and extracts and mix until all of the flour is incorporated.  The mixture will be smooth and shiny.Line a baking sheet with parchment paper.  Pencil no more than six 5" x 2" rectangles on the parchment.Flip the parchment paper upside-down so that the batter will not directly touch the pencil marks.Using about 2 teaspoons of batter per rectangle, spread batter to fill the rectangles on the parchment.  They should be thin enough to see through.Bake just until the edges of the cookies start to brown (about 9 minutes). Remove from the oven and very quickly (within 15 seconds) roll up one cookie to look like a cigar.  If you are super fast, you can pipe a line of Nutella before rolling (you may need to thin it a little with water to get it to go through the piping bag).  Dust cooled cookie with a little cocoa powder.Place the rest of the tray in the oven for a minute so that the next cookie will be soft enough to roll. Remove, roll, dust, and repeat until the whole tray is done.Continue making cookie sheets of batter until you have used all of the batter.If you were unable to fill the cookies prior to rolling, cover a chopstick or wooden skewer with Nutella, slide it into cooled cookies, and wiggle it around to coat the inside edges of the cookie.Store uncovered and eat within two days.  They won\'t be bad after two days - they just won\'t be crispy.', u'spoonacularSourceUrl': u'https://spoonacular.com/copycat-pirouette-cookies-nutella-filled-cigar-cookies-621724', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}