{u'recipes': [{u'sourceName': u'Fountain Venue Kitchen', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/482550-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 482550, u'veryPopular': False, u'lowFodmap': True, u'title': u'Leftover Spaghetti Pizza', u'diets': [u'gluten free', u'fodmap friendly'], u'pricePerServing': 78.8, u'creditText': u'Fountain Venue Kitchen', u'extendedIngredients': [{u'originalString': u'3 tablespoons olive or avocado oil', u'aisle': u'Oil, Vinegar, Salad Dressing;Health Foods', u'name': u'avocado oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4581, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup freshly grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 lightly packed cups leftover spaghetti (see notes)', u'aisle': u'Sweet Snacks', u'name': u'pb cups', u'metaInformation': [u'leftover', u'packed', u'(see notes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 19150, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://fountainavenuekitchen.com/leftover-spaghetti-pizza/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat the eggs with the Parmesan cheese.  Toss with the leftover spaghetti, making sure the spaghetti is fully covered with the egg mixture.  (I do not add salt, as the Parmesan and sauce from the spaghetti provide ample flavor; you made add a sprinkle of salt and pepper if desired.)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a 9 or 10-inch skillet over medium heat.  The skillet should be hot enough that a piece of spaghetti dropped into the pan sizzles. If it sizzles, the oil is ready.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the spaghetti mixture into the pan and distribute it evenly, pressing down lightly. Cook approximately 7 minutes on the first side, or until golden brown and crispy around the edges.To flip the pasta, carefully slide it onto a dinner plate.  Cover with a second dinner plate and flip.  (I think this is easier and safer than flipping directly from the hot skillet.  I do this over the sink, taking care not to drip oil as there will be residual oil that has not been absorbed by the noodles.)  Slide the pasta back into the skillet, and cook the other side for 4 minutes or until golden brown.Slide the pasta onto a serving platter, cut into wedges, and serve warm with a little extra cheese and/or sauce, if desired.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Felsina Chianti Colli Senesi. It has 4.1 out of 5 stars and a bottle costs about 21 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'In a large bowl, beat the eggs with the Parmesan cheese.  Toss with the leftover spaghetti, making sure the spaghetti is fully covered with the egg mixture.  (I do not add salt, as the Parmesan and sauce from the spaghetti provide ample flavor; you made add a sprinkle of salt and pepper if desired.)Heat the olive oil in a 9 or 10-inch skillet over medium heat.  The skillet should be hot enough that a piece of spaghetti dropped into the pan sizzles. If it sizzles, the oil is ready.Pour the spaghetti mixture into the pan and distribute it evenly, pressing down lightly. Cook approximately 7 minutes on the first side, or until golden brown and crispy around the edges.To flip the pasta, carefully slide it onto a dinner plate.  Cover with a second dinner plate and flip.  (I think this is easier and safer than flipping directly from the hot skillet.  I do this over the sink, taking care not to drip oil as there will be residual oil that has not been absorbed by the noodles.)  Slide the pasta back into the skillet, and cook the other side for 4 minutes or until golden brown.Slide the pasta onto a serving platter, cut into wedges, and serve warm with a little extra cheese and/or sauce, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/leftover-spaghetti-pizza-482550', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}