{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/211534-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 211534, u'veryPopular': False, u'lowFodmap': False, u'title': u'Moroccan meatballs with eggs', u'diets': [u'dairy free'], u'preparationMinutes': 40, u'pricePerServing': 229.11, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g fresh breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'400g can chickpeas, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 16058, u'unit': u'g'}, {u'originalString': u'20g bunch coriander, mostly chopped', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 2012, u'unit': u'g'}, {u'originalString': u'1 courgette, thickly sliced', u'aisle': u'Produce', u'name': u'courgette', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}, {u'originalString': u'5 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 garlic cloves, sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'2 tsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tsp'}, {u'originalString': u'250g pack lean lamb mince', u'aisle': u'Meat', u'name': u'lamb mince', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 17224, u'unit': u'g'}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd-1 tsp ras el hanout spice mix', u'aisle': u'Spices and Seasonings', u'name': u'ras el hanout spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062027, u'unit': u'tsp'}, {u'originalString': u'2 x 400g cans chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/749722/moroccan-meatballs-with-eggs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Fry the onion in 1 tbsp oil until soft,then allow to cool.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Mix with thebreadcrumbs, mince, cinnamon, 1 egg,\xbd tsp salt and lots of pepper, then shapeinto about 24 meatballs with wet hands.Fry in the remaining oil in a shallow panfor about 8 mins, moving them round untilevenly browned. Lift out and set aside.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the garlic to the oil left in the panand fry until softened.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the courgette,fry for 1-2 mins, then tip in the tomatoes,honey, ras el hanout, three-quarters ofthe coriander, seasoning and a coupleof tbsp water. Stir and cook until pulpy.Stir in the chickpeas and add themeatballs. Make 4 hollows in the sauce,then break in the remaining eggs. Coverand cook for 4-8 mins over a low heat untilthe eggs are set. Scatter with corianderand serve straight from the pan withcrusty bread for scooping up the sauce.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1062027, u'name': u'ras el hanout'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 143, u'instructions': u'Fry the onion in 1 tbsp oil until soft,then allow to cool. Mix with thebreadcrumbs, mince, cinnamon, 1 egg,\xbd tsp salt and lots of pepper, then shapeinto about 24 meatballs with wet hands.Fry in the remaining oil in a shallow panfor about 8 mins, moving them round untilevenly browned. Lift out and set aside.Add the garlic to the oil left in the panand fry until softened. Add the courgette,fry for 1-2 mins, then tip in the tomatoes,honey, ras el hanout, three-quarters ofthe coriander, seasoning and a coupleof tbsp water. Stir and cook until pulpy.Stir in the chickpeas and add themeatballs. Make 4 hollows in the sauce,then break in the remaining eggs. Coverand cook for 4-8 mins over a low heat untilthe eggs are set. Scatter with corianderand serve straight from the pan withcrusty bread for scooping up the sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/moroccan-meatballs-with-eggs-211534', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}