{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/210482-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 210482, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chinese pork ribs', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 1998.32, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tsp Chinese five-spice powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'5 spice powder', u'metaInformation': [u'chinese'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chinese-five-spice-powder.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002002, u'unit': u'tsp'}, {u'originalString': u'1 tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'100ml hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'solid', u'id': 6175, u'unit': u'ml'}, {u'originalString': u'12 meaty pork ribs', u'aisle': u'Meat', u'name': u'pork ribs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 10204, u'unit': u''}, {u'originalString': u'2 tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp vinegar (you can use cider, malt or wine)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [u'canned', u'(you can use cider, malt or wine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tbsp'}], u'healthScore': 67.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bbcgoodfood.com/node/97669', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 64, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the ribs in a large pan and cover withwater. Bring to the boil and simmer for 15 mins.Meanwhile, pour the hoisin sauce in a jug and stirin the soy sauce, honey, vinegar and five-spice.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Drain the ribs very well, then brush with theglaze – if barbecuing, chill, cover and keep inthe fridge for later.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat the grill to high, if using. Grill or barbecuefor 15-20 mins, turning from time to time untilshiny and slightly charred in places.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 54, u'instructions': u'Put the ribs in a large pan and cover withwater. Bring to the boil and simmer for 15 mins.Meanwhile, pour the hoisin sauce in a jug and stirin the soy sauce, honey, vinegar and five-spice.Drain the ribs very well, then brush with theglaze – if barbecuing, chill, cover and keep inthe fridge for later.Heat the grill to high, if using. Grill or barbecuefor 15-20 mins, turning from time to time untilshiny and slightly charred in places. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/chinese-pork-ribs-210482', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}