{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/717962-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 717962, u'veryPopular': True, u'lowFodmap': False, u'title': u'Three Cheese Mushroom Flatbreads', u'diets': [], u'pricePerServing': 193.74, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon dried marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried marjoram', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2023, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon dried parsley flakes', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley flakes', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoon'}, {u'originalString': u'1 Flatout Light Original Flatbread', u'aisle': u'Bakery/Bread', u'name': u'flatbread', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10018413, u'unit': u''}, {u'originalString': u'\xbc teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'1 \xbd oz sliced mushrooms (I used Baby Bellas)', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced', u'(I used Baby Bellas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'\xbd oz Parmesan cheese, finely shredded', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'oz'}, {u'originalString': u'Freshly cracked black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'serving'}, {u'originalString': u'\xbd oz 2% shredded Mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'oz'}, {u'originalString': u'2 wedges of The Laughing Cow Creamy Swiss Garlic & Herb cheese, softened to room temperature', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'softened', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1040, u'unit': u''}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.emilybites.com/2016/02/three-cheese-mushroom-flatbreads.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pre-heat the oven to 350.Lightly mist a small skillet with cooking spray and bring to medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the mushrooms, parsley and marjoram and cook, stirring occasionally, for a few minutes until the mushrooms are browned and cooked.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'id': 2023, u'name': u'marjoram'}]}, {u'equipment': [], u'step': u'Add the garlic, stir together and cook for another 30 seconds to a minute until garlic is fragrant. Set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the flatbread directly onto the middle rack of the oven and bake for about 3  minutes until they stand firm when lifted.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 10018413, u'name': u'flatbread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and spread with the cheese wedges, leaving a bit of space around the edge for the crust. Sprinkle the mozzarella over the top and follow with the mushrooms. Sprinkle the parmesan over the mushrooms and follow with a bit of black pepper. Return the flatbread to the middle rack of the oven and bake for another 4-5 minutes until the cheeses are melted and the edges are browned. Slice and serve immediately.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 10018413, u'name': u'flatbread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 616, u'instructions': u'Pre-heat the oven to 350.Lightly mist a small skillet with cooking spray and bring to medium heat. Add the mushrooms, parsley and marjoram and cook, stirring occasionally, for a few minutes until the mushrooms are browned and cooked. Add the garlic, stir together and cook for another 30 seconds to a minute until garlic is fragrant. Set aside.Place the flatbread directly onto the middle rack of the oven and bake for about 3  minutes until they stand firm when lifted. Remove from the oven and spread with the cheese wedges, leaving a bit of space around the edge for the crust. Sprinkle the mozzarella over the top and follow with the mushrooms. Sprinkle the parmesan over the mushrooms and follow with a bit of black pepper. Return the flatbread to the middle rack of the oven and bake for another 4-5 minutes until the cheeses are melted and the edges are browned. Slice and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/three-cheese-mushroom-flatbreads-717962', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}