{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/627800-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 627800, u'veryPopular': True, u'lowFodmap': False, u'title': u'Oatmeal blackberry breakfast pie', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 112.57, u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'2 cups blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9042, u'unit': u'cups'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 teaspoons ground cinnamon, plus more for top', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [u'plus more for top'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1-2/3 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 cups old-fashioned rolled oats', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'1 prepared pie crust', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'2 tablespoons unsalted butter, melted and cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 scoop vanilla whey protein powder', u'aisle': u'Health Foods', u'name': u'whey protein powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 1001223, u'unit': u'scoop'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.sheknows.com/food-and-recipes/articles/1037377/oatmeal-blackberry-breakfast-pie-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F.2. Line a 9-inch pie pan with your prepared pie crust.3. Sprinkle half the berries onto the pie crust.4. In a large bowl, combine all the dry ingredients.5. In a small bowl whisk together the milk, vanilla, maple syrup, egg and butter.6.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the milk mixture with the dry ingredients and stir until combined.7.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour over the blackberries in the pie shell.8. Press the remaining berries into the oats.9.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [], u'step': u'Bake for 35 to 45 minutes, until the mixture is set and the edges are lightly browned.10.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and cool for 10 minutes.11. Slice up and serve with a sprinkle of fresh berries, or a dollop of whipped cream.More oatmeal recipes10 Oatmeal add-ins for breakfast', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Easy carrot cake oatmeal', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Make your oatmeal healthier', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1098, u'instructions': u'<p>1. Preheat the oven to 375 degrees F.</p><p>2. Line a 9-inch pie pan with your prepared pie crust.</p><p>3. Sprinkle half the berries onto the pie crust.</p><p>4. In a large bowl, combine all the dry ingredients.</p><p>5. In a small bowl whisk together the milk, vanilla, maple syrup, egg and butter.</p><p>6. Add the milk mixture with the dry ingredients and stir until combined.</p><p>7. Pour over the blackberries in the pie shell.</p><p>8. Press the remaining berries into the oats.</p><p>9. Bake for 35 to 45 minutes, until the mixture is set and the edges are lightly browned.</p><p>10. Remove from oven and cool for 10 minutes.</p><p>11. Slice up and serve with a sprinkle of fresh berries, or a dollop of whipped cream.</p><p>More oatmeal recipes</p><p>10 Oatmeal add-ins for breakfast</p><p>Easy carrot cake oatmeal</p><p>Make your oatmeal healthier</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/oatmeal-blackberry-breakfast-pie-627800', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}