{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/527881-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527881, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Bean Chili with Chocolate and Coconut', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 38.32, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1 pound dried black beans, rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'dried', u'black', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16015, u'unit': u'pound'}, {u'originalString': u'1-3 teaspoons minced canned chipotle chiles in adobo, to taste', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'canned chipotle chiles in adobo', u'metaInformation': [u'canned', u'minced', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup good-quality chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2009, u'unit': u'cup'}, {u'originalString': u'1/4 cup coconut flakes', u'aisle': u'Baking', u'name': u'coconut flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'toppings: chocolate chips and additional toasted coconut flakes', u'aisle': u'Baking', u'name': u'coconut flakes', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 12108, u'unit': u'servings'}, {u'originalString': u'1 tablespoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'6 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 (4 oz.) can diced green chiles', u'aisle': u'Produce', u'name': u'green chiles', u'metaInformation': [u'diced', u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'oz'}, {u'originalString': u'1 Tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'2 teaspoons dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'2 Tbsp. unsweetened cocoa powder (use dark chocolate cocoa for vegan version)', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'dark', u'unsweetened', u'for vegan version)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'Tbsp'}, {u'originalString': u'8 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 large white onion, chopped', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.gimmesomeoven.com/black-bean-chili-with-chocolate-and-coconut/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil in a large stockpot over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion and garlic and cook for 4-5 minutes, until translucent, stirring occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in chili powder and cumin cook for an additional 3 minutes until fragrant.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add in the water, black beans, green chiles, coconut flakes, unsweetened cocoa powder, and oregano. Bring to a boil. Then reduce heat to medium-low and cover, leaving the lid slightly ajar. Simmer for about 2 hours or until the beans are mostly tender.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'unsweetened cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'id': 12108, u'name': u'coconut flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Add in the chipotle peppers in adobo sauce by teaspoons until it reaches your desired taste. Season with salt and pepper, and add an additional 1/2 cup or more of water if needed. Then return to heat for a final 30 minutes or until the beans are fully-cooked. If you would like a smoother soup, feel free to use a potato masher or immersion blender to puree. Otherwise, serve as-is with toppings.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'canned chipotle chiles in adobo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili can be paired with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Bohigas Brut Reserva Cava. It has 4.3 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale yellow colour. Constant and small bubble. Foam of great persistence. Very fruity aromas, especially of white fruit (acid apple and pear) on shades of peel of citrics and white flowers. In the background, some spicy notes owed to ageing (cinnamon) and cookies. It is a well-structured "cava" in the mouth. Well picked up over its acidity that tenses it overall from beginning to end. The bubble lends a creamy feeling, and it gives volume and softness to the structure that returns acidity and widens the aromas of white fruits and spices that are repeated in the mouth. Its balanced end harmonizes its acidity, and leaves a memory of freshness and volume owing to its light sugar content View More', u'title': u'Bohigas Brut Reserva Cava', u'price': u'$16.99', u'id': 440298, u'link': u'https://www.wine.com/product/bohigas-brut-reserva-cava/131248', u'imageUrl': u'https://spoonacular.com/productImages/440298-312x231.jpg'}]}, u'aggregateLikes': 93, u'instructions': u'Heat oil in a large stockpot over medium-high heat. Add onion and garlic and cook for 4-5 minutes, until translucent, stirring occasionally. Add in chili powder and cumin cook for an additional 3 minutes until fragrant. Add in the water, black beans, green chiles, coconut flakes, unsweetened cocoa powder, and oregano. Bring to a boil. Then reduce heat to medium-low and cover, leaving the lid slightly ajar. Simmer for about 2 hours or until the beans are mostly tender.Add in the chipotle peppers in adobo sauce by teaspoons until it reaches your desired taste. Season with salt and pepper, and add an additional 1/2 cup or more of water if needed. Then return to heat for a final 30 minutes or until the beans are fully-cooked. If you would like a smoother soup, feel free to use a potato masher or immersion blender to puree. Otherwise, serve as-is with toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-chili-with-chocolate-and-coconut-527881', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}