{u'recipes': [{u'sourceName': u'Cheap Recipe Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483122-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 483122, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Hot Sauce', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 47.13, u'creditText': u'Cheap Recipe Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh lime juice (from 1/2 lime)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'(from 1/2 lime)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'1 pound mixed hot peppers', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'mixed', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10111333, u'unit': u'pound'}, {u'originalString': u'1 tablespoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'1 cup distilled white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white distilled vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.cheaprecipeblog.com/2012/08/homemade-hot-sauce-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Before you start: Be sure to wear gloves when handling hot peppers! You have been warned.Preheat oven to 450F. Rinse, dry, and place hot peppers on a large baking sheet.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for approximately 5 to 7 minutes, turning peppers once or twice to ensure even roasting. Once the skin on the peppers has begun to char and blacken, remove them from oven, place in a bowl and cover with plastic wrap.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [], u'step': u'Let the peppers sit for about 15 minutes. Wearing protective gloves, peel the skin off of the peppers and remove as many seeds as possible.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place peppers, vinegar, salt, lime juice, and honey in a food processor. Pulse until smooth. Store refrigerated for up to one month.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23, u'instructions': u'Before you start: Be sure to wear gloves when handling hot peppers! You have been warned.Preheat oven to 450F. Rinse, dry, and place hot peppers on a large baking sheet. Bake for approximately 5 to 7 minutes, turning peppers once or twice to ensure even roasting. Once the skin on the peppers has begun to char and blacken, remove them from oven, place in a bowl and cover with plastic wrap. Let the peppers sit for about 15 minutes. Wearing protective gloves, peel the skin off of the peppers and remove as many seeds as possible.Place peppers, vinegar, salt, lime juice, and honey in a food processor. Pulse until smooth. Store refrigerated for up to one month.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-hot-sauce-483122', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}