{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/216142-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 216142, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salmon with celeriac gratin & green beans', u'diets': [u'gluten free', u'dairy free', u'whole 30', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 590.38, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'800g celeriac, peeled- about 1.2kg whole', u'aisle': u'Produce', u'name': u'celeriac', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 11141, u'unit': u'g'}, {u'originalString': u'1 chicken stock cube', u'aisle': u'Canned and Jarred', u'name': u'chicken stock cube', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6080, u'unit': u''}, {u'originalString': u'1 tbsp fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tbsp'}, {u'originalString': u'10g garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u'g'}, {u'originalString': u'500g green beans', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11052, u'unit': u'g'}, {u'originalString': u'good grating of fresh nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'fresh', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'4 x 100g skinless salmon fillets', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 15076, u'unit': u'fillet'}, {u'originalString': u'1 tbsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tbsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/salmon-celeriac-gratin-green-beans', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Slice the celeriac as thinly as you can –quartering it first will help. Find a bakingdish that will hold all the celeriac, thenadd a layer before scattering with some garlic, thyme and seasoning. Repeatlayers, finishing on a celeriac layer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'id': 11141, u'name': u'celeriac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Mix the stock cube with 450ml boilingwater, season with nutmeg, then pourover the celeriac.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'id': 11141, u'name': u'celeriac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Bake for about1 hr 15 mins – pressing the celeriac intothe dish so that it stays submerged andsoaks up the stock – until a skewer pokedin goes in easily, and the top is crisp.When the gratin has 15 mins to go,sit the salmon on a baking parchment-linedbaking sheet.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'id': 11141, u'name': u'celeriac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Mix the mustardwith some ground black pepper anda little salt, and brush over the fillets.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake with the gratin for 12-15 minsuntil cooked just through.Meanwhile, cook the beans in boilingwater until tender, drain well and season.Divide into 4 equal portions along withthe gratin, and serve with the salmon.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Attems Ramato Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif. View More', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 188, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Slice the celeriac as thinly as you can –quartering it first will help. Find a bakingdish that will hold all the celeriac, thenadd a layer before scattering with some garlic, thyme and seasoning. Repeatlayers, finishing on a celeriac layer.Mix the stock cube with 450ml boilingwater, season with nutmeg, then pourover the celeriac. Bake for about1 hr 15 mins – pressing the celeriac intothe dish so that it stays submerged andsoaks up the stock – until a skewer pokedin goes in easily, and the top is crisp.When the gratin has 15 mins to go,sit the salmon on a baking parchment-linedbaking sheet. Mix the mustardwith some ground black pepper anda little salt, and brush over the fillets.Bake with the gratin for 12-15 minsuntil cooked just through.Meanwhile, cook the beans in boilingwater until tender, drain well and season.Divide into 4 equal portions along withthe gratin, and serve with the salmon.', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-with-celeriac-gratin-green-beans-216142', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}