{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/250264-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 250264, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hazelnut Sage Stuffing (Gluten-Free optional)', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 75.43, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 pound Cremini mushrooms, chopped', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 bulb fennel, chopped', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup chopped hazelnuts', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12120, u'unit': u'cup'}, {u'originalString': u"1 loaf Multigrain Bread (such as Rudi's Organic Multigrain Bread or Rudi's Gluten-Free Multigrain Bread)", u'aisle': u'Bakery/Bread', u'name': u'multigrain bread', u'metaInformation': [u'gluten-free', u'organic', u"(such as Rudi's Multigrain Bread or Rudi's Multigrain Bread)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18075, u'unit': u'loaf'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'4 tablespoons sage, minced', u'aisle': u'Produce', u'name': u'sage', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2038, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1-1/2 cup veggie stock (homemade is always better)', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [u'homemade', u'( is always better)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cup'}, {u'originalString': u'1 whole yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'whole', u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/hazelnut-sage-stuffing-gluten-free', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 250 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the loaf of bread into rough cubes, anywhere from 1/2 inch to 3/4\xbeinch pieces.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread the bread cubes over a cookie sheet and toast them in the oven for 10-15 minutes, or until they’re light brown and slightly crisp on the outside.Set the bread aside and turn the oven temperature up to 350 degrees.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a saut\xe9 pan over medium heat and cook the onion, fennel, and garlic until they’re slightly translucent, about 5-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the sage and mushrooms and cook everything down for 10 minutes, or until the veggies are ~50% of their original volume. Season everything with salt and pepper as you go along and taste, taste, taste.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the bread cubes in a large bowl and mix in the cooked veggie mixture. Make sure you mix everything well, no giant pockets of bread or veggies hanging out on their own.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the veggie stock and two eggs (unscrambled) over the bread mixture and stir everything one more time. You want it to be moist but not mushy, the egg should coat everything (it will help the stuffing set in the dish).', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Spread the stuffing into a 9 x 13 dish and sprinkle the hazelnuts over the entire casserole.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}]}, {u'equipment': [], u'step': u'Bake the stuffing for 15-20 minutes, or until the bread is nicely toasted on top and moist in the middle. The nuts on top will toast as the stuffing bakes and release their most Thanksgiving-y aroma into your house.Get a spoon, a turkey and a bib. It’s Thanksgiving.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 12, u'instructions': u'Preheat your oven to 250 degrees.Cut the loaf of bread into rough cubes, anywhere from 1/2 inch to 3/4\xbeinch pieces. Spread the bread cubes over a cookie sheet and toast them in the oven for 10-15 minutes, or until they’re light brown and slightly crisp on the outside.Set the bread aside and turn the oven temperature up to 350 degrees.Heat the oil in a saut\xe9 pan over medium heat and cook the onion, fennel, and garlic until they’re slightly translucent, about 5-7 minutes.Add the sage and mushrooms and cook everything down for 10 minutes, or until the veggies are ~50% of their original volume. Season everything with salt and pepper as you go along and taste, taste, taste.Put the bread cubes in a large bowl and mix in the cooked veggie mixture. Make sure you mix everything well, no giant pockets of bread or veggies hanging out on their own.Pour the veggie stock and two eggs (unscrambled) over the bread mixture and stir everything one more time. You want it to be moist but not mushy, the egg should coat everything (it will help the stuffing set in the dish).Spread the stuffing into a 9 x 13 dish and sprinkle the hazelnuts over the entire casserole.Bake the stuffing for 15-20 minutes, or until the bread is nicely toasted on top and moist in the middle. The nuts on top will toast as the stuffing bakes and release their most Thanksgiving-y aroma into your house.Get a spoon, a turkey and a bib. It’s Thanksgiving.', u'spoonacularSourceUrl': u'https://spoonacular.com/hazelnut-sage-stuffing-gluten-free-optional-250264', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}