{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/522845-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 522845, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bacon, Jalapeno, Red Onion and Cream Cheese Makes the Best Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 164.87, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'4 ozs cream cheese, cut into cubes and rolled into balls about 3/4" diameter', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cut into cubes and rolled into balls 3/4" diameter'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ozs'}, {u'originalString': u'1 large jalapeno pepper, membrane and seeds removed', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeds removed', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Garlic Olive Oil (or just schmush a garlic clove in some olive oil and let it sit for a bit; drain and use the oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for a bit; drain and use the oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'clove'}, {u'originalString': u'1/4 to 1/2 red onion, sliced thin', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'red', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Pizza dough for one crust', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [u'for one crust'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 93610, u'unit': u'servings'}, {u'originalString': u'2 cups Mexican blend cheese', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1251, u'unit': u'cups'}, {u'originalString': u'6 slices thick cut bacon, cooked til not quite crisp and drained', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick cut', u'crisp', u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.creative-culinary.com/bacon-jalapeno-red-onion-and-cream-cheese-makes-the-best-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 425 degrees.Work your pizza dough into a greased pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}, {u'equipment': [], u'step': u'Brush the surface of the pizza with the garlic olive oil.Scatter the shredded cheese all over.Scatter the red onion, jalapeno pepper and bacon on top of the cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 10 minutes and then remove from the oven.Dot the surface with the cream cheese balls and return the pizza to the oven.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Bake for an additional 10 minutes or until crust is lightly brown.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Selvapiana Chianti Rufina. It has 4.3 out of 5 stars and a bottle costs about 14 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses.', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 803, u'instructions': u'Preheat oven to 425 degrees.Work your pizza dough into a greased pan. Brush the surface of the pizza with the garlic olive oil.Scatter the shredded cheese all over.Scatter the red onion, jalapeno pepper and bacon on top of the cheese.Bake for 10 minutes and then remove from the oven.Dot the surface with the cream cheese balls and return the pizza to the oven.Bake for an additional 10 minutes or until crust is lightly brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-jalapeno-red-onion-and-cream-cheese-makes-the-best-pizza-522845', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}