{u'recipes': [{u'sourceName': u'Rachel Cooks', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/493566-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 493566, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Butter Popcorn', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 37.15, u'creditText': u'Rachel Cooks', u'extendedIngredients': [{u'originalString': u'1/4 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1 cup dry roasted peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'dry roasted peanuts', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16090, u'unit': u'cup'}, {u'originalString': u'3 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup popcorn kernels, popped, unpopped kernels removed', u'aisle': u'Savory Snacks', u'name': u'popcorn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 25002, u'unit': u'cup'}, {u'originalString': u'1/4 cup honey (I use raw, local honey)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw', u'(I use , local honey)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 1/2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.rachelcooks.com/2013/07/08/peanut-butter-popcorn/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large bowl, add popcorn and peanuts. Prepare a sheet pan with parchment paper or a silpat baking mat. Set aside. In a small saucepan, heat honey and sugar over medium heat. Bring to a simmer and simmer for about 2 minutes or until the sugar is dissolved.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from heat and immediately stir in vanilla and peanut butter until smooth and peanut butter is melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Pour over popcorn and stir until all popcorn is coated.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread onto prepared sheet pan and let set for 5-10 minutes before serving. Will remain slightly sticky and is best eaten the same day.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Piper-Heidsieck Brut Cuvee. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 40 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance.', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 183, u'instructions': u'In a large bowl, add popcorn and peanuts. Prepare a sheet pan with parchment paper or a silpat baking mat. Set aside. In a small saucepan, heat honey and sugar over medium heat. Bring to a simmer and simmer for about 2 minutes or until the sugar is dissolved. Remove from heat and immediately stir in vanilla and peanut butter until smooth and peanut butter is melted. Pour over popcorn and stir until all popcorn is coated. Spread onto prepared sheet pan and let set for 5-10 minutes before serving. Will remain slightly sticky and is best eaten the same day.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-popcorn-493566', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}