{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/704806-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 704806, u'veryPopular': False, u'lowFodmap': False, u'title': u'New Mexican Red Pork Chili', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 451.51, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 teaspoons packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'teaspoons'}, {u'originalString': u'1 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoons'}, {u'originalString': u'additional cilantro, green onions, sour cream, or any other desired toppings', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'sour', u'or any other desired toppings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'2 tablespoons minced fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon instant tapioca', u'aisle': u'Baking', u'name': u'instant tapioca', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93660, u'unit': u'tablespoon'}, {u'originalString': u'zest from \xbd lime, plus 1\xbd teaspoons lime juice', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'2 lbs boneless country-style pork ribs, trimmed', u'aisle': u'Meat', u'name': u'pork ribs', u'metaInformation': [u'boneless', u'country-style', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-ribs.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10204, u'unit': u'lbs'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.tasteandtellblog.com/new-mexican-red-pork-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spray the inside of a 3 to 7 quart slow cooker with cooking spray.In a small bowl, combine the tomato paste, chili powder, vegetable oil and garlic. Microwave until fragrant, 30 seconds to 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer the mixture to the bottom of the slow cooker.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Pour the chicken broth over the top.Sprinkle the ribs with salt and pepper. Nestle the ribs into the slow cooker in a single layer, if possible. Cover and cook on low for 5 to 6 hours or high for 3 to 4 hours, until the pork is tender.Use a large spoon or ladle to skim the surface of the chili and remove any excess fat. Use tongs to break up the ribs into 1-inch pieces. If needed, add hot chicken stock to adjust the consistency of the sauce. Stir in the cilantro, lime zest and lime juice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Serve the chili topped with additional cilantro, sliced green onions, sour cream, or any other desired chili toppings.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Segura Viudas Brut Reserva Heredad Cava with a 4.1 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Like a rich Chardonnay with bubbles, this limited production Cava rests on an authentic pewter base and comes in a handsome hand-blown bottle emblazoned with a metal crest of the Segura Viudas family. Perfect with pasta drizzled in truffle oil, slow braised meats, cured meat and cheese plates, oysters. View More', u'title': u'Segura Viudas Brut Reserva Heredad Cava', u'price': u'$21.99', u'id': 448175, u'link': u'https://www.wine.com/product/segura-viudas-brut-reserva-heredad-cava/4103', u'imageUrl': u'https://spoonacular.com/productImages/448175-312x231.jpg'}]}, u'aggregateLikes': 32, u'instructions': u'Spray the inside of a 3 to 7 quart slow cooker with cooking spray.In a small bowl, combine the tomato paste, chili powder, vegetable oil and garlic. Microwave until fragrant, 30 seconds to 1 minute. Transfer the mixture to the bottom of the slow cooker. Pour the chicken broth over the top.Sprinkle the ribs with salt and pepper. Nestle the ribs into the slow cooker in a single layer, if possible. Cover and cook on low for 5 to 6 hours or high for 3 to 4 hours, until the pork is tender.Use a large spoon or ladle to skim the surface of the chili and remove any excess fat. Use tongs to break up the ribs into 1-inch pieces. If needed, add hot chicken stock to adjust the consistency of the sauce. Stir in the cilantro, lime zest and lime juice.Serve the chili topped with additional cilantro, sliced green onions, sour cream, or any other desired chili toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/new-mexican-red-pork-chili-704806', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}