{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600852-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 600852, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ron’s Ultimate Spaghetti – why order spaghetti from a restaurant when it tastes like this at home', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 1134.72, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'4 chicken bouillon cubes or beef bouillon cubes', u'aisle': u'Canned and Jarred', u'name': u'beef bouillon cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 6076, u'unit': u''}, {u'originalString': u'3 (8 ounce) cans tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounce'}, {u'originalString': u'1 (14 1/2) ounce can stewed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u''}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tablespoon'}, {u'originalString': u'1 diced green bell pepper', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 pound ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1 tablespoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 tablespoon parsley flakes', u'aisle': u'Spices and Seasonings', u'name': u'parsley flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Accent seasoning (optional)', u'name': u'seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11420420, u'unit': u'pounds'}, {u'originalString': u'1 diced sweet onion', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 (14 1/2) ounce can water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 14.0, u'consistency': u'liquid', u'id': 14412, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.copykat.com/2009/05/20/rons-ultimate-spaghetti/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 126, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Saut\xe9 the ground beef, diced onions and diced bell pepper together until meat is browned.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [], u'step': u'Add all spices, tomato sauce, stewed tomatoes and water. Simmer for twenty minutes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add 1/4 cup grated parmesan cheese and stir.Boil four quarts of water.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add 1 \xbd  pound spaghetti to boiling water and stir until water returns to boil. Turn heat down and simmer 8 to 9 minutes to desired tenderness.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain and pour directly in to sauce or add sauce to individual serving.Because of the bullion cubes make sure you taste before adding salt. You may find some tomatoes and tomato sauce a little more sour than others. This of course depends on the brand being used. If this turns out to be the case, add a wee bit of sugar.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 84, u'instructions': u'Saut\xe9 the ground beef, diced onions and diced bell pepper together until meat is browned.Add all spices, tomato sauce, stewed tomatoes and water. Simmer for twenty minutes. Add 1/4 cup grated parmesan cheese and stir.Boil four quarts of water. Add 1 \xbd  pound spaghetti to boiling water and stir until water returns to boil. Turn heat down and simmer 8 to 9 minutes to desired tenderness. Drain and pour directly in to sauce or add sauce to individual serving.Because of the bullion cubes make sure you taste before adding salt. You may find some tomatoes and tomato sauce a little more sour than others. This of course depends on the brand being used. If this turns out to be the case, add a wee bit of sugar.', u'spoonacularSourceUrl': u'https://spoonacular.com/rons-ultimate-spaghetti-why-order-spaghetti-from-a-restaurant-when-it-tastes-like-this-at-home-600852', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}