{u'recipes': [{u'sourceName': u'Tori Avey', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/533525-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 533525, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peach Sangria', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 297.05, u'creditText': u'Tori Avey', u'extendedIngredients': [{u'originalString': u'1 liter ginger ale, chilled', u'aisle': u'Beverages', u'name': u'ginger ale', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'solid', u'id': 14136, u'unit': u'liter'}, {u'originalString': u'3/4 cup peach liqueur or peach schnapps', u'aisle': u'Alcoholic Beverages', u'name': u'peach schnapps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peach-schnapps.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 93736, u'unit': u'cup'}, {u'originalString': u'2 large fresh yellow peaches (about 1 pound total), sliced', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'yellow', u'large', u'sliced', u'( 1 pound total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 bottle white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'bottle'}, {u'originalString': u'Sangria pitcher, serving glasses', u'aisle': u'?', u'name': u'sangria pitcher', u'metaInformation': [], u'unitLong': u'glasse', u'unitShort': u'glasses', u'amount': 1.0, u'unit': u'glasses'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://toriavey.com/toris-kitchen/2012/08/peach-sangria/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the sliced peaches into the bottom of the sangria pitcher.In a small saucepan, bring 1/4 cup of sugar and 1/2 cup of water to a boil. Stir until the sugar dissolves completely.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from heat and let it cool. This is your simple syrup.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the simple syrup, peach liqueur and white wine over the peaches. Stir.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Place the pitcher in the refrigerator and let it sit for at least 2 hours, up to overnight.When ready to serve, top the pitcher off with chilled ginger ale and stir gently.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 14136, u'name': u'ginger ale'}]}, {u'equipment': [], u'step': u"Serve in wine glasses, allowing a piece of fruit or two into each glass.The ginger ale will lose its carbonation quickly in the pitcher, but will still add a great flavor. If you'd like a more sparkling sangria, top the glasses off rather than the pitcher. Fill each glass half full with sangria and top off with ginger ale. This will make the final beverage more carbonated and sparkling.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 14136, u'name': u'ginger ale'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 169, u'instructions': u"Place the sliced peaches into the bottom of the sangria pitcher.In a small saucepan, bring 1/4 cup of sugar and 1/2 cup of water to a boil. Stir until the sugar dissolves completely. Remove from heat and let it cool. This is your simple syrup.Pour the simple syrup, peach liqueur and white wine over the peaches. Stir.Place the pitcher in the refrigerator and let it sit for at least 2 hours, up to overnight.When ready to serve, top the pitcher off with chilled ginger ale and stir gently. Serve in wine glasses, allowing a piece of fruit or two into each glass.The ginger ale will lose its carbonation quickly in the pitcher, but will still add a great flavor. If you'd like a more sparkling sangria, top the glasses off rather than the pitcher. Fill each glass half full with sangria and top off with ginger ale. This will make the final beverage more carbonated and sparkling.", u'spoonacularSourceUrl': u'https://spoonacular.com/peach-sangria-533525', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}