{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220886-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 220886, u'veryPopular': False, u'lowFodmap': False, u'title': u'Boiled beef & carrots with parsley dumplings', u'diets': [u'dairy free'], u'pricePerServing': 469.19, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1-1\xbckg joint silverside beef Beef bee-f The classic cut of meat for a British Sunday roast, beef is full of flavour, as well as being a…', u'aisle': u'Meat', u'name': u'beef stew meat', u'metaInformation': [u'for a british sunday roast, beef is full of flavour, as well as being a…'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'servings'}, {u'originalString': u'4-5 cardamom pods', u'aisle': u'Spices and Seasonings', u'name': u'cardamom pods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1002006, u'unit': u''}, {u'originalString': u'2 carrot Carrot ka-rot The carrot, with its distinctive bright orange colour, is one of the most versatile root…', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'with its distinctive bright orange colour, is one of the most versatile root…'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'18 baby carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'\xbd small celeriac Celeriac sell-air-e-ak The unsung hero of the vegetable world, knobbly, odd-shaped celeriac has a subtle, celery-like…', u'aisle': u'Produce', u'name': u'celeriac', u'metaInformation': [u'small', u'odd-shaped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11141, u'unit': u''}, {u'originalString': u'1 tsp coriander seed Coriander seed kor-ee-and-er seed The small, creamy brown seeds of the coriander plant give dishes a warm, aromatic and slightly…', u'aisle': u'Spices and Seasonings', u'name': u'coriander seed', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2013, u'unit': u'tsp'}, {u'originalString': u'1 leek Leek lee-k Like garlic and onion, leeks are a member of the allium family, but have their own distinct…', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'12 baby leek Leek lee-k Like garlic and onion, leeks are a member of the allium family, but have their own distinct…', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u"2 tbsp olive oil Olive oil ol-iv oyl Probably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil cooking spray', u'metaInformation': [u'fresh', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cooking-spray.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1004679, u'unit': u'tbsp'}, {u'originalString': u'3 rounded tbsp finely chopped fresh parsley Parsley par-slee One of the most ubiquitous herbs in British cookery, parsley is also popular in European and…', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022030, u'unit': u'tsp'}, {u'originalString': u'1 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'250g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}, {u'originalString': u'4-5 star anise Star anise star an-eese Star anise is one of the central spices in Chinese cooking. It has a strong anise flavour, with…', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [u'chinese'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}, {u'originalString': u'4-5 star anise, peppercorns and thyme sprigs Star anise star an-eese Star anise is one of the central spices in Chinese cooking. It has a strong anise flavour, with…', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [u'chinese'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}, {u'originalString': u'2l good quality stock (chicken, beef or vegetable)', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [u'(chicken, beef or vegetable)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liters', u'unitShort': u'l', u'amount': 2.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'l'}, {u'originalString': u'125g shredded suet', u'aisle': u'Meat', u'name': u'suet', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-fat-or-lard.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 13335, u'unit': u'g'}, {u'originalString': u'few sprigs of fresh thyme and 2-3 bay leaves Thyme This popular herb grows in Europe, especially the Mediterranean, and is a member of the mint…', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'2-3 turnip Turnip tern-ip Turnips are creamy-white with a lovely purple, red or greenish upper part where the taproot has…', u'aisle': u'Produce', u'name': u'turnip', u'metaInformation': [u'with a lovely purple, red or greenish upper part where the taproot has…'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11564, u'unit': u''}, {u'originalString': u'12 baby turnip Turnip tern-ip Turnips are creamy-white with a lovely purple, red or greenish upper part where the taproot has…', u'aisle': u'Produce', u'name': u'turnip', u'metaInformation': [u'with a lovely purple, red or greenish upper part where the taproot has…'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11564, u'unit': u''}, {u'originalString': u'4-5 cloves Clove klo-ve The dry, unopened flower bud of the tropical myrtle tree family used to flavour a wide variety…', u'aisle': u'?', u'name': u'klo-ve the', u'metaInformation': [u'dry'], u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'unit': u'cloves'}], u'healthScore': 72.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2543/boiled-beef-and-carrots-with-parsley-dumplings', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut the beef into three or four chunky pieces, put in a large pan and just cover with cold water. Bring it quickly to the boil, then reduce to a simmer and, using a ladle, skim off any scum on the top. As you are doing this, you will also be removing some of the water.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Pour in the stock, return it to the boil, then turn to a simmer.Meanwhile, roughly chop the vegetables and add them to the pan with the sprigs of thyme and bay leaves. Season lightly.Take a large square of muslin (or use a clean J-cloth), lay the spices in the middle and then tie up with kitchen string, like a money bag. Drop the bag into the pan and tie the bag to the handle. Simmer the beef (dont let it boil) for about 2 hrs, until the meat feels tender when pierced with a sharp knife. If the stock reduces down too much, top it up with more water so the meat remains submerged.While the beef is cooking, peel celeriac and cut into small sticks about 1cm thick. Halve turnips. Trim tops off the other vegetables, but dont peel  theres no need. Bring a pan of lightly salted water to the boil and blanch vegetables for about 3 mins. Have ready a large bowl of ice-cold water and when the vegetables are just tender, drain them and tip immediately into the water. Leave for 2-3 mins, drain again and set aside. Also, while the beef is cooking, mix together the flour, suet, salt, a grinding of pepper and the parsley for the dumplings.When the beef is cooked, remove the pan from the heat, then strain off and reserve the stock for cooking the dumplings and reheating the baby vegetables (you wont use it all). Discard the vegetables and tip the beef into a baking dish. Cover loosely with foil to keep warm.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'id': 11141, u'name': u'celeriac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'id': 11564, u'name': u'turnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-fat-or-lard.jpg', u'id': 13335, u'name': u'suet'}]}, {u'equipment': [], u'step': u'Mix just enough cold water (about 200ml) into the flour and suet mix to make a soft dough. If the dough is too wet, it will be difficult to shape.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-fat-or-lard.jpg', u'id': 13335, u'name': u'suet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll gently into 10-12 balls. Bring a shallow pan of water to the boil and add a couple of ladles of the stock plus the olive oil, the star anise, peppercorns and thyme sprigs. Using a slotted spoon, lower in the dumplings. Cover and simmer for about 12-15 mins, until risen and fluffy.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the dumplings with a slotted spoon.Spoon about three ladles of stock into another pan, bring to a simmer and reheat the veg briefly.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Remove with a slotted spoon. Strain the stock from the veg for serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Cut each beef chunk into slices and season lightly. Arrange in warmed serving dishes with the baby vegetables, celeriac and dumplings.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celeriac.jpg', u'id': 11141, u'name': u'celeriac'}]}, {u'equipment': [], u'step': u'Pour some stock over and serve.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 19, u'instructions': u'Cut the beef into three or four chunky pieces, put in a large pan and just cover with cold water. Bring it quickly to the boil, then reduce to a simmer and, using a ladle, skim off any scum on the top. As you are doing this, you will also be removing some of the water. Pour in the stock, return it to the boil, then turn to a simmer.Meanwhile, roughly chop the vegetables and add them to the pan with the sprigs of thyme and bay leaves. Season lightly.Take a large square of muslin (or use a clean J-cloth), lay the spices in the middle and then tie up with kitchen string, like a money bag. Drop the bag into the pan and tie the bag to the handle. Simmer the beef (dont let it boil) for about 2 hrs, until the meat feels tender when pierced with a sharp knife. If the stock reduces down too much, top it up with more water so the meat remains submerged.While the beef is cooking, peel celeriac and cut into small sticks about 1cm thick. Halve turnips. Trim tops off the other vegetables, but dont peel  theres no need. Bring a pan of lightly salted water to the boil and blanch vegetables for about 3 mins. Have ready a large bowl of ice-cold water and when the vegetables are just tender, drain them and tip immediately into the water. Leave for 2-3 mins, drain again and set aside. Also, while the beef is cooking, mix together the flour, suet, salt, a grinding of pepper and the parsley for the dumplings.When the beef is cooked, remove the pan from the heat, then strain off and reserve the stock for cooking the dumplings and reheating the baby vegetables (you wont use it all). Discard the vegetables and tip the beef into a baking dish. Cover loosely with foil to keep warm.Mix just enough cold water (about 200ml) into the flour and suet mix to make a soft dough. If the dough is too wet, it will be difficult to shape. Roll gently into 10-12 balls. Bring a shallow pan of water to the boil and add a couple of ladles of the stock plus the olive oil, the star anise, peppercorns and thyme sprigs. Using a slotted spoon, lower in the dumplings. Cover and simmer for about 12-15 mins, until risen and fluffy. Remove the dumplings with a slotted spoon.Spoon about three ladles of stock into another pan, bring to a simmer and reheat the veg briefly. Remove with a slotted spoon. Strain the stock from the veg for serving.Cut each beef chunk into slices and season lightly. Arrange in warmed serving dishes with the baby vegetables, celeriac and dumplings. Pour some stock over and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/boiled-beef-carrots-with-parsley-dumplings-220886', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 165, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}