{u'recipes': [{u'sourceName': u'Stephs Bite by Bite', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/485808-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 22, u'id': 485808, u'veryPopular': False, u'lowFodmap': False, u'title': u'Funfetti Oreo Stuffed Cookies', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 39.18, u'creditText': u'Stephs Bite by Bite', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs, plus1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'7 tablespoons mulit-colored jimmies', u'aisle': u'Baking', u'name': u'jimmies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 93645, u'unit': u'tablespoons'}, {u'originalString': u'24 Oreo cookies [Birthday Cake flavor]', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1/2 cup plain greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/2 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon of vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.stephsbitebybite.com/2013/07/22/funfetti-oreo-stuffed-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. In the bowl of a stand mixer, cream the butter, yogurt, sugar, and powdered sugar together. Scrape down the sides, then beat in one egg at a time, mixing until incorporated. Beat in the vanilla for a minute. Turn off the mixer and add in the flour, baking powder, and salt, slowly turn the mixer back on and mix until flour is just combined in the batter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}], u'step': u'Add in the jimmies and beat for just another minute. Using an ice cream scoop, scoop out a tablespoon of dough. With your hand flatten it out a little and place an Oreo on top. Then scoop another tablespoon of dough and place it on top of the Oreo [you should have a sandwich now]. Then seal the edges of the dough around the Oreo and mold the dough around the Oreo.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on cookie sheet and continue with the rest of the dough.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake cookie for 18-22 minutes or until cookies are a light golden brown.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Let cool on baking sheet for a minute and then transfer to a cooling rack to cool --- or just EAT!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 317, u'instructions': u'Preheat oven to 350 degrees F. In the bowl of a stand mixer, cream the butter, yogurt, sugar, and powdered sugar together. Scrape down the sides, then beat in one egg at a time, mixing until incorporated. Beat in the vanilla for a minute. Turn off the mixer and add in the flour, baking powder, and salt, slowly turn the mixer back on and mix until flour is just combined in the batter. Add in the jimmies and beat for just another minute. Using an ice cream scoop, scoop out a tablespoon of dough. With your hand flatten it out a little and place an Oreo on top. Then scoop another tablespoon of dough and place it on top of the Oreo [you should have a sandwich now]. Then seal the edges of the dough around the Oreo and mold the dough around the Oreo. Place on cookie sheet and continue with the rest of the dough. Bake cookie for 18-22 minutes or until cookies are a light golden brown. Let cool on baking sheet for a minute and then transfer to a cooling rack to cool --- or just EAT!', u'spoonacularSourceUrl': u'https://spoonacular.com/funfetti-oreo-stuffed-cookies-485808', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}