{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201652-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201652, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tofu Skin Rolls', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 186.97, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 cups oil vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'cups'}, {u'originalString': u'1/4 cup low sodium canned or homemade chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'low sodium', u'homemade', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'3 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'Cilantro or green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon ground white pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'12 ounces ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10219, u'unit': u'ounces'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 teaspoons light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'4 ounces tofu skin', u'aisle': u'Ethnic Foods', u'name': u'tofu skin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beancurd-sheets.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 98891, u'unit': u'ounces'}, {u'originalString': u'3 dried shitakes, rehydrated and minced', u'aisle': u'?', u'name': u'shitakes', u'metaInformation': [u'dried', u'minced'], u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/11/tofu-skin-rolls-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Soak tofu skin in a large bowl of water until softened, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beancurd-sheets.jpg', u'id': 98891, u'name': u'bean curd sheets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Remove from water.  Line the sheets up on a cutting board and roll into a cylinder.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut crosswise into 1-inch segments, at least a foot in length.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a medium sized mixing bowl, combine pork, egg white, ginger, 1 teaspoon salt, white pepper, 1/4 teaspoon sugar, soy sauce, oyster sauce, 2 teaspoons cornstarch, and minced shiitake.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'id': 6176, u'name': u'oyster sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix with hands to combine.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Using about 2 tablespoons of meat filing per segment of tofu skin, roll up the filling in the tofu skin, forming fairly tight cylinders.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beancurd-sheets.jpg', u'id': 98891, u'name': u'bean curd sheets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine remaining teaspoon soy sauce and teaspoon cornstarch in a small bowl and stir with a fork until homogenous.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Add chicken stock and set aside.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [], u'step': u'4', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat oil in the wok to 350 F.  Fry the cylinders of tofu skin, a couple at a time, until the surface is light brown and somewhat puffed up.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beancurd-sheets.jpg', u'id': 98891, u'name': u'bean curd sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Remove with a slotted spoon and set aside.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Line up all the fried rolls in a shallow bowl that can fit into a metal or bamboo steamer.', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the sauce over the rolls, and steam over high heat for 15 minutes, flipping the rolls halfway through. Steam until the skin has absorbed at least half of the sauce.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, garnishing with cilantro or green onions, if desired.', u'number': 18, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 38, u'instructions': u'Procedures                                                                              1                                                                            Soak tofu skin in a large bowl of water until softened, about 30 minutes.  Remove from water.  Line the sheets up on a cutting board and roll into a cylinder.  Cut crosswise into 1-inch segments, at least a foot in length.                                                                                                                             2                                                                            In a medium sized mixing bowl, combine pork, egg white, ginger, 1 teaspoon salt, white pepper, 1/4 teaspoon sugar, soy sauce, oyster sauce, 2 teaspoons cornstarch, and minced shiitake. Mix with hands to combine.                                                                                                                            3                                                                            Using about 2 tablespoons of meat filing per segment of tofu skin, roll up the filling in the tofu skin, forming fairly tight cylinders. Combine remaining teaspoon soy sauce and teaspoon cornstarch in a small bowl and stir with a fork until homogenous. Add chicken stock and set aside.                                                                                                                            4                                                                            Heat oil in the wok to 350 F.  Fry the cylinders of tofu skin, a couple at a time, until the surface is light brown and somewhat puffed up.  Remove with a slotted spoon and set aside.                                                                                                                            5                                                                            Line up all the fried rolls in a shallow bowl that can fit into a metal or bamboo steamer.  Pour the sauce over the rolls, and steam over high heat for 15 minutes, flipping the rolls halfway through. Steam until the skin has absorbed at least half of the sauce. Serve immediately, garnishing with cilantro or green onions, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/tofu-skin-rolls-201652', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}