{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/246001-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 246001, u'veryPopular': True, u'lowFodmap': False, u'title': u'Turkey Stew with Peppers and Mushrooms', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 212.23, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'2-4 bell peppers of various colors, sliced thinly', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'Freshly ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 14-ounce can of plum tomatoes with juice', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'with juice', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon hot Hungarian paprika or few dashes cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon fresh rosemary, minced', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'2 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 Tbsp Hungarian sweet paprika', u'aisle': u'Spices and Seasonings', u'name': u'hungarian paprika', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'4 ounces mushrooms, sliced thinly', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'4 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 large onion, sliced, abut 2 cups', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3/4 cup plain (full fat is best, anything less will likely curdle*) yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain yogurt', u'metaInformation': [u'plain', u'(full fat is best, anything less will likely curdle*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 1/2 to 2 pounds skinless, boneless turkey thigh or breast, cut into large chunks', u'aisle': u'Meat', u'name': u'turkey thigh', u'metaInformation': [u'boneless', u'skinless', u'large', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 98913, u'unit': u'pounds'}, {u'originalString': u'1 Tbsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'Tbsp'}], u'healthScore': 72.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/turkey_stew_with_peppers_and_mushrooms/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons of the olive oil on high heat in a large saut\xe9 pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions and peppers and saut\xe9 them until they begin to soften and lightly brown.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the sweet paprika, the hot paprika, and the garlic and cook for 30 seconds more, until the garlic is fragrant.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1002028, u'name': u'sweet paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the peppers, onions, and garlic from the pan and set aside.2', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Heat the remaining 2 tablespoons of oil over high heat.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the mushrooms and the turkey to the pan. Sear the mushrooms and turkey over high heat, stirring often, for 3-4 minutes, until the turkey and mushrooms begin to brown. Reduce the heat to medium, return  the peppers-and-onion mixture to the pan and mix well.3  Squeeze the tomatoes to break them up, and add them with their juices to the pan, along with the Worcestershire sauce, lemon juice, rosemary and black pepper.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix well, reduce the heat to medium-low, cover the pan and simmer for 15-20 minutes.4  Stir the cornstarch into the yogurt and add to stew.  Cook over low heat (do not let simmer or boil), stirring occasionally, until sauce thickens a little.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}]}, {u'equipment': [], u'step': u'Serve with rice, polenta, or mashed potatoes.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are my top picks for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. One wine you could try is Noble Vines 337 Lodi Cabernet Sauvignon. It has 4.2 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'337 Cabernet Sauvignon exudes vibrant aromas of black cherry, ripe currant, fresh herbs and lightly roasted coffee. Smooth tannins and balanced acidity support core flavors of blackberry, black cherry and chocolate, intertwined with spicy black pepper accents on the finish. This wine can be enjoyed on its own or with herb-roasted pork loin, baked chicken or barbecued steak and sauteed mushrooms.', u'title': u'Noble Vines 337 Lodi Cabernet Sauvignon', u'price': u'$11.99', u'id': 438039, u'link': u'https://www.wine.com/product/noble-vines-337-lodi-cabernet-sauvignon-2014/165669', u'imageUrl': u'https://spoonacular.com/productImages/438039-312x231.jpg'}]}, u'aggregateLikes': 466, u'instructions': u'1  Heat 2 tablespoons of the olive oil on high heat in a large saut\xe9 pan.  Add the onions and peppers and saut\xe9 them until they begin to soften and lightly brown.  Add the sweet paprika, the hot paprika, and the garlic and cook for 30 seconds more, until the garlic is fragrant. Remove the peppers, onions, and garlic from the pan and set aside.2  Heat the remaining 2 tablespoons of oil over high heat.  Add the mushrooms and the turkey to the pan. Sear the mushrooms and turkey over high heat, stirring often, for 3-4 minutes, until the turkey and mushrooms begin to brown. Reduce the heat to medium, return  the peppers-and-onion mixture to the pan and mix well.3  Squeeze the tomatoes to break them up, and add them with their juices to the pan, along with the Worcestershire sauce, lemon juice, rosemary and black pepper. Mix well, reduce the heat to medium-low, cover the pan and simmer for 15-20 minutes.4  Stir the cornstarch into the yogurt and add to stew.  Cook over low heat (do not let simmer or boil), stirring occasionally, until sauce thickens a little.Serve with rice, polenta, or mashed potatoes.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-stew-with-peppers-and-mushrooms-246001', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}