{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/221593-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 150, u'id': 221593, u'veryPopular': False, u'lowFodmap': False, u'title': u'As-you-like-it Christmas cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 50, u'pricePerServing': 248.78, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g whole or flaked almonds, chopped hazelnuts, walnuts or brazil nuts (optional)', u'aisle': u'Nuts;Savory Snacks', u'name': u'brazil nuts', u'metaInformation': [u'whole', u'flaked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brazil-nuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93710, u'unit': u'g'}, {u'originalString': u'250g pack unsalted butter, softened, plus extra for the tin', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'softened', u'for the tin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1kg mixed dried fruits (any blend of raisins, sultanas, currants, mixed peel, dried cranberries, glac\xe9 cherries, chopped dried apricots, dates, dried figs or dried pineapple)', u'aisle': u'Produce', u'name': u'kiwi fruits', u'metaInformation': [u'mixed', u'dried', u'chopped', u'(any blend of raisins, sultanas, currants, peel, cranberries, glac\xe9 cherries, apricots, dates, figs or pineapple)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 9148, u'unit': u'kg'}, {u'originalString': u'zest and juice 2 oranges, 2 lemons or 4 clementines', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'250g light, soft brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'2 tsp mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'mixed spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022035, u'unit': u'tsp'}, {u'originalString': u'200g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'150ml sherry, brandy, rum or brewed tea, plus extra for feeding', u'aisle': u'Tea and Coffee', u'name': u'tea', u'metaInformation': [u'for feeding', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'solid', u'id': 14355, u'unit': u'ml'}, {u'originalString': u'2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/850633/asyoulikeit-christmas-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put your chosen dried fruit mixtureinto a large bowl with your choice ofalcohol or tea, citrus zest and juice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'tea'}]}, {u'equipment': [], u'step': u'Mix well, cover and leave overnight.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 160C/140C fan/gas 3.Butter and double-line a deep caketin – 20cm round or 18cm square –with enough baking parchment to comeabout 2.5cm above the top of the tin.Wrap the outside of the tin with a fewsheets of newspaper, securing withstaples or string.Beat the butter, sugar and vanilla untilcreamy, then beat in the eggs one byone. Tip in the flour, mixed spice, soakeddried fruit and any liquid from the bowl,plus your chosen nuts, if using. Stireverything together, then scrape intothe cake tin. Using the back of yourspoon, make a slight dent in the centreof the mixture, then bake for 1\xbd hrs.Reduce oven to 140C/120C fan/gas 1,loosely cover the top of the cakewith a double sheet of foil or bakingparchment, and bake for another45 mins-1 hr or until a skewer pokedright to the bottom comes out clean.Cool in the tin, then lift out and wrap ingreaseproof paper or baking parchment.Keep in a cake tin with a tight-fitting lid,or wrapped in a large sheet of foil, ina cool, dark place for up to 6 months.Open the cake every week or twoto feed by poking with a skewer inseveral places and dribbling over a littlemore of your chosen alcohol or tea.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 1022035, u'name': u'mixed spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'tea'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 296, u'instructions': u'Put your chosen dried fruit mixtureinto a large bowl with your choice ofalcohol or tea, citrus zest and juice.Mix well, cover and leave overnight.Heat oven to 160C/140C fan/gas 3.Butter and double-line a deep caketin – 20cm round or 18cm square –with enough baking parchment to comeabout 2.5cm above the top of the tin.Wrap the outside of the tin with a fewsheets of newspaper, securing withstaples or string.Beat the butter, sugar and vanilla untilcreamy, then beat in the eggs one byone. Tip in the flour, mixed spice, soakeddried fruit and any liquid from the bowl,plus your chosen nuts, if using. Stireverything together, then scrape intothe cake tin. Using the back of yourspoon, make a slight dent in the centreof the mixture, then bake for 1\xbd hrs.Reduce oven to 140C/120C fan/gas 1,loosely cover the top of the cakewith a double sheet of foil or bakingparchment, and bake for another45 mins-1 hr or until a skewer pokedright to the bottom comes out clean.Cool in the tin, then lift out and wrap ingreaseproof paper or baking parchment.Keep in a cake tin with a tight-fitting lid,or wrapped in a large sheet of foil, ina cool, dark place for up to 6 months.Open the cake every week or twoto feed by poking with a skewer inseveral places and dribbling over a littlemore of your chosen alcohol or tea.', u'spoonacularSourceUrl': u'https://spoonacular.com/as-you-like-it-christmas-cake-221593', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 200, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}