{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/709629-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 9, u'id': 709629, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Candy Cookies', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 36.3, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'1 cup Butterfinger bits', u'aisle': u'Meat', u'name': u'bacon bits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10862, u'unit': u'cup'}, {u'originalString': u'8 Tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'1 chocolate cake mix', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99040, u'unit': u''}, {u'originalString': u'4 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u"1 1/4 cup mini M&M's, divided", u'aisle': u'Sweet Snacks', u'name': u"m&m's", u'metaInformation': [u'mini', u'divided'], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19157, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://insidebrucrewlife.com/2016/01/chocolate-candy-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the dry cake mix, butter, and egg and mix until a soft dough forms.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Add the cream cheese and beat again until completely mixed in. Stir in the Butterfinger bits and 1 cup mini M&M's. Refrigerate for 30 minutes to an hour.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'id': 19157, u'name': u'mini m&ms'}]}, {u'equipment': [], u'step': u"Roll the dough into 24 equal balls. Press the remaining mini M&M's all around the dough balls.", u'number': 3, u'ingredients': [{u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'id': 19157, u'name': u'mini m&ms'}]}, {u'equipment': [], u'step': u'Bake at 350 degrees for 9-10 minutes.  Do not over bake.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Let cool on the cookie sheet for 2 minutes, then remove to a sheet of parchment on the counter.  Cool completely.  Store in a tightly sealed container.  Makes 24 cookies.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 172, u'instructions': u"Combine the dry cake mix, butter, and egg and mix until a soft dough forms. Add the cream cheese and beat again until completely mixed in. Stir in the Butterfinger bits and 1 cup mini M&M's. Refrigerate for 30 minutes to an hour.Roll the dough into 24 equal balls. Press the remaining mini M&M's all around the dough balls.Bake at 350 degrees for 9-10 minutes.  Do not over bake.  Let cool on the cookie sheet for 2 minutes, then remove to a sheet of parchment on the counter.  Cool completely.  Store in a tightly sealed container.  Makes 24 cookies.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-candy-cookies-709629', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 54, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}