{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/567779-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 567779, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pulled Pork Enchiladas', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 196.25, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'1 (15 ounce) can tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounce'}, {u'originalString': u'canola oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon cayenne pepper (if desired)', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'(if desired)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'10-12 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1 (4 ounce) can diced green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'diced', u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounce'}, {u'originalString': u'guacamole', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1009037, u'unit': u'servings'}, {u'originalString': u'kosher salt and fresh cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'fresh', u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 cup shredded Monterey jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1/2 cup minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'3 cups pork filling', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10010219, u'unit': u'cups'}, {u'originalString': u'3 cups Slow Cooker Pulled Pork', u'aisle': u'Meat', u'name': u'pulled pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10983, u'unit': u'cups'}, {u'originalString': u'1/2 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.lifesambrosia.com/2009/08/pulled-pork-enchiladas-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.    To prepare the enchilada sauce.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a small sauce pan. Cook onion until softened about 5 minutes. Sprinkle flour over the top, cook 1 minute. Stir in tomato sauce and remaining ingredients. Bring to a boil. Reduce heat and let simmer while you prepare the filling. Season to taste with salt and pepper.    For the filling, heat oil in a skillet over medium heat. Cook onion until softened, about 5 minutes. Stir in pulled pork and diced green chilies. Cook until warmed through. Turn heat to low while you prepare the tortillas.    Use enough canola oil to lightly coat the bottom of a small pan, about 2 tablespoons.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Heat over medium-high heat. Cook tortillas one at a time until soft, about 30 seconds on each side. As you cook each tortilla, place them on paper towels to absorb any of the oil left over.    Lay each tortilla on a flat surface. Spoon about 1/4 cup filling into center, sprinkle with shredded Monterey jack cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Roll closed. Repeat with remaining filling and tortillas.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread a thin layer of enchilada sauce on the bottom of a baking dish.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place rolled tortillas in the baking dish. Spoon remaining enchilada sauce over the top. Sprinkle with shredded Monterey jack and cheddar cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Bake 15-20 minutes or until cheese melts. Turn on broiler, broil for 3-5 minutes or until cheese browns.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool slightly and serve with guacamole and sour cream.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Enchilada works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The The Donum Estate Russian River Valley Pinot Noir with a 4.9 out of 5 star rating seems like a good match. It costs about 67 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'This Pinot Noir displays abundant and intense aromas of ripe black fruits, including cherry, plum and raspberry, in a complex and concentrated nose. Smooth and richly textured, the wine offers great depth of black cherry, berry and cola flavors with notes of mineral and spice on a bright and long-lasting finish.', u'title': u'The Donum Estate Russian River Valley Pinot Noir', u'price': u'$66.99', u'id': 433784, u'link': u'https://www.wine.com/product/the-donum-estate-russian-river-valley-pinot-noir-2009/121584', u'imageUrl': u'https://spoonacular.com/productImages/433784-312x231.jpg'}]}, u'aggregateLikes': 123, u'instructions': u'Preheat oven to 350 degrees.    To prepare the enchilada sauce. Heat oil in a small sauce pan. Cook onion until softened about 5 minutes. Sprinkle flour over the top, cook 1 minute. Stir in tomato sauce and remaining ingredients. Bring to a boil. Reduce heat and let simmer while you prepare the filling. Season to taste with salt and pepper.    For the filling, heat oil in a skillet over medium heat. Cook onion until softened, about 5 minutes. Stir in pulled pork and diced green chilies. Cook until warmed through. Turn heat to low while you prepare the tortillas.    Use enough canola oil to lightly coat the bottom of a small pan, about 2 tablespoons. Heat over medium-high heat. Cook tortillas one at a time until soft, about 30 seconds on each side. As you cook each tortilla, place them on paper towels to absorb any of the oil left over.    Lay each tortilla on a flat surface. Spoon about 1/4 cup filling into center, sprinkle with shredded Monterey jack cheese. Roll closed. Repeat with remaining filling and tortillas.    Spread a thin layer of enchilada sauce on the bottom of a baking dish. Place rolled tortillas in the baking dish. Spoon remaining enchilada sauce over the top. Sprinkle with shredded Monterey jack and cheddar cheese. Bake 15-20 minutes or until cheese melts. Turn on broiler, broil for 3-5 minutes or until cheese browns. Remove from oven. Let cool slightly and serve with guacamole and sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/pulled-pork-enchiladas-567779', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}