{u'recipes': [{u'sourceName': u'Kitchen Confidante', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497003-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497003, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pancit Bihon', u'diets': [u'dairy free'], u'pricePerServing': 170.56, u'creditText': u'Kitchen Confidante', u'extendedIngredients': [{u'originalString': u'1-2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 carrot, julienne', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 stalks of celery, sliced on bias', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 Chinese/Napa cabbage, sliced', u'aisle': u'Produce', u'name': u'chinese cabbage', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/napa-cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11970, u'unit': u''}, {u'originalString': u'3 cloves garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 lb ground chicken (or thinly sliced chicken breast)', u'aisle': u'Meat', u'name': u'ground chicken', u'metaInformation': [u'thinly sliced', u'(or chicken breast)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 5332, u'unit': u'lb'}, {u'originalString': u'Ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 lb ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10219, u'unit': u'lb'}, {u'originalString': u'4 cups low sodium chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1006970, u'unit': u'cups'}, {u'originalString': u'8 oz (227 grams) bihon noodles (Philippine rice noodles)', u'aisle': u'Pasta and Rice', u'name': u'noodles', u'metaInformation': [u'(Philippine rice noodles)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 227.0, u'consistency': u'solid', u'id': 20420, u'unit': u'grams'}, {u'originalString': u'1 medium onion, finely diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1-2 Tbsp patis (fish sauce)', u'aisle': u'Ethnic Foods', u'name': u'patis', u'metaInformation': [u'(fish sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://kitchenconfidante.com/pancit-bihon-filipino-rice-noodles', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'In a large wok, heat oil over medium-low heat. Saut\xe9 the onion and garlic. When the onion is transparent, increase the heat to medium-high and add the ground pork and chicken. Season with soy sauce, pepper and patis.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 10219, u'name': u'ground pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let cook for about 20 minutes on medium-low heat (cooking this for a long time is what takes out the “malansa” or slimey chicken flavor). Stir occasionally.Meanwhile, bring the chicken stock to a boil in a large pot.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add noodles upon boiling, cook for about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Drain and set aside both stock and noodles.When the pork and chicken is ready, add vegetables. If using Chinese sausage, add that as well. \xa0', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}, {u'equipment': [], u'step': u'Add a little extra oil or broth to avoid sticking. When the vegetables are crisp yet tender, add all the noodles and the stock one cup at a time, taking care to not let the noodles get too soggy. Stir well until well incorporated.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add shrimp, allow to cook, about five minutes.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with cilantro and serve with a squeeze of lemon.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 370, u'instructions': u'In a large wok, heat oil over medium-low heat. Saut\xe9 the onion and garlic. When the onion is transparent, increase the heat to medium-high and add the ground pork and chicken. Season with soy sauce, pepper and patis. Let cook for about 20 minutes on medium-low heat (cooking this for a long time is what takes out the “malansa” or slimey chicken flavor). Stir occasionally.Meanwhile, bring the chicken stock to a boil in a large pot. Add noodles upon boiling, cook for about 3 minutes. Drain and set aside both stock and noodles.When the pork and chicken is ready, add vegetables. If using Chinese sausage, add that as well. \xa0Add a little extra oil or broth to avoid sticking. When the vegetables are crisp yet tender, add all the noodles and the stock one cup at a time, taking care to not let the noodles get too soggy. Stir well until well incorporated. Add shrimp, allow to cook, about five minutes.Garnish with cilantro and serve with a squeeze of lemon.', u'spoonacularSourceUrl': u'https://spoonacular.com/pancit-bihon-497003', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}