{u'recipes': [{u'sourceName': u'Healthy Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628295-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 628295, u'veryPopular': False, u'lowFodmap': True, u'title': u'Gluten Free Crackers', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 84.42, u'creditText': u'Healthy Recipes', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 cups Honeyville Blanched Almond Flour, Super Fine Grind', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'blanched almond flour', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93740, u'unit': u'cups'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://healthyrecipesblogs.com/2015/02/02/gluten-free-crackers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Line a cookie sheet with parchment.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the almond flour, egg, salt and pepper in food processor. Process for a few seconds, until crumbly dough forms.Use your hands to transfer the dough to the parchment-lined cookie sheet. Press it into a disc. Cover with another sheet of parchment, and roll out very thin, to 1/16 inch thick.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}], u'step': u'Remove the top parchment, and cut the dough into 1-inch squares using a pizza cutter. Gently separate the squares so that they dont touch.Gather the scraps and re-roll between 2 more sheets of parchment.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Cut into more crackers and add them to the cookie sheet. If the dough becomes very soft and difficult to work with, place it in the freezer for a couple of minutes to firm up.Sprinkle the crackers with the sesame seeds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [], u'step': u'Place a sheet of parchment one more time over the crackers and gently roll to help the sesame seeds adhere.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake 15 minutes, or until golden-brown and crisp. If youre like me and didnt manage to roll your dough out evenly, youll need to remove the thinner crackers first, then place the rest back in the oven to bake some more.Cool 10 minutes on a wire rack before enjoying. Store leftovers in an airtight container in the fridge and place them in a 350-oven for 5 minutes to re-crisp before serving - they lose their crispness when stored, but reheat briefly and theyre as good as on the first day.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 26, u'instructions': u'Preheat oven to 350 degrees F. Line a cookie sheet with parchment.Place the almond flour, egg, salt and pepper in food processor. Process for a few seconds, until crumbly dough forms.Use your hands to transfer the dough to the parchment-lined cookie sheet. Press it into a disc. Cover with another sheet of parchment, and roll out very thin, to 1/16 inch thick. Remove the top parchment, and cut the dough into 1-inch squares using a pizza cutter. Gently separate the squares so that they dont touch.Gather the scraps and re-roll between 2 more sheets of parchment. Cut into more crackers and add them to the cookie sheet. If the dough becomes very soft and difficult to work with, place it in the freezer for a couple of minutes to firm up.Sprinkle the crackers with the sesame seeds. Place a sheet of parchment one more time over the crackers and gently roll to help the sesame seeds adhere.Bake 15 minutes, or until golden-brown and crisp. If youre like me and didnt manage to roll your dough out evenly, youll need to remove the thinner crackers first, then place the rest back in the oven to bake some more.Cool 10 minutes on a wire rack before enjoying. Store leftovers in an airtight container in the fridge and place them in a 350-oven for 5 minutes to re-crisp before serving - they lose their crispness when stored, but reheat briefly and theyre as good as on the first day.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-crackers-628295', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}