{u'recipes': [{u'sourceName': u'Bakers Royale', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604331-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 604331, u'veryPopular': False, u'lowFodmap': False, u'title': u'4th of July Fruit Salad Cones', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'pricePerServing': 37.61, u'creditText': u'Bakers Royale', u'extendedIngredients': [{u'originalString': u'1 large apple', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'3 oz. blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 9050, u'unit': u'oz'}, {u'originalString': u'6 jumbo ice cream cones', u'aisle': u'Frozen', u'name': u'ice cream cones', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cream-cone.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18271, u'unit': u''}, {u'originalString': u'6-8 strawberries, halved', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.bakersroyale.com/fruit/4th-of-july-fruit-salad-cones/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Line ice cream cone with a cupcake liner. Slice apple into 1/8inch slices; and using a small meat star cookie cutter, stamp out stars from apple slices. Fill cone with blueberries, strawberries and apple stars.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cream-cone.jpg', u'id': 18271, u'name': u'ice cream cone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Sauvignon Blanc, and Gruener Veltliner are great choices for Fruit Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try Chehalem INOX Chardonnay. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 172, u'instructions': u'Line ice cream cone with a cupcake liner. Slice apple into 1/8inch slices; and using a small meat star cookie cutter, stamp out stars from apple slices. Fill cone with blueberries, strawberries and apple stars.', u'spoonacularSourceUrl': u'https://spoonacular.com/4th-of-july-fruit-salad-cones-604331', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}