{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [u'asian', u'korean'], u'image': u'https://spoonacular.com/recipeImages/536331-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 536331, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Tofu Bibimbap', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 545.6, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'Bird chilis (opt.)', u'aisle': u'Produce;Ethnic Foods', u'name': u"bird's eye chilis", u'metaInformation': [u'(opt.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11670, u'unit': u'servings'}, {u'originalString': u'1 large carrot, shredded', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'shredded', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/2 cucumber, sliced thin', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 oz. enoki mushrooms (opt.)', u'aisle': u'Produce', u'name': u'enoki mushrooms', u'metaInformation': [u'(opt.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/enoki-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11950, u'unit': u'oz'}, {u'originalString': u'1 clove minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'4 tablespoons Gochujang', u'aisle': u'Ethnic Foods', u'name': u'gochujang', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1016973, u'unit': u'tablespoons'}, {u'originalString': u'1 red pepper, sliced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'2 teaspoons rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoons'}, {u'originalString': u'8 oz. Shiitake mushrooms, sliced', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11238, u'unit': u'oz'}, {u'originalString': u'Short grain white rice', u'aisle': u'Pasta and Rice', u'name': u'short grain rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10120052, u'unit': u'servings'}, {u'originalString': u'Soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'servings'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'16 ounces tofu, pressed', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16162, u'unit': u'ounces'}, {u'originalString': u'Vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.macheesmo.com/2014/01/baked-tofu-bibimbap/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Let the tofu press for at least 20 minutes.3)', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add a drizzle of vegetable oil to a baking dish and add pressed tofu. Top each piece of tofu with a small drizzle of the bibimbap sauce.4)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake tofu for 60 minutes, turning once halfway through.5) Meanwhile, cook rice according to instructions. I like to use a short grain white rice, but any rice will work.6) When you are about ready to serve, saute grated carrots and peppers with a drizzle of oil in a large skillet. Just cook until the veggies start to soften, but still have a tiny crunch, maybe a minute or two.7)', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add another drizzle of oil to the pan and toss in the sliced shiitake mushrooms and cook over high heat for 3-4 minutes. You can toss in some bird chilis as well if you want to add some additional heat to the dish. Don't eat the bird chilis though. They will be too hot!8) Finally, you can wipe out the skillets, add a fresh drizzle of oil, and crack in a few eggs. Cook the eggs for 60 seconds until the whites are just set. Then you can either flip the eggs or cover the skillet and let the eggs steam for 30 seconds. Try not to overcook the yolk though.Make the bowls by scooping a big spoon of rice into each bowl and stirring in some of the sauce. Top with carrots, peppers, mushrooms, sliced fresh cucumber, sliced tofu, the egg, and extra sauce on the side.", u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'id': 11238, u'name': u'shiitake mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bibimbap on the menu? Try pairing with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try L'Ecole 41 Chenin Blanc. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 112, u'instructions': u"Directions1) For sauce, mince garlic very fine and stir together with other ingredients. You can make the sauce well in advance and store it in the fridge if you want.2) For tofu, preheat oven to 350 degrees F. Lay out a few paper towels on a flat surface and place tofu on paper towels. Cover tofu with paper towels and add some weight to the tofu to press out the liquid. Let the tofu press for at least 20 minutes.3) Add a drizzle of vegetable oil to a baking dish and add pressed tofu. Top each piece of tofu with a small drizzle of the bibimbap sauce.4) Bake tofu for 60 minutes, turning once halfway through.5) Meanwhile, cook rice according to instructions. I like to use a short grain white rice, but any rice will work.6) When you are about ready to serve, saute grated carrots and peppers with a drizzle of oil in a large skillet. Just cook until the veggies start to soften, but still have a tiny crunch, maybe a minute or two.7) Add another drizzle of oil to the pan and toss in the sliced shiitake mushrooms and cook over high heat for 3-4 minutes. You can toss in some bird chilis as well if you want to add some additional heat to the dish. Don't eat the bird chilis though. They will be too hot!8) Finally, you can wipe out the skillets, add a fresh drizzle of oil, and crack in a few eggs. Cook the eggs for 60 seconds until the whites are just set. Then you can either flip the eggs or cover the skillet and let the eggs steam for 30 seconds. Try not to overcook the yolk though.Make the bowls by scooping a big spoon of rice into each bowl and stirring in some of the sauce. Top with carrots, peppers, mushrooms, sliced fresh cucumber, sliced tofu, the egg, and extra sauce on the side.", u'spoonacularSourceUrl': u'https://spoonacular.com/baked-tofu-bibimbap-536331', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}