{u'recipes': [{u'sourceName': u'Fed and Fit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/584019-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 584019, u'veryPopular': True, u'lowFodmap': False, u'title': u'Paleo Meatloaf', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 292.18, u'creditText': u'Fed and Fit', u'extendedIngredients': [{u'originalString': u'2 lb Lean Ground Beef (I used 90% lean)', u'aisle': u'Meat', u'name': u'90% lean ground beef', u'metaInformation': [u'90%', u'lean', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23562, u'unit': u'lb'}, {u'originalString': u'\xbd cup Almond Meal', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93740, u'unit': u'cup'}, {u'originalString': u'2 Tbsp Balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'Tbsp'}, {u'originalString': u'\xbd tsp Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 can 15 oz Tomato Sauce (I prefer organic)', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'organic', u'(I prefer )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11549, u'unit': u'can'}, {u'originalString': u'1 cup Shredded Carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 Tbsp Grainy/Spicy Mustard', u'aisle': u'Condiments', u'name': u'grainy mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'Tbsp'}, {u'originalString': u'\xbd cup Chopped Green Bell Pepper', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'1 lb Lean Ground Pork (I used 80% lean)', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [u'80%', u'lean', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10219, u'unit': u'lb'}, {u'originalString': u'1 tsp Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 cup Chopped Fresh Tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'1 can 6 oz Tomato Paste (again, I prefer organic)', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'organic', u'(again, I prefer )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'can'}, {u'originalString': u'1 cup Chopped Yellow Onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://fedandfit.com/2013/02/07/paleo-meatloaf/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix all the loaf ingredients together. I recommend you use your hands to smash and combine – you can feel when the texture is even.In an oven safe pan (I like to use my non-stick turkey roasting pan), form your loaf.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake at 375 F for 45 minutes.In a separate bowl, whisk all ingredients for your sauce together.At the end of the 45 minutes, pull loaf from oven and turn heat up to 450 F.Frost the loaf with the sauce. Like a cake, place all the sauce on top of the loaf and carefully spread down until it evenly covers all sides.When the oven is at 450 F, put the coated loaf back in the oven and bake for an additional 15 minutes.If the tomato sauce still looks watery, leave in the oven for 5 minutes at a time until it has a texture you’re happy with.', u'length': {u'number': 110, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Let cool slightly, then serve![Note: this meatloaf makes for amazing leftovers. Just cover with plastic wrap and reheat slices when you want. It will keep for 4-5 days in the fridge.]', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon and Zinfandel are great choices for Meatloaf. Meatloaf will work with many red wines. We recommend something bold and fruity, like a Cabernet Sauvignon or Zinfandel. The Ghost Block Oakville Estate Cabernet Sauvignon with a 4.6 out of 5 star rating seems like a good match. It costs about 60 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'zinfandel'], u'productMatches': [{u'description': u'Finesse oriented with an elegant balance and structure, supported by bright aromas of roses, tobacco and spice. The attack is full on the palate with blackberries, cherries, cocoa, and cinnamon. The ripe mid palate ties together a long finish of cherries, caramel, spice, cassis and coffee. View More', u'title': u'Ghost Block Oakville Estate Cabernet Sauvignon', u'price': u'$59.99', u'id': 447663, u'link': u'https://www.wine.com/product/ghost-block-oakville-estate-cabernet-sauvignon-2010/124053', u'imageUrl': u'https://spoonacular.com/productImages/447663-312x231.jpg'}]}, u'aggregateLikes': 5680, u'instructions': u'Preheat oven to 375 F.Mix all the loaf ingredients together. I recommend you use your hands to smash and combine – you can feel when the texture is even.In an oven safe pan (I like to use my non-stick turkey roasting pan), form your loaf.Bake at 375 F for 45 minutes.In a separate bowl, whisk all ingredients for your sauce together.At the end of the 45 minutes, pull loaf from oven and turn heat up to 450 F.Frost the loaf with the sauce. Like a cake, place all the sauce on top of the loaf and carefully spread down until it evenly covers all sides.When the oven is at 450 F, put the coated loaf back in the oven and bake for an additional 15 minutes.If the tomato sauce still looks watery, leave in the oven for 5 minutes at a time until it has a texture you’re happy with.Let cool slightly, then serve![Note: this meatloaf makes for amazing leftovers. Just cover with plastic wrap and reheat slices when you want. It will keep for 4-5 days in the fridge.]', u'spoonacularSourceUrl': u'https://spoonacular.com/paleo-meatloaf-584019', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}