{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213677-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 85, u'id': 213677, u'veryPopular': False, u'lowFodmap': True, u'title': u'All-in-one spring roast chicken', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 139.44, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'150g pack baby carrots, scrubbed or peeled', u'aisle': u'Produce', u'name': u'baby carrots', u'metaInformation': [u'peeled', u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 11960, u'unit': u'g'}, {u'originalString': u'50g/ 2oz butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'oz'}, {u'originalString': u'1 free-range chicken, about 1.6kg 3lb 8oz', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'free range egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'good handful roughly-chopped mixed herbs (mint, tarragon, parsley, chervil and chives are all nice)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'herbs', u'metaInformation': [u'mixed', u'good', u'(mint, tarragon, parsley, chervil and chives are all nice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 1002044, u'unit': u'handful'}, {u'originalString': u'500g bag new potatoes', u'aisle': u'Produce', u'name': u'new potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11352, u'unit': u'g'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'140g/ 5oz podded broad bean, podded again if you like', u'aisle': u'Produce', u'name': u'yam bean', u'metaInformation': [u'podded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jicama.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11603, u'unit': u'oz'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2037637/allinone-spring-roast-chicken', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Sit the chicken in a good-sized roastingdish or tin. Push your fingers betweenthe breast and skin to separate, push insome of the softened butter and gentlyspread over the breasts without tearingthe skin. Rub the rest of the butter allover the outside of the chicken. Seasonwell and roast for 30 mins.Toss the new potatoes with the oliveoil and plenty of seasoning. When thechicken comes out, scatter the spudsaround it and toss with the juices inthe dish, too. Put back in the oven foranother 30 mins.Stir the carrots into the potatoesand put back into the oven foranother 20 mins.Check the chicken is cooked bypiercing the thigh and making sure thejuices run clear. Stir the broad beansand peas into the other veg with asplash of water and put back in theoven for 5 mins.', u'length': {u'number': 85, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'id': 11352, u'name': u'new potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven,cover loosely with foil and rest for10 mins. Scatter over and stir in theherbs before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Roasted Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 64, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Sit the chicken in a good-sized roastingdish or tin. Push your fingers betweenthe breast and skin to separate, push insome of the softened butter and gentlyspread over the breasts without tearingthe skin. Rub the rest of the butter allover the outside of the chicken. Seasonwell and roast for 30 mins.Toss the new potatoes with the oliveoil and plenty of seasoning. When thechicken comes out, scatter the spudsaround it and toss with the juices inthe dish, too. Put back in the oven foranother 30 mins.Stir the carrots into the potatoesand put back into the oven foranother 20 mins.Check the chicken is cooked bypiercing the thigh and making sure thejuices run clear. Stir the broad beansand peas into the other veg with asplash of water and put back in theoven for 5 mins. Remove from the oven,cover loosely with foil and rest for10 mins. Scatter over and stir in theherbs before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/all-in-one-spring-roast-chicken-213677', u'dishTypes': [], u'occasions': [u'spring', u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}