{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/465652-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 465652, u'veryPopular': True, u'lowFodmap': True, u'title': u'Cranberry Slush Punch', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 50.73, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (12 ounces) frozen cranberry-apple juice concentrate', u'aisle': u'Frozen', u'name': u'cranberry juice concentrate', u'metaInformation': [u'frozen', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 14430, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'12 cups lemon-lime soda, chilled', u'aisle': u'Beverages', u'name': u'lemon lime soda', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'solid', u'id': 14144, u'unit': u'cups'}, {u'originalString': u'2 cans (12 ounces each) lemonade concentrate', u'aisle': u'Frozen', u'name': u'lemonade concentrate', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonade.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 14292, u'unit': u'ounces'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'3 cans (8 ounces each) jellied cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 9081, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cranberry-slush-punch', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the cranberry sauce, concentrates, water, cinnamon and allspice. Cover and freeze for 8 hours or overnight.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from the freezer 45 minutes before serving. For each serving, combine 1/2 cup slush mixture with 1/2 cup lemon-lime soda.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 518, u'instructions': u'Directions                                                                                In a large bowl, combine the cranberry sauce, concentrates, water, cinnamon and allspice. Cover and freeze for 8 hours or overnight.                                                                                            Remove from the freezer 45 minutes before serving. For each serving, combine 1/2 cup slush mixture with 1/2 cup lemon-lime soda.                                        Yield: 24 servings (1 cup each).                                                                                                                         Originally published as Cranberry Slush Punch in  Taste of HomeDecember/January 2004, p39                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 116 calories, trace fat (trace saturated fat), 0 cholesterol, 24 mg sodium, 30 g carbohydrate, trace fiber, trace protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-slush-punch-465652', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}