{u'recipes': [{u'sourceName': u'Deep South Dish', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/244206-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 244206, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creole Jambalaya', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 275.85, u'creditText': u'Deep South Dish', u'extendedIngredients': [{u'originalString': u'1 tablespoon all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1 pound andouille sausage', u'aisle': u'Meat', u'name': u'andouille sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7064, u'unit': u'pound'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/2 to 1 teaspoon Cajun seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032028, u'unit': u'teaspoon'}, {u'originalString': u'1-2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'4 cups chicken stock or broth', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 medium green bell pepper', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'Kosher salt & freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 cups uncooked, long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cups'}, {u'originalString': u'Old Bay seasoning', u'aisle': u'Spices and Seasonings', u'name': u'old bay seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1052034, u'unit': u'servings'}, {u'originalString': u'1 medium onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Chopped parsley, to garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'Palmful dried parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'Hot pepper sauce, for the table', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'hot', u'for the table'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'1 pound raw shrimp', u'aisle': u'Seafood', u'name': u'raw shrimp', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 pound boneless skinless chicken breast', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'10 ounce Rotel tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11529, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2032, u'unit': u'teaspoon'}, {u'originalString': u'28 ounce whole tomatoes', u'aisle': u'Canned and Jarred', u'name': u'whole tomatoes', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011531, u'unit': u'ounce'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.deepsouthdish.com/2008/10/jambalaya-with-chicken-smoked-sausage.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Recipe: Creole Jambalaya', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'From the Kitchen of Deep South Dish', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Prep time: 20 min |Cook time: 40 min |', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Jambalaya works really well with ros\xe9 Wine, Sauvignon Blanc, and Albarino. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. The Cecchi Chianti Classico Riserva di Famiglia with a 4.1 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'rose wine', u'sauvignon blanc', u'albarino'], u'productMatches': [{u'description': u'Chianti Classico Riserva di Famiglia is certainly the most representative wine of Cecchi. Produced only in years in which the grapes reach the quality desired it comes from the area of Castellina in Chianti. The color of excellent limpidity is of an intense ruby red. The aroma reveals broad and ethereal notes of ripe fruit and spices. The structure is elegant. View More', u'title': u'Cecchi Chianti Classico Riserva di Famiglia', u'price': u'$26.99', u'id': 459422, u'link': u'https://www.wine.com/product/cecchi-chianti-classico-riserva-di-famiglia-2014/240545', u'imageUrl': u'https://spoonacular.com/productImages/459422-312x231.jpg'}]}, u'aggregateLikes': 4210, u'instructions': u"Recipe: Creole JambalayaFrom the Kitchen of Deep South DishPrep time: 20 min |Cook time: 40 min |Yield: About 10 to 12 servingsIngredients1 pound andouille sausage, smoked sausage, or ham, coarsely chopped1 medium onion, chopped1 medium green bell pepper, chopped3 cloves of garlic, minced1-2 tablespoons canola oil1 pound boneless skinless chicken breastKosher salt & freshly cracked black pepper1 tablespoon all purpose flour1 (28 ounce) can of whole tomatoes, undrained1 (10 ounce) can of Rotel tomatoes, undrained4 cups of chicken stock or broth1 teaspoon of dried thyme1 teaspoon of dried basilPalmful of dried parsley1/2 teaspoon white pepper1/2 to 1 teaspoon of Cajun seasoning (like Slap Ya Mama), or to taste4 cups of uncooked, long grain rice3 tablespoons of butter, cut into slices (can omit if using dark or mixed chicken)1 pound of raw shrimp, cleaned and deveinedOld Bay seasoningChopped parsley, to garnishHot pepper sauce, for the tableInstructionsPreheat oven to 350 degrees F. Cut up sausage, onion, bell pepper and garlic; set aside.Sprinkle the whole chicken breasts with salt and pepper and brown in oil over medium to medium high heat in a 6 quart cast iron dutch oven that has a lid. Don't overcook! Remove chicken and set aside to cool. Once cool, coarsely chop into bite sized pieces. To the dutch oven, add the chopped sausage and cook until browned; remove and set aside.Add additional oil as needed to bring up to a tablespoon. Stir in the flour and cook, stirring constantly until lightly browned. Do not burn! Add onion and bell pepper and saute a few minutes until softened. Reduce heat to medium and add the garlic, cooking another minute. Using kitchen shears, roughly chop the tomatoes right in the can, then carefully stir them into the veggie/roux mixture, add the Rotel tomatoes and cook an additional 5 minutes. Add the chicken broth, thyme, basil, parsley, Cajun seasoning, white pepper, and cayenne, bring back up to a boil. Add the rice and stir in. Return to a boil. Add the chicken and sausage, dot the top with butter, stir, cover the pot and place it into the oven. Bake at 350 degrees F for 30 minutes or until the majority of liquid is absorbed.Remove, stir, taste and adjust seasonings as needed. Sprinkle the shrimp lightly with Old Bay seasoning, stir the shrimp into the rice mixture and return to the oven to bake until liquid is absorbed and shrimp are cooked through. Fluff with a large serving fork.Scoop onto plates, garnish with a bit of parsley, add a side salad or a green veggie, and pass hot pepper sauce at the table. Makes a massive amount of jambalaya. Reheat leftovers covered in the microwave.Lighten it up: Substitute turkey smoked sausage and use non-stick cooking spray to brown the meats instead of oil. For the roux, omit the oil, use a bit more spray, and just brown the flour in the dutch oven long enough to cook the flour, about 5 minutes. Whisk in a bit of water to form a gravy and add a splash of Kitchen Bouquet. Omit the butter at the end.Source: http://deepsouthdish.comPRINT THISRequires Adobe Reader - download it free!Deep South Dish", u'spoonacularSourceUrl': u'https://spoonacular.com/creole-jambalaya-244206', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}