{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507908-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 507908, u'veryPopular': True, u'lowFodmap': False, u'title': u'Monte Cristo Sandwich', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 468.53, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'servings'}, {u'originalString': u'6 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'8 slices firm bread (a hearty French or Challah), sliced \xbd-inch to 1-inch thick', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french', u'hearty', u'firm', u'sliced', u'(a or Challah)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18029, u'unit': u'slices'}, {u'originalString': u'8 ounces Gruy\xe8re cheese, shredded', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1023, u'unit': u'ounces'}, {u'originalString': u'8 ounces sliced Virginia ham', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10151, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'Maple syrup, for serving', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'servings'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons unsalted butter, melted + 1 tablespoon for cooking', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'for cooking'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'1\xbd cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.browneyedbaker.com/2012/10/25/monte-cristo-sandwich-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 36, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}], u'step': u'If your bread is not yet dry, put it in the toaster on the lowest setting to dry it out. 2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the milk, egg yolks, brown sugar, melted butter, vanilla extract and salt in a medium bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour the custard into a 9x13-inch baking pan.3. Assemble the sandwiches by spreading a thin layer of Dijon mustard on each slice of bread. Top 4 slices with an equal amount of ham and cheese, and then top with the remaining slices of bread, pressing them together gently.4. Set a 12-inch skillet over medium-low heat and melt \xbd tablespoon of the butter.5. Meanwhile, place the assembled sandwiches in the custard mixture for 20 seconds. Gently flip the sandwiches over and soak on the other side for an additional 20 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer two of the sandwiches to a baking sheet or tray.6.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Place the other two sandwiches in the skillet and cook until golden brown, 3 to 4 minutes. Using a spatula, carefully flip the sandwiches and cook until the second side is golden brown, an additional 3 to 4 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the cooked sandwiches to a cooling rack or serving tray. Wipe out the skillet with a paper towel, melt the remaining \xbd tablespoon of butter and repeat with the remaining two sandwiches.7.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with maple syrup or fruit preserves.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 5197, u'instructions': u'1. If your bread is not yet dry, put it in the toaster on the lowest setting to dry it out. 2. Whisk together the milk, egg yolks, brown sugar, melted butter, vanilla extract and salt in a medium bowl. Pour the custard into a 9x13-inch baking pan.3. Assemble the sandwiches by spreading a thin layer of Dijon mustard on each slice of bread. Top 4 slices with an equal amount of ham and cheese, and then top with the remaining slices of bread, pressing them together gently.4. Set a 12-inch skillet over medium-low heat and melt \xbd tablespoon of the butter.5. Meanwhile, place the assembled sandwiches in the custard mixture for 20 seconds. Gently flip the sandwiches over and soak on the other side for an additional 20 seconds. Transfer two of the sandwiches to a baking sheet or tray.6. Place the other two sandwiches in the skillet and cook until golden brown, 3 to 4 minutes. Using a spatula, carefully flip the sandwiches and cook until the second side is golden brown, an additional 3 to 4 minutes. Remove the cooked sandwiches to a cooling rack or serving tray. Wipe out the skillet with a paper towel, melt the remaining \xbd tablespoon of butter and repeat with the remaining two sandwiches.7. Serve with maple syrup or fruit preserves.', u'spoonacularSourceUrl': u'https://spoonacular.com/monte-cristo-sandwich-507908', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}