{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/577129-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 577129, u'veryPopular': True, u'lowFodmap': False, u'title': u'Black Bean and Corn Soup + Spicy Mexican Three Cheese Quesadillas', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 204.61, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'Black Pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 cans of Black Beans, un-drained, divided', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 4.0, u'consistency': u'solid', u'id': 16018, u'unit': u'cans'}, {u'originalString': u'1 cup sliced Celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon Chipotle Pepper', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 11632, u'unit': u'teaspoon'}, {u'originalString': u'Cotija Cheese', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1001019, u'unit': u'servings'}, {u'originalString': u'2 teaspoons Cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1 can diced Fire-Roasted Tomatoes', u'aisle': u'Canned and Jarred', u'name': u'fire-roasted tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 98849, u'unit': u'can'}, {u'originalString': u'12 small Flour Tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'Fresh cilantro, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'5-6 cloves Fresh Garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Juice of half a Lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Kosher Salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 ounces Monterey Jack Cheese, grated', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon of Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'Olive Oil, for pan or griddle', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for pan or griddle'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Pickled Jalapenos', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pickled jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10011632, u'unit': u'servings'}, {u'originalString': u'1 Poblano Pepper', u'aisle': u'Produce', u'name': u'poblano pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'1 medium Red Bell Pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4 teaspoon Smoked Paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'3 cups Sweet Corn', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'sweet corn', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11168, u'unit': u'cups'}, {u'originalString': u'32 ounces Low Sodium Vegetable Broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ounces'}, {u'originalString': u'1 medium White Onion, diced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'diced', u'white', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'4 ounces Chihuaua Cheese, grated', u'aisle': u'?', u'name': u'chihuaua cheese', u'metaInformation': [u'grated'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'unit': u'ounces'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.simplyscratch.com/2013/10/black-bean-and-corn-soup-with-spicy-mexican-three-cheese-quesadillas.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'FOR THE PEPPERS: Preheat your grill to medium-high heat. Wash and pat dry a medium red bell pepper and poblano. Lightly spray them with olive oil. Once the grill is hot, set the peppers on the hottest part of your gill. Grill the peppers for 10-12 minutes, turning occasionally until the skin chars and blisters.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove and place into a clean bowl and cover tightly with plastic wrap.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [], u'step': u'Let the peppers sit for 15-20 minutes before removing. Peel the skin off, remove the stem and scrape out the seeds before dicing.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a cup and a half of the black beans into a bowl. Smash them with a fork until only small pieces of bean remain. Set it off to the side.In a 4 to 5 quart Dutch oven; heat a tablespoon of olive oil over medium-low heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u"Add the celery, onion and garlic and saute until they're just starting to soften.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the cumin, chipotle powder, smoked paprika and black pepper {about 1/4 teaspoon}. Stir and cook for another minute or two. Next add in the fire-roasted tomatoes, the bell pepper, poblano and corn.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'id': 98849, u'name': u'fire roasted tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}, {u'equipment': [], u'step': u'Pour in the 4 cups of vegetable broth and the portion of beans that are left whole. Stir and bring to a boil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}]}, {u'equipment': [], u'step': u'Pour in the smashed black beans and stir. Reduce the temperature to simmer, cover and cook for 45 minutes. Taste and add salt to your preference before serving.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Garnish with freshly torn cilantro leaves.EnjoyFOR THE QUESADILLAS: Preheat your griddle to 350 degrees and lightly spray or grease with olive oil. Lay down three tortillas and sprinkle a little of each of the cheeses over top {add pickled jalapenos if you like it spicy!}. Top each with a second tortilla and once the cheese has melted, flip. Sprinkle the remaining cheese over the crispy top and add the final flour tortilla. Once the bottom is crispy and golden, flip and cook until that side is crispy.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'id': 10011632, u'name': u'pickled jalapenos'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'id': 10218364, u'name': u'flour tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Cut into wedges and enjoy!', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Argyle Reserve Pinot Noir with a 4.3 out of 5 star rating seems like a good match. It costs about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 373, u'instructions': u"FOR THE PEPPERS: Preheat your grill to medium-high heat. Wash and pat dry a medium red bell pepper and poblano. Lightly spray them with olive oil. Once the grill is hot, set the peppers on the hottest part of your gill. Grill the peppers for 10-12 minutes, turning occasionally until the skin chars and blisters. Remove and place into a clean bowl and cover tightly with plastic wrap. Let the peppers sit for 15-20 minutes before removing. Peel the skin off, remove the stem and scrape out the seeds before dicing.Place a cup and a half of the black beans into a bowl. Smash them with a fork until only small pieces of bean remain. Set it off to the side.In a 4 to 5 quart Dutch oven; heat a tablespoon of olive oil over medium-low heat. Add the celery, onion and garlic and saute until they're just starting to soften.Add the cumin, chipotle powder, smoked paprika and black pepper {about 1/4 teaspoon}. Stir and cook for another minute or two. Next add in the fire-roasted tomatoes, the bell pepper, poblano and corn. Pour in the 4 cups of vegetable broth and the portion of beans that are left whole. Stir and bring to a boil.Pour in the smashed black beans and stir. Reduce the temperature to simmer, cover and cook for 45 minutes. Taste and add salt to your preference before serving.Garnish with freshly torn cilantro leaves.EnjoyFOR THE QUESADILLAS: Preheat your griddle to 350 degrees and lightly spray or grease with olive oil. Lay down three tortillas and sprinkle a little of each of the cheeses over top {add pickled jalapenos if you like it spicy!}. Top each with a second tortilla and once the cheese has melted, flip. Sprinkle the remaining cheese over the crispy top and add the final flour tortilla. Once the bottom is crispy and golden, flip and cook until that side is crispy.Cut into wedges and enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-and-corn-soup-+-spicy-mexican-three-cheese-quesadillas-577129', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}