{u'recipes': [{u'sourceName': u'Buns in My Oven', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/711533-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 711533, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oven Baked Sloppy Joe Dogs', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 147.31, u'creditText': u'Buns in My Oven', u'extendedIngredients': [{u'originalString': u'1 cup grated cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'cup'}, {u'originalString': u'1 pound ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'8 hot dog buns', u'aisle': u'Bakery/Bread', u'name': u'hot dog buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10018350, u'unit': u''}, {u'originalString': u'8 hot dogs', u'aisle': u'Meat', u'name': u'hot dogs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 21118, u'unit': u''}, {u'originalString': u'mustard, relish, onions as desired', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'servings'}, {u'originalString': u'1 can (15 ounces) sloppy joe sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 6150, u'unit': u'ounces'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.bunsinmyoven.com/2016/01/28/oven-baked-sloppy-joe-dogs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.Cook the ground beef in a medium skillet over medium heat until cooked through.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [], u'step': u'Drain grease.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add sloppy joe sauce to skillet and stir well to coat the meat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place the hot dog buns in a 9x13 baking dish and fill each bun with a hot dog and mustard, relish, or onions as desired.Spoon the sloppy joe mixture over the hot dogs and top with cheddar cheese.Cover dish with foil and bake for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-dog-buns.jpg', u'id': 10018350, u'name': u'hot dog bun'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Hot Dogs can be paired with Riesling, Gewurztraminer, and ros\xe9 Wine. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. You could try Columbia Winery Cellarmaster's Riesling. Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 48, u'instructions': u'Preheat oven to 350 degrees.Cook the ground beef in a medium skillet over medium heat until cooked through. Drain grease.Add sloppy joe sauce to skillet and stir well to coat the meat.Place the hot dog buns in a 9x13 baking dish and fill each bun with a hot dog and mustard, relish, or onions as desired.Spoon the sloppy joe mixture over the hot dogs and top with cheddar cheese.Cover dish with foil and bake for 20 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-baked-sloppy-joe-dogs-711533', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}