{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556388-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 556388, u'veryPopular': True, u'lowFodmap': False, u'title': u'Custard and amaretti gelato', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 82.23, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'40 g of crushed amaretti + more to decorate', u'aisle': u'Sweet Snacks', u'name': u'amaretti', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 93766, u'unit': u'g'}, {u'originalString': u'250 g of fresh cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'g'}, {u'originalString': u'5 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 teaspoon of carob seed flour', u'aisle': u'Baking', u'name': u'grape seed flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 99048, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon of orange blossom honey', u'aisle': u'Gourmet', u'name': u'orange blossom water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12411111, u'unit': u'tablespoon'}, {u'originalString': u'125 g of caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'1 tablespoon of vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'220 g of whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 220.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://en.julskitchen.com/dessert/a-gelato-a-day', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'The day before.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the milk and cream in a saucepan until slightly simmering. Turn off the heath and add a tablespoon of vanilla essence.Beat the egg yolks with the sugar until light and pale, add a tablespoon of honey and a teaspoon of carob seed flour, then stir them thoroughly into the yolks.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1012050, u'name': u'artificial vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour slowly the milk and cream in a thin stream into the egg yolks and stir constantly with a whisk to prevent the eggs from curdling.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Put the custard in a double boiler on the stove and heat till 83\xb0C or mix with a whisk until it reaches the first boil. Turn off, cover with cling film and let it cool, then move it in the fridge until the next day.The next day.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Pour the custard into the chilled ice cream maker and follow the instructions. Just before the ice cream is ready, crush the amaretti biscuits with a rolling pin to grind them into a fine powder and add in into the ice cream for the last 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'id': 93766, u'name': u'amaretti cookies'}]}, {u'equipment': [], u'step': u'Put the ice cream in a plastic or metal container and transfer it into the freezer for a few hours. Take it off ten minutes before serving and decorate with other amaretti crumbs.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'id': 93766, u'name': u'amaretti cookies'}]}], u'name': u''}], u'aggregateLikes': 545, u'instructions': u'The day before. Heat the milk and cream in a saucepan until slightly simmering. Turn off the heath and add a tablespoon of vanilla essence.Beat the egg yolks with the sugar until light and pale, add a tablespoon of honey and a teaspoon of carob seed flour, then stir them thoroughly into the yolks.Pour slowly the milk and cream in a thin stream into the egg yolks and stir constantly with a whisk to prevent the eggs from curdling.Put the custard in a double boiler on the stove and heat till 83\xb0C or mix with a whisk until it reaches the first boil. Turn off, cover with cling film and let it cool, then move it in the fridge until the next day.The next day. Pour the custard into the chilled ice cream maker and follow the instructions. Just before the ice cream is ready, crush the amaretti biscuits with a rolling pin to grind them into a fine powder and add in into the ice cream for the last 5 minutes.Put the ice cream in a plastic or metal container and transfer it into the freezer for a few hours. Take it off ten minutes before serving and decorate with other amaretti crumbs.', u'spoonacularSourceUrl': u'https://spoonacular.com/custard-and-amaretti-gelato-556388', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}