{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/607611-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 607611, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salsa Borracha (Drunken Salsa)', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 131.65, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u'1 (12\xad-ounce) bottle of beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'(12\xad-ounce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbc cup lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'\xbc cup neutral oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'neutral'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'2 tablespoons tequila', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10814037, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds tomatoes, chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'pounds'}, {u'originalString': u'Tortilla chips, for serving', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}, {u'originalString': u'1 large yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2014/07/salsa-borracha-drunken-salsa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in a large saucepan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the onion, garlic and jalape\xf1os and cook for 5 minutes, stirring frequently.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the tomatoes, beer and brown sugar. Bring to a simmer and continue simmering until the mixture has thickened, 20-30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the lime juice, cilantro and tequila, then puree using an immersion blender, or transfer to a food processor or blender and puree in batches until the salsa reaches your desired consistency.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 10814037, u'name': u'tequila'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Salsa. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The J Vineyards & Winery Pinot Noir with a 5 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'At J, we are devoted to the concept of terroir in the Russian River Valley, and our 2013 J Vineyards Pinot Noir is a reflection of this vintage, the vineyards and our attention to detail in the winery. Delivering bright berry flavors-red cherry, raspberry and blackberry- this elegant Pinot is enhanced by notes of licorice and red tea, which linger on the finish. Aromas of wild strawberries and spices delight the nose.', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 224, u'instructions': u'Heat oil in a large saucepan over medium heat. Add the onion, garlic and jalape\xf1os and cook for 5 minutes, stirring frequently. Add the tomatoes, beer and brown sugar. Bring to a simmer and continue simmering until the mixture has thickened, 20-30 minutes. Add the lime juice, cilantro and tequila, then puree using an immersion blender, or transfer to a food processor or blender and puree in batches until the salsa reaches your desired consistency.', u'spoonacularSourceUrl': u'https://spoonacular.com/salsa-borracha-drunken-salsa-607611', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}