{u'recipes': [{u'sourceName': u'Tinned Tomatoes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/472229-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 472229, u'veryPopular': False, u'lowFodmap': False, u'title': u'Labneh with Olive Oil and Za’atar', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 228.53, u'creditText': u'Tinned Tomatoes', u'extendedIngredients': [{u'originalString': u'a handful of fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'handful'}, {u'originalString': u'1 ball fresh mozzarella', u'aisle': u'Cheese', u'name': u'fresh mozzarella', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ball', u'unitShort': u'ball', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ball'}, {u'originalString': u'1 clove garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2 packets of ready made gnocchi', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'gnocchi', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'unitLong': u'packets', u'unitShort': u'packets', u'amount': 2.0, u'consistency': u'solid', u'id': 98853, u'unit': u'packets'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd glass red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'glass', u'unitShort': u'glass', u'amount': 0.5, u'consistency': u'liquid', u'id': 14096, u'unit': u'glass'}, {u'originalString': u'a good grinding of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 tbsp tomato puree', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11547, u'unit': u'tbsp'}, {u'originalString': u'400g tin chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 11529, u'unit': u'g'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.tinnedtomatoes.com/2014/05/tomato-and-basil-gnocchi-bake-national.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Saute the onion and garlic in the olive oil until the onion is soft and translucent.2.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Add the tomatoes, tomato puree and wine and cook gently for 20 minutes. Season with salt and pepper and add some roughly torn fresh basil.3. Pre-heat the oven to 200c/180 c fan/gas mark 6.4. Gently fry the gnocchi in a frying pan until golden and starting to crisp.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11547, u'name': u'tomato puree'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'id': 98853, u'name': u'gnocchi'}]}, {u'equipment': [], u'step': u'Mix with the sauce and pour into an ovenproof dish.5. Top the gnocchi with slices of mozzarella and some more torn basil and bake for 20 minutes until the mozzarella has melted and is starting to turn golden.6.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'id': 98853, u'name': u'gnocchi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Serve with garlic bread and a side salad.7. Enjoy!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Greek Yogurt. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'1. Saute the onion and garlic in the olive oil until the onion is soft and translucent.2. Add the tomatoes, tomato puree and wine and cook gently for 20 minutes. Season with salt and pepper and add some roughly torn fresh basil.3. Pre-heat the oven to 200c/180 c fan/gas mark 6.4. Gently fry the gnocchi in a frying pan until golden and starting to crisp. Mix with the sauce and pour into an ovenproof dish.5. Top the gnocchi with slices of mozzarella and some more torn basil and bake for 20 minutes until the mozzarella has melted and is starting to turn golden.6. Serve with garlic bread and a side salad.7. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/labneh-with-olive-oil-and-zaatar-472229', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}