{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/763031-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 763031, u'veryPopular': False, u'lowFodmap': True, u'title': u'Lavender-Pink Peppercorn Vodka Sodas', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 360.15, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 liter club soda', u'aisle': u'Beverages', u'name': u'club soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'liter'}, {u'originalString': u'1/4 cup dried lavender', u'aisle': u'Gourmet', u'name': u'lavender', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93811, u'unit': u'cup'}, {u'originalString': u'Lemon wedges, for serving', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'1 teaspoon pink peppercorns, plus more for garnish', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'Sprigs of fresh lavender, for serving', u'aisle': u'Gourmet', u'name': u'lavender', u'metaInformation': [u'fresh', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'unitLong': u'Sprig', u'unitShort': u'Sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 93811, u'unit': u'Sprigs'}, {u'originalString': u'1 vanilla bean', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'8 to 12 ounces good-quality vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 14051, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpeg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/lavender-pink-peppercorn-vodka-sodas.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Combine the sugar, lavender, peppercorns and 1 cup water in a small saucepan. Split the vanilla bean lengthwise, scrape out the seeds with the back of a paring knife and add them to the saucepan. Bring the mixture to a boil over medium heat, stirring to submerge the lavender. Cook until the sugar dissolves, about 2 minutes. Turn off the heat, and let the syrup steep for 10 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'id': 93811, u'name': u'fresh lavender'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Pour the lavender syrup through cheesecloth placed over a fine-mesh strainer, and refrigerate the syrup until completely cooled.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Fill 4 Collins glasses with ice.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Add 2 to 3 ounces of vodka and 1 ounce of the lavender syrup into each glass, and top off with club soda. Crush some peppercorns on a cutting board with the back of a knife. Stir the cocktail with a long spoon, and garnish with lavender, lemon wedges and crushed peppercorns.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'id': 93811, u'name': u'fresh lavender'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern can be paired with Zinfandel, Riesling, and Sparkling Wine. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Rombauer El Dorado Zinfandel with a 4.3 out of 5 star rating seems like a good match. It costs about 33 dollars per bottle.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'This wine is ruby red with a bright hue, and aromas of red berries and mountain berries mixed with brown sugar, tobacco and a hint of violet. On the palate, it’s expansive and dense with flavors of plums, raspberry, blackberry jam, vanilla and dried florals. The finish builds and lingers on and on.94% Zinfandel, 6% Petite Sirah View More', u'title': u'Rombauer El Dorado Zinfandel', u'price': u'$32.99', u'id': 446519, u'link': u'https://www.wine.com/product/rombauer-el-dorado-zinfandel-2015/304373', u'imageUrl': u'https://spoonacular.com/productImages/446519-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Combine the sugar, lavender, peppercorns and 1 cup water in a small saucepan. Split the vanilla bean lengthwise, scrape out the seeds with the back of a paring knife and add them to the saucepan. Bring the mixture to a boil over medium heat, stirring to submerge the lavender. Cook until the sugar dissolves, about 2 minutes. Turn off the heat, and let the syrup steep for 10 minutes. Pour the lavender syrup through cheesecloth placed over a fine-mesh strainer, and refrigerate the syrup until completely cooled.                          Fill 4 Collins glasses with ice. Add 2 to 3 ounces of vodka and 1 ounce of the lavender syrup into each glass, and top off with club soda. Crush some peppercorns on a cutting board with the back of a knife. Stir the cocktail with a long spoon, and garnish with lavender, lemon wedges and crushed peppercorns.', u'spoonacularSourceUrl': u'https://spoonacular.com/lavender-pink-peppercorn-vodka-sodas-763031', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}