{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/580933-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 580933, u'veryPopular': False, u'lowFodmap': False, u'title': u'Indian Chickpea Stew: Value Adding, Great Tasting', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 115.4, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'6 ounces baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11457, u'unit': u'ounces'}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'brown rice, for serving', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 20040, u'unit': u'servings'}, {u'originalString': u'2 15-ounce cans garbanzo beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned garbanzo beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'1 28-ounce can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon coriander seed', u'aisle': u'Spices and Seasonings', u'name': u'coriander seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2013, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ginger, ground or fresh', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon grapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1-1 1/2 teaspoons turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoons'}, {u'originalString': u'2 cups vegetable broth, low sodium kind recommended', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 large yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}, {u'originalString': u'4 cloves garlics, minced', u'aisle': u'?', u'name': u'garlics', u'metaInformation': [u'minced'], u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'unit': u'cloves'}], u'healthScore': 71.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.foodfanatic.com/2013/02/indian-chickpea-stew-value-adding-great-tasting/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a large pot or Dutch oven, saut\xe9 the onion over medium heat until it begins to brown, about 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add all of the ingredients except for the spinach and stir to combine. Cover and bring the pot to a boil.Once a full boil is reached, lower the heat to medium low and allow the stew to cook at a gentle boil about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the cover from the pot and add all of the spinach. It’s okay if the pot is very full at this point; the spinach will cook down.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Put the cover back on and allow the spinach to steam about 30 seconds to 1 minute before stirring it into the stew to incorporate it.Cook an additional 2 minutes then serve over cooked brown rice.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are great choices for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. You could try Double Canyon Horse Heaven Hills Cabernet Sauvignon. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'This Cabernet embodies an enticing array of ripe red and black plum, intermixed with notes of fresh red cherry. Characteristic of the appellation and 2014 vintage, the nose offers spiced potpourri with a touch of raspberry preserves. The addition of Syrah leads to a full and rich texture on the mid-palate, further accented by bright acidity from the Petit Verdot, sweet red fruit from the Merlot and luscious blackberry notes supplied by the Malbec. The soft and supple mouthfeel is supported by the complexity of sweet oak tannins and fresh fruit character, finishing with the juicy acidity that is characteristic of Horse Heaven Hills. View More', u'title': u'Double Canyon Horse Heaven Hills Cabernet Sauvignon', u'price': u'$19.99', u'id': 441790, u'link': u'https://www.wine.com/product/double-canyon-horse-heaven-hills-cabernet-sauvignon-2014/160719', u'imageUrl': u'https://spoonacular.com/productImages/441790-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'In a large pot or Dutch oven, saut\xe9 the onion over medium heat until it begins to brown, about 8 to 10 minutes.Add all of the ingredients except for the spinach and stir to combine. Cover and bring the pot to a boil.Once a full boil is reached, lower the heat to medium low and allow the stew to cook at a gentle boil about 15 minutes.Remove the cover from the pot and add all of the spinach. It’s okay if the pot is very full at this point; the spinach will cook down.Put the cover back on and allow the spinach to steam about 30 seconds to 1 minute before stirring it into the stew to incorporate it.Cook an additional 2 minutes then serve over cooked brown rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/indian-chickpea-stew-value-adding-great-tasting-580933', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}