{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/179849-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 179849, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Finger Paints', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 37.31, u'extendedIngredients': [{u'originalString': u'1 cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'2 tablespoons dish soap', u'aisle': u'Refrigerated;Frozen', u'name': u'deep dish pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18945, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1/2 cup hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'Red, yellow, green and blue food color', u'aisle': u'Baking', u'name': u'yellow food color', u'metaInformation': [u'green', u'blue', u'red', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/homemade-finger-paints/8d7f300b-4efa-44c7-80ed-6e9279a12f69', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In medium bowl, stir together cornstarch, cold water and dish soap.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Add hot water; beat with electric mixer on medium speed until mixture is creamy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Divide mixture among 4 small plastic containers. Drop several drops of red food color into 1 container; stir until well mixed. Repeat with remaining food colors and containers. Store covered at room temperature. Use for finger painting on paper or canvas.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'red food color'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 73, u'instructions': u'1                               In medium bowl, stir together cornstarch, cold water and dish soap. Add hot water; beat with electric mixer on medium speed until mixture is creamy.                                                          2                               Divide mixture among 4 small plastic containers. Drop several drops of red food color into 1 container; stir until well mixed. Repeat with remaining food colors and containers. Store covered at room temperature. Use for finger painting on paper or canvas.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-finger-paints-179849', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}