{u'recipes': [{u'sourceName': u'From Away', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/607626-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 607626, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cinammon-Butter Roasted Bananas on Toast with Honey', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 82.31, u'creditText': u'From Away', u'extendedIngredients': [{u'originalString': u'1 banana, split lengthwise', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2 tablespoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'Sprinkle of cinnamon and sugar', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cinnamon sugar butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar-butter.png', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 93674, u'unit': u'serving'}, {u'originalString': u'1 teaspoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoon'}, {u'originalString': u'1 rounded tablespoon of almond or peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'tablespoon'}, {u'originalString': u'1 slice rustic bread, toasted', u'aisle': u'Bakery/Bread', u'name': u'rustic bread', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slice'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.fromaway.com/cooking/breakfast-cooking/slice-toast-cinammon-butter-roasted-banana', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400. In a pie pan or on a baking sheet, place banana cut side up. Dot with butter, then sprinkle with cinnamon and sugar. Roast 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread toast with about a half a tablespoon of butter, then almond or peanut butter. Top with roasted banana, then drizzle with honey and serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 8, u'instructions': u'Preheat oven to 400. In a pie pan or on a baking sheet, place banana cut side up. Dot with butter, then sprinkle with cinnamon and sugar. Roast 15 minutes.Spread toast with about a half a tablespoon of butter, then almond or peanut butter. Top with roasted banana, then drizzle with honey and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/cinammon-butter-roasted-bananas-on-toast-with-honey-607626', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}