{u'recipes': [{u'sourceName': u'Feasting at Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/481775-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 481775, u'veryPopular': True, u'lowFodmap': False, u'title': u'Summer Seafood Stew', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 622.47, u'creditText': u'Feasting at Home', u'extendedIngredients': [{u'originalString': u'Crusty Bread or 1 cup of Cannellini Beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cannellini beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10716050, u'unit': u'cup'}, {u'originalString': u'4 cups Chicken Stock ( or a good fish stock)', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'good', u'( or a fish stock)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 C dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'C'}, {u'originalString': u'2 cups finely diced fennel ( one large bulb)', u'aisle': u'Produce', u'name': u'fennel', u'metaInformation': [u'diced', u'large', u'finely', u'( one bulb)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11957, u'unit': u'cups'}, {u'originalString': u'8 oz firm fish like halibut, talapia, mahi mahi, or salmon', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'oz'}, {u'originalString': u'1 tsp fish sauce ( leave out if using fish stock)', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [u'( leave out if using fish stock)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tsp'}, {u'originalString': u'1/3 C chopped flat leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11297, u'unit': u'C'}, {u'originalString': u'4 garlic cloves, smashed and roughly diced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'diced', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 lb mussels ( frozen are OK, but get fresh if you can)', u'aisle': u'Seafood', u'name': u'mussels', u'metaInformation': [u'fresh', u'frozen', u'( are OK, but get if you can)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15164, u'unit': u'lb'}, {u'originalString': u'2 T olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'T'}, {u'originalString': u'1 cup finely diced onion ( half a large onion)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large', u'finely', u'( half a onion)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 lb large prawns, raw, peeled and de-veined', u'aisle': u'Seafood', u'name': u'raw prawns', u'metaInformation': [u'raw', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'salt if necessary', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 T tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'T'}, {u'originalString': u'2 medium tomatoes- diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.feastingathome.com/2013/06/summer-seafood-stew.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Remove from casing and break up or crumble into small bite size pieces). Once browned, set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour off the fat, wipe out skillet with paper towel.In same skillet, heat 2 T olive oil on med high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add fennel, stirring often for about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}]}, {u'equipment': [], u'step': u'Add onion, turn heat down to med and saute both until tender, about 8-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic, saut\xe9 3 minutes, stirring occasionally, until garlic starts turn golden.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add tomato paste. Turn heat up to high, constantly stirring, until paste darkens, about 3 more minutes. You are basically frying the paste to deepen the flavor of the dish.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add white wine and turn heat down to medium high, stirring until it mostly evaporates, about 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}]}, {u'equipment': [], u'step': u"Add chicken Stock, tomatoes, browned chorizo, and fish sauce and bring to a simmer. Once simmering, taste for salt. Surprisingly, I didn't need to add any salt ( salt content in stocks and chorizo can vary greatly - so make sure to taste.", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cracked pepper.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add fish, simmer a couple minutes and add prawns, simmer a couple minutes, then add mussels. Remember the larger the prawns or mussels or fish pieces the longer they take to cook, so look at all your seafood ingredients and determine which will take the longest to cook, putting them in first. \xa0Finish with a squeeze of a half a lemon and sprinkle generously with flat leaf parsley.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'flat leaf parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Serve with crusty bread. I like to cut a loaf of good quality garlic or rosemary bread into thick slices, arrange on a baking sheet, drizzle with olive oil and fresh rosemary sprigs, and bake in a 400F oven until toasty, or even better, grill the bread.If you are going gluten free, try adding a cup of cooked cannellini beans to the stew for added heartiness, instead of serving with bread.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'id': 10716050, u'name': u'cannellini beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Stew works really well with Cabernet Sauvignon, Chablis, and Malbec. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. You could try Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'Cabernet Sauvignon 100% View More', u'title': u"Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc", u'price': u'$7.99', u'id': 454922, u'link': u'https://www.wine.com/product/vincent-bouquet-cabernet-sauvignon-vin-de-pays-doc-2006/101798', u'imageUrl': u'https://spoonacular.com/productImages/454922-312x231.jpg'}]}, u'aggregateLikes': 6662, u'instructions': u"Instructions:In a large heavy bottom deep skillet or Dutch oven, brown chorizo in a little olive oil. (Remove from casing and break up or crumble into small bite size pieces). Once browned, set aside. Pour off the fat, wipe out skillet with paper towel.In same skillet, heat 2 T olive oil on med high heat. Add fennel, stirring often for about 3 minutes. Add onion, turn heat down to med and saute both until tender, about 8-10 minutes. Add garlic, saut\xe9 3 minutes, stirring occasionally, until garlic starts turn golden. Add tomato paste. Turn heat up to high, constantly stirring, until paste darkens, about 3 more minutes. You are basically frying the paste to deepen the flavor of the dish.Add white wine and turn heat down to medium high, stirring until it mostly evaporates, about 1-2 minutes. Add chicken Stock, tomatoes, browned chorizo, and fish sauce and bring to a simmer. Once simmering, taste for salt. Surprisingly, I didn't need to add any salt ( salt content in stocks and chorizo can vary greatly - so make sure to taste. Add cracked pepper. Add fish, simmer a couple minutes and add prawns, simmer a couple minutes, then add mussels. Remember the larger the prawns or mussels or fish pieces the longer they take to cook, so look at all your seafood ingredients and determine which will take the longest to cook, putting them in first. \xa0Finish with a squeeze of a half a lemon and sprinkle generously with flat leaf parsley.Serve with crusty bread. I like to cut a loaf of good quality garlic or rosemary bread into thick slices, arrange on a baking sheet, drizzle with olive oil and fresh rosemary sprigs, and bake in a 400F oven until toasty, or even better, grill the bread.If you are going gluten free, try adding a cup of cooked cannellini beans to the stew for added heartiness, instead of serving with bread.", u'spoonacularSourceUrl': u'https://spoonacular.com/summer-seafood-stew-481775', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter', u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}