{u'recipes': [{u'sourceName': u'Life, Love, and Sugar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547888-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 547888, u'veryPopular': False, u'lowFodmap': False, u'title': u'Super Moist Carrot Cake with Cream Cheese Icing', u'diets': [], u'pricePerServing': 255.19, u'creditText': u'Life, Love, and Sugar', u'extendedIngredients': [{u'originalString': u'2 1/2 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'3/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3/4 cup buttermilk, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'3/4 cup plus 2 tbsp cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020129, u'unit': u'cup'}, {u'originalString': u'8 oz. can of crushed pineapple, drained (about 3/4 cup after draining)', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'drained', u'canned', u'( 3/4 cup after draining)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9354, u'unit': u'oz'}, {u'originalString': u'1 1/3 cups pureed cooked carrots (from about 1 lb. 2 oz. raw)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'raw', u'pureed', u'cooked', u'(from 1 lb. 2 oz. )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'2 1/4 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'16 oz cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'4 large eggs, room temperature and lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 tsp freshly grated ginger, optional', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'Large pinch of ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2011, u'unit': u'pinch'}, {u'originalString': u'1/2 tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 cup walnuts or pecans, optional', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'6-7 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/2 cup raisins, optional (is using, reduce sugar to 1 2/3 cup)', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'(is using, reduce sugar to 1 2/3 cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'***If adding raisins, save the drained off pineapple juice for soaking raisins (soak for about an hour)', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'drained', u'for soaking raisins (soak for an hour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9299, u'unit': u'servings'}, {u'originalString': u'3/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'3/4 cup sweetened flaked coconut, optional', u'aisle': u'Baking', u'name': u'sweetened coconut', u'metaInformation': [u'sweetened', u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12109, u'unit': u'cup'}, {u'originalString': u'1/4 cup unsalted butter, melted and cooled slightly', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 tsp unsulphured molasses', u'aisle': u'Baking', u'name': u'unsulphured molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tsp'}, {u'originalString': u'2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/2 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'png', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.lifeloveandsugar.com/2013/03/21/super-moist-carrot-cake-with-cream-cheese-icing-2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 69, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Cake1. Clean and peel carrots and chop into large pieces. 2. Steam carrots for 15 minutes, or until very tender. 3. While the carrots are warm, puree in a food processor or blender until mostly smooth. Set aside to cool.4. Sift together flours, sugar, salt, baking soda and spices in a large mixing bowl.5.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add oil, melted butter, buttermilk, eggs, vanilla and molasses.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix until well combined and no lumps remain.6. Fold in pureed carrots and pineapple as well as walnuts, coconut, ginger and raisins if using. 7. For a cake, pour batter into 2 9-inch greased pans and bake at 350 degrees for 40-50 minutes.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool in pan for about 10 minutes, then transfer to wire rack to cool completely. For cupcakes, pour batter into cupcake pans and bake for 18-22 minutes. Allow to cool in pans for about 5 minutes, then remove to wire rack.Icing1. Beat the cream cheese and butter until smooth.2. Slowly add 3 cups of powdered sugar.', u'length': {u'number': 37, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Mix until combined.3.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Mix in the vanilla extract.4.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}, {u'equipment': [], u'step': u'Add the rest of the powdered sugar and mix until smooth.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'aggregateLikes': 341, u'instructions': u'Cake1. Clean and peel carrots and chop into large pieces. 2. Steam carrots for 15 minutes, or until very tender. 3. While the carrots are warm, puree in a food processor or blender until mostly smooth. Set aside to cool.4. Sift together flours, sugar, salt, baking soda and spices in a large mixing bowl.5. Add oil, melted butter, buttermilk, eggs, vanilla and molasses. Mix until well combined and no lumps remain.6. Fold in pureed carrots and pineapple as well as walnuts, coconut, ginger and raisins if using. 7. For a cake, pour batter into 2 9-inch greased pans and bake at 350 degrees for 40-50 minutes. Let cool in pan for about 10 minutes, then transfer to wire rack to cool completely. For cupcakes, pour batter into cupcake pans and bake for 18-22 minutes. Allow to cool in pans for about 5 minutes, then remove to wire rack.Icing1. Beat the cream cheese and butter until smooth.2. Slowly add 3 cups of powdered sugar. Mix until combined.3. Mix in the vanilla extract.4. Add the rest of the powdered sugar and mix until smooth.', u'spoonacularSourceUrl': u'https://spoonacular.com/super-moist-carrot-cake-with-cream-cheese-icing-547888', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}