{u'recipes': [{u'sourceName': u'Little Leopard Book', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/560841-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 560841, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chef Inspired Dish, Quality Social: Roasted Chicken with Brussels Sprouts and Potato Hash', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 273.19, u'creditText': u'Little Leopard Book', u'extendedIngredients': [{u'originalString': u'1 cup brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'cup'}, {u'originalString': u'3 tbsp butter (divided)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'2 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1/4 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'2 lemon rosemary basil marinated chicken breasts', u'aisle': u'Produce;Spices and Seasonings', u'name': u'lemon basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 tsp lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup diced pancetta', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10410123, u'unit': u'cup'}, {u'originalString': u'5-6 small red potatoes (quartered)', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'small', u'quartered', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://littleleopardbook.com/2013/01/12/chef-inspired-dish-quality-social-roasted-chicken-with-brussels-sprouts-and-potato-hash/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Begin cooking the marinated chicken breasts in a cast iron skillet, then add 2 tbsp of cubed butter.Cook for 8-10 minutes, then flip.Cook the other side for 8-10 minutes then place into a 350\xb0 oven to finish roasting for an additional 10 minutes.While the chicken is roasting, prepare the vegetables by heating the olive oil in a skillet then adding the potatoes and brussels sprouts.Cook for 3-5 minutes then add the pancetta and 1 tbsp butter.Cook for 2-3 minutes then add the chicken stock and cranberries. Cook until most of the liquid is absorbed and the potatoes are tender.', u'length': {u'number': 38, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place the vegetables on a plate and top with the chicken, sprinkle with lemon zest.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Roasted Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 125, u'instructions': u'Begin cooking the marinated chicken breasts in a cast iron skillet, then add 2 tbsp of cubed butter.Cook for 8-10 minutes, then flip.Cook the other side for 8-10 minutes then place into a 350\xb0 oven to finish roasting for an additional 10 minutes.While the chicken is roasting, prepare the vegetables by heating the olive oil in a skillet then adding the potatoes and brussels sprouts.Cook for 3-5 minutes then add the pancetta and 1 tbsp butter.Cook for 2-3 minutes then add the chicken stock and cranberries. Cook until most of the liquid is absorbed and the potatoes are tender.Place the vegetables on a plate and top with the chicken, sprinkle with lemon zest.', u'spoonacularSourceUrl': u'https://spoonacular.com/chef-inspired-dish-quality-social-roasted-chicken-with-brussels-sprouts-and-potato-hash-560841', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}