{u'recipes': [{u'sourceName': u'Erins Food Files', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573053-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 573053, u'veryPopular': False, u'lowFodmap': False, u'title': u'Braised Chicken Thighs with Winter Vegetables', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'pricePerServing': 298.61, u'creditText': u'Erins Food Files', u'extendedIngredients': [{u'originalString': u'3 slices bacon, diced medium', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'4 medium carrots, cut into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'4 skinless chicken thighs (about 2 pounds), patted dry', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'skinless', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5091, u'unit': u'pounds'}, {u'originalString': u'coarse salt and ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh minced ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'4 garlic cloves, smashed and peeled', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tablespoon'}, {u'originalString': u'2 cups low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon red-pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 sprigs rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprigs'}, {u'originalString': u'1 large russet potato, peeled and cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'large', u'peeled', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1/2 small Savoy cabbage, cored and thick ribs removed, cut into 1/2-by-2-inch strips', u'aisle': u'Produce', u'name': u'savoy cabbage', u'metaInformation': [u'thick', u'cored', u'small', u'cut into 1/2-by-2-inch strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/savoy-cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11114, u'unit': u''}, {u'originalString': u'1 sweet onion, such as Vidalia, cut into 3/4-inch wedges', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u' such as vidalia, cut into 3/4-inch wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 tart apple, such as Granny Smith or Mutsu, peeled and cut into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'tart apple', u'metaInformation': [u' such as granny smith or mutsu, peeled and cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-delicious-apples.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 1029003, u'unit': u''}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.erinsfoodfiles.com/2011/12/braised-chicken-thighs-with-winter-vegetables.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine marinade ingredients in medium container and whisk to combine.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken and toss to coat.  Cover, and refrigerate at least 1 hour, until ready to cook.Preheat oven to 375\xb0. In a large ovenproof pan, heat oil over medium- high. Season chicken with salt and pepper and cook until browned on both sides, 8 minutes per side.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer chicken to a plate. Reduce heat to medium, add bacon and garlic to pan, and cook until bacon fat is rendered, 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add onion, potato, and carrots; season with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer to oven and bake 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from oven and stir in cabbage, apple, red-pepper flakes, broth, and mustard.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add chicken, return to oven, and bake until cooked through, 20 to 25 minutes, stirring vegetables halfway through.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u'Optional Marinade'}], u'aggregateLikes': 18, u'instructions': u'Optional Marinade: Combine marinade ingredients in medium container and whisk to combine.  Add chicken and toss to coat.  Cover, and refrigerate at least 1 hour, until ready to cook.Preheat oven to 375\xb0. In a large ovenproof pan, heat oil over medium- high. Season chicken with salt and pepper and cook until browned on both sides, 8 minutes per side. Transfer chicken to a plate. Reduce heat to medium, add bacon and garlic to pan, and cook until bacon fat is rendered, 5 minutes. Add onion, potato, and carrots; season with salt and pepper. Transfer to oven and bake 20 minutes.Remove pan from oven and stir in cabbage, apple, red-pepper flakes, broth, and mustard. Add chicken, return to oven, and bake until cooked through, 20 to 25 minutes, stirring vegetables halfway through.', u'spoonacularSourceUrl': u'https://spoonacular.com/braised-chicken-thighs-with-winter-vegetables-573053', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}