{u'recipes': [{u'sourceName': u'Normal Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598904-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 598904, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Crescent Chicken', u'diets': [], u'pricePerServing': 180.64, u'creditText': u'Normal Cooking', u'extendedIngredients': [{u'originalString': u'2 cups chopped cooked chicken', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cooked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'1 can cream of chicken soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'can'}, {u'originalString': u'1 can of crescent rolls (8 count regular or 6 count jumbo)', u'aisle': u'Refrigerated', u'name': u'crescent rolls', u'metaInformation': [u'(8 count regular or 6 count jumbo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 93618, u'unit': u'can'}, {u'originalString': u'1 can of milk (using soup can)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(using soup can)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'can'}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://normalcooking.com/2014/02/16/creamy-crescent-chicken/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.Prepare soup, according to directions on can, using milk instead of water, and set aside. Separate crescent rolls. Spoon chicken and cheese onto each crescent; roll and seal to enclose filling.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place in a 9\xd713 baking dish.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour soup over rolls.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake uncovered for 30 mins.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Chehalem INOX Chardonnay. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 110, u'instructions': u'Preheat oven to 350 degrees F.Prepare soup, according to directions on can, using milk instead of water, and set aside. Separate crescent rolls. Spoon chicken and cheese onto each crescent; roll and seal to enclose filling. Place in a 9\xd713 baking dish. Pour soup over rolls. Bake uncovered for 30 mins.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-crescent-chicken-598904', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}