{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/410500-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 410500, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Creamed Corn', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 69.94, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 package (3 ounces) cream cheese, cubed', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 can (4 ounces) chopped green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounces'}, {u'originalString': u'1/4 cup sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped sweet red pepper', u'aisle': u'Produce', u'name': u'red sweet pepper', u'metaInformation': [u'sweet', u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1 can (15-1/4 ounces) whole kernel corn, drained', u'aisle': u'Produce', u'name': u'whole kernel corn', u'metaInformation': [u'whole', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounces'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/spicy-creamed-corn', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, combine all the ingredients. Cook over medium heat until cream cheese is melted and mixture is blended, stirring often.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 33, u'instructions': u'Directions                                                                                In a large saucepan, combine all the ingredients. Cook over medium heat until cream cheese is melted and mixture is blended, stirring often.                                        Yield: 4 servings.                                                                                                                         Originally published as Spicy Creamed Corn in  Quick CookingJanuary/February 2004, p48                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 162 calories, 8 g fat (5 g saturated fat), 23 mg cholesterol, 471 mg sodium, 15 g carbohydrate, 3 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-creamed-corn-410500', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}