{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/404653-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 404653, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Noodle Casserole', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 68.72, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup dry bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'dry bread crumbs', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'5 to 6 cups 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 teaspoon onion salt', u'aisle': u'Spices and Seasonings', u'name': u'onion salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1072047, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds process cheese (Velveeta), cubed', u'aisle': u'Cheese', u'name': u'process american cheese', u'metaInformation': [u'cubed', u'(Velveeta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 1253, u'unit': u'pounds'}, {u'originalString': u'2 packages (1 pound each) wide egg noodles', u'aisle': u'Pasta and Rice', u'name': u'wide egg noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 20409, u'unit': u'pound'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cheesy-noodle-casserole', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Cook noodles according to package directions; drain. Meanwhile, in a Dutch oven, melt butter. Stir in the flour, garlic salt and onion salt until smooth; gradually stir in milk. Bring to a boil; cook and stir for 2 minutes or until thickened.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1072047, u'name': u'onion salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the cheese; stir until melted. Stir in noodles.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to two greased shallow 2-qt. baking dishes.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the bread crumbs and butter until crumbly; sprinkle over casseroles.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 25-30 minutes or until golden brown.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 8, u'instructions': u'Directions                                                                                Cook noodles according to package directions; drain. Meanwhile, in a Dutch oven, melt butter. Stir in the flour, garlic salt and onion salt until smooth; gradually stir in milk. Bring to a boil; cook and stir for 2 minutes or until thickened. Add the cheese; stir until melted. Stir in noodles.                                                                                             Transfer to two greased shallow 2-qt. baking dishes. Combine the bread crumbs and butter until crumbly; sprinkle over casseroles.  Bake, uncovered, at 350\xb0 for 25-30 minutes or until golden brown.                                        Yield: 2 casseroles (12 servings each).                                                                                                                         Originally published as Cheesy Noodle Casserole in  Taste of HomeOctober/November 2003, p39                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 283 calories, 17 g fat (10 g saturated fat), 62 mg cholesterol, 697 mg sodium, 21 g carbohydrate, 1 g fiber, 12 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-noodle-casserole-404653', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}