{u'recipes': [{u'sourceName': u'Bake Your Day', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552507-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 552507, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bagel Bombs', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 90, u'pricePerServing': 58.59, u'creditText': u'Bake Your Day', u'extendedIngredients': [{u'originalString': u'1/2 packet (1 1/8 tsp.) dry active yeast – I used Red Star PLATINUM (3.5 grams)', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'red', u'dry', u'(3.5 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.125, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}, {u'originalString': u'2 tsp. black sesame seeds (4 grams)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'black sesame seeds', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-sesame-seeds-or-chia-seeds.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 4.0, u'consistency': u'solid', u'id': 10012023, u'unit': u'grams'}, {u'originalString': u'3 1/2- 4 cups bread flour (550 grams)', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 550.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'grams'}, {u'originalString': u"6 ounces cream cheese, room temperature (I had 1/3-less fat on had so that's what I used)", u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature', u"(I had 1/3-less fat on had so that's what I used)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'grapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'servings'}, {u'originalString': u'1-2 jalapenos, finely diced, depending on desired heat level (go ahead and use 2!)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'diced', u'finely', u'(go ahead and use 2!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 Tbs. kosher salt (12 grams)', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 12.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'grams'}, {u'originalString': u'3/4 tsp. salt (3 grams)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'grams'}, {u'originalString': u'1 bunch of scallions, finely chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}, {u'originalString': u'1 3/4 cups water (370 grams), room temperature water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 370.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'grams'}, {u'originalString': u'2 ounces white cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'white cheddar cheese', u'metaInformation': [u'shredded', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1011009, u'unit': u'ounces'}, {u'originalString': u'1 Tbs. white sesame seeds (6 grams)', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'white sesame seeds', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 6.0, u'consistency': u'solid', u'id': 12023, u'unit': u'grams'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.bakeyourday.net/bagel-bombs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the flour, salt and yeast in the bowl of your stand mixer – by hand – using the dough hook attachment like a spoon.  Stir by hand as you add the water, mixing for one minute until the mixture is loosely coming together but is still somewhat a mess. Engage the bowl and dough hook with the mixer and mix the dough with the machine on the lowest speed for three minutes, the dough should be smooth and cohesive.  Knead for four more minutes on the lowest speed.  The dough should look like a wet ball and should bounce back softly when prodded.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Brush a large bowl with a light coating of grapeseed oil and turn the dough into it.  Cover it with plastic wrap and let the dough proof at room temperature for 45 minutes.  The dough will rise and have a smooth outer surface – the dough is now ready to use.  If you don’t use it immediately, refrigerate it for up to three days; bring it to room temperature before using in a recipe. Or you can freeze it for up to one week. Stir together the flour, salt, and yeas. Slowly add the water while you continue to stir.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4517, u'name': u'grape seed oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix for 1 minute.Make the Everything Bagel', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix:While the dough proofs, prepare the bagel mix by combining the Everything Bagel', u'number': 4, u'ingredients': []}], u'name': u'Combine the cream cheese, cheddar cheese, jalapenos, scallions and salt until well-blended.  Scoop out into 8 even lumps onto a Silpat or parchment-lined sheet pan.  Freeze for at least one hour, up to 3 hours, until very hard. Make the Mother Dough'}, {u'steps': [], u'name': u'Prepare the plugs'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat the oven to 325 degrees and line a large baking sheet with parchment paper or a Silpat liner.Punch down (half of) the dough and flatten it onto a smooth (floured) surface.  *(Store the other half of the dough in the fridge for up to three days or in the freezer for a week.)  It might be sticky – if it is, use flour as needed.  Use a dough cutter or pizza cutter to divide the dough into eight equal pieces.  Use your fingers and palms to stretch the dough into thin discs like small pizzas, about 3-inches wide.Put a cream cheese plug into the center of each piece of dough and bring the edges up around and pinch to seal the plug completely.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Roll the dough between the palms of your hands to ensure it is sealed.  They should resemble dinner rolls at this point.  Arrange them onto the prepared sheet pans about 3 inches apart.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the egg and water together and give each bagel bomb a healthy bath of egg wash – make sure the whole surface is covered – and then give each a liberal sprinkling of the bagel mix – don’t be afraid to use it all!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake the bagel bombs for 30 minutes – or more – until they are golden brown and a few may have exploded a little cream cheese – that explosion was my favorite part of these!  Cassie’s Notes:The original recipe calls for a Bacon, Scallion and Cream Cheese Plug – I’ve been on a Jalapeno-Cheddar kick lately so I was craving that combination in these.  Feel free to fry up some bacon instead and make sure to add a few drops of the bacon grease to the plug mixture as directed in the cookbook.  I baked these for about 40 minutes because I kept wanting a little more color on them – I think I could have flattened my dough out a bit more and they would have taken less time.', u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u'Mix ingredients in a small bowl.  Store in an airtight container until ready to use – up to six months. Make the Bagel Bombs'}], u'winePairing': {}, u'aggregateLikes': 647, u'instructions': u'Prepare the plugs:Combine the cream cheese, cheddar cheese, jalapenos, scallions and salt until well-blended.  Scoop out into 8 even lumps onto a Silpat or parchment-lined sheet pan.  Freeze for at least one hour, up to 3 hours, until very hard. Make the Mother Dough:Combine the flour, salt and yeast in the bowl of your stand mixer – by hand – using the dough hook attachment like a spoon.  Stir by hand as you add the water, mixing for one minute until the mixture is loosely coming together but is still somewhat a mess. Engage the bowl and dough hook with the mixer and mix the dough with the machine on the lowest speed for three minutes, the dough should be smooth and cohesive.  Knead for four more minutes on the lowest speed.  The dough should look like a wet ball and should bounce back softly when prodded.Brush a large bowl with a light coating of grapeseed oil and turn the dough into it.  Cover it with plastic wrap and let the dough proof at room temperature for 45 minutes.  The dough will rise and have a smooth outer surface – the dough is now ready to use.  If you don’t use it immediately, refrigerate it for up to three days; bring it to room temperature before using in a recipe. Or you can freeze it for up to one week. Stir together the flour, salt, and yeas. Slowly add the water while you continue to stir. Mix for 1 minute.Make the Everything Bagel Mix:While the dough proofs, prepare the bagel mix by combining the Everything Bagel Mix ingredients in a small bowl.  Store in an airtight container until ready to use – up to six months. Make the Bagel Bombs:Heat the oven to 325 degrees and line a large baking sheet with parchment paper or a Silpat liner.Punch down (half of) the dough and flatten it onto a smooth (floured) surface.  *(Store the other half of the dough in the fridge for up to three days or in the freezer for a week.)  It might be sticky – if it is, use flour as needed.  Use a dough cutter or pizza cutter to divide the dough into eight equal pieces.  Use your fingers and palms to stretch the dough into thin discs like small pizzas, about 3-inches wide.Put a cream cheese plug into the center of each piece of dough and bring the edges up around and pinch to seal the plug completely.  Roll the dough between the palms of your hands to ensure it is sealed.  They should resemble dinner rolls at this point.  Arrange them onto the prepared sheet pans about 3 inches apart.  Whisk the egg and water together and give each bagel bomb a healthy bath of egg wash – make sure the whole surface is covered – and then give each a liberal sprinkling of the bagel mix – don’t be afraid to use it all! Bake the bagel bombs for 30 minutes – or more – until they are golden brown and a few may have exploded a little cream cheese – that explosion was my favorite part of these!  Cassie’s Notes:The original recipe calls for a Bacon, Scallion and Cream Cheese Plug – I’ve been on a Jalapeno-Cheddar kick lately so I was craving that combination in these.  Feel free to fry up some bacon instead and make sure to add a few drops of the bacon grease to the plug mixture as directed in the cookbook.  I baked these for about 40 minutes because I kept wanting a little more color on them – I think I could have flattened my dough out a bit more and they would have taken less time.', u'spoonacularSourceUrl': u'https://spoonacular.com/bagel-bombs-552507', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}