{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [u'south american', u'latin american'], u'image': u'https://spoonacular.com/recipeImages/494345-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 494345, u'veryPopular': False, u'lowFodmap': False, u'title': u'Soft Chicken Tacos with Cilantro Chimichurri and Homemade Corn Tortillas', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 36.96, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'1 cup shredded cabbage', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cup'}, {u'originalString': u'1 cup corn flour (masa harina*), plus more as needed', u'aisle': u'Ethnic Foods;Baking', u'name': u'corn flour', u'metaInformation': [u'as needed', u'plus more ', u'(masa harina*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20019, u'unit': u'cup'}, {u'originalString': u'1 cup fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 jalape\xf1o pepper, seeded and finely chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 small onion, finely chopped (about 1/2 cup chopped)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'finely chopped', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon fresh cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons TABASCO GREEN PEPPER\xae SAUCE', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'tablespoons'}, {u'originalString': u'2 cups shredded roasted chicken (from 1/2 a rotisserie chicken)', u'aisle': u'Meat', u'name': u'roasted chicken', u'metaInformation': [u'shredded', u'(from 1/2 a rotisserie chicken)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2013/10/soft-chicken-tacos-with-cilantro-chimichurri-and-homemade-corn-tortillas.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine onion, cilantro, jalape\xf1o, olive oil, and green pepper sauce in a bowl. Season to taste with salt and pepper. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Mix corn flour with salt and 2/3 cups water in medium mixing bowl until dough comes together. Dough should be soft, but not gooey or crumbly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-flour.jpg', u'id': 20019, u'name': u'corn flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add more flour or water as needed until desired consistency is achieved. Divide dough into eight equal balls and arrange on a baking sheet. Cover with a damp towel to keep them from drying out as you work.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place a single dough ball between two pieces of parchment or waxed paper on a sturdy surface. Using the bottom of a heavy pan (or other flat heavy object), press firmly down on dough ball to flatten. Then, using a rolling pin, gently roll the dough ball into a 5 to 6 inch round. You can also use a tortilla press if you have one. Gently peel tortilla from paper and place on flat surface. Cover with damp towel and repeat with remaining dough balls.Preheat a griddle or non-stick skillet over medium-high heat. One at a time, add tortillas to dry pan and cook for 40 to 60 seconds per side. Keep cooked tortillas in warm oven until ready to use.To assemble, spoon shredded chicken onto tortillas and top with shredded cabbage and chimichurri.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}]}, {u'equipment': [], u'step': u'Serve immediately.*Masa Harina flour is a made from lime-soaked corn kernels. You can find it in the international aisle of most major grocery stores or Mexican food stores, or online.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 74, u'instructions': u'Combine onion, cilantro, jalape\xf1o, olive oil, and green pepper sauce in a bowl. Season to taste with salt and pepper. Set aside.Mix corn flour with salt and 2/3 cups water in medium mixing bowl until dough comes together. Dough should be soft, but not gooey or crumbly. Add more flour or water as needed until desired consistency is achieved. Divide dough into eight equal balls and arrange on a baking sheet. Cover with a damp towel to keep them from drying out as you work.Place a single dough ball between two pieces of parchment or waxed paper on a sturdy surface. Using the bottom of a heavy pan (or other flat heavy object), press firmly down on dough ball to flatten. Then, using a rolling pin, gently roll the dough ball into a 5 to 6 inch round. You can also use a tortilla press if you have one. Gently peel tortilla from paper and place on flat surface. Cover with damp towel and repeat with remaining dough balls.Preheat a griddle or non-stick skillet over medium-high heat. One at a time, add tortillas to dry pan and cook for 40 to 60 seconds per side. Keep cooked tortillas in warm oven until ready to use.To assemble, spoon shredded chicken onto tortillas and top with shredded cabbage and chimichurri. Serve immediately.*Masa Harina flour is a made from lime-soaked corn kernels. You can find it in the international aisle of most major grocery stores or Mexican food stores, or online.', u'spoonacularSourceUrl': u'https://spoonacular.com/soft-chicken-tacos-with-cilantro-chimichurri-and-homemade-corn-tortillas-494345', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}