{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532816-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 532816, u'veryPopular': True, u'lowFodmap': False, u'title': u'White Chocolate Blackberry Ice Cream', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 242.88, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'12 oz. (about 2 heaping cups) fresh blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9042, u'unit': u'cups'}, {u'originalString': u'2 oz. white chocolate, chopped or in the form of chips', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19003, u'unit': u'oz'}, {u'originalString': u'8 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1.5 cups half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'2 cups milk (I used skim)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(I used skim)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 1/3 cup sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/white-chocolate-blackberry-ice-cream/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 40, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small saucepan, combine blackberries and 1/3 cup of the sugar over medium heat. Cook, stirring every few minutes, until  you have a nice thick syrup - about 20 minutes. Strain blackberry syrup into a small bowl through a mesh colander and set aside. Discard any leftover blackberry bits or pulp. In a large saucepan, combine half-and-half and milk over medium heat.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk occasionally and bring to a simmer. While milk mixture is heating up, combine remaining sugar (1 cup), vanilla extract, and egg yolks.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk by hand (or, if you're lazy like me, use an electric hand mixer!) until eggs have lightened in color. When milk mixture has reached a simmer, it's time to temper the eggs!", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u"Add a few tablespoons of hot liquid at a time to the egg mixture, whisking constantly, until you've incorporated about half of the hot milk mixture into the eggs. At this point, you can pour the the egg mixture back into the saucepan, whisking to incorporate. Return saucepan to the stove over low heat.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add blackberry mixture to milk/egg mixture in the saucepan and whisk to combine. Stir frequently until the custard has thickened and coats the back of a spoon, about 3 minutes (see this post for some step-by-step pictures!)', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place white chocolate in a large bowl. When ice cream has thickened, remove it from the heat and pour it over the white chocolate. Stir the mixture until chocolate has melted into the ice cream base.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u"Let the custard cool on the counter for 15-20 minutes, then place it in the fridge uncovered for 30 minutes to an hour. After an hour, cover the mixture with an airtight lid or some plastic wrap and let it chill in the fridge for at least eight hours or overnight. You're ready to churn the ice cream (YAY!)", u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u'Pour the ice cream base into your ice cream maker and churn according to manufacturer instructions. Eat it right away soft-serve style or pop it in an airtight container and freeze it for an hour or two before digging in.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 499, u'instructions': u"In a small saucepan, combine blackberries and 1/3 cup of the sugar over medium heat. Cook, stirring every few minutes, until  you have a nice thick syrup - about 20 minutes. Strain blackberry syrup into a small bowl through a mesh colander and set aside. Discard any leftover blackberry bits or pulp. In a large saucepan, combine half-and-half and milk over medium heat. Whisk occasionally and bring to a simmer. While milk mixture is heating up, combine remaining sugar (1 cup), vanilla extract, and egg yolks. Whisk by hand (or, if you're lazy like me, use an electric hand mixer!) until eggs have lightened in color. When milk mixture has reached a simmer, it's time to temper the eggs! Add a few tablespoons of hot liquid at a time to the egg mixture, whisking constantly, until you've incorporated about half of the hot milk mixture into the eggs. At this point, you can pour the the egg mixture back into the saucepan, whisking to incorporate. Return saucepan to the stove over low heat.Add blackberry mixture to milk/egg mixture in the saucepan and whisk to combine. Stir frequently until the custard has thickened and coats the back of a spoon, about 3 minutes (see this post for some step-by-step pictures!)Place white chocolate in a large bowl. When ice cream has thickened, remove it from the heat and pour it over the white chocolate. Stir the mixture until chocolate has melted into the ice cream base.Let the custard cool on the counter for 15-20 minutes, then place it in the fridge uncovered for 30 minutes to an hour. After an hour, cover the mixture with an airtight lid or some plastic wrap and let it chill in the fridge for at least eight hours or overnight. You're ready to churn the ice cream (YAY!) Pour the ice cream base into your ice cream maker and churn according to manufacturer instructions. Eat it right away soft-serve style or pop it in an airtight container and freeze it for an hour or two before digging in.", u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-blackberry-ice-cream-532816', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}