{u'recipes': [{u'sourceName': u'Chef Druck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/580450-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 580450, u'veryPopular': False, u'lowFodmap': False, u'title': u'Holiday Baking: No Bake Chocolate Peanut Butter Balls', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 41.47, u'creditText': u'Chef Druck', u'extendedIngredients': [{u'originalString': u'6 ounces of whipped cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 package Oreo Cookies (16.6 ounces) (Do not use double stuffed! Save those for eating)', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'for eating)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.6, u'consistency': u'liquid', u'id': 10018166, u'unit': u'ounces'}, {u'originalString': u'12 ounces of semi-sweet chocolate (340 grams) (have a little extra on hand in case you run out)', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'(have a little extra on hand in case you run out)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 340.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'grams'}, {u'originalString': u'1/3 cups of smooth Planters Peanut Butter (or your favorite brand)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [u'your favorite', u'(or brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 16150, u'unit': u'cups'}, {u'originalString': u'Any sprinkles or decorations you want to add', u'aisle': u'?', u'name': u'decorations you want to add', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 36.0, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 15.0, u'sourceUrl': u'http://chefdruck.com/2013/12/holiday-baking-no-bake-chocolate-peanut-butter-balls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cleaver.jpg', u'id': 404632, u'name': u'cleaver'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the Oreos in a bowl and crush with a meat cleaver. This is my type of holiday therapy! Alternatively, you could put them in two ziplock bags (one inside the other) and tell your kids to go nuts on them. Once the Oreos are in coarse chunks, place them in the food processor and pulse them a few times.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the cream cheese and the peanut butter to food processor and pulse until well blended. This is tough work for your mixer, and should make you pause and appreciate the conveniences of modern life! You will have to open the lid and move the contents around many times until you get the right consistency. You’ll know when you’re done. The mixture will be glistening, dark, and smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u"Roll mixture into small balls and place on wax paper on a cookie sheet.Chill in fridge for 30 minutes to an hour hour.Melt the chocolate in the microwave in 30 second increments, stirring with a dry spoon until smooth and beautiful.Dip oreo balls in chocolate. This can be messy if you don’t use a spoon. Resist the temptation to use your fingers or you will have unappetizing fingerprints on your Oreo balls. I prefer to dump the balls one by one in the melted chocolate, move them around with a spoon and scoop them out with the same spoon once they're thoroughly covered onto a wax paper covered cookie sheet.Decorate the balls with sprinkles if desired. I prefer a smoother coating. My kids like them covered with sprinkles. To each his own.Chill again in the fridge for 30 minutes.Keep in the fridge until ready to serve. Dust with cocoa or powdered sugar before serving.", u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 51, u'instructions': u"Pour the Oreos in a bowl and crush with a meat cleaver. This is my type of holiday therapy! Alternatively, you could put them in two ziplock bags (one inside the other) and tell your kids to go nuts on them. Once the Oreos are in coarse chunks, place them in the food processor and pulse them a few times.Add the cream cheese and the peanut butter to food processor and pulse until well blended. This is tough work for your mixer, and should make you pause and appreciate the conveniences of modern life! You will have to open the lid and move the contents around many times until you get the right consistency. You’ll know when you’re done. The mixture will be glistening, dark, and smooth.Roll mixture into small balls and place on wax paper on a cookie sheet.Chill in fridge for 30 minutes to an hour hour.Melt the chocolate in the microwave in 30 second increments, stirring with a dry spoon until smooth and beautiful.Dip oreo balls in chocolate. This can be messy if you don’t use a spoon. Resist the temptation to use your fingers or you will have unappetizing fingerprints on your Oreo balls. I prefer to dump the balls one by one in the melted chocolate, move them around with a spoon and scoop them out with the same spoon once they're thoroughly covered onto a wax paper covered cookie sheet.Decorate the balls with sprinkles if desired. I prefer a smoother coating. My kids like them covered with sprinkles. To each his own.Chill again in the fridge for 30 minutes.Keep in the fridge until ready to serve. Dust with cocoa or powdered sugar before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/holiday-baking-no-bake-chocolate-peanut-butter-balls-580450', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}