{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205590-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205590, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spiked Thin Mint Milkshake', u'diets': [u'gluten free'], u'pricePerServing': 224.43, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 cups chocolate ice cream (about 12 ounces / 4 medium scoops)', u'aisle': u'Frozen', u'name': u'chocolate ice cream', u'metaInformation': [u'medium', u'( 12 ounces / 4 scoops)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 19270, u'unit': u'cups'}, {u'originalString': u'1 ounces peppermint schnapps or ULLR Peppermint Cinnamon Schnapps', u'aisle': u'Alcoholic Beverages', u'name': u'cinnamon schnapps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shot-of-liquor.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 93731, u'unit': u'ounces'}, {u'originalString': u'1/2 cup mint chip ice cream (about 3 ounces / 1 medium scoop)', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'medium', u'( 3 ounces / 1 scoop)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19095, u'unit': u'cup'}, {u'originalString': u'16 Thin Mint cookies, plus additional for garnish', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'for garnish', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 2064, u'unit': u''}, {u'originalString': u'1 ounce blanco tequila', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 10814037, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'Garnish: whipped cream and crumbled Thin Mints', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [u'crumbled', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}, {u'originalString': u'3/4 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/03/spiked-thin-mint-milkshake-girl-scout-cookies-shake-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add milk and cocoa powder to a blender and blend until well mixed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add chocolate ice cream and mint chip ice cream, mint schnapps, tequila, and Thin Mints to blender. Pur\xe9e until smooth. Divide between serving glasses.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-ice-cream.png', u'id': 19270, u'name': u'chocolate ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 10814037, u'name': u'tequila'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Garnish with whipped cream and crumbled Thin Mints.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Milkshake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 548, u'instructions': u'Procedures                                                                              1                                                                            Add milk and cocoa powder to a blender and blend until well mixed.                                                                                                                             2                                                                            Add chocolate ice cream and mint chip ice cream, mint schnapps, tequila, and Thin Mints to blender. Pur\xe9e until smooth. Divide between serving glasses. Garnish with whipped cream and crumbled Thin Mints.', u'spoonacularSourceUrl': u'https://spoonacular.com/spiked-thin-mint-milkshake-205590', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}