{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/200101-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 200101, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cook the Book: Thai Beef Salad', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 446.5, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u"2 fresh red bird's-eye chiles, halved lengthwise, seeded, and thinly sliced lengthwise", u'aisle': u'Produce;Ethnic Foods', u'name': u"bird's eye chiles", u'metaInformation': [u'fresh', u'red', u'halved lengthwise', u'seeded', u'thinly sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11670, u'unit': u''}, {u'originalString': u'8 ounces cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'ounces'}, {u'originalString': u'1 large cucumber, halved lengthwise and thinly sliced on the diagonal (do not peel)', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'large', u'halved lengthwise', u'thinly sliced', u'(do not peel)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'2 tablespoons Vietnamese fish sauce, preferably Phu Quoc brand', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoons'}, {u'originalString': u'1 bunch fresh basil, leaves only, large leaves torn', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'bunch'}, {u'originalString': u'1 bunch fresh cilantro, leaves only', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'1 cup fresh mint, leaves only, large leaves torn', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'4 fresh kaffir lime leaves, center veins removed, cut into julienne', u'aisle': u'Ethnic Foods', u'name': u'kaffir lime leaves', u'metaInformation': [u'fresh', u'cut into julienne'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 93633, u'unit': u''}, {u'originalString': u'3 tablespoons freshly squeezed lime or lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup toasted peanuts, coarsely chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'toasted', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 16091, u'unit': u'cup'}, {u'originalString': u'1 red onion, peeled, halved crosswise, and cut into thin rings', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'peeled', u'halved', u'cut into thin rings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 pound rare roast beef, cut across the grain into paper-thin slices, then into thin strips', u'aisle': u'Meat', u'name': u'roast beef', u'metaInformation': [u'paper-thin', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 93713, u'unit': u'pound'}, {u'originalString': u'1 tablespoon best quality sesame oil (such as Leblanc)', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'(such as Leblanc)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons tamari or other Japanese soy sauce', u'aisle': u'Ethnic Foods', u'name': u'tamari', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'teaspoons'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/07/cook-the-book-thai-beef-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In the small jar, whisk together the citrus juice, fish sauce, sesame oil, tamari, ginger, and garlic. Cover and shake to blend. Taste for seasoning.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10116124, u'name': u'tamari'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Layer the beef in a glass or ceramic dish.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour half the dressing over the beef. Cover and refrigerate for 2 hours, turning the meat from time to time, to infuse the meat with the dressing.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'At serving time, combine the tomatoes, cucumber, onion, and chiles in a large, shallow bowl. Toss with the remaining dressing.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the beef and toss to coat.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve, garnished with the herbs, peanuts, and kaffir lime leaves.\xa0', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'id': 93633, u'name': u'kaffir lime leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1002044, u'name': u'herbs'}]}], u'name': u''}], u'aggregateLikes': 80, u'instructions': u'Procedures                                                                              1                                                                            In the small jar, whisk together the citrus juice, fish sauce, sesame oil, tamari, ginger, and garlic. Cover and shake to blend. Taste for seasoning.                                                                                                                            2                                                                            Layer the beef in a glass or ceramic dish. Pour half the dressing over the beef. Cover and refrigerate for 2 hours, turning the meat from time to time, to infuse the meat with the dressing.                                                                                                                            3                                                                            At serving time, combine the tomatoes, cucumber, onion, and chiles in a large, shallow bowl. Toss with the remaining dressing. Add the beef and toss to coat. Serve, garnished with the herbs, peanuts, and kaffir lime leaves.\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-thai-beef-salad-200101', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}