{u'recipes': [{u'sourceName': u'Skinny Mom', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/666923-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 666923, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skinny Chili Mac Casserole', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 181.86, u'creditText': u'Skinny Mom', u'extendedIngredients': [{u'originalString': u'1 tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'14.5 oz can tomatoes, diced', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'16 oz can chili beans', u'aisle': u'Canned and Jarred', u'name': u'chili beans', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 43112, u'unit': u'oz'}, {u'originalString': u'1 Tbsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'Tbsp'}, {u'originalString': u'4 oz can diced green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'diced', u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'oz'}, {u'originalString': u'1 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 lb lean ground turkey', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'1 cup reduced-fat, shredded Mexican cheese blend', u'aisle': u'Cheese', u'name': u'low fat shredded mexican cheese blend', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-mexican-cheese-blend.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1209, u'unit': u'cup'}, {u'originalString': u'1 small onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup whole grain rotini pasta', u'aisle': u'Pasta and Rice', u'name': u'rotini pasta', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11320420, u'unit': u'cup'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'6 oz can tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11887, u'unit': u'oz'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.skinnymom.com/skinny-chili-mac-casserole/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.Cook pasta according to package instructions and add 1 tsp salt to boiling water.In a large skillet over medium heat, add extra virgin olive oil.Brown onion, minced garlic and turkey for 7-10 minutes until onions have softened and turkey is browned and cooked.Next add chopped sweet peppers (if using) and chopped green chilies.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10511282, u'name': u'yellow onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add in chili beans, diced tomatoes, tomato paste, chili powder, ground cumin and black pepper.Stir all ingredients together over low heat.After pasta has been cooked and drained, add pasta to turkey and bean mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'id': 43112, u'name': u'chili beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Mix all ingredients together with a spoon or spatula, and transfer ingredients to a casserole dish.Sprinkle 1 cup of reduced-fat shredded Mexican cheese blend on top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-mexican-cheese-blend.jpg', u'id': 1209, u'name': u'low fat shredded mexican cheese blend'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake chili mac in oven for 15-20 minutes until cheese is melted and bubbly. * This dish freezes nicely. To freeze, omit the cheese and baking. After mixing all the ingredients together on stove top, add to a container and freeze. Before serving, thaw mixture, add to casserole dish, top with cheese and bake to heat through.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are great choices for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Juve Y Camps Brut Nature Reserva de la Familia Cava. It has 4.3 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats. View More', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Preheat oven to 375 degrees.Cook pasta according to package instructions and add 1 tsp salt to boiling water.In a large skillet over medium heat, add extra virgin olive oil.Brown onion, minced garlic and turkey for 7-10 minutes until onions have softened and turkey is browned and cooked.Next add chopped sweet peppers (if using) and chopped green chilies.Add in chili beans, diced tomatoes, tomato paste, chili powder, ground cumin and black pepper.Stir all ingredients together over low heat.After pasta has been cooked and drained, add pasta to turkey and bean mixture.Mix all ingredients together with a spoon or spatula, and transfer ingredients to a casserole dish.Sprinkle 1 cup of reduced-fat shredded Mexican cheese blend on top.Bake chili mac in oven for 15-20 minutes until cheese is melted and bubbly. * This dish freezes nicely. To freeze, omit the cheese and baking. After mixing all the ingredients together on stove top, add to a container and freeze. Before serving, thaw mixture, add to casserole dish, top with cheese and bake to heat through.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-chili-mac-casserole-666923', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl', u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}