{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/544070-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 544070, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cinnamon Roll Rice Krispie Treats', u'diets': [], u'pricePerServing': 56.54, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'1/4 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'4 oz cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 (10.5 oz) bag miniature marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.5, u'consistency': u'solid', u'id': 19116, u'unit': u'oz'}, {u'originalString': u'2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'6 cups Rice Krispies Cereal', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 8065, u'unit': u'cups'}, {u'originalString': u'1/8 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tsp unsulphured molasses', u'aisle': u'Baking', u'name': u'unsulphured molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.cookingclassy.com/2012/01/cinnamon-roll-rice-krispie-treats/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Butter a 9x13 dish, set aside.  Melt butter in a large saucepan over medium low heat.  Stir in salt, molasses, and cinnamon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add marshmallows and stir constantly until marshmallows have completely melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in vanilla.  Fold in Rice Krispies Cereal, stirring until evenly coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'id': 8065, u'name': u'rice krispies cereal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Pour Rice Krispie Treat mixture into buttered dish.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread mixture evenly into pan with a buttered spatula.  Allow to cool several minutes, then cut while still slightly warm.  Using your hands, round edges of cut squares by cupping your hands around the edges and gently pressing.  Allow to cool completely then pipe Cream Cheese Frosting over tops of Cinnamon', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404725, u'name': u'butter knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll Rice Krispie Treats.  Optional, dust the tops lightly with cinnamon.Alternately, for a simpler method, simply spread Rice Krispie Treats mixture into buttered pan after folding in cereal.  Allow them to cool then spread Cream Cheese Frosting evenly over top with a butter knife or an icing spatula.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Cut into squares.In a mixing bowl, using an electric mixer, whip together butter and cream cheese until fluffy.  Stir in vanilla.  Slowly add in powdered sugar and mix until smooth and fluffy.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Rice Crispy Treats. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 330, u'instructions': u'Butter a 9x13 dish, set aside.  Melt butter in a large saucepan over medium low heat.  Stir in salt, molasses, and cinnamon.  Add marshmallows and stir constantly until marshmallows have completely melted.  Remove from heat and stir in vanilla.  Fold in Rice Krispies Cereal, stirring until evenly coated.  Pour Rice Krispie Treat mixture into buttered dish.  Spread mixture evenly into pan with a buttered spatula.  Allow to cool several minutes, then cut while still slightly warm.  Using your hands, round edges of cut squares by cupping your hands around the edges and gently pressing.  Allow to cool completely then pipe Cream Cheese Frosting over tops of Cinnamon Roll Rice Krispie Treats.  Optional, dust the tops lightly with cinnamon.Alternately, for a simpler method, simply spread Rice Krispie Treats mixture into buttered pan after folding in cereal.  Allow them to cool then spread Cream Cheese Frosting evenly over top with a butter knife or an icing spatula.  Cut into squares.In a mixing bowl, using an electric mixer, whip together butter and cream cheese until fluffy.  Stir in vanilla.  Slowly add in powdered sugar and mix until smooth and fluffy.', u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-roll-rice-krispie-treats-544070', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}