{u'recipes': [{u'sourceName': u'Real Simple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/2482-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 2482, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pan-roasted Cod And Fennel With Spinach Couscous', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 58.17, u'creditText': u'Real Simple', u'extendedIngredients': [{u'originalString': u'1 cup couscous', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'couscous', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20028, u'unit': u'cup'}, {u'originalString': u'1/4 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 bulb fennel, cut into wedges', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'1 1/2 lbs skinless cod or some other firm white fish fillets', u'aisle': u'Seafood', u'name': u'fish fillets', u'metaInformation': [u'skinless', u'white', u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10115261, u'unit': u'lbs'}, {u'originalString': u'2 cups flat-leaf spinach (1 1/2 ozs), chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'solid', u'id': 11297, u'unit': u'ozs'}, {u'originalString': u'1/2 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'kosher salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 Tbsps olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsps'}, {u'originalString': u'1 medium red onion, cut into wedges', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.realsimple.com/food-recipes/browse-all-recipes/pan-roasted-cod-fennel-couscous-00100000066547/index.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 400 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large ovenproof skillet over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the fennel, onion, and  teaspoon each salt and pepper. Cook, tossing frequently, until beginning to soften, 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the wine.Season the cod with the coriander and  teaspoon each salt and pepper and nestle in the vegetables.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer the skillet to oven and roast until the cod is opaque throughout, 8 to 12 minutes.Meanwhile, cook the couscous according to the package directions. Fluff with a fork and fold in the spinach.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}]}, {u'equipment': [], u'step': u'Serve with the cod and vegetables.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Vampire Pinot Grigio Wine. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This dry, zestful combination is reminiscent of ripe pears and roses', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Directions            Heat oven to 400 F. Heat the oil in a large ovenproof skillet over medium-high heat. Add the fennel, onion, and  teaspoon each salt and pepper. Cook, tossing frequently, until beginning to soften, 8 to 10 minutes. Add the wine.Season the cod with the coriander and  teaspoon each salt and pepper and nestle in the vegetables. Transfer the skillet to oven and roast until the cod is opaque throughout, 8 to 12 minutes.Meanwhile, cook the couscous according to the package directions. Fluff with a fork and fold in the spinach. Serve with the cod and vegetables.', u'spoonacularSourceUrl': u'https://spoonacular.com/pan-roasted-cod-and-fennel-with-spinach-couscous-2482', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 30, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}