{u'recipes': [{u'sourceName': u'My Gourmet Connection', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/499569-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 499569, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oven-Roasted Snapper with Tomato and Caper Salsa', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'pricePerServing': 239.17, u'creditText': u'My Gourmet Connection', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons capers, well drained', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons extra virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons fresh parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'Juice of 1 lemon, divided', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Fresh parsley and lemon wedges for garnish', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'3 plum tomatoes, seeded and cut into 1/4-inch pieces', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'seeded', u'cut into 1/4-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'3 tablespoons red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tablespoons'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 red snapper fillet (about 1 lb)', u'aisle': u'Seafood', u'name': u'snapper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-snapper-fresh.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15101, u'unit': u'lb'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.mygourmetconnection.com/recipes/main-courses/fish-shellfish/oven-roasted-snapper-tomato-caper-salsa.php', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the snapper, skin side down on the prepared pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snapper.jpg', u'id': 15101, u'name': u'snapper'}]}, {u'equipment': [], u'step': u'Drizzle with about 1-1/2 tablespoons lemon juice and 1 tablespoon of olive oil. Season with salt and pepper and set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Red Snapper works really well with Pinot Noir, Pinot Grigio, and Gruener Veltliner. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is J Vineyards & Winery Pinot Noir. It has 5 out of 5 stars and a bottle costs about 48 dollars.", u'pairedWines': [u'pinot noir', u'pinot grigio', u'gruener veltliner'], u'productMatches': [{u'description': u'At J, we are devoted to the concept of terroir in the Russian River Valley, and our 2013 J Vineyards Pinot Noir is a reflection of this vintage, the vineyards and our attention to detail in the winery. Delivering bright berry flavors-red cherry, raspberry and blackberry- this elegant Pinot is enhanced by notes of licorice and red tea, which linger on the finish. Aromas of wild strawberries and spices delight the nose.', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'Preparation:Preheat the oven to 425\xb0F, line a shallow-sided baking pan with foil and spray with nonstick spray. Place the snapper, skin side down on the prepared pan. Drizzle with about 1-1/2 tablespoons lemon juice and 1 tablespoon of olive oil. Season with salt and pepper and set aside.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-roasted-snapper-with-tomato-and-caper-salsa-499569', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}