{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528478-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 528478, u'veryPopular': False, u'lowFodmap': True, u'title': u'Mango Margaritas', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 277.21, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'1 limes', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/2 cup Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 Tbsp Coarse Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}, {u'originalString': u'1 1/2 cup Tequila', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 10814037, u'unit': u'cup'}, {u'originalString': u'1 1/2 cup Triple Sec', u'aisle': u'Alcoholic Beverages', u'name': u'triple sec', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 14534, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.countrycleaver.com/2012/05/pw-wednesday-carnitas-pizza-and-mango-margaritas.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Zest limes, combine zest with 2 tablespoons of sugar. Use to coat rims of margarita glasses by swiping wedge of lime along rim of glass and dip glasses into into sugar/lime mix. Set aside.In blender combine remaining ingredients, including juice of both zested limes. Blend until smooth. Distribute amongst glasses and enjoy!', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 9, u'instructions': u'Zest limes, combine zest with 2 tablespoons of sugar. Use to coat rims of margarita glasses by swiping wedge of lime along rim of glass and dip glasses into into sugar/lime mix. Set aside.In blender combine remaining ingredients, including juice of both zested limes. Blend until smooth. Distribute amongst glasses and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-margaritas-528478', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}