{u'recipes': [{u'sourceName': u'Pale Omg', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719759-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 719759, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Raspberry Caramel Ice Cream', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 146.09, u'creditText': u'Pale Omg', u'extendedIngredients': [{u'originalString': u'1⁄4 teaspoon coarse sea salt (extra for garnishing)', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [u'for garnishing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup heavy cream or full-fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full-fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'Your choice of ice cream (I used Vanilla Coconut Bliss Ice Cream or you could make your own vanilla ice cream)', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'(I used Vanilla Coconut Bliss Ice Cream or you could make your own vanilla ice cream)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}, {u'originalString': u'1 cup fine maple sugar', u'aisle': u'Gourmet;Baking', u'name': u'maple sugar', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19340, u'unit': u'cup'}, {u'originalString': u'1 10 ounce bag of frozen raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 9302, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://paleomg.com/salted-raspberry-caramel-ice-cream/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}], u'step': u'In a small saucepan over medium heat, combine cream, maple sugar, vanilla extract and salt. Stir until completely combined.Bring to a boil, then set a timer for 12 minutes, being sure not to let the mixture boil over. After 12 minutes, reduce the heat to low and simmer for 5 more minutes or until the caramel coats the back of a spoon.', u'length': {u'number': 29, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 19340, u'name': u'maple sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat, let cool.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place a small saucepan over medium heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add raspberries and honey.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Mix for about 10 minutes until raspberries have completely broken down into a sauce.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place in a blender to puree then press puree through a fine mesh strainer using a spoon to get out all of the puree, leaving behind the seeds.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the raspberry puree into the caramel sauce, place over medium heat and mix to combine and soften.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Pour raspberry caramel sauce over ice cream and top with coarse sea salt.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'coarse sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Vanillan Ice Cream. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 465, u'instructions': u'In a small saucepan over medium heat, combine cream, maple sugar, vanilla extract and salt. Stir until completely combined.Bring to a boil, then set a timer for 12 minutes, being sure not to let the mixture boil over. After 12 minutes, reduce the heat to low and simmer for 5 more minutes or until the caramel coats the back of a spoon.Remove from the heat, let cool.Place a small saucepan over medium heat. Add raspberries and honey. Mix for about 10 minutes until raspberries have completely broken down into a sauce. Place in a blender to puree then press puree through a fine mesh strainer using a spoon to get out all of the puree, leaving behind the seeds.Pour the raspberry puree into the caramel sauce, place over medium heat and mix to combine and soften.Pour raspberry caramel sauce over ice cream and top with coarse sea salt.', u'spoonacularSourceUrl': u'https://spoonacular.com/salted-raspberry-caramel-ice-cream-719759', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}