{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/514795-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 514795, u'veryPopular': True, u'lowFodmap': False, u'title': u'Quinoa and Cucumber Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 106.04, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'\xbd tsp. dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'tsp'}, {u'originalString': u'1\xbd c. English cucumber, sliced thin', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10111205, u'unit': u'c'}, {u'originalString': u'1 clove garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'\xbc tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp. Pompeian olive oil (Koroneiki if available)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'(Koroneiki if available)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbe c. uncooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20035, u'unit': u'c'}, {u'originalString': u'1-2 Roma tomatoes, seeded and diced', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'diced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'\xbd sweet onion, sliced thin', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'2 tbsp. white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tbsp'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://wearychef.com/quinoa-cucumber-salad-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, stir together lemon juice, vinegar, olive oil, garlic, salt, pepper, and basil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add cucumber, onion, and tomato, and stir to coat. Cover tightly and refrigerate at least one hour or up to 24 hours. (You could serve this cucumber salad on its own!)At least 30 minutes before ready to serve, bring quinoa, 1\xbd c. water, and a couple pinches of salt to a boil. Reduce heat to simmer, cover, and cook 20 minutes. Then, transfer cooked quinoa to a serving bowl, fluff with fork, and allow to cool at least 10 minutes.Stir cucumber mixture into quinoa and serve.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1433, u'instructions': u'In a medium bowl, stir together lemon juice, vinegar, olive oil, garlic, salt, pepper, and basil. Add cucumber, onion, and tomato, and stir to coat. Cover tightly and refrigerate at least one hour or up to 24 hours. (You could serve this cucumber salad on its own!)At least 30 minutes before ready to serve, bring quinoa, 1\xbd c. water, and a couple pinches of salt to a boil. Reduce heat to simmer, cover, and cook 20 minutes. Then, transfer cooked quinoa to a serving bowl, fluff with fork, and allow to cool at least 10 minutes.Stir cucumber mixture into quinoa and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/quinoa-and-cucumber-salad-514795', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}