{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557425-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 557425, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rose Colored Couscous (Israeli Couscous with Beets and Walnuts)', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 91.66, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'2 medium beets, roasted (see instructions in the note below)', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'medium', u'(see instructions in the note below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'2 cups cooked Israeli couscous (you can use regular couscous)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'cooked israeli couscous', u'metaInformation': [u'cooked', u'canned', u'(you can use regular couscous)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-israeli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020029, u'unit': u'cups'}, {u'originalString': u'a handful of fresh dill fronds, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'handful'}, {u'originalString': u'handful of parsley leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'salt and fresh cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'a handful of good walnuts, roughly chopped', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'good', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'handful'}, {u'originalString': u"1 Tbsp za'atar (see recipe below)", u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u"za'atar", u'metaInformation': [u'(see recipe below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zaatar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002042, u'unit': u'Tbsp'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2013/06/rose-colored-couscous-israeli-couscous-with-beets-and-walnuts.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Chop the beets into a small dice while they are still warm.  Toss with the couscous, breaking up any lumps with a fork.Toss with the herbs and nuts.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [], u'step': u'Mix the za’atar with the olive oil and lemon juice, and add to the salad.  Toss well.  Refrigerate for at least an hour or two to allow it to get completely chilled, and for the flavors to mingle.  Check the seasonings and serve garnished with a few more nuts and herbs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 179, u'instructions': u'<p>Chop the beets into a small dice while they are still warm.  Toss with the couscous, breaking up any lumps with a fork.</p><p>Toss with the herbs and nuts.</p><p>Mix the za’atar with the olive oil and lemon juice, and add to the salad.  Toss well.  Refrigerate for at least an hour or two to allow it to get completely chilled, and for the flavors to mingle.  Check the seasonings and serve garnished with a few more nuts and herbs.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/rose-colored-couscous-israeli-couscous-with-beets-and-walnuts-557425', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}