{u'recipes': [{u'sourceName': u'Beyond Frosting', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590923-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590923, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Butter & Jelly Mini Shortbread Cookie Sandwiches', u'diets': [], u'pricePerServing': 52.88, u'creditText': u'Beyond Frosting', u'extendedIngredients': [{u'originalString': u'2 bags Walkers Mini Crunchy Oatmeal Cookie', u'aisle': u'Sweet Snacks', u'name': u'cookie', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'bags', u'unitShort': u'bags', u'amount': 2.0, u'consistency': u'liquid', u'id': 10118192, u'unit': u'bags'}, {u'originalString': u'1 tbsp Heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tbsp'}, {u'originalString': u'⅛ C Jelly (flavor; I like Raspberry)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jelly', u'metaInformation': [u'(flavor; I like Raspberry)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.125, u'consistency': u'solid', u'id': 19297, u'unit': u'C'}, {u'originalString': u'\xbd C Peanut butter at room temperature', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16098, u'unit': u'C'}, {u'originalString': u'1 C Powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'C'}, {u'originalString': u'\xbc C Unsalted butter at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'C'}, {u'originalString': u'\xbd tsp Pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://beyondfrosting.com/2013/08/05/pbj-shortbread-cookie-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Allow butter and peanut butter to come to room temperature.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine in a medium-sized bowl and cream together until smooth using the wire whisk attachment on the mixer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add powered sugar and blend into peanut butter.Last, add heavy whipping cream and vanilla extract. Whip until smooth.Spoon a teaspoon of peanut butter frosting onto a cookie, top with a little bit of jelly and cover with another cookie.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 109, u'instructions': u'Allow butter and peanut butter to come to room temperature. Combine in a medium-sized bowl and cream together until smooth using the wire whisk attachment on the mixer.Add powered sugar and blend into peanut butter.Last, add heavy whipping cream and vanilla extract. Whip until smooth.Spoon a teaspoon of peanut butter frosting onto a cookie, top with a little bit of jelly and cover with another cookie.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-jelly-mini-shortbread-cookie-sandwiches-590923', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 28, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}