{u'recipes': [{u'sourceName': u'Healthy Seasonal Recipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/524227-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 524227, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Reuben Quesadilla with Pear', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 148.99, u'creditText': u'Healthy Seasonal Recipes', u'extendedIngredients': [{u'originalString': u'pinch celery salt', u'aisle': u'Spices and Seasonings', u'name': u'celery salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1052047, u'unit': u'pinch'}, {u'originalString': u'1 tablespoon ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'tablespoon'}, {u'originalString': u'2 8-inch multi-grain tortillas', u'aisle': u'Bakery/Bread', u'name': u'multi-grain bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 2.0, u'consistency': u'solid', u'id': 18075, u'unit': u'8-inch'}, {u'originalString': u'\xbd teaspoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoon'}, {u'originalString': u'\xbd ripe pear, core removed and thinly sliced', u'aisle': u'Produce', u'name': u'pear', u'metaInformation': [u'ripe', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 teaspoons pickle relish', u'aisle': u'Condiments', u'name': u'pickle relish', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 11944, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup sauerkraut', u'aisle': u'Canned and Jarred', u'name': u'sauerkraut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauerkraut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11439, u'unit': u'cup'}, {u'originalString': u'2 ounces shredded Cabot Vermont Sharp Cheddar', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'ounces'}, {u'originalString': u'4 ounces thinly-sliced pepper turkey deli meat', u'aisle': u'Meat', u'name': u'turkey deli meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/deli-turkey.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 7259, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons Cabot Greek-style 2% plain yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'plain', u'2%', u'greek-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.healthyseasonalrecipes.com/turkey-reuben-quesadilla-pear/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together Cabot Greek-style plain yogurt, ketchup, relish, celery seed and pepper in a small bowl. Lay tortillas out on work surface.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'plain yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Spread dressing out over entire tortilla, leaving a \xbd-inch boarder along the edge. Arrange turkey slices on one side of  both of the tortillas. Top with pear, sauerkraut and cheddar. Fold plain side of the tortillas over to create quesadilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauerkraut.jpg', u'id': 11439, u'name': u'sauerkraut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush oil over the bottom of a large skillet, and place over medium heat. Arrange quesadillas in the skillet, and cook until browned on bottom, 4 to 5 minutes. Carefully turn over, reduce heat to medium-low and continue cooking until the bottom is browned and the cheese is melted 3 to 4 minutes longer.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}], u'step': u'Cut with a sharp serrated knife and serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Quesadilla works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is The Donum Estate Russian River Valley Pinot Noir. It has 4.9 out of 5 stars and a bottle costs about 67 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'This Pinot Noir displays abundant and intense aromas of ripe black fruits, including cherry, plum and raspberry, in a complex and concentrated nose. Smooth and richly textured, the wine offers great depth of black cherry, berry and cola flavors with notes of mineral and spice on a bright and long-lasting finish. View More', u'title': u'The Donum Estate Russian River Valley Pinot Noir', u'price': u'$66.99', u'id': 433784, u'link': u'https://www.wine.com/product/the-donum-estate-russian-river-valley-pinot-noir-2009/121584', u'imageUrl': u'https://spoonacular.com/productImages/433784-312x231.jpg'}]}, u'aggregateLikes': 301, u'instructions': u'Whisk together Cabot Greek-style plain yogurt, ketchup, relish, celery seed and pepper in a small bowl. Lay tortillas out on work surface. Spread dressing out over entire tortilla, leaving a \xbd-inch boarder along the edge. Arrange turkey slices on one side of  both of the tortillas. Top with pear, sauerkraut and cheddar. Fold plain side of the tortillas over to create quesadilla.  Brush oil over the bottom of a large skillet, and place over medium heat. Arrange quesadillas in the skillet, and cook until browned on bottom, 4 to 5 minutes. Carefully turn over, reduce heat to medium-low and continue cooking until the bottom is browned and the cheese is melted 3 to 4 minutes longer. Cut with a sharp serrated knife and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-reuben-quesadilla-with-pear-524227', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}