{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557522-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 557522, u'veryPopular': False, u'lowFodmap': False, u'title': u'Minimal Monday: Celery Salad with Walnut Vinaigrette', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 47.47, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'1 head of celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'head'}, {u'originalString': u'salt and fresh cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 Tbsp walnut vinegar (or white wine, or champagne vinegar)', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut', u'metaInformation': [u'white', u'(or wine, or champagne vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12155, u'unit': u'Tbsp'}, {u'originalString': u'walnut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'walnut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnut-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4528, u'unit': u'servings'}, {u'originalString': u'1/4 cup fresh walnuts, rough chopped, plus more for garnishing', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'fresh', u'plus more for garnishing', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2014/04/minimal-monday-celery-salad-with-walnut-vinaigrette.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse the celery well and remove the tough outer stalks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut off the root end but keep the whole head together.Thinly slice the head of celery, cutting on the diagonal.  Use a sharp knife to get clean cuts.To make the dressing, put 1/4 cup of the nuts in a small 4-cup food processor.  Process them until finely ground, you will have to scrape down the sides once or twice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Add the vinegar and process again.  Then, while the machine is running, drizzle in the oil until you have an emulsion.  Stop the machine and taste as you go until you get a balance of acidity that appeals to you.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add salt and freshly cracked black pepper to taste.Toss the celery with enough dressing to coat lightly, and then put in the refrigerator for an hour or so.When ready to serve, top the salad more rough chopped walnuts and more dressing.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 125, u'instructions': u'Rinse the celery well and remove the tough outer stalks.  Cut off the root end but keep the whole head together.Thinly slice the head of celery, cutting on the diagonal.  Use a sharp knife to get clean cuts.To make the dressing, put 1/4 cup of the nuts in a small 4-cup food processor.  Process them until finely ground, you will have to scrape down the sides once or twice.  Add the vinegar and process again.  Then, while the machine is running, drizzle in the oil until you have an emulsion.  Stop the machine and taste as you go until you get a balance of acidity that appeals to you.  Add salt and freshly cracked black pepper to taste.Toss the celery with enough dressing to coat lightly, and then put in the refrigerator for an hour or so.When ready to serve, top the salad more rough chopped walnuts and more dressing.', u'spoonacularSourceUrl': u'https://spoonacular.com/minimal-monday-celery-salad-with-walnut-vinaigrette-557522', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}