{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598709-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 598709, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Seed Mole | Mole Verde', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 340.48, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 cups chicken stock or broth', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 teaspoon cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'1 cup packed coarsely chopped fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'packed', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 cup fresh epazote (optional)', u'aisle': u'Produce;Ethnic Foods', u'name': u'fresh epazote', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10098908, u'unit': u'cup'}, {u'originalString': u'1 cup coarsely chopped fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'5 garlic cloves, halved', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 jalape\xf1o peppers, sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 tablespoon vegetable or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon dried oregano (optional)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 cup shelled pumpkin seeds', u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12014, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'5 tomatillos, husked and halved', u'aisle': u'Produce', u'name': u'tomatillos', u'metaInformation': [u'husked', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11954, u'unit': u''}, {u'originalString': u'1 white onion, cut into wedges', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://leitesculinaria.com/74276/recipes-pumpkin-seed-mole.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet with high sides or in a large saucepan over medium-high heat, toast the pumpkin seeds, cumin seeds, and oregano, if using, until fragrant, 3 to 4 minutes. Toss frequently to make sure they don’t burn.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the heat and transfer to a spice grinder or a blender and process until finely ground.2. In the same skillet, heat the oil over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, tomatillos, garlic, and jalape\xf1os and cook until slightly browned, 4 to 5 minutes, tossing a couple of times but not too much.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the vegetables in a blender or food processor, then add the broth, cilantro, parsley, epazote (if using), and salt and process until pur\xe9ed.3.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/epazote.jpg', u'id': 98908, u'name': u'epazote'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the mixture back into the skillet and add the ground pumpkin seed mixture.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let simmer gently until the flavors are melded, stirring occasionally, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately. (Leftovers—if there are any—can be refrigerated in an airtight container for up to a couple of days.)', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 163, u'instructions': u'1. In a large skillet with high sides or in a large saucepan over medium-high heat, toast the pumpkin seeds, cumin seeds, and oregano, if using, until fragrant, 3 to 4 minutes. Toss frequently to make sure they don’t burn. Remove from the heat and transfer to a spice grinder or a blender and process until finely ground.2. In the same skillet, heat the oil over medium-high heat. Add the onion, tomatillos, garlic, and jalape\xf1os and cook until slightly browned, 4 to 5 minutes, tossing a couple of times but not too much. Place the vegetables in a blender or food processor, then add the broth, cilantro, parsley, epazote (if using), and salt and process until pur\xe9ed.3. Pour the mixture back into the skillet and add the ground pumpkin seed mixture. Let simmer gently until the flavors are melded, stirring occasionally, about 15 minutes. Serve immediately. (Leftovers—if there are any—can be refrigerated in an airtight container for up to a couple of days.)', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-seed-mole-mole-verde-598709', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}