{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/246306-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 246306, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tempura Squid', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 75, u'pricePerServing': 234.1, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'A deep fryer', u'aisle': u'Refrigerated;Frozen', u'name': u'deep dish pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18945, u'unit': u'servings'}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3/4 cup rice or regular flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'Canola oil or peanut oil for frying (high smoke point vegetable oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'for frying', u'(high smoke point vegetable oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'servings'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup ice cold sparkling water (the colder the better)', u'aisle': u'Beverages', u'name': u'sparkling water', u'metaInformation': [u'ice cold', u'(the colder the better)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'cup'}, {u'originalString': u'1 pound cleaned squid', u'aisle': u'Seafood', u'name': u'squid', u'metaInformation': [u'cleaned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamari-or-squid.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15175, u'unit': u'pound'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/tempura_squid/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'1 Slice the squid tubes into rings about 1/2-inch to 3/4-inch wide. Leave the tentacles whole.2 This recipe was designed for a deep-fryer, but you can also fill a large, heavy-bottomed pot (keep a lid nearby, for safety reasons) halfway with oil, about 3 inches deep.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamari-or-squid.jpg', u'id': 15175, u'name': u'squid'}]}, {u'equipment': [], u'step': u'Heat the oil to 360-370\xb0F. 3 While the oil is heating, mix all the dry ingredients together well.4 Once the oil has reached 360\xb0F, take the sparkling water out of the refrigerator and mix it with the egg yolk. Immediately mix it in with the dry ingredients.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chopsticks.jpg', u'id': 405596, u'name': u'chopsticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Mix quickly. Do not worry if there are clumps or lumps. Over-mixing may cause the batter to become chewy when cooked.5 Working in small batches at a time (about 8 pieces), dip the squid pieces in the batter. Pick them up one by one and gently put them in the hot oil. (Note if your fingers are coated with the batter, it will help protect them from splatter.) When the squid pieces are in the oil, use a chopstick or the handle of a wooden spoon to dislodge any squid pieces that may have become stuck from the bottom of the pot or fryer. Fry for 45 seconds to 1 minute, and remove to paper towels to drain.  Note that when done, they will NOT be golden brown, but more of a pale yellow or tan.  Repeat with the rest of the squid. Working in batches will help keep the oil temperature from falling too far while you are frying the squid.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamari-or-squid.jpg', u'id': 15175, u'name': u'squid'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Serve immediately with lime or lemon wedges, soy sauce, ponzu sauce, Tabasco or another hot sauce.Once the cooking oil has completely cooled (after about 2 hours), strain it through a paper towel-lined sieve, and save it to reuse the next time you want to deep fry seafood.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tempura can be paired with Sparkling Wine, Sparkling ros\xe9, and Riesling. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Banfi Rosa Regale Brachetto with a 4.8 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose', u'riesling', u'sake', u'sauvignon blanc'], u'productMatches': [{u'description': u'Festive cranberry in color with an aromatic bouquet with hints of raspberries, strawberries and rose. A fresh raspberry taste, with crisp acidity, enticing the palate with an initial softness, graduating to a round and luscious finish. View More', u'title': u'Banfi Rosa Regale Brachetto', u'price': u'$20.99', u'id': 433356, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-2015/152879', u'imageUrl': u'https://spoonacular.com/productImages/433356-312x231.jpg'}]}, u'aggregateLikes': 275, u'instructions': u'1 Slice the squid tubes into rings about 1/2-inch to 3/4-inch wide. Leave the tentacles whole.2 This recipe was designed for a deep-fryer, but you can also fill a large, heavy-bottomed pot (keep a lid nearby, for safety reasons) halfway with oil, about 3 inches deep.  Heat the oil to 360-370\xb0F. 3 While the oil is heating, mix all the dry ingredients together well.4 Once the oil has reached 360\xb0F, take the sparkling water out of the refrigerator and mix it with the egg yolk. Immediately mix it in with the dry ingredients. Mix quickly. Do not worry if there are clumps or lumps. Over-mixing may cause the batter to become chewy when cooked.5 Working in small batches at a time (about 8 pieces), dip the squid pieces in the batter. Pick them up one by one and gently put them in the hot oil. (Note if your fingers are coated with the batter, it will help protect them from splatter.) When the squid pieces are in the oil, use a chopstick or the handle of a wooden spoon to dislodge any squid pieces that may have become stuck from the bottom of the pot or fryer. Fry for 45 seconds to 1 minute, and remove to paper towels to drain.  Note that when done, they will NOT be golden brown, but more of a pale yellow or tan.  Repeat with the rest of the squid. Working in batches will help keep the oil temperature from falling too far while you are frying the squid.Serve immediately with lime or lemon wedges, soy sauce, ponzu sauce, Tabasco or another hot sauce.Once the cooking oil has completely cooled (after about 2 hours), strain it through a paper towel-lined sieve, and save it to reuse the next time you want to deep fry seafood.', u'spoonacularSourceUrl': u'https://spoonacular.com/tempura-squid-246306', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}