{u'recipes': [{u'sourceName': u"Renee's Kitchen Adventures", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/718063-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 718063, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blood Orange, Beet, and Apple Salad with Goat Cheese and Citrus Honey Vinaigrette', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 490.79, u'creditText': u"Renee's Kitchen Adventures", u'extendedIngredients': [{u'originalString': u'1/2 medium apple (I used Fuji but Granny Smith would be awesome too!) cored, and sliced thinly', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'cored', u'medium', u'sliced', u'(I used Fuji but Granny Smith would be awesome too!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'2 Tbs apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'Tbs'}, {u'originalString': u'2 - 3 cups baby greens and baby spinach mix', u'aisle': u'Produce', u'name': u'baby greens', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'1 blood orange, peeled and cut into sections (as shown in photos)', u'aisle': u'Produce', u'name': u'blood orange', u'metaInformation': [u'peeled', u'cut into sections (as shown in photos)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blood-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009200, u'unit': u''}, {u'originalString': u'juice of 1 blood orange', u'aisle': u'Beverages', u'name': u'blood orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blood-orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009206, u'unit': u''}, {u'originalString': u'1/2 tsp, Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'2 Tbs goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 1159, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbs'}, {u'originalString': u'juice of half a lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 cup cubed pickled beets (or cold, fresh, roasted beets)', u'aisle': u'Canned and Jarred', u'name': u'pickled beets', u'metaInformation': [u'fresh', u'cold', u'cubed', u'(or , , roasted beets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-beets.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11084, u'unit': u'cup'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'serving'}, {u'originalString': u'2 Tbs chopped walnuts', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 12155, u'unit': u'Tbs'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.reneeskitchenadventures.com/2016/02/blood-orange-beet-and-apple-salad-with.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Arrange greens, beets, apple slices, orange sections, goat cheese and walnuts on a plate. In a small jar, combine all the dressing ingredients up to the olive oil.  Put lid on and shake well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-slices.png', u'id': 1019200, u'name': u'orange slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Add olive oil and shake well again. Dress salad with about 2 TBS of the dressing.  Store unused dressing in refrigerator for up to a few days.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'aggregateLikes': 309, u'instructions': u'Arrange greens, beets, apple slices, orange sections, goat cheese and walnuts on a plate. In a small jar, combine all the dressing ingredients up to the olive oil.  Put lid on and shake well.  Add olive oil and shake well again. Dress salad with about 2 TBS of the dressing.  Store unused dressing in refrigerator for up to a few days.', u'spoonacularSourceUrl': u'https://spoonacular.com/blood-orange-beet-and-apple-salad-with-goat-cheese-and-citrus-honey-vinaigrette-718063', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}