{u'recipes': [{u'sourceName': u'Healthy Green Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552318-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 552318, u'veryPopular': True, u'lowFodmap': True, u'title': u's for Gluten-Free Chocolate Chip Cookies', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'pricePerServing': 12.74, u'creditText': u'Healthy Green Kitchen', u'extendedIngredients': [{u'originalString': u'*1 large egg, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'*8 tablespoons (1 stick) cold unsalted butter, cut into 1-inch pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into 1-inch pieces', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'*1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'*210 grams Whole-Grain Gluten-Free Flour Mix (see description in the body of this post above)', u'aisle': u'Gluten Free;Health Foods', u'name': u'whole grain oat flour', u'metaInformation': [u'gluten-free', u'(see description in the body of this post above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 210.0, u'consistency': u'solid', u'id': 20132, u'unit': u'grams'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.healthygreenkitchen.com/gluten-free-chocolate-chip-cookies.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [], u'name': u'Preheat the oven to 350\xb0F. Line a baking sheet with parchment paper.2. Combining the dry ingredients'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the cold butter cubes to the bowl of a stand mixer. With the paddle attachment, run the mixer on medium speed until the butter is creamy and softened.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the brown sugar and sucanat. Blend them together on medium speed until the mixture is light and fluffy, about 3 minutes. Use a rubber spatula to scrape down the sides of the bowl.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the egg and mix until all traces of egg disappear into the batter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in the vanilla.4. Finishing the batter:  With the mixer running, add the flour a scoop at a time. When all the flour has been added and all trace of flour has disappeared into the batter, scrape down the sides of the bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add the chocolate and hazelnuts.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix until just combined. Turn the cookie dough out of the bowl onto a clean surface. If there is any flour, chocolate, or hazelnuts left in the bowl, mix them to the dough.5. Baking the cookies: Scoop 30 grams of cookie dough into your hands. Shape it into a ball. Put it on the lined baking sheet, then flatten it a bit with your palm. Smooth out the edges of the cookie disc. Repeat until you end up with 6 cookies on the baking sheet with about 3 inches of space between them.6.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake until the edges are crisp and the center is still soft to the touch, about 12 minutes, turning the tray 180 degrees in the oven halfway through baking. Carefully move the parchment paper to a counter and bake the rest of the cookies.Feel Like Playing?Need I tell you that these cookies are best warm from the oven? However, you do need to let them cool a bit before you eat them. Hot out of the oven, they are still a little fragile. Just warm to the touch, they are heaven.If you can’t find hazelnuts, walnuts will do just fine.These cookies also improve in flavor if you refrigerate the dough overnight. You can roll the dough into 3 logs, cover them in plastic wrap, and have cookie dough waiting to make a couple of cookies an evening, if you prefer.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u'Whisk together the flour, psyllium husks, salt, baking powder, and baking soda until they have become one color.3. Creaming the butter and sugar'}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 2382, u'instructions': u'1. Preheat the oven to 350\xb0F. Line a baking sheet with parchment paper.2. Combining the dry ingredients: Whisk together the flour, psyllium husks, salt, baking powder, and baking soda until they have become one color.3. Creaming the butter and sugar:  Add the cold butter cubes to the bowl of a stand mixer. With the paddle attachment, run the mixer on medium speed until the butter is creamy and softened. Add the brown sugar and sucanat. Blend them together on medium speed until the mixture is light and fluffy, about 3 minutes. Use a rubber spatula to scrape down the sides of the bowl. Add the egg and mix until all traces of egg disappear into the batter. Mix in the vanilla.4. Finishing the batter:  With the mixer running, add the flour a scoop at a time. When all the flour has been added and all trace of flour has disappeared into the batter, scrape down the sides of the bowl. Add the chocolate and hazelnuts. Mix until just combined. Turn the cookie dough out of the bowl onto a clean surface. If there is any flour, chocolate, or hazelnuts left in the bowl, mix them to the dough.5. Baking the cookies: Scoop 30 grams of cookie dough into your hands. Shape it into a ball. Put it on the lined baking sheet, then flatten it a bit with your palm. Smooth out the edges of the cookie disc. Repeat until you end up with 6 cookies on the baking sheet with about 3 inches of space between them.6. Bake until the edges are crisp and the center is still soft to the touch, about 12 minutes, turning the tray 180 degrees in the oven halfway through baking. Carefully move the parchment paper to a counter and bake the rest of the cookies.Feel Like Playing?Need I tell you that these cookies are best warm from the oven? However, you do need to let them cool a bit before you eat them. Hot out of the oven, they are still a little fragile. Just warm to the touch, they are heaven.If you can’t find hazelnuts, walnuts will do just fine.These cookies also improve in flavor if you refrigerate the dough overnight. You can roll the dough into 3 logs, cover them in plastic wrap, and have cookie dough waiting to make a couple of cookies an evening, if you prefer.', u'spoonacularSourceUrl': u'https://spoonacular.com/s-for-gluten-free-chocolate-chip-cookies-552318', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}