{u'recipes': [{u'sourceName': u'Merry Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/587329-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 587329, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Bundt Cake', u'diets': [], u'pricePerServing': 75.38, u'creditText': u'Merry Gourmet', u'extendedIngredients': [{u'originalString': u'1-1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup mini chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u'cups'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup Grand Marnier', u'aisle': u'Alcoholic Beverages', u'name': u'grand marnier', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10314534, u'unit': u'cup'}, {u'originalString': u'2 cups granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 sticks (1 cup) unsalted butter, cut into 1-inch pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.merrygourmet.com/2011/12/a-few-days-of-quiet-and-a-chocolate-bundt-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees and place oven rack in the middle position. Spray the bundt pan well with baking spray with flour, or butter the pan well and dust with cocoa powder (about 3 tablespoons), knocking out the excess.Over medium heat, heat coffee, Grand Marnier, butter, and cocoa powder together in a 3-quart saucepan, whisking until the butter is melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'id': 10314534, u'name': u'grand marnier'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Remove from heat, add sugar, and stir well until dissolved, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer mixture to a large bowl and cool for at least 5 minutes.While the chocolate mixture cools, whisk together flour, baking soda, and salt in a bowl. In a second, smaller bowl, whisk together eggs and vanilla, then whisk into the cooled chocolate mixture until well incorporated.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add flour mixture and whisk until just combined. Batter will be thin and bubbly at this point. Fold in chocolate chips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour batter into bundt pan and bake for 45-50 minutes, until a wooden toothpick inserted in the center comes out clean.Cool cake completely in pan on a rack, approximately 2 hours, then loosen cake from pan using the tip of a sharp knife. Carefully invert pan over a cake plate and turn cake out onto plate.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Bundt Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 158, u'instructions': u'Preheat oven to 325 degrees and place oven rack in the middle position. Spray the bundt pan well with baking spray with flour, or butter the pan well and dust with cocoa powder (about 3 tablespoons), knocking out the excess.Over medium heat, heat coffee, Grand Marnier, butter, and cocoa powder together in a 3-quart saucepan, whisking until the butter is melted. Remove from heat, add sugar, and stir well until dissolved, about 1 minute. Transfer mixture to a large bowl and cool for at least 5 minutes.While the chocolate mixture cools, whisk together flour, baking soda, and salt in a bowl. In a second, smaller bowl, whisk together eggs and vanilla, then whisk into the cooled chocolate mixture until well incorporated. Add flour mixture and whisk until just combined. Batter will be thin and bubbly at this point. Fold in chocolate chips. Pour batter into bundt pan and bake for 45-50 minutes, until a wooden toothpick inserted in the center comes out clean.Cool cake completely in pan on a rack, approximately 2 hours, then loosen cake from pan using the tip of a sharp knife. Carefully invert pan over a cake plate and turn cake out onto plate.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-bundt-cake-587329', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}