{u'recipes': [{u'sourceName': u'Real Housemoms', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/802717-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 802717, u'veryPopular': False, u'lowFodmap': True, u'title': u'Orange Spice Old Fashioned', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'pricePerServing': 294.58, u'creditText': u'Real Housemoms', u'extendedIngredients': [{u'originalString': u'2 large orange peels', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'pinch of cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'pinch'}, {u'originalString': u'4 ounces lemon lime soda (such as 7UP, or Sierra Mist)', u'aisle': u'Beverages', u'name': u'lemon lime soda', u'metaInformation': [u'(such as 7UP, or Sierra Mist)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 14144, u'unit': u'ounces'}, {u'originalString': u'even small pinch of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'3 dashes of orange bitters', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 9200, u'unit': u'dashes'}, {u'originalString': u'1/2 teaspoon of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2 ounces whiskey or brandy', u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 14052, u'unit': u'ounces'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://realhousemoms.com/orange-spice-old-fashioned/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}], u'step': u'In the bottom of a small tumbler, add the orange peels, sugar, and spices. Muddle together. (I just used the end of an ice cream scoop.)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the orange bitters, whiskey or brandy, soda, and top with ice. Stir to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}]}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u'In the bottom of a small tumbler, add the orange peels, sugar, and spices. Muddle together. (I just used the end of an ice cream scoop.)Add the orange bitters, whiskey or brandy, soda, and top with ice. Stir to combine.', u'spoonacularSourceUrl': u'https://spoonacular.com/orange-spice-old-fashioned-802717', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}