{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/600673-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 600673, u'veryPopular': True, u'lowFodmap': False, u'title': u'Popeye’s Cajun Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 65.21, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1/2 cup Finely Dice Bell Pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10211821, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Celery Flakes', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'teaspoon'}, {u'originalString': u'4 cup Long Grain Rice Cooked and Drained', u'aisle': u'Pasta and Rice', u'name': u'cooked long grain rice', u'metaInformation': [u'long grain', u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cup'}, {u'originalString': u'1 teaspoon Creole Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'creole seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002031, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Garlic Powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup Diced Green Onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 pound Lean Ground Beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon Red Pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'teaspoon'}, {u'originalString': u'1/4 - 1/3 cup Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.copykat.com/2009/02/06/popeyes-cajun-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In fry pan stir in ground beef, bell pepper and cook on medium high heat until beef looses its pink color and bell pepper is soft.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [], u'step': u'Remove excess grease. Turn temperature down to medium or medium low.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u"Add remaining ingredients, stir and cook together until ground beef is completely cooked and liquid is gone about 25 - 35 min. More Creole seasoning and red pepper may be added for that Cajun at Heart. I like to use Tony Chacheres's.", u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1002031, u'name': u'creole seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Albarino, ros\xe9 Wine, and Sauvignon Blanc are great choices for Cajun. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. One wine you could try is Martin Codax Albarino. It has 4.1 out of 5 stars and a bottle costs about 17 dollars.', u'pairedWines': [u'albarino', u'rose wine', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Martin Codax 2011 Rias Baixas Albarino is delicate and medium-bodied with a crisp, dry finish. Flavors of ripe apple, peach, pear and lemon zest are framed by bright minerality and hints of spice. This Albari\xf1o displays intense floral aromas and an attractive acidity, making it a versatile, food-friendly wine.', u'title': u'Martin Codax Albarino', u'price': u'$16.99', u'id': 436904, u'link': u'https://www.wine.com/product/martin-codax-albarino-2011/121023', u'imageUrl': u'https://spoonacular.com/productImages/436904-312x231.jpg'}]}, u'aggregateLikes': 502, u'instructions': u"In fry pan stir in ground beef, bell pepper and cook on medium high heat until beef looses its pink color and bell pepper is soft. Remove excess grease. Turn temperature down to medium or medium low. Add remaining ingredients, stir and cook together until ground beef is completely cooked and liquid is gone about 25 - 35 min. More Creole seasoning and red pepper may be added for that Cajun at Heart. I like to use Tony Chacheres's.", u'spoonacularSourceUrl': u'https://spoonacular.com/popeyes-cajun-rice-600673', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}