{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/396345-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 396345, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Sweet Potato Fries', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 71.1, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 cup black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'cup'}, {u'originalString': u'1/4 cup garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'cup'}, {u'originalString': u'Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'Olive Oil, for tossing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for tossing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1 cup salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'cup'}, {u'originalString': u'5 sweet potatoes, peeled and sliced into 1/4-inch long slices, then 1/4-wide inch strips, using a crinkle cut knife', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'peeled', u'sliced into 1/4-inch long slices, then 1/4-wide inch strips, using a crinkle cut knife'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/paula-deen/baked-sweet-potato-fries-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Line a sheet tray with parchment. In a large bowl toss sweet potatoes with just enough oil to coat. Sprinkle with House Seasoning and paprika.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread sweet potatoes in single layer on prepared baking sheet, being sure not to overcrowd.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Bake until sweet potatoes are tender and golden brown, turning occasionally, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Let cool 5 to 10 minutes before serving.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Mix ingredients together and store in an airtight container for up to 6 months.', u'number': 1, u'ingredients': []}], u'name': u'For the House Seasoning'}], u'aggregateLikes': 231, u'instructions': u'Preheat oven to 450 degrees F.                          Line a sheet tray with parchment. In a large bowl toss sweet potatoes with just enough oil to coat. Sprinkle with House Seasoning and paprika. Spread sweet potatoes in single layer on prepared baking sheet, being sure not to overcrowd. Bake until sweet potatoes are tender and golden brown, turning occasionally, about 20 minutes. Let cool 5 to 10 minutes before serving.                          For the House Seasoning: Mix ingredients together and store in an airtight container for up to 6 months.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-sweet-potato-fries-396345', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}