{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/616716-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 616716, u'veryPopular': False, u'lowFodmap': False, u'title': u'Wholemeal Maple Pecan Buns', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 73.73, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'Salted treacle butter, to serve*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'2 1/4 teaspoons dried yeast', u'aisle': u'Baking', u'name': u'dried yeast', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'2 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup raw pecans, chopped, plus 12 pecan halves, to serve', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'raw', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1 3/4 cups plain flour, plus more for kneading', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain', u'plus more for kneading'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'Flaky salt, for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'4 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'teaspoon'}, {u'originalString': u'1 3/4 cups whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 20080, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.halfbakedharvest.com/wholemeal-maple-pecan-buns/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a large bowl, stir together the flour, yeast, honey or sugar and salt. Make a well in the centre of the ingredients, crack in the egg and pour in 1 cup lukewarm water. Stir with your hands, then tip out onto a lightly floured surface. Knead the dough for 10 minutes, adding a little more flour if needed, until you have a smooth, slightly sticky ball of dough.Oil the bowl and place the dough in it. Cover with a clean kitchen towel and leave to rise in a warm place for 1 hour, or until doubled in size.Liberally butter a 12-cup muffin tin. In a small saucepan, heat the maple syrup, sugar, butter, salt and milk over a medium-low heat, stirring gently, until melted and combined. Bring to a simmer then remove from the heat. Divide the pecans and the maple mixture between the cups of the buttered muffin tin.Punch down the bread dough and divide it into 12 balls then place a ball of dough in each muffin cup. Cover with oiled plastic wrap and leave to rise in a warm place for 3045 minutes, until doubled in size. Preheat the oven to 350 degree F.Once the buns have risen, remove the plastic wrap and bake them for 2025 minutes until puffed and golden brown. Immediately flip the hot tin upside down onto a cooling rack and leave for 5 minutes. Lift up the muffin tin and scrape out any of the maple topping that may be stuck, placing it on top of the buns. Top each bun with a pecan half and a sprinkle of flaky salt.', u'length': {u'number': 5085, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve warm with the salted treacle butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 153, u'instructions': u'In a large bowl, stir together the flour, yeast, honey or sugar and salt. Make a well in the centre of the ingredients, crack in the egg and pour in 1 cup lukewarm water. Stir with your hands, then tip out onto a lightly floured surface. Knead the dough for 10 minutes, adding a little more flour if needed, until you have a smooth, slightly sticky ball of dough.Oil the bowl and place the dough in it. Cover with a clean kitchen towel and leave to rise in a warm place for 1 hour, or until doubled in size.Liberally butter a 12-cup muffin tin. In a small saucepan, heat the maple syrup, sugar, butter, salt and milk over a medium-low heat, stirring gently, until melted and combined. Bring to a simmer then remove from the heat. Divide the pecans and the maple mixture between the cups of the buttered muffin tin.Punch down the bread dough and divide it into 12 balls then place a ball of dough in each muffin cup. Cover with oiled plastic wrap and leave to rise in a warm place for 3045 minutes, until doubled in size. Preheat the oven to 350 degree F.Once the buns have risen, remove the plastic wrap and bake them for 2025 minutes until puffed and golden brown. Immediately flip the hot tin upside down onto a cooling rack and leave for 5 minutes. Lift up the muffin tin and scrape out any of the maple topping that may be stuck, placing it on top of the buns. Top each bun with a pecan half and a sprinkle of flaky salt. Serve warm with the salted treacle butter.', u'spoonacularSourceUrl': u'https://spoonacular.com/wholemeal-maple-pecan-buns-616716', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}