{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/487172-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 487172, u'veryPopular': False, u'lowFodmap': False, u'title': u'Savory Tater Tot Casserole', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 177.44, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (19 ounce) can cream of chicken soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 19.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'ounce'}, {u'originalString': u'1 1/2 pounds lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 23557, u'unit': u'pounds'}, {u'originalString': u'4 cups frozen mixed vegetables', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'mixed', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11583, u'unit': u'cups'}, {u'originalString': u'1/2 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 (32 ounce) package frozen potato rounds', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 11362, u'unit': u'ounce'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Savory-Tater-Tot-Casserole/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/glass-baking-tray.jpg', u'id': 406921, u'name': u'glass baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F (190 degrees C). Spray 9x13 glass baking dish with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread hamburger into bottom of pan, covering entire bottom, gently tamping beef down. Sprinkle with diced onions. Layer frozen veggies as next layer. Cover with the soup, straight from the can, carefully spreading with spatula to cover entirely.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Layer tater tots on top, covering entire top with tots.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 degrees F (190 degrees) for 1 hour, or until hamburger is done. Check after 30 minutes; if tots are getting too brown, turn down to 350 degrees F (190 degrees C).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 268, u'instructions': u'Preheat oven to 375 degrees F (190 degrees C). Spray 9x13 glass baking dish with cooking spray.                            Spread hamburger into bottom of pan, covering entire bottom, gently tamping beef down. Sprinkle with diced onions. Layer frozen veggies as next layer. Cover with the soup, straight from the can, carefully spreading with spatula to cover entirely.                            Layer tater tots on top, covering entire top with tots.  Bake at 375 degrees F (190 degrees) for 1 hour, or until hamburger is done. Check after 30 minutes; if tots are getting too brown, turn down to 350 degrees F (190 degrees C).                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/savory-tater-tot-casserole-487172', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}