{u'recipes': [{u'sourceName': u'Serena Bakes Simple from Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520279-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 520279, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten Free Egg Free Double Chocolate Peanut Butter Bite Cookies', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 21.7, u'creditText': u'Serena Bakes Simple from Scratch', u'extendedIngredients': [{u'originalString': u'1 teaspoon Baking Powder Gluten Free', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [u'gluten free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'15 ounce Canned Chickpeas, Rinsed And Drained Well', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'canned', u'rinsed', u'drained', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'1/4 cup + 2 tablespoons Cocoa Powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1/2 cup Honey or Agave Or 3/4 cup Brown Sugar', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'3/4 cup All Natural Peanut Butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1 pinch Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1/2 cup Semi Sweet Chocolate Chips, Gluten Free', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'gluten free', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.serenabakessimplyfromscratch.com/2013/01/gluten-free-egg-free-double-chocolate.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a blender or food processor combine chickpeas, cocoa powder, honey, peanut butter, baking powder, sea salt and vanilla. Pulse until mixture is smooth and creamy like peanut butter. Scrape the sides of bowl as needed to make a uniform texture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add chocolate chips and fold until combined.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Using a cookie scoop or tablespoon make 1" balls and place on a parchment or silpat lined baking sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake cookies for 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Allow to cool on cookie sheet for 3-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cookies are best enjoyed warm.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 160, u'instructions': u'Preheat oven to 375 degrees.                    In a blender or food processor combine chickpeas, cocoa powder, honey, peanut butter, baking powder, sea salt and vanilla. Pulse until mixture is smooth and creamy like peanut butter. Scrape the sides of bowl as needed to make a uniform texture.                    Add chocolate chips and fold until combined.                    Using a cookie scoop or tablespoon make 1" balls and place on a parchment or silpat lined baking sheet.                    Bake cookies for 12 minutes.                    Allow to cool on cookie sheet for 3-5 minutes.                    Cookies are best enjoyed warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-egg-free-double-chocolate-peanut-butter-bite-cookies-520279', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}