{u'recipes': [{u'sourceName': u'Life Made Simple', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/802365-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 37, u'id': 802365, u'veryPopular': False, u'lowFodmap': False, u'title': u'45 Minute Skillet Lasagna', u'diets': [], u'preparationMinutes': 8, u'pricePerServing': 162.23, u'creditText': u'Life Made Simple', u'extendedIngredients': [{u'originalString': u'1 (14.5 oz) can tomato sauce, divided', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'divided', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'1 (14.5 oz.) can diced tomatoes, divided', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'divided', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'\xbd cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'6 oz. cremini mushrooms, sliced', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'\xbd tsp. dried parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2029, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. fresh basil, julienned (optional)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tbsp'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp. Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'tsp'}, {u'originalString': u'4-5 sheets dried lasagna (depending on the size of your skillet)**', u'aisle': u'Pasta and Rice', u'name': u'lasagna pasta', u'metaInformation': [u'dried', u'(depending on the size of your skillet)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 4.0, u'consistency': u'solid', u'id': 10620420, u'unit': u'sheets'}, {u'originalString': u'1 lb. lean ground beef (I used 93%)*', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'93%', u'lean', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'1\xbd tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 small onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1\xbd c. grated part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1028, u'unit': u'c'}, {u'originalString': u'\xbd tsp. kosher sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1 c. chopped fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'c'}, {u'originalString': u'2 tbsp. tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://lifemadesimplebakes.com/2016/09/45-minute-skillet-lasagna/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.In a large, deep skillet set over medium-high heat, add the olive oil. When the oil is hot, add the mushrooms and saut until brown, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onion and saut until translucent, about 3 minutes, then add the garlic and cook until fragrant, about 1 minute.Turn the heat to high and make push the vegetables to the edges of the pan.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the beef and cook until browned, breaking it up as it cooks.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the spinach and cook until wilted, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add half of the diced tomatoes, half of the tomato sauce, along with the tomato paste, chicken broth, Italian seasoning, salt and pepper. Bring to a simmer, then reduce heat to medium-low and let simmer for 5 minutes.In a small bowl, whisk together the remaining diced tomatoes and tomato sauce along with the Italian seasoning, dried parsley, garlic powder, salt, and pepper.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 2029, u'name': u'dried parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Remove the skillet from the stove. Slide one lasagna sheet under the filling into the center of the skillet, then break another sheet into four pieces. Slide those under the filling and around the edges. This will create the bottom layer.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the filling into an even layer over top.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining sheets of lasagna over top (same method: full sheet in the center of the pan, remaining sheet broken into pieces to cover the remaining area or edges).', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the sauce over top, then sprinkle on the cheese. Cover with lid and bake for 20 minutes, then remove lid and bake for 5 minutes uncovered.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow to set for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with basil, if desired.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Tiamo Chianti. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 10 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Intense ruby red with garnet tones.  Intense, fruity with persistent aromas of spices and licorice. Full with good acidity and balanced tannins.Tiamo is bottled at Chianti DOCG, and certified as made with 100% organic grapes.  View More', u'title': u'Tiamo Chianti', u'price': u'$9.95', u'id': 441645, u'link': u'https://www.wine.com/product/tiamo-chianti-2009/107710', u'imageUrl': u'https://spoonacular.com/productImages/441645-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Preheat oven to 375 degrees.In a large, deep skillet set over medium-high heat, add the olive oil. When the oil is hot, add the mushrooms and saut until brown, about 4 minutes. Add the onion and saut until translucent, about 3 minutes, then add the garlic and cook until fragrant, about 1 minute.Turn the heat to high and make push the vegetables to the edges of the pan. Add the beef and cook until browned, breaking it up as it cooks. Add the spinach and cook until wilted, about 2 minutes.Add half of the diced tomatoes, half of the tomato sauce, along with the tomato paste, chicken broth, Italian seasoning, salt and pepper. Bring to a simmer, then reduce heat to medium-low and let simmer for 5 minutes.In a small bowl, whisk together the remaining diced tomatoes and tomato sauce along with the Italian seasoning, dried parsley, garlic powder, salt, and pepper.Remove the skillet from the stove. Slide one lasagna sheet under the filling into the center of the skillet, then break another sheet into four pieces. Slide those under the filling and around the edges. This will create the bottom layer. Spread the filling into an even layer over top. Add the remaining sheets of lasagna over top (same method: full sheet in the center of the pan, remaining sheet broken into pieces to cover the remaining area or edges). Spread the sauce over top, then sprinkle on the cheese. Cover with lid and bake for 20 minutes, then remove lid and bake for 5 minutes uncovered.Remove from the oven and allow to set for 5 minutes. Garnish with basil, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/45-minute-skillet-lasagna-802365', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}