{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/700490-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 700490, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marshmallow Crisp Milkshake', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 130.26, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup Rice Krispies\xae cereal, divided plus additional for garnish', u'aisle': u'Cereal', u'name': u'cereal', u'metaInformation': [u'divided', u'for garnish', u'rice krispies\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bran-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8029, u'unit': u'cup'}, {u'originalString': u'2 cups Rice Krispies\xae cereal', u'aisle': u'Cereal', u'name': u'cereal', u'metaInformation': [u'rice krispies\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bran-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8029, u'unit': u'cups'}, {u'originalString': u'1\xbd cups marshmallow fluff', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'marshmallow fluff', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 93644, u'unit': u'cups'}, {u'originalString': u'1\xbc cup mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19116, u'unit': u'cup'}, {u'originalString': u'4 cups vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}, {u'originalString': u'1 cup whole milk, plus two tablespoons', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.afamilyfeast.com/marshmallow-crisp-milkshake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Spray an 8x8-inch baking pan with non-stick cooking spray.In a saucepan, melt butter and mini marshmallows over low heat, stirring until completely melted and well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Remove from heat.Stir in Rice Krispies cereal and stir until well coated.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the marshmallow and cereal mixture into the prepared pan and using a buttered spatula or wax paper, press mixture firmly into the pan.Cool completely, then cut into long narrow triangles for garnishing the milkshake. (Best if served the same day. Extras may be stored in an airtight container for up to a day or so.)In a small saucepan, combine 1 cup milk and 1 cups marshmallow fluff. Over low heat and stirring frequently, heat just until marshmallow fluff completely dissolves.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93644, u'name': u'marshmallow cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'id': 8029, u'name': u'cereal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from heat and chill to cool.Just before serving, prepare 2 tall or 4 short glasses for serving.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour 2 tablespoons of milk into a wide shallow bowl. In another wide shallow bowl, pour  cup of the Rice Krispies cereal. Dip the rim of the glass into the milk, then the cereal and allow the cereal to dry on the rim of the glasses.In a blender, pour in the cooled milk and marshmallow mixture, then add the ice cream. Blend until smooth and frothy.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'id': 8029, u'name': u'cereal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add  cup of Rice Krispies cereal and briefly pulse again until combined.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the milkshake mixture into the prepared glasses, and top with a prepared Rice Krispies Treat.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 110, u'instructions': u'Spray an 8x8-inch baking pan with non-stick cooking spray.In a saucepan, melt butter and mini marshmallows over low heat, stirring until completely melted and well combined. Remove from heat.Stir in Rice Krispies cereal and stir until well coated. Pour the marshmallow and cereal mixture into the prepared pan and using a buttered spatula or wax paper, press mixture firmly into the pan.Cool completely, then cut into long narrow triangles for garnishing the milkshake. (Best if served the same day. Extras may be stored in an airtight container for up to a day or so.)In a small saucepan, combine 1 cup milk and 1 cups marshmallow fluff. Over low heat and stirring frequently, heat just until marshmallow fluff completely dissolves. Remove from heat and chill to cool.Just before serving, prepare 2 tall or 4 short glasses for serving. Pour 2 tablespoons of milk into a wide shallow bowl. In another wide shallow bowl, pour  cup of the Rice Krispies cereal. Dip the rim of the glass into the milk, then the cereal and allow the cereal to dry on the rim of the glasses.In a blender, pour in the cooled milk and marshmallow mixture, then add the ice cream. Blend until smooth and frothy. Add  cup of Rice Krispies cereal and briefly pulse again until combined.Pour the milkshake mixture into the prepared glasses, and top with a prepared Rice Krispies Treat.', u'spoonacularSourceUrl': u'https://spoonacular.com/marshmallow-crisp-milkshake-700490', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}