{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/565273-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 565273, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom Spaghetti', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 185.52, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'20 grams butter cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'1/2 tsp dried chilli flakes (or substitute with finely chopped chilli padi)', u'aisle': u'Spices and Seasonings', u'name': u'dried chilli flakes', u'metaInformation': [u'dried', u'with finely chopped chilli padi)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'20 grams Italian flat-leaf parsley finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'italian', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 11297, u'unit': u'grams'}, {u'originalString': u'10 cloves garlic peeled and sliced thinly', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'200 grams fresh button or favourite mushrooms stalks discarded and caps sliced thinly', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11260, u'unit': u'grams'}, {u'originalString': u'4 tbsp olive oil divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 servings of spaghetti or your favourite pasta about 140-160grams', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 20420, u'unit': u'servings'}, {u'originalString': u'freshly cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'sea salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.noobcook.com/mushroom-spaghetti/2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a pot of water with 1 tbsp sea salt to a boil. Cook spaghetti until al dente (usually 2-3 minutes minus the recommended time).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Drain and set aside the pasta, reserving a small cup of the pasta water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat saucepan with 1 tbsp of olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add mushrooms, a pinch of salt and black pepper. Stir fry or saute until cooked, about 3 minutes. Set aside cooked mushrooms on a plate.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 3 tbsp olive oil in the same pan, add garlic and chilli padi/chilli flakes (if using).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Saute the garlic until it starts to turn light golden brown.Turn off the stove. The garlic will continue cooking in the hot oil on its own for a few more seconds in the hot oil, until they turn a lovely golden brown. Melt cubed butter in the garlic & oil mixture.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add cooked pasta, chopped parsley, cooked mushrooms, sea salt and black pepper (to taste). Toss to coat all the ingredients evenly, adding some reserved pasta water to help the ingredients bind together.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14, u'instructions': u'Bring a pot of water with 1 tbsp sea salt to a boil. Cook spaghetti until al dente (usually 2-3 minutes minus the recommended time). Drain and set aside the pasta, reserving a small cup of the pasta water.Heat saucepan with 1 tbsp of olive oil. Add mushrooms, a pinch of salt and black pepper. Stir fry or saute until cooked, about 3 minutes. Set aside cooked mushrooms on a plate.Heat 3 tbsp olive oil in the same pan, add garlic and chilli padi/chilli flakes (if using). Saute the garlic until it starts to turn light golden brown.Turn off the stove. The garlic will continue cooking in the hot oil on its own for a few more seconds in the hot oil, until they turn a lovely golden brown. Melt cubed butter in the garlic & oil mixture.Add cooked pasta, chopped parsley, cooked mushrooms, sea salt and black pepper (to taste). Toss to coat all the ingredients evenly, adding some reserved pasta water to help the ingredients bind together.', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-spaghetti-565273', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}