{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446755-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 446755, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ground Beef Noodle Soup', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 90.38, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 pounds lean ground beef (90% lean)', u'aisle': u'Meat', u'name': u'90% lean ground beef', u'metaInformation': [u'90%', u'lean', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23562, u'unit': u'pounds'}, {u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 tablespoons beef bouillon granules', u'aisle': u'Canned and Jarred', u'name': u'beef bouillon granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1006076, u'unit': u'tablespoons'}, {u'originalString': u'1-1/2 cups uncooked egg noodles', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20409, u'unit': u'cups'}, {u'originalString': u'1/2 cup each chopped onion, celery and carrot', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'7 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 envelope au jus mix', u'aisle': u'?', u'name': u'au jus mix', u'metaInformation': [], u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'unit': u'envelope'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/ground-beef-noodle-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, cook the beef, onion, celery and carrot over medium heat until meat is no longer pink; drain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the water, au jus mix, bouillon, bay leaves and pepper; bring to a boil. Stir in the noodles. Return to a boil. Cook, uncovered, for 15 minutes or until noodles are tender, stirring occasionally. Discard bay leaves.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 519, u'instructions': u'Directions                                                                                In a large saucepan, cook the beef, onion, celery and carrot over medium heat until meat is no longer pink; drain.                                                                                            Add the water, au jus mix, bouillon, bay leaves and pepper; bring to a boil. Stir in the noodles. Return to a boil. Cook, uncovered, for 15 minutes or until noodles are tender, stirring occasionally. Discard bay leaves.                                        Yield: 8 servings (2 quarts).                                                                                                                         Originally published as Ground Beef Noodle Soup in  Quick CookingSeptember/October 2001, p55                                                                                                                                                                                                        Nutritional Facts                                                                             One 1-cup serving (prepared with lean ground beef, reduced-sodium bouillon and yolk-free noodles) equals 203 calories, 9 g fat (3 g saturated fat), 32 mg cholesterol, 471 mg sodium, 10 g carbohydrate, 1 g fiber, 20 g protein. Diabetic Exchanges: 2 lean meat, 1 starch.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/ground-beef-noodle-soup-446755', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}