{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213056-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 213056, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow-roasted pork shoulder with leeks, apricots & thyme', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 89.92, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 carrot, thickly sliced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 celery stick, cut into chunks', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'140g fresh coarse breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'85g chopped dried apricots, soaked for 2 hrs in boiling water to cover, then drained', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried', u'boiling', u'drained', u'chopped', u'for 2 hrs in  water to cover, then '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 9032, u'unit': u'g'}, {u'originalString': u'150ml white wine or medium-dry cider', u'aisle': u'Alcoholic Beverages', u'name': u'dry cider', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cider.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'solid', u'id': 93807, u'unit': u'ml'}, {u'originalString': u'2 leeks, cleaned well and shredded', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'shredded', u'cleaned', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1 onion, thickly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'500ml strong-flavoured chicken or pork stock', u'aisle': u'Canned and Jarred', u'name': u'pork stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'ml'}, {u'originalString': u'1 tsp chopped thyme leaf', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2604640/slowroasted-pork-shoulder-with-leeks-apricots-and-', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'A few hours before you want to cookthe pork, remove it from the fridge anddry the skin thoroughly. Leave unwrappedin a cool place to slowly come to roomtemperature while you make the stuffing.Put a large saucepan over a mediumheat and add the butter. When it beginsto sizzle, add the leeks and cook untilthey are soft and most of their liquid has evaporated. Stir in the apricots andthyme, season well and transfer to abowl to cool. When the mixture is cold,stir in the breadcrumbs. Taste andseason again if required.When you are ready to cook the pork,heat oven to 220C/200C fan/gas 7.Spoon the stuffing into the pocket yourbutcher has left for you. Wipe any stuffingfrom the skin, put the pork in a roastingtin and season the skin well with salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Put the celery, onion and carrot in thetin around the pork, place in the ovenand cook for 30 mins.Reduce heat to 140C/120C fan/gas 1 and cook the pork for a further2 hrs 30 mins.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Transfer the pork to awarm serving dish to rest while youfinish the gravy.Tip out any fat from the roasting tin andreserve for another dish.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the roastingtin on a medium heat, add the white wineor cider and, using a wooden spatula,scrape the caramelised juices from thebottom of the pan and allow them todissolve.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let the juices reduce by half.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the stock and simmer for 5 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the flour and butter, mashedtogether, and whisk them into the gravy.Taste for seasoning, then strain into awarmed jug. If your pork skin has notcrackled, put under a hot grill for a fewmins, turning every 30 secs or so, untilbubbled and crackling.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pork Shoulder can be paired with Malbec, Pinot Noir, and Sangiovese. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. The Tikal Amorio Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 28 dollars per bottle.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'Aromas of smoky oak and cherry. Mouthwatering, penetrating flavors of ripe red and black cherries, red berries. Quite rich and velvety on the palate, and finishes with just enough grip to make it a real winner with food. This is some seriously sexy Malbec. Pairs well with grilled or smoked meats such as beef, pork, and lamb. Also complements dishes prepared with cheese or cream sauces.', u'title': u'Tikal Amorio Malbec', u'price': u'$27.99', u'id': 444771, u'link': u'https://www.wine.com/product/tikal-amorio-malbec-2008/104742', u'imageUrl': u'https://spoonacular.com/productImages/444771-312x231.jpg'}]}, u'aggregateLikes': 59, u'instructions': u'A few hours before you want to cookthe pork, remove it from the fridge anddry the skin thoroughly. Leave unwrappedin a cool place to slowly come to roomtemperature while you make the stuffing.Put a large saucepan over a mediumheat and add the butter. When it beginsto sizzle, add the leeks and cook untilthey are soft and most of their liquid has evaporated. Stir in the apricots andthyme, season well and transfer to abowl to cool. When the mixture is cold,stir in the breadcrumbs. Taste andseason again if required.When you are ready to cook the pork,heat oven to 220C/200C fan/gas 7.Spoon the stuffing into the pocket yourbutcher has left for you. Wipe any stuffingfrom the skin, put the pork in a roastingtin and season the skin well with salt.Put the celery, onion and carrot in thetin around the pork, place in the ovenand cook for 30 mins.Reduce heat to 140C/120C fan/gas 1 and cook the pork for a further2 hrs 30 mins. Transfer the pork to awarm serving dish to rest while youfinish the gravy.Tip out any fat from the roasting tin andreserve for another dish. Put the roastingtin on a medium heat, add the white wineor cider and, using a wooden spatula,scrape the caramelised juices from thebottom of the pan and allow them todissolve. Let the juices reduce by half.Add the stock and simmer for 5 mins.Add the flour and butter, mashedtogether, and whisk them into the gravy.Taste for seasoning, then strain into awarmed jug. If your pork skin has notcrackled, put under a hot grill for a fewmins, turning every 30 secs or so, untilbubbled and crackling.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-roasted-pork-shoulder-with-leeks-apricots-thyme-213056', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 225, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}