{u'recipes': [{u'sourceName': u'Panini Happy', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/252091-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 252091, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chips and Guacamole Grilled Cheese + Q & A with Laura Werlin', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 375.29, u'creditText': u'Panini Happy', u'extendedIngredients': [{u'originalString': u'8 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'4 tablespoons butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces Colby cheese, coarsely grated', u'aisle': u'Cheese', u'name': u'colby cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1011, u'unit': u'ounces'}, {u'originalString': u'4 ounces goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'4 ounces Monterey Jack cheese, coarsely grated', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons peeled, seeded, finely diced (1/4-inch) Roma tomato (see Note)', u'aisle': u'Produce', u'name': u'roma tomato', u'metaInformation': [u'diced', u'peeled', u'seeded', u'finely', u'(1/4-inch)', u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10211529, u'unit': u'tablespoons'}, {u'originalString': u'8 slices sourdough bread', u'aisle': u'Bakery/Bread', u'name': u'sourdough bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sourdough-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10118029, u'unit': u'slices'}, {u'originalString': u'8 large tortilla chips (about 2 ounces)', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19056, u'unit': u'ounces'}, {u'originalString': u'1/2 cup guacamole (homemade or purchased, preferably one with tomato in it)', u'aisle': u'?', u'name': u'purchased', u'metaInformation': [u'with tomato in it)', u'homemade'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://paninihappy.com/chips-and-guacamole-grilled-cheese-q-a-with-laura-werlin/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line a plate with paper towels. In a large nonstick skillet, cook the bacon over medium heat until very crisp.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain the bacon on the paper towels.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the bacon fat from the pan and wipe the pan with a paper towel, but do not wash it. Set aside.To make the tortilla chip butter, put the chips in the bowl of a food processor and process until the texture is very fine, similar to sand. Alternatively, place the chips in a sturdy plastic bag. Using a meat mallet or other heavy object, pound the chips until they are the texture of sand.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Spread the butter mixture on one side of each slice of bread.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place 4 slices, butter-chip mixture side down, on your work surface.', u'number': 2, u'ingredients': []}], u'name': u'Put the butter in a medium bowl and add the ground chips. Using a fork, work the chip “sand” and butter together until well mixed. The mixture will be somewhat stiff.To assemble'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large nonstick skillet over medium heat for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the sandwiches into the pan, cover, and cook for 3 to 4 minutes, until the undersides are golden brown. Watch carefully because the chips in the butter can burn easily. Turn the sandwiches, pressing each one firmly with a spatula to compress the filling slightly. Cover and cook for 2 to 3 minutes or until the undersides are well browned. Turn the sandwiches once more, press firmly with the spatula again, cook for 1 minute, and remove from the pan.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Let cool 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}], u'step': u'Cut in half and serve.For sandwich maker method: Use your sandwich maker for this sandwich only if you have variable heat settings. Otherwise, it will cook too hot and burn the chips on the bread without melting the cheese. To use your sandwich maker, follow directions for assembly above. Cook according to manufacturer’s instructions.', u'number': 4, u'ingredients': []}], u'name': u'Spread 2 tablespoons of the guacamole on each slice of bread. Sprinkle the tomato on top of the guacamole, if using. Follow with the Colby and Monterey Jack cheeses. Dot with small pieces of the goat cheese. Finish by placing two bacon pieces on each sandwich. Top with remaining bread slices, buttered side up.For stovetop method'}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Argyle Reserve Pinot Noir. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 1930, u'instructions': u'Line a plate with paper towels. In a large nonstick skillet, cook the bacon over medium heat until very crisp. Drain the bacon on the paper towels. Remove the bacon fat from the pan and wipe the pan with a paper towel, but do not wash it. Set aside.To make the tortilla chip butter, put the chips in the bowl of a food processor and process until the texture is very fine, similar to sand. Alternatively, place the chips in a sturdy plastic bag. Using a meat mallet or other heavy object, pound the chips until they are the texture of sand.Put the butter in a medium bowl and add the ground chips. Using a fork, work the chip “sand” and butter together until well mixed. The mixture will be somewhat stiff.To assemble: Spread the butter mixture on one side of each slice of bread. Place 4 slices, butter-chip mixture side down, on your work surface. Spread 2 tablespoons of the guacamole on each slice of bread. Sprinkle the tomato on top of the guacamole, if using. Follow with the Colby and Monterey Jack cheeses. Dot with small pieces of the goat cheese. Finish by placing two bacon pieces on each sandwich. Top with remaining bread slices, buttered side up.For stovetop method: Heat a large nonstick skillet over medium heat for 2 minutes. Put the sandwiches into the pan, cover, and cook for 3 to 4 minutes, until the undersides are golden brown. Watch carefully because the chips in the butter can burn easily. Turn the sandwiches, pressing each one firmly with a spatula to compress the filling slightly. Cover and cook for 2 to 3 minutes or until the undersides are well browned. Turn the sandwiches once more, press firmly with the spatula again, cook for 1 minute, and remove from the pan. Let cool 5 minutes. Cut in half and serve.For sandwich maker method: Use your sandwich maker for this sandwich only if you have variable heat settings. Otherwise, it will cook too hot and burn the chips on the bread without melting the cheese. To use your sandwich maker, follow directions for assembly above. Cook according to manufacturer’s instructions.', u'spoonacularSourceUrl': u'https://spoonacular.com/chips-and-guacamole-grilled-cheese-+-q-a-with-laura-werlin-252091', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}