{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/479241-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479241, u'veryPopular': False, u'lowFodmap': False, u'title': u'Seared Scallops with Spiced Corn & Tomato Succotash', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 522.47, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'2 tablespoons chopped basil, plus 3 leaves julienned for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'julienned', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 teaspoons cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'5 ears of corn, kernels removed', u'aisle': u'Produce', u'name': u'ears of corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'3 plum tomatoes, seeded and roughly chopped', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'seeded', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2lb scallops', u'aisle': u'Seafood', u'name': u'scallops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10015172, u'unit': u'lb'}, {u'originalString': u'1/4 teaspoon turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'1 medium sweet vidalia onion, finely diced', u'aisle': u'Produce', u'name': u'vidalia onion', u'metaInformation': [u'diced', u'sweet', u'medium', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://feedmephoebe.com/2012/02/seared-scallops-with-spiced-corn-tomato-succotash/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Rinse the scallops under cold water and set aside on a dish towel. You want them to be dry by the time you are ready to cook, without breaking them by prodding with a towel.In large nonstick or cast iron skillet, heat a tablespoon of olive oil over a medium flame.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}]}, {u'equipment': [], u'step': u'Saute the onion slowly until translucent and beginning to brown, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the garlic and corn and continue to saute until the corn is bright yellow and tender, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the cumin, turmeric, and salt. Cook for another few minutes until the corn is beginning to caramelize. Turn the heat down to low and add the tomatoes. Stir slowly until the tomatoes heated through, but have not begun to release their juices, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the lemon and the basil off the heat, and transfer to a platter.In a large nonstick or cast iron skillet (you can remove the corn mixture to a platter, clean out the pan and use it for the scallops), heat one tablespoon of olive oil over a high flame. Once the oil is hot, but not smoking, add the butter. Gently pat the scallops with a paper towel to make sure they are nice and dry and season them with salt on one side. When the butter is melted and the pan is smoking, add the scallops, making sure not to crowd the pan (you will likely need to do this in 2 or 3 batches). Turn the pan to keep the butter and oil evenly distributed, but DO NOT move the scallops until they have properly browned, about 2-3 minutes depending on the size of your scallops. When they have a good sear (dark brown crust), flip them and cook for another minute. The scallops should still be slightly translucent in the center–if they are opaque throughout, they will likely be overcooked by the time you serve them.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove finished scallops to the corn platter, making sure to put the beautiful seared side facing up. Repeat with the remaining scallops.Squeeze a little extra lemon juice over the scallops and garnish with julienned basil.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 105, u'instructions': u'Rinse the scallops under cold water and set aside on a dish towel. You want them to be dry by the time you are ready to cook, without breaking them by prodding with a towel.In large nonstick or cast iron skillet, heat a tablespoon of olive oil over a medium flame. Saute the onion slowly until translucent and beginning to brown, about 10 minutes. Add the garlic and corn and continue to saute until the corn is bright yellow and tender, about 5 minutes. Add the cumin, turmeric, and salt. Cook for another few minutes until the corn is beginning to caramelize. Turn the heat down to low and add the tomatoes. Stir slowly until the tomatoes heated through, but have not begun to release their juices, about 5 minutes. Add the lemon and the basil off the heat, and transfer to a platter.In a large nonstick or cast iron skillet (you can remove the corn mixture to a platter, clean out the pan and use it for the scallops), heat one tablespoon of olive oil over a high flame. Once the oil is hot, but not smoking, add the butter. Gently pat the scallops with a paper towel to make sure they are nice and dry and season them with salt on one side. When the butter is melted and the pan is smoking, add the scallops, making sure not to crowd the pan (you will likely need to do this in 2 or 3 batches). Turn the pan to keep the butter and oil evenly distributed, but DO NOT move the scallops until they have properly browned, about 2-3 minutes depending on the size of your scallops. When they have a good sear (dark brown crust), flip them and cook for another minute. The scallops should still be slightly translucent in the center–if they are opaque throughout, they will likely be overcooked by the time you serve them. Remove finished scallops to the corn platter, making sure to put the beautiful seared side facing up. Repeat with the remaining scallops.Squeeze a little extra lemon juice over the scallops and garnish with julienned basil. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/seared-scallops-with-spiced-corn-tomato-succotash-479241', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}