{u'recipes': [{u'sourceName': u'Joyful Healthy Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/575104-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 575104, u'veryPopular': True, u'lowFodmap': False, u'title': u'Hawaiian Kalua Pork Tacos with Pineapple Salsa', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 98.23, u'creditText': u'Joyful Healthy Eats', u'extendedIngredients': [{u'originalString': u'half of a red cabbage head, thinly sliced', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u'head'}, {u'originalString': u'1 minced chipotle pepper, from a can of chipotle pepper in adobe sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'canned chipotle pepper', u'metaInformation': [u'minced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'\xbc cup of chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 18363, u'unit': u'servings'}, {u'originalString': u'juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'juice from half a lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 T. liquid smoke', u'aisle': u'Spices and Seasonings;Condiments', u'name': u'liquid smoke', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93627, u'unit': u'T'}, {u'originalString': u'1 whole pineapple, chopped into very small pieces', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'whole', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'4-6lbs. Pork Shoulder', u'aisle': u'Meat', u'name': u'pork shoulder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 10072, u'unit': u'lbs'}, {u'originalString': u'\xbc cup of minced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 T. red Hawaiian Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'T'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.joyfulhealthyeats.com/pork-tacos-with-pineapple-salsa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Pat dry 4-6lbs of pork shoulder and place in slow cooker.Generously poke the pork shoulder with a fork, the more the better. {these holes will let the seasonings flow into the meat}Next, pour liquid smoke and Red Hawaiian Sea Salt over the pork shoulder. Rub the sea salt and liquid smoke into the pork shoulder very well to ensure it is completely covered.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'id': 10072, u'name': u'pork shoulder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 93627, u'name': u'liquid smoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Place lid on to cover and cook for 8-12 hours, checking every hour after 8 hours for doneness {I used 4lb. and it took 8hrs.}When finished, shred pork with two forks.To make the Pineapple salsa, use 1 whole pineapple, slice off the exterior and remove the core.Next, chop up your pineapple into small bit size pieces. {almost minced.. i mean tiny people}', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place pineapple in a large bowl and add red onion, fresh cilantro, chipotle pepper from a can of chipotle in adobe sauce, juice of half a lime, and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix all together.Next, thinly slice {should look like shoe strings} half of a red cabbage head, add to a bowl and mix with juice of 1 lime.Assemble to tacos, put a little of hawaiian kalua pork, pineapple salsa, and red cabbage on a corn tortilla and eat up!If you wanted you could add queso fresco cheese to this or a little BBQ sauce would be good too!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Tacos. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Argyle Reserve Pinot Noir. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 529, u'instructions': u'Pat dry 4-6lbs of pork shoulder and place in slow cooker.Generously poke the pork shoulder with a fork, the more the better. {these holes will let the seasonings flow into the meat}Next, pour liquid smoke and Red Hawaiian Sea Salt over the pork shoulder. Rub the sea salt and liquid smoke into the pork shoulder very well to ensure it is completely covered.Place lid on to cover and cook for 8-12 hours, checking every hour after 8 hours for doneness {I used 4lb. and it took 8hrs.}When finished, shred pork with two forks.To make the Pineapple salsa, use 1 whole pineapple, slice off the exterior and remove the core.Next, chop up your pineapple into small bit size pieces. {almost minced.. i mean tiny people}Place pineapple in a large bowl and add red onion, fresh cilantro, chipotle pepper from a can of chipotle in adobe sauce, juice of half a lime, and salt.Mix all together.Next, thinly slice {should look like shoe strings} half of a red cabbage head, add to a bowl and mix with juice of 1 lime.Assemble to tacos, put a little of hawaiian kalua pork, pineapple salsa, and red cabbage on a corn tortilla and eat up!If you wanted you could add queso fresco cheese to this or a little BBQ sauce would be good too!', u'spoonacularSourceUrl': u'https://spoonacular.com/hawaiian-kalua-pork-tacos-with-pineapple-salsa-575104', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 510, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}