{u'recipes': [{u'sourceName': u'Pies and Plots', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/585314-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 585314, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot Cross Buns', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 300, u'pricePerServing': 46.83, u'creditText': u'Pies and Plots', u'extendedIngredients': [{u'originalString': u'4 \xbd teaspoons (2 packets) active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'packets', u'unitShort': u'packets', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'packets'}, {u'originalString': u'\xbc teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u"2 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'\xbe cup dried cherries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cherries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93822, u'unit': u'cup'}, {u'originalString': u'4 large eggs, slightly beaten (Pasteurized if you like)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'slightly beaten', u'(Pasteurized if you like)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'5 \xbe cups all-purpose flour, plus more for dusting', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dusting', u'all-purpose', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'Zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'Zest of 1 orange (I used a Cara Cara)', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'(I used a Cara Cara)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'\xbd cup American Spoon Red Haven Peach Preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peach preserves', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-preserves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11319297, u'unit': u'cup'}, {u'originalString': u'\xbe cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'12 tablespoons (1 \xbd sticks) unsalted butter, melted and cooled, plus more for bowl', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted', u'plus more for bowl', u'(1 \xbd sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://piesandplots.net/hot-cross-buns/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour 1 cup milk into small saucepan with candy thermometer clipped to side, and bring to about 110 degrees F over medium heat. Once heated, pour milk into bowl of stand mixer fitted with dough hook attachment. With machine running on low speed, add sugar, yeast, salt, butter, cinnamon, orange and lemon zest, and eggs.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix until combined.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add flour, continuing to mix on low speed until soft, slightly sticky dough forms around dough hook. This should happen quite quickly. Continue mixing on low speed about 4 more minutes until the dough is smooth. Scrape down hook and bowl as necessary.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add raisins and cherries, mixing to incorporate.Turn the dough out onto a floured surface. Knead briefly only to make sure raisins and cherries are fully incorporated throughout the dough. Shape dough into ball.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place dough in a large well buttered bowl. Turn the dough in the bowl so it is covered with butter. Tightly cover the bowl with plastic wrap and place in a warm spot to rise for about 1 hour 30 minutes until it has roughly doubled in size.Line 2 baking sheets with parchment paper. Turn dough out onto unfloured work surface. Knead very briefly before shaping into log.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut log in half, each half in half and each quarter into six pieces. Shape each piece, roughly the same size, it doesn’t have to be exact, into a tightly formed ball.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place each ball on baking sheet, about 2 inches apart, 4 rows of 3 on each tray. Cover baking sheets tightly with plastic wrap and place in a warm spot to rise for about 2 hours, until buns are doubled in size and touching.Preheat oven to 375 degrees F. Unwrap buns before transferring them to the oven to bake until golden brown, about 18-25 minutes, rotating after 10 minutes if necessary. Depending on your oven, watch them to make sure the bottoms are not browning far more quickly than the tops.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Let cool on trays.While the buns are cooling, heat the peach preserves in a small saucepan over medium heat, breaking up large pieces of peach with a spoon.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-preserves.jpg', u'id': 11319297, u'name': u'peach preserves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Brush or spoon jam over buns. They can still be warm for this step.When buns are completely cool, make the icing. In a medium bowl, whisk or stir together confectioners’ sugar, vanilla, and about 2 tablespoons of milk, you may need more. The icing should be thick but spreadable.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [], u'step': u'Adding more confectioners’ sugar or milk may be necessary to achieve the desired consistency.Spoon icing into piping bag or plastic zipper bag with a tiny tip cut off. Pipe crosses on buns.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Serve and enjoy. Buns will keep for one day at room temperature in an air tight container, or frozen, wrapped in parchment and foil and placed in a zipper bag for up to 3 months.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 25, u'instructions': u'Pour 1 cup milk into small saucepan with candy thermometer clipped to side, and bring to about 110 degrees F over medium heat. Once heated, pour milk into bowl of stand mixer fitted with dough hook attachment. With machine running on low speed, add sugar, yeast, salt, butter, cinnamon, orange and lemon zest, and eggs. Mix until combined. Add flour, continuing to mix on low speed until soft, slightly sticky dough forms around dough hook. This should happen quite quickly. Continue mixing on low speed about 4 more minutes until the dough is smooth. Scrape down hook and bowl as necessary. Add raisins and cherries, mixing to incorporate.Turn the dough out onto a floured surface. Knead briefly only to make sure raisins and cherries are fully incorporated throughout the dough. Shape dough into ball. Place dough in a large well buttered bowl. Turn the dough in the bowl so it is covered with butter. Tightly cover the bowl with plastic wrap and place in a warm spot to rise for about 1 hour 30 minutes until it has roughly doubled in size.Line 2 baking sheets with parchment paper. Turn dough out onto unfloured work surface. Knead very briefly before shaping into log. Cut log in half, each half in half and each quarter into six pieces. Shape each piece, roughly the same size, it doesn’t have to be exact, into a tightly formed ball. Place each ball on baking sheet, about 2 inches apart, 4 rows of 3 on each tray. Cover baking sheets tightly with plastic wrap and place in a warm spot to rise for about 2 hours, until buns are doubled in size and touching.Preheat oven to 375 degrees F. Unwrap buns before transferring them to the oven to bake until golden brown, about 18-25 minutes, rotating after 10 minutes if necessary. Depending on your oven, watch them to make sure the bottoms are not browning far more quickly than the tops. Let cool on trays.While the buns are cooling, heat the peach preserves in a small saucepan over medium heat, breaking up large pieces of peach with a spoon. Brush or spoon jam over buns. They can still be warm for this step.When buns are completely cool, make the icing. In a medium bowl, whisk or stir together confectioners’ sugar, vanilla, and about 2 tablespoons of milk, you may need more. The icing should be thick but spreadable. Adding more confectioners’ sugar or milk may be necessary to achieve the desired consistency.Spoon icing into piping bag or plastic zipper bag with a tiny tip cut off. Pipe crosses on buns. Serve and enjoy. Buns will keep for one day at room temperature in an air tight container, or frozen, wrapped in parchment and foil and placed in a zipper bag for up to 3 months.', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-cross-buns-585314', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 300, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}