{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/695565-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 695565, u'veryPopular': True, u'lowFodmap': False, u'title': u'Green Chile Bison Burger', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 261.97, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 pound ground bison or lean (90% or leaner) ground beef', u'aisle': u'Meat', u'name': u'90% lean ground beef', u'metaInformation': [u'90%', u'lean', u'( or leaner)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23562, u'unit': u'pound'}, {u'originalString': u'2 4-ounce cans diced green chiles, drained, divided', u'aisle': u'Produce', u'name': u'green chiles', u'metaInformation': [u'diced', u'green', u'divided', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounce'}, {u'originalString': u'4 whole-wheat hamburger buns, toasted', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [u'whole-wheat', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1/4 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup shredded pepper Jack cheese, divided', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1025, u'unit': u'cup'}, {u'originalString': u'1/4 cup thinly sliced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'1 cup very thinly sliced iceberg or romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/chile_bison_burger.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Tip: To oil a grill rack, oil a folded paper towel, hold it with tongs and rub it over the rack. (Do not use cooking spray on a hot grill.)Stovetop Variation: Coat a nonstick pan, preferably cast-iron (or a grill pan), with cooking spray and heat over medium-high heat for 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Add burgers, reduce heat to medium and cook, turning once, until an instant-read thermometer registers 155F (for pork and bison) or 165 (for beef or chicken), 4 to 5 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Bison Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Terrazas de los Andes Reserva Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Bright red color with purple shades. Intense floral and fruity notes. Presence of violets, ripe black cherry and plum aromas. ReIts sweet and juicy mouthfeel delivers finesse, delicate tannins and an elegant finish of black fruits. veals a toasty and spicy character of black pepper and chocolate.Pair with Tuna Carpaccio and Red Fruits Vinaigrette, Tenderloin served with MediterraneanRatatouille and Moist Semisweet Chocolate Cake over Mascarpone and Red Fruits Ice Cream. View More', u'title': u'Terrazas de los Andes Reserva Malbec', u'price': u'$21.99', u'id': 438817, u'link': u'https://www.wine.com/product/terrazas-de-los-andes-reserva-malbec-2014/162923', u'imageUrl': u'https://spoonacular.com/productImages/438817-312x231.jpg'}]}, u'aggregateLikes': 488, u'instructions': u'Tip: To oil a grill rack, oil a folded paper towel, hold it with tongs and rub it over the rack. (Do not use cooking spray on a hot grill.)Stovetop Variation: Coat a nonstick pan, preferably cast-iron (or a grill pan), with cooking spray and heat over medium-high heat for 1 to 2 minutes. Add burgers, reduce heat to medium and cook, turning once, until an instant-read thermometer registers 155F (for pork and bison) or 165 (for beef or chicken), 4 to 5 minutes per side.', u'spoonacularSourceUrl': u'https://spoonacular.com/green-chile-bison-burger-695565', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}