{u'recipes': [{u'sourceName': u'3BoysUnprocessed ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719027-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 719027, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spinach and Tortellini Salad', u'diets': [], u'pricePerServing': 227.87, u'creditText': u'3BoysUnprocessed ', u'extendedIngredients': [{u'originalString': u'4 cups fresh baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'1 cup shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'3/4 cup creamy Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 43016, u'unit': u'cup'}, {u'originalString': u'2 tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 bag frozen tortellini', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'tortellini', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 93727, u'unit': u'bag'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.3boysunprocessed.com/spinach-and-tortellini-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add all ingredients except oil to food processor. Blend until combined. Slowly add oil while continuing to blend. Store in refrigerator for up to 2 weeks. ** If you dont have a food processor, no problem! Just use a large mixing bowl and whisk.', u'number': 1, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 43252, u'instructions': u'Add all ingredients except oil to food processor. Blend until combined. Slowly add oil while continuing to blend. Store in refrigerator for up to 2 weeks. ** If you dont have a food processor, no problem! Just use a large mixing bowl and whisk.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-and-tortellini-salad-719027', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}