{u'recipes': [{u'sourceName': u'Dine and Dish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/709026-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 709026, u'veryPopular': False, u'lowFodmap': False, u'title': u'A Cozy Home – Homemade Honey Oatmeal Bread', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 39.13, u'creditText': u'Dine and Dish', u'extendedIngredients': [{u'originalString': u"2\xbd teaspoons (or 1 packet) Fleischmann's\xae Active Dry Yeast", u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry', u'(or 1 packet)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'3 cups bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'2 Tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tablespoons'}, {u'originalString': u'2 teaspoons Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cups quick cook oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbc cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1\xbd cups lukewarm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://dineanddish.net/2016/01/honey-oatmeal-bread-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bread-machine.jpg', u'id': 5607, u'name': u'bread machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place all ingredients into your bread machine in the order suggested by the manufacturer. (Mine suggests liquids first, dry ingredients next, ending with the yeast placed in a small well on top of the flour.)Set your bread machine to dough cycle and allow it to run its cycle.After the cycle is complete, preheat oven to 350F.Turn dough into a lightly buttered loaf pan and bake at 350F for 40-50 minutes, watching closely to make sure it doesn\'t get too brown. Bread is done when top is a golden brown and loaf sounds "hollow" when tapped.If desired, top the loaf with melted butter.Allow to rest 10 minutes before slicing.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Dessert Bread. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u'Place all ingredients into your bread machine in the order suggested by the manufacturer. (Mine suggests liquids first, dry ingredients next, ending with the yeast placed in a small well on top of the flour.)Set your bread machine to dough cycle and allow it to run its cycle.After the cycle is complete, preheat oven to 350F.Turn dough into a lightly buttered loaf pan and bake at 350F for 40-50 minutes, watching closely to make sure it doesn\'t get too brown. Bread is done when top is a golden brown and loaf sounds "hollow" when tapped.If desired, top the loaf with melted butter.Allow to rest 10 minutes before slicing.', u'spoonacularSourceUrl': u'https://spoonacular.com/a-cozy-home-homemade-honey-oatmeal-bread-709026', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}