{u'recipes': [{u'sourceName': u'YumUniverse', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/8182-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 8182, u'veryPopular': False, u'lowFodmap': False, u'title': u'Amaranth Hemp Protein Poppers', u'diets': [], u'pricePerServing': 421.9, u'creditText': u'YumUniverse', u'extendedIngredients': [{u'originalString': u'1/4 cup raw almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1/2 cup amaranth', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'amaranth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaranth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20001, u'unit': u'cup'}, {u'originalString': u'1/2 organic banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'Pour paste into the large bowl with the nuts and mix well. Fold in your hemp seeds.', u'aisle': u'Bread', u'name': u'bread bowl', u'metaInformation': [u'with the nuts and mix well. fold in your hemp seeds.', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 99169, u'unit': u'servings'}, {u'originalString': u'Skillet', u'aisle': u'Pasta and Rice', u'name': u'burger skillet', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 99037, u'unit': u'servings'}, {u'originalString': u'1/8 tsp cardamom', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'Pinch cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'pinch'}, {u'originalString': u'1/4 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'Food Processor', u'aisle': u'Baking', u'name': u'food dye', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'1/4 cup organic hemp seeds', u'aisle': u'Health Foods', u'name': u'hemp seeds', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93602, u'unit': u'cup'}, {u'originalString': u'2 tbsp grade B maple syrup (optional for extra sweetness. Can substitute raw yacon syrup or raw honey to taste.)', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'raw', u'for extra sweetness. can substitute  yacon syrup or  honey to taste.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tbsp'}, {u'originalString': u'2 soaked Medjool dates, pitted', u'aisle': u'Dried Fruits;Produce', u'name': u'medjool dates', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9421, u'unit': u''}, {u'originalString': u'1/4 cup raw pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'Do you like this recipe?', u'aisle': u'Meat', u'name': u'real bacon recipe pieces', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10862, u'unit': u'servings'}, {u'originalString': u'1/4 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1/4 cup raw sunflower seeds', u'aisle': u'Savory Snacks', u'name': u'sunflower seeds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12036, u'unit': u'cup'}, {u'originalString': u"Try to buy everything organic. Here's why.", u'aisle': u'?', u'name': u"try to buy everything organic. here's why", u'metaInformation': [], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'c'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.yumuniverse.com/2009/12/31/amaranth-hemp-protein-poppers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Lets have some fun now. I think popping amaranth grain is one of the cutest kitchen activities one can participate in.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaranth.jpg', u'id': 20001, u'name': u'amaranth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place your best skillet on high heat and when a drop of water disappears immediately when dropped in, your skillet is ready. Pop amaranth by placing 1 tablespoon of grain in at a time, stirring constantly for about 15 seconds until seeds pop. After they pop, transfer to a bowl and add the next tablespoon of amaranth to the skillet until you get 1 cup of popped amaranth.Now, I have read that a skillet lightly greased in coconut oil also works well, but my experience has been that an un-greased skillet on high heat yields great results. So I think it depends on the pan and the range you are cooking with. Dont be discouraged if the grains dont pop right away, just adjust the temperature until you find the combination that works in your kitchen.Once all your amaranth is popped, place in a shallow bowl and set aside. Now lets create a sweet banana date paste to bind our poppers. In the blender, place banana, dates and maple syrup and mix until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaranth.jpg', u'id': 20001, u'name': u'amaranth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour paste into the large bowl with the nuts and mix well. Fold in your hemp seeds.Using a small spoon, scoop your banana nut and hemp mixture into your popped amaranth. Coat your dollop with popped amaranth, roll in your hand until you have a fully coated ball.Continue until you have used all of your mixture and popped amaranth.Store poppers in an airtight glass container in your refrigerator, freezer or you can dehydrate them and keep them in your pantry. If you would like to extend the shelf life of this snack, then dehydrate your poppers for about 6-8 hrs.  Do you like this recipe?Be a doll and Tweet about it, Pin it and/or share it on Facebook (I bet some folks out there in the world will be thankful you did).Sharing rules and I sure do appreciate it.And because I love YU', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'id': 93602, u'name': u'hemp seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaranth.jpg', u'id': 20001, u'name': u'amaranth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 41, u'instructions': u'Lets have some fun now. I think popping amaranth grain is one of the cutest kitchen activities one can participate in. Place your best skillet on high heat and when a drop of water disappears immediately when dropped in, your skillet is ready. Pop amaranth by placing 1 tablespoon of grain in at a time, stirring constantly for about 15 seconds until seeds pop. After they pop, transfer to a bowl and add the next tablespoon of amaranth to the skillet until you get 1 cup of popped amaranth.Now, I have read that a skillet lightly greased in coconut oil also works well, but my experience has been that an un-greased skillet on high heat yields great results. So I think it depends on the pan and the range you are cooking with. Dont be discouraged if the grains dont pop right away, just adjust the temperature until you find the combination that works in your kitchen.Once all your amaranth is popped, place in a shallow bowl and set aside. Now lets create a sweet banana date paste to bind our poppers. In the blender, place banana, dates and maple syrup and mix until smooth.Pour paste into the large bowl with the nuts and mix well. Fold in your hemp seeds.Using a small spoon, scoop your banana nut and hemp mixture into your popped amaranth. Coat your dollop with popped amaranth, roll in your hand until you have a fully coated ball.Continue until you have used all of your mixture and popped amaranth.Store poppers in an airtight glass container in your refrigerator, freezer or you can dehydrate them and keep them in your pantry. If you would like to extend the shelf life of this snack, then dehydrate your poppers for about 6-8 hrs.  Do you like this recipe?Be a doll and Tweet about it, Pin it and/or share it on Facebook (I bet some folks out there in the world will be thankful you did).Sharing rules and I sure do appreciate it.And because I love YU', u'spoonacularSourceUrl': u'https://spoonacular.com/amaranth-hemp-protein-poppers-8182', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 480, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}