{u'recipes': [{u'sourceName': u'Recipes Food and Cooking', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/612187-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 612187, u'veryPopular': False, u'lowFodmap': False, u'title': u'Burrito Bowl with Shredded Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 171.33, u'creditText': u'Recipes Food and Cooking', u'extendedIngredients': [{u'originalString': u'1 can Ro-tel tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'can'}, {u'originalString': u'3 chicken breast halves', u'aisle': u'Meat', u'name': u'chicken breast halves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1045062, u'unit': u''}, {u'originalString': u'2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1 lb. cranberry beans or pintos', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cranberry beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16020, u'unit': u'lb'}, {u'originalString': u'1 cup chopped onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'red onion, sweet peppers, tomatoes, some sour cream and guacamole over rice', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'sweet', u'sour', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'servings'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 tablespoons taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2073, u'unit': u'tablespoons'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://recipesfoodandcooking.com/2014/09/16/burrito-bowl-shredded-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Look thru the beans and throw out any that are split or broken, make sure there also any little stones in them. Rinse them well.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the water and bring to a boil,', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat and let set for 30 minutes. You can also soak the beans in cold water overnight.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain and rinse the beans.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put them in a heavy pan with the onions.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add enough water to cover them and cook over medium heat until the beans are tender.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the chicken broth, ro-tel tomatoes, seasonings. Continue to cook until the beans start to thicken and get creamy. Season the chicken breasts with salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the chicken breasts on top of the beans and cover the pan. Cook over medium low heat for 20 - 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Remove the chicken breasts and allow to cool. When they are cool shred the chicken into pieces and refrigerate until ready to use.It the water evaporates before the beans reach the creamy stage add more water. When the beans get creamy use a potato masher and mash up some of the beans, but not all. You can add the chicken in back at this point. Keep warm while you make rice to serve it over. Spoon the bean mixture over the rice. Top with tomatoes, onions, sweet peppers, cheese, guacamole and sour cream.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Mark West Black Label Monterey County Pinot Noir. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches.", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 116, u'instructions': u'Look thru the beans and throw out any that are split or broken, make sure there also any little stones in them. Rinse them well. Add the water and bring to a boil, Remove from heat and let set for 30 minutes. You can also soak the beans in cold water overnight. Drain and rinse the beans. Put them in a heavy pan with the onions. Add enough water to cover them and cook over medium heat until the beans are tender. Add the chicken broth, ro-tel tomatoes, seasonings. Continue to cook until the beans start to thicken and get creamy. Season the chicken breasts with salt and pepper. Place the chicken breasts on top of the beans and cover the pan. Cook over medium low heat for 20 - 25 minutes. Remove the chicken breasts and allow to cool. When they are cool shred the chicken into pieces and refrigerate until ready to use.It the water evaporates before the beans reach the creamy stage add more water. When the beans get creamy use a potato masher and mash up some of the beans, but not all. You can add the chicken in back at this point. Keep warm while you make rice to serve it over. Spoon the bean mixture over the rice. Top with tomatoes, onions, sweet peppers, cheese, guacamole and sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/burrito-bowl-with-shredded-chicken-612187', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}