{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/757994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 757994, u'veryPopular': False, u'lowFodmap': False, u'title': u'Watercress, Jicama, and Orange Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 113.88, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 avocado, sliced (optional)', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbc cup coarsely chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 Tbs. coriander seeds', u'aisle': u'Spices and Seasonings', u'name': u'coriander seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 2013, u'unit': u'Tbs'}, {u'originalString': u'1 medium jicama, peeled and julienned', u'aisle': u'Produce', u'name': u'jicama', u'metaInformation': [u'medium', u'julienned', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jicama.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11603, u'unit': u''}, {u'originalString': u'\xbd cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 oranges', u'aisle': u'Produce', u'name': u'oranges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'1 shallot, roughly chopped', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'8 cups watercress, stems removed, leaves washed and patted dry', u'aisle': u'Produce', u'name': u'watercress', u'metaInformation': [u'dry', u'washed and patted '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 11591, u'unit': u'cups'}, {u'originalString': u'\xbc cup white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cup'}], u'healthScore': 58.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/watercress-jicama-and-orange-salad/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make Vinaigrette: Toast coriander in dry skillet 1 minute, or until fragrant.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to bowl, and cool completely.2. Blend toasted coriander seeds, vinegar, cilantro, and shallot in blender or mini-food processor until smooth. With motor still running, add oil, and blend until combined. Season with salt and pepper, if desired.3. To make Salad: Slice ends off oranges, and stand upright on counter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'id': 2013, u'name': u'whole coriander seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut away peel and pith with serrated knife, exposing fruit. Working over serving bowl to catch juices, release each orange section by slicing between membranes with knife.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}]}, {u'equipment': [], u'step': u'Remove and discard seeds.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add orange segments and juices to bowl with watercress and jicama. Toss with 1/2 cup Vinaigrette. (Reserve remaining Vinaigrette for another use.) Divide Salad among serving plates, and top with avocado slices (if using).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-slices.png', u'id': 1019200, u'name': u'orange slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-slices.jpg', u'id': 1019037, u'name': u'avocado slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'id': 11591, u'name': u'watercress'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jicama.jpg', u'id': 11603, u'name': u'jicama'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'1. To make Vinaigrette: Toast coriander in dry skillet 1 minute, or until fragrant. Transfer to bowl, and cool completely.2. Blend toasted coriander seeds, vinegar, cilantro, and shallot in blender or mini-food processor until smooth. With motor still running, add oil, and blend until combined. Season with salt and pepper, if desired.3. To make Salad: Slice ends off oranges, and stand upright on counter. Cut away peel and pith with serrated knife, exposing fruit. Working over serving bowl to catch juices, release each orange section by slicing between membranes with knife. Remove and discard seeds. Add orange segments and juices to bowl with watercress and jicama. Toss with 1/2 cup Vinaigrette. (Reserve remaining Vinaigrette for another use.) Divide Salad among serving plates, and top with avocado slices (if using).', u'spoonacularSourceUrl': u'https://spoonacular.com/watercress-jicama-and-orange-salad-757994', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}