{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/760447-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760447, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fresh Fruit Yogurt Pops', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 82.81, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbc cup corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'2 cups fresh summer fruit, such as raspberries, pitted cherries, etc.', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'fresh', u' such as raspberries, pitted cherries, etc.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9431, u'unit': u'cups'}, {u'originalString': u'1 Tbs. fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbs'}, {u'originalString': u'2 cups low-fat vanilla yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat vanilla yogurt', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001119, u'unit': u'cups'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/fresh-fruit-yogurt-pops-2/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place yogurt, vanilla, lemon juice, corn syrup and 1 cup fruit in blender or food processor, and pur\xe9e until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}, {u'equipment': [], u'step': u'Add remaining fruit, and pulse 3 or 4 times, or until fruit is broken down into small pieces.2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}, {u'equipment': [], u'step': u'Pour mixture into 8 1/2-cup frozen-pop molds.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place top on mold; insert wooden sticks. Freeze at least 4 hours.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Yogurt works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 81, u'instructions': u'1. Place yogurt, vanilla, lemon juice, corn syrup and 1 cup fruit in blender or food processor, and pur\xe9e until smooth. Add remaining fruit, and pulse 3 or 4 times, or until fruit is broken down into small pieces.2. Pour mixture into 8 1/2-cup frozen-pop molds. Place top on mold; insert wooden sticks. Freeze at least 4 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-fruit-yogurt-pops-760447', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}