{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/695357-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 695357, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sichuan-Style Tofu with Mushrooms', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 99.24, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 teaspoons Chinkiang vinegar (see Tip) or balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon crushed red pepper, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 tablespoons reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16424, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 scallions, trimmed and chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'trimmed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/2 teaspoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoon'}, {u'originalString': u'14 ounces water-packed firm tofu, rinsed', u'aisle': u'Canned and Jarred', u'name': u'water packed tuna', u'metaInformation': [u'firm', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 15121, u'unit': u'ounces'}, {u'originalString': u'1 1/2 cups sliced white mushrooms (about 4 ounces)', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/sichuan_style_tofu_with_mushrooms.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place tofu on several paper towels and sprinkle with 1/4 teaspoon salt. Turn the tofu over, sprinkle with the remaining 1/4 teaspoon salt, place more paper towels on top and weigh the tofu down with a plate. Set aside for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut the tofu into roughly 1-inch cubes.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a 14-inch flat-bottomed wok or large skillet over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in 1 tablespoon oil; add garlic and scallions and stir-fry until fragrant, 10 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add mushrooms and stir-fry until just beginning to soften, 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to a plate.Swirl the remaining 1 tablespoon oil into the pan, reduce the heat to medium, add the tofu and pan-fry, turning midway through cooking, until it begins to brown, about 3 minutes. Swirl in the reserved sauce and the mushroom mixture; increase the heat to high and stir-fry until the tofu is just heated through and the sauce clings to it, 30 seconds to 1 minute. Discard the garlic.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u'Whisk broth, tomato paste, vinegar, sugar, soy sauce, sesame oil, cornstarch and crushed red pepper in a small bowl. Set the sauce near the stove.To prepare tofu and mushrooms'}, {u'steps': [], u'name': u'To prepare sauce'}], u'aggregateLikes': 1358, u'instructions': u'To prepare sauce: Whisk broth, tomato paste, vinegar, sugar, soy sauce, sesame oil, cornstarch and crushed red pepper in a small bowl. Set the sauce near the stove.To prepare tofu and mushrooms: Place tofu on several paper towels and sprinkle with 1/4 teaspoon salt. Turn the tofu over, sprinkle with the remaining 1/4 teaspoon salt, place more paper towels on top and weigh the tofu down with a plate. Set aside for 5 minutes. Cut the tofu into roughly 1-inch cubes.Heat a 14-inch flat-bottomed wok or large skillet over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in 1 tablespoon oil; add garlic and scallions and stir-fry until fragrant, 10 seconds. Add mushrooms and stir-fry until just beginning to soften, 1 minute. Transfer to a plate.Swirl the remaining 1 tablespoon oil into the pan, reduce the heat to medium, add the tofu and pan-fry, turning midway through cooking, until it begins to brown, about 3 minutes. Swirl in the reserved sauce and the mushroom mixture; increase the heat to high and stir-fry until the tofu is just heated through and the sauce clings to it, 30 seconds to 1 minute. Discard the garlic. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/sichuan-style-tofu-with-mushrooms-695357', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}