{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/546097-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 546097, u'veryPopular': True, u'lowFodmap': False, u'title': u'Donut Trifle', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 41.38, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 Tbsp. multi-colored sprinkles', u'aisle': u'Baking', u'name': u'colored sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93645, u'unit': u'Tbsp'}, {u'originalString': u"1 cup BREAKSTONE'S or KNUDSEN Sour Cream", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'8 glazed donuts with sprinkles, each cut into 8 pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'glazed pecans', u'metaInformation': [u'with sprinkles, each cut into 8 pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 93783, u'unit': u''}, {u'originalString': u'2 pkg. (3.4 oz. each) JELL-O Vanilla Flavor Instant Pudding', u'aisle': u'Baking', u'name': u'instant vanilla pudding', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.8, u'consistency': u'solid', u'id': 19206, u'unit': u'oz'}, {u'originalString': u'3 cups cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 tub (8 oz.) COOL WHIP Whipped Topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/donut-trifle-162253.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat pudding mixes and milk in medium bowl with whisk 2 min.  Stir in sour cream.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Layer half each of the donut pieces, pudding and COOL WHIP in large bowl; repeat layers.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Top with sprinkles.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 714, u'instructions': u'Beat pudding mixes and milk in medium bowl with whisk 2 min.  Stir in sour cream.                                             Layer half each of the donut pieces, pudding and COOL WHIP in large bowl; repeat layers.                                                Top with sprinkles.', u'spoonacularSourceUrl': u'https://spoonacular.com/donut-trifle-546097', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}