{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511064-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 511064, u'veryPopular': True, u'lowFodmap': False, u'title': u'Frozen Stuffed Banana Sandwiches', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 8.97, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'1 heaping tsp. Almond Butter or other nut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12195, u'unit': u'tsp'}, {u'originalString': u'1 Banana, sliced 1/4" thick pieces', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'thick', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 Tbsp. granola (optional)', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 8212, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup greek yogurt, plain', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 extra large strawberry, sliced', u'aisle': u'Produce', u'name': u'strawberry', u'metaInformation': [u'extra large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'9 toothpicks', u'aisle': u'?', u'name': u'toothpicks', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'unit': u''}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2012/05/08/frozen-stuffed-banana-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Slice banana's into pieces, make sure you have an even amount to make your sandwiches. Equally smear peanut butter on to one side of half of your cut bananas.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Add 1 piece of sliced strawberry onto peanut butter. Top other banana piece onto strawberry.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place toothpick into center of banana to hold it together. With a knife or spoon, smear the yogurt onto the banana, than sprinkle with granola.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'id': 8212, u'name': u'granola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Place into freezer for 30 to 60 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 3565, u'instructions': u"Slice banana's into pieces, make sure you have an even amount to make your sandwiches. Equally smear peanut butter on to one side of half of your cut bananas. Add 1 piece of sliced strawberry onto peanut butter. Top other banana piece onto strawberry.Place toothpick into center of banana to hold it together. With a knife or spoon, smear the yogurt onto the banana, than sprinkle with granola.Place into freezer for 30 to 60 minutes.", u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-stuffed-banana-sandwiches-511064', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}