{u'recipes': [{u'sourceName': u"Renee's Kitchen Adventures", u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/713887-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 713887, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Chicken Chopped Salad Bowls', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 338.5, u'creditText': u"Renee's Kitchen Adventures", u'extendedIngredients': [{u'originalString': u'1/2 cup mild banana pepper slices, divided', u'aisle': u'Canned and Jarred', u'name': u'banana pepper', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11976, u'unit': u'cup'}, {u'originalString': u'1 cup black olives, divided', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'cup'}, {u'originalString': u'1 cup shredded carrots, divided', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'12 oz. Tyson\xae Grilled & Ready Fully-Cooked Frozen Chicken Breast Strips, prepared according to package directions', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'frozen', u'prepared', u'fully-cooked', u'tyson\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 5062, u'unit': u'oz'}, {u'originalString': u'1 cup diced cucumber, divided', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'diced', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'1 cup cubed fresh mozzarella, divided', u'aisle': u'Cheese', u'name': u'fresh mozzarella', u'metaInformation': [u'fresh', u'divided', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'1 cup halved grape tomatoes, divided', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'divided', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'1/4 cup Wish-Bone\xae Italian dressing, and more to taste to finish the salad', u'aisle': u'Meat', u'name': u'ham bone', u'metaInformation': [u'italian', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bone-ham.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12011111, u'unit': u'cup'}, {u'originalString': u'1 cup marinated artichoke hearts, divided', u'aisle': u'Canned and Jarred', u'name': u'marinated artichoke hearts', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93828, u'unit': u'cup'}, {u'originalString': u'1 cup marinated mushrooms, divided', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1/4 cup shaved Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 cup dried pasta, shape, cooked according to package directions to al dente doneness', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'dried', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'cup'}, {u'originalString': u'1/2 cup thinly sliced red onion, divided', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'divided', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'5 - 6 cups chopped romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.reneeskitchenadventures.com/2016/02/italian-chicken-chopped-salad-bowls.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the warm pasta with 1/4 cup Wish-Bone Italian dressing.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the romaine lettuce to the pasta and stir.  Divide the pasta-romaine mixture equally between 4 large bowls. Top each bowl with the pasta-romaine mixture with 3 oz. of prepared Tyson Grilled & Ready Chicken Breast Strips. Continue to top salad bowls with the remaining ingredients, dividing them equally between the 4 bowls.  Top with additional Wish-Bone Italian dressing to taste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Chehalem INOX Chardonnay. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Combine the warm pasta with 1/4 cup Wish-Bone Italian dressing.  Add the romaine lettuce to the pasta and stir.  Divide the pasta-romaine mixture equally between 4 large bowls. Top each bowl with the pasta-romaine mixture with 3 oz. of prepared Tyson Grilled & Ready Chicken Breast Strips. Continue to top salad bowls with the remaining ingredients, dividing them equally between the 4 bowls.  Top with additional Wish-Bone Italian dressing to taste.  Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-chicken-chopped-salad-bowls-713887', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}