{u'recipes': [{u'sourceName': u'The Roasted Root', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512583-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_FULL', u'id': 512583, u'veryPopular': False, u'lowFodmap': False, u'title': u'10 Things You Need to Know About Kombucha + Apple Ginger Kombucha', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 120.68, u'creditText': u'The Roasted Root', u'extendedIngredients': [{u'originalString': u'8 Dried apple rings (one apple ring per bottle)*', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'dried', u'per bottle)*'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 cup apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9016, u'unit': u'cup'}, {u'originalString': u'1 gallon home-brewed kombucha', u'aisle': u'Tea and Coffee', u'name': u'brewed coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'gallon', u'unitShort': u'gallon', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u'gallon'}, {u'originalString': u'2 tablespoons fresh ginger, peeled and finely grated', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'finely grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.theroastedroot.net/10-things-need-know-kombucha-apple-ginger-kombucha-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a large sterilized pitcher, combine the plain kombucha, grated ginger, apple juice, and cinnamon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 9016, u'name': u'apple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Mix to combine.Sterilize 8 flip-cap or screw top glass bottles by running them through the dishwasher.Rip or chop up the dried apples and place 1 rings worth in each bottle.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the kombucha from the pitcher into the bottles, leaving room at the top, because gasses will form during secondary fermentation.Seal the bottles and place them in a warm, dark room (bedroom closet works awesome) for 2 to 3 days in order to let the kombucha go through secondary fermentation.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Place the bottles in the refrigerator. The kombucha will continue to ferment in the refrigerator, but it will slow down.When ready to drink, carefully open the bottles. Pressure forms during secondary fermentation, so point the bottle away from everyone. A small SCOBY will have formed during secondary fermentation, and there is also ginger pulp and apple rings in the kombucha. For best results, use a fine strainer to strain all of this out prior to drinking.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 325, u'instructions': u'In a large sterilized pitcher, combine the plain kombucha, grated ginger, apple juice, and cinnamon. Mix to combine.Sterilize 8 flip-cap or screw top glass bottles by running them through the dishwasher.Rip or chop up the dried apples and place 1 rings worth in each bottle.Pour the kombucha from the pitcher into the bottles, leaving room at the top, because gasses will form during secondary fermentation.Seal the bottles and place them in a warm, dark room (bedroom closet works awesome) for 2 to 3 days in order to let the kombucha go through secondary fermentation.Place the bottles in the refrigerator. The kombucha will continue to ferment in the refrigerator, but it will slow down.When ready to drink, carefully open the bottles. Pressure forms during secondary fermentation, so point the bottle away from everyone. A small SCOBY will have formed during secondary fermentation, and there is also ginger pulp and apple rings in the kombucha. For best results, use a fine strainer to strain all of this out prior to drinking.', u'spoonacularSourceUrl': u'https://spoonacular.com/10-things-you-need-to-know-about-kombucha-+-apple-ginger-kombucha-512583', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}