{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/605914-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 605914, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Flat Iron Steak with Tomato Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 295.72, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'1 tablespoon balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 pound flat iron steak', u'aisle': u'Meat', u'name': u'flat iron steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/boneless-chuck-or-top-blade-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 23059, u'unit': u'pound'}, {u'originalString': u'5 - 6 fresh basil leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 cup halved golden grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.lifesambrosia.com/2014/07/grilled-flat-iron-steak-with-tomato-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine tomatoes, garlic, olive oil, balsamic vinegar and basil together in a bowl. Season with salt and pepper. Cover and let set at room temperature while you prepare the steak. Preheat a gas grill to medium - high heat. Liberally season both sides of the steak with salt and pepper. Cook steak for 4 - 6 minutes on each side for medium rare.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove steak from grill and allow to rest for 10 minutes. Slice steak against the grain, top with tomato salad and serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Flat Iron Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Beringer Howell Mountain Bancroft Ranch Merlot with a 4.2 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"The 2006 Bancroft Ranch Merlot is a rich garnet color, and brims with flavors of ripe black fruits, brown spices and a hint of orange zest. Its refined tannins and depth of flavor make it one of Beringer's most memorable wines from Howell Mountain.Blend: 93% Merlot, 4% Cabernet Sauvignon, and 3% Cabernet Franc View More", u'title': u'Beringer Howell Mountain Bancroft Ranch Merlot', u'price': u'$34.99', u'id': 438453, u'link': u'https://www.wine.com/product/beringer-howell-mountain-bancroft-ranch-merlot-2006/116574', u'imageUrl': u'https://spoonacular.com/productImages/438453-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Combine tomatoes, garlic, olive oil, balsamic vinegar and basil together in a bowl. Season with salt and pepper. Cover and let set at room temperature while you prepare the steak. Preheat a gas grill to medium - high heat. Liberally season both sides of the steak with salt and pepper. Cook steak for 4 - 6 minutes on each side for medium rare. Remove steak from grill and allow to rest for 10 minutes. Slice steak against the grain, top with tomato salad and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-flat-iron-steak-with-tomato-salad-605914', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 22, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}