{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528830-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 210, u'id': 528830, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Salmon Potato Salad', u'diets': [u'gluten free', u'whole 30', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 193.34, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'2 pounds Tri Color Baby Potatoes, halved or quartered', u'aisle': u'Produce', u'name': u'baby potatoes', u'metaInformation': [u'halved', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11352, u'unit': u'pounds'}, {u'originalString': u'1 Tbsp Dill, minced + garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'Tbsp'}, {u'originalString': u'4 gloves Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbc tsp Ground Pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 Lemon, zest and juice', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2/3 cup Mexican Sour Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 93772, u'unit': u'cup'}, {u'originalString': u'\xbd tsp Red Pepper Flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'4 ounces Smoked Salmon filet, flaked - Not lox.', u'aisle': u'Seafood', u'name': u'salmon filet', u'metaInformation': [u'smoked', u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounces'}, {u'originalString': u'\xbd tsp Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp Tuscan Seasoning Blend', u'aisle': u'Spices and Seasonings', u'name': u'seasoning blend', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'tsp'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.countrycleaver.com/2013/08/smoked-salmon-potato-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, bring cut potatoes covered in salted water to a simmer. Bring the water to a fast simmer, not a rolling boil - that will destroy the potatoes and cause them to fall apart. Simmer until they are fork tender - about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and rinse under cold water.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread out on a rimmed cookie sheet. In a small bowl combine minced dill, garlic, lemon zest, salt, ground pepper, red pepper flakes, and Tuscan seasoning. Sprinkle over the potatoes and toss to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place coated potatoes in the fridge to chill. This will help the potatoes absorb the flavors. Chill for 1 hour.In a large bowl, whisk together the sour cream and mayonnaise and lemon juice.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour potatoes into the mixture, and scrape any remaining seasoning from the cookie sheet into the potatoes and cream.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}]}, {u'equipment': [], u'step': u'Add in flaked smoked salmon. Fold gently to combine. Season additionally if desired. Cover and chill until ready to serve - best chilled for at least three hours.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with extra dill for garnish.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Vampire Pinot Grigio Wine with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'fresh , floral , fruity', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'In a large saucepan, bring cut potatoes covered in salted water to a simmer. Bring the water to a fast simmer, not a rolling boil - that will destroy the potatoes and cause them to fall apart. Simmer until they are fork tender - about 20 minutes. Drain and rinse under cold water. Spread out on a rimmed cookie sheet. In a small bowl combine minced dill, garlic, lemon zest, salt, ground pepper, red pepper flakes, and Tuscan seasoning. Sprinkle over the potatoes and toss to combine. Place coated potatoes in the fridge to chill. This will help the potatoes absorb the flavors. Chill for 1 hour.In a large bowl, whisk together the sour cream and mayonnaise and lemon juice. Pour potatoes into the mixture, and scrape any remaining seasoning from the cookie sheet into the potatoes and cream. Add in flaked smoked salmon. Fold gently to combine. Season additionally if desired. Cover and chill until ready to serve - best chilled for at least three hours. Serve with extra dill for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-salmon-potato-salad-528830', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}