{u'recipes': [{u'sourceName': u'Nutmeg Nanny', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/586468-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 586468, u'veryPopular': True, u'lowFodmap': False, u'title': u'Toasted Coconut Tiramisu', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 254.6, u'creditText': u'Nutmeg Nanny', u'extendedIngredients': [{u'originalString': u'3/4 cup coconut coffee, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'coconut coffee creamer', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 98976, u'unit': u'cup'}, {u'originalString': u'1/2 cup heavy cream, cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 packages soft ladyfingers', u'aisle': u'Sweet Snacks', u'name': u'ladyfingers', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'unitLong': u'package', u'unitShort': u'packages', u'amount': 1.0, u'consistency': u'solid', u'id': 18423, u'unit': u'packages'}, {u'originalString': u'4 ounces mascarpone cheese', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 93820, u'unit': u'ounces'}, {u'originalString': u'1 tablespoons black rum', u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 cup toasted sweetened coconut, divided', u'aisle': u'Baking', u'name': u'sweetened coconut', u'metaInformation': [u'sweetened', u'divided', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12109, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoons vanilla bean paste', u'aisle': u'Gourmet', u'name': u'vanilla bean paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93813, u'unit': u'teaspoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.nutmegnanny.com/2014/03/20/toasted-coconut-tiramisu/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 49, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a medium sized mixing bowl stir together mascarpone cheese, 1/2 cup toasted coconut, coconut coffee, black rum and vanilla bean paste. In a bowl an electric mixer add heavy cream and sugar. Bean until soft peaks form.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 93813, u'name': u'vanilla paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add half the whipped cream mixture to the mascarpone mixture and stir to combine. Fold the remaining whipped cream into the mixture. After the mascarpone mixture has been prepared it's time to start to the ladyfinger mixture and assembly. Depending on your serving bowls you will get 2 to 4 servings. I used 2 small trifle glasses. In a small bowl stir together the coconut coffee and black rum. Quickly dip the 1 lady finger at a time and add to the bottom of the mini trifle glass. You should be able to fit 2-3 ladyfingers on the bottom layer. Top with mascarpone mixture and a sprinkling of the remainder toasted coconut. Follow for 2 more layers. Smoothing the top layer for appearance.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u'Let the mixture set for at least an hour in the refrigerator to set up.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tiramisu on the menu? Try pairing with Cream Sherry, Chianti, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 754, u'instructions': u"In a medium sized mixing bowl stir together mascarpone cheese, 1/2 cup toasted coconut, coconut coffee, black rum and vanilla bean paste. In a bowl an electric mixer add heavy cream and sugar. Bean until soft peaks form. Add half the whipped cream mixture to the mascarpone mixture and stir to combine. Fold the remaining whipped cream into the mixture. After the mascarpone mixture has been prepared it's time to start to the ladyfinger mixture and assembly. Depending on your serving bowls you will get 2 to 4 servings. I used 2 small trifle glasses. In a small bowl stir together the coconut coffee and black rum. Quickly dip the 1 lady finger at a time and add to the bottom of the mini trifle glass. You should be able to fit 2-3 ladyfingers on the bottom layer. Top with mascarpone mixture and a sprinkling of the remainder toasted coconut. Follow for 2 more layers. Smoothing the top layer for appearance. Let the mixture set for at least an hour in the refrigerator to set up.", u'spoonacularSourceUrl': u'https://spoonacular.com/toasted-coconut-tiramisu-586468', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}