{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/597886-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 597886, u'veryPopular': False, u'lowFodmap': False, u'title': u'Barbecue Biscuits with Soft Fried Egg', u'diets': [], u'pricePerServing': 112.76, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'1/2 to 1 cup of your favorite barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'2 cups barbecue', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cups'}, {u'originalString': u'4 biscuits, warmed and split', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [u'split', u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18009, u'unit': u''}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.framedcooks.com/2013/09/barbecue-biscuits-with-egg.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat barbecue in a medium saucepan with sauce (use more or less sauce, depending on how you like it!) until warmed through.  Cover pot to keep warm and set aside.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat butter in medium-large skillet over medium-high heat.  When butter is melted but not browned, gently crack eggs into the skillet.  Cover the skillet and let the eggs cook for 2 minutes.  Check them, and if they are not yet done to your liking, turn the heat off and keep the eggs in the skillet, covered, for another minute or so until they are done (you want the yolks a little runny).3. Assemble as follows: place a split biscuit on each of four plates, top with barbecue, and top the barbecue with an egg.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve at once - for breakfast, lunch or dinner!', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 36, u'instructions': u'1. Heat barbecue in a medium saucepan with sauce (use more or less sauce, depending on how you like it!) until warmed through.  Cover pot to keep warm and set aside.2. Heat butter in medium-large skillet over medium-high heat.  When butter is melted but not browned, gently crack eggs into the skillet.  Cover the skillet and let the eggs cook for 2 minutes.  Check them, and if they are not yet done to your liking, turn the heat off and keep the eggs in the skillet, covered, for another minute or so until they are done (you want the yolks a little runny).3. Assemble as follows: place a split biscuit on each of four plates, top with barbecue, and top the barbecue with an egg.  Serve at once - for breakfast, lunch or dinner!', u'spoonacularSourceUrl': u'https://spoonacular.com/barbecue-biscuits-with-soft-fried-egg-597886', u'dishTypes': [u'side dish'], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}