{u'recipes': [{u'sourceName': u'A Few Short Cuts', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/539802-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 539802, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot Cocoa Poke Cake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 22.27, u'creditText': u'A Few Short Cuts', u'extendedIngredients': [{u'originalString': u'1 Chocolate Cake Mix (prepared according to package)', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [u'prepared', u'( according to package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99040, u'unit': u''}, {u'originalString': u'1 small box instant chocolate pudding mix', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 19184, u'unit': u'box'}, {u'originalString': u'1 small box instant vanilla pudding mix', u'aisle': u'Baking', u'name': u'instant vanilla pudding mix', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 19206, u'unit': u'box'}, {u'originalString': u'2 cups mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'3 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 11.0, u'sourceUrl': u'http://afewshortcuts.com/2013/12/hot-cocoa-poke-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/straw.jpg', u'id': 405924, u'name': u'drinking straws'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake a prepare cake according to the box in a 13x9 pan.Once it comes out of the oven, use a straw to poke holes throughout the cake.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the 2 boxes of instant pudding mix with 3 cups of milk until well mixed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour the pudding over the cake, over the holes. Cover and refrigerate for atleast 2 hours. Top with the mini marshmallows and serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Bake a prepare cake according to the box in a 13x9 pan.Once it comes out of the oven, use a straw to poke holes throughout the cake.Mix the 2 boxes of instant pudding mix with 3 cups of milk until well mixed.Pour the pudding over the cake, over the holes. Cover and refrigerate for atleast 2 hours. Top with the mini marshmallows and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-cocoa-poke-cake-539802', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}