{u'recipes': [{u'sourceName': u'A Saucy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/719806-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 719806, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Covered Peanut Butter Eggs', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 90, u'pricePerServing': 95.8, u'creditText': u'A Saucy Kitchen', u'extendedIngredients': [{u'originalString': u'1 can (15 oz) chickpeas drained', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16058, u'unit': u'oz'}, {u'originalString': u'6 ounces dark chocolate, it comes out to about 3 cups', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'2-3 tablespoons maple syrup or agave', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup peanut butter (125 grams)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 16098, u'unit': u'grams'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.asaucykitchen.com/chocolate-covered-peanut-butter-eggs/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the drained chickpeas, peanut butter, maple syrup, and vanilla extract to a blender and blend until smooth. You will need to stop the blender periodically to scrape the sides down.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Transfer the cookie dough to a medium sized dough, cover, and place in the fridge for 30 minutes so that the dough becomes firm and easy to handle.After at least 30 minutes take the dough out of the fridge. Pinch off the dough 1-2 tablespoons at a time and form into egg shapes. Lay out the egg shaped peanut butter dough on a plate and place back in the fridge while you melt and cool the chocolate in the next step.While the dough is firming up again in the fridge, begin melting your chocolate. Bring a small pot of water to a simmer on the stove top. While the water is heating up, break your chocolate up and place in a heat proof bowl. Once the water in the pot reaches a simmer, place the heat proof bowl over the water. Stir the chocolate occasionally to help it melt evenly. Once it's completely melted remove it from the heat and set it aside until it's cool enough to handle.Lay out a sheet a wax paper to place the chocolate covered peanut butter eggs on after they've been dipped in chocolate. Once you're ready to start dipping, place a peanut butter egg on a fork and dunk in the bowl of melted chocolate. Pull the egg out of the chocolate and let the excess chocolate drip back in the bowl for a few seconds before placing the egg on the wax paper to set. Continue dipping until all the eggs are covered.", u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Drizzle any excess chocolate over the eggs and allow them to set for at least 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 538, u'instructions': u"Add the drained chickpeas, peanut butter, maple syrup, and vanilla extract to a blender and blend until smooth. You will need to stop the blender periodically to scrape the sides down. Transfer the cookie dough to a medium sized dough, cover, and place in the fridge for 30 minutes so that the dough becomes firm and easy to handle.After at least 30 minutes take the dough out of the fridge. Pinch off the dough 1-2 tablespoons at a time and form into egg shapes. Lay out the egg shaped peanut butter dough on a plate and place back in the fridge while you melt and cool the chocolate in the next step.While the dough is firming up again in the fridge, begin melting your chocolate. Bring a small pot of water to a simmer on the stove top. While the water is heating up, break your chocolate up and place in a heat proof bowl. Once the water in the pot reaches a simmer, place the heat proof bowl over the water. Stir the chocolate occasionally to help it melt evenly. Once it's completely melted remove it from the heat and set it aside until it's cool enough to handle.Lay out a sheet a wax paper to place the chocolate covered peanut butter eggs on after they've been dipped in chocolate. Once you're ready to start dipping, place a peanut butter egg on a fork and dunk in the bowl of melted chocolate. Pull the egg out of the chocolate and let the excess chocolate drip back in the bowl for a few seconds before placing the egg on the wax paper to set. Continue dipping until all the eggs are covered. Drizzle any excess chocolate over the eggs and allow them to set for at least 30 minutes.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-covered-peanut-butter-eggs-719806', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}