{u'recipes': [{u'sourceName': u'Simply Being Mommy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512726-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 512726, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Scramble Panini', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 298.18, u'creditText': u'Simply Being Mommy', u'extendedIngredients': [{u'originalString': u'1\xbd cup (12.5 oz) canned white meat chicken breast', u'aisle': u'Meat', u'name': u'chicken breast meat', u'metaInformation': [u'white', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.5, u'consistency': u'solid', u'id': 5062, u'unit': u'oz'}, {u'originalString': u'2 cups Egg Beaters egg substitute', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg beaters', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93833, u'unit': u'cups'}, {u'originalString': u'\xbc tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbc cup 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 cup sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'\xbc tsp salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1102047, u'unit': u'tsp'}, {u'originalString': u'\xbd cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'8 whole wheat flatbreads', u'aisle': u'Bakery/Bread', u'name': u'wheat flatbreads', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10018042, u'unit': u''}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://simplybeingmommy.com/2011/08/15/chicken-scramble-panini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In mixing bowl, stir together eggs, milk, salt, pepper and garlic powder. In a separate bowl, combine chicken, mushrooms and green onion. Turn on panini press to heat.In a non-stick skillet, add egg mixture and cook over medium-low heat. Cook until eggs are almost done and add chicken mixture. Continue to cook until chicken is heated through and eggs are no longer runny.Spray panini press with butter flavored cooking spray. Put a scoop of egg mixture onto one end of the flatbread or tortilla, add a little cheese and fold.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}], u'step': u"Place on panini press and cook for about two minutes. You'll know once it's done because it will be a nice golden brown with beautiful panini marks.", u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u"In mixing bowl, stir together eggs, milk, salt, pepper and garlic powder. In a separate bowl, combine chicken, mushrooms and green onion. Turn on panini press to heat.In a non-stick skillet, add egg mixture and cook over medium-low heat. Cook until eggs are almost done and add chicken mixture. Continue to cook until chicken is heated through and eggs are no longer runny.Spray panini press with butter flavored cooking spray. Put a scoop of egg mixture onto one end of the flatbread or tortilla, add a little cheese and fold. Place on panini press and cook for about two minutes. You'll know once it's done because it will be a nice golden brown with beautiful panini marks.", u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-scramble-panini-512726', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}