{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/629756-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 629756, u'veryPopular': False, u'lowFodmap': False, u'title': u'Monterey Chicken Fajitas', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 251.72, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'1.6 lbs (750 g) boneless chicken breasts, cut into strips', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'boneless', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 750.0, u'consistency': u'solid', u'id': 5062, u'unit': u'g'}, {u'originalString': u"1 can (284 mL) CAMPBELL'S\xae Condensed Low Fat Cream of Celery Soup", u'aisle': u'Canned and Jarred', u'name': u'condensed cream of celery soup', u'metaInformation': [u'low fat', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-celery-soup.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 284.0, u'consistency': u'liquid', u'id': 6010, u'unit': u'mL'}, {u'originalString': u'1 cup (250 mL) corn', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 250.0, u'consistency': u'solid', u'id': 11168, u'unit': u'mL'}, {u'originalString': u'6 flour tortillas (6-inch/15 cm)', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'(/15 cm)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 6.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'6-inch'}, {u'originalString': u'1 small green pepper, cut into strips', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'small', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'Lime wedges', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1 cup (250 mL) Monterey Jack cheese, shredded', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 250.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'mL'}, {u'originalString': u'1 medium onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 small red pepper, cut into strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'small', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 cup (250 mL) PACE\xae chunky salsa, divided', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 250.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'mL'}, {u'originalString': u'1 tbsp (15 mL) Tex-Mex seasoning blend', u'aisle': u'Spices and Seasonings', u'name': u'seasoning blend', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 15.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'mL'}, {u'originalString': u'2 tbsp (30 mL) vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'mLs', u'unitShort': u'mL', u'amount': 30.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'mL'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.thereciperebel.com/monterey-chicken-fajitas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large pan over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add chicken and cook until lightly browned (about 5 minutes).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add peppers, onions and seasoning and cook until veggies are tender-crisp and chicken is cooked through (about 7-10 minutes).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the soup and  cup of salsa, and bring to a simmer. Stir in the corn. Cook 2-3 minutes, until heated through.Spoon about  cup filling into each tortilla and serve with remaining salsa, cheese and lime wedges.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Raymond Reserve Selection Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 126, u'instructions': u'Heat oil in a large pan over medium-high heat. Add chicken and cook until lightly browned (about 5 minutes). Add peppers, onions and seasoning and cook until veggies are tender-crisp and chicken is cooked through (about 7-10 minutes).Add the soup and  cup of salsa, and bring to a simmer. Stir in the corn. Cook 2-3 minutes, until heated through.Spoon about  cup filling into each tortilla and serve with remaining salsa, cheese and lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/monterey-chicken-fajitas-629756', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}