{u'recipes': [{u'sourceName': u'The Hungry House Wife', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532770-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 532770, u'veryPopular': True, u'lowFodmap': False, u'title': u'S’mores Milkshake & Giveaway', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 114.73, u'creditText': u'The Hungry House Wife', u'extendedIngredients': [{u'originalString': u'\xbc cup Jif Chocolate Hazelnut Spread', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'chocolate hazelnut spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19125, u'unit': u'cup'}, {u'originalString': u'2 sheets regular Graham Crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 2.0, u'consistency': u'solid', u'id': 18617, u'unit': u'sheets'}, {u'originalString': u'4 large Marshmallows, toasted', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'large', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 19116, u'unit': u''}, {u'originalString': u'3 cups Vanilla Ice Cream, packed', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.thehungryhousewife.com/2012/06/smores-milkshake-giveaway.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the milk in a blender.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the ice cream.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Mix in blender until smooth.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the marshmallows(these will obviously be very sticky), graham crackers and Jif Hazelnut', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Spread.Pulse several times until the last 3 ingredients are incorporated', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 6839, u'instructions': u'Place the milk in a blender.Add the ice cream.Mix in blender until smooth.Add the marshmallows(these will obviously be very sticky), graham crackers and Jif Hazelnut Spread.Pulse several times until the last 3 ingredients are incorporated', u'spoonacularSourceUrl': u'https://spoonacular.com/smores-milkshake-giveaway-532770', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}