{u'recipes': [{u'sourceName': u'Not Enough Cinnamon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542228-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 542228, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey-Pineapple Glazed Shrimps', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 364.27, u'creditText': u'Not Enough Cinnamon', u'extendedIngredients': [{u'originalString': u'3 small garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1-1/2 tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'1/2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 can (8 oz) pineapple chunks in juice (keep the juice!)', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'canned', u'(keep the juice!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9273, u'unit': u'oz'}, {u'originalString': u'1/2 tsp hot pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1.5 lb raw shrimps, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimps', u'metaInformation': [u'raw', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 15152, u'unit': u'lb'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://notenoughcinnamon.com/2013/07/30/honey-pineapple-glazed-shrimps/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, combine raw shrimps with 1 tbsp arrowroot powder or cornstarch.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Mix well to cover the shrimps.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a non-stick skillet over medium heat. Cook garlic for about 30 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add shrimps, season with salt and pepper and cook until they turn pink.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from skillet and set aside.  While shrimps are cooking, combine pineapple juice (you should get about 1/2 cup out of a 8 oz can) and 2 tsp arrowroot (or 3 tsp cornstarch) in a small bowl.  In the same skillet you used for the shrimps, pour pineapple juice mixture and honey, and keep stirring. As soon as it starts bubbling, reduce heat. Return shrimps to the skillet, add pineapple chunks and hot pepper flakes and stir until heated through.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'id': 9273, u'name': u'pineapple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u'In a medium bowl, combine raw shrimps with 1 tbsp arrowroot powder or cornstarch. Mix well to cover the shrimps.  Heat olive oil in a non-stick skillet over medium heat. Cook garlic for about 30 seconds. Add shrimps, season with salt and pepper and cook until they turn pink. Remove from skillet and set aside.  While shrimps are cooking, combine pineapple juice (you should get about 1/2 cup out of a 8 oz can) and 2 tsp arrowroot (or 3 tsp cornstarch) in a small bowl.  In the same skillet you used for the shrimps, pour pineapple juice mixture and honey, and keep stirring. As soon as it starts bubbling, reduce heat. Return shrimps to the skillet, add pineapple chunks and hot pepper flakes and stir until heated through. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-pineapple-glazed-shrimps-542228', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}