{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/205226-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205226, u'veryPopular': False, u'lowFodmap': False, u'title': u"Onion Crema (from Ragazza's Pizza Bianca)", u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 74.0, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 cups dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cups'}, {u'originalString': u'2 medium cloves garlic, sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 medium onions, diced (about 1 cup)', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/08/onion-crema-from-ragazzas-pizza-bianca-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt butter in a large saucepan over medium high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions and garlic, season with salt and pepper, and cook, stirring frequently, until just starting to brown.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add white wine, bring to a simmer, and cook until liquid is nearly completely reduced.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}]}, {u'equipment': [], u'step': u'Add cream, bring to a simmer, and cook, stirring frequently, until reduced by 1/3rd, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'2', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend ingredients using an immersion blender or a countertop blender. Season to taste with more salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Cecchi Sangiovese di Toscana. It has 4.1 out of 5 stars and a bottle costs about 9 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'The red wine is made according to traditional methods, along with the help of modern technology and with much care. It has a ruby red colour with purple lights, and a delicate fruity bouquet reminiscent of violets and irises. Its good structure, well combined with a moderate acidity, can be distinguished on the palate. Although lacking in sharp tannins, the generous taste of the Sangiovese guarantees a wine that ages well. This wine is pleasant with cold and hot meat dishes and when young should be served at a temperature of 16 \xb0C. View More', u'title': u'Cecchi Sangiovese di Toscana', u'price': u'$9.49', u'id': 439017, u'link': u'https://www.wine.com/product/cecchi-sangiovese-di-toscana-2000/48873', u'imageUrl': u'https://spoonacular.com/productImages/439017-312x231.jpg'}]}, u'aggregateLikes': 60, u'instructions': u'Procedures                                                                              1                                                                            Melt butter in a large saucepan over medium high heat. Add onions and garlic, season with salt and pepper, and cook, stirring frequently, until just starting to brown. Add white wine, bring to a simmer, and cook until liquid is nearly completely reduced. Add cream, bring to a simmer, and cook, stirring frequently, until reduced by 1/3rd, about 10 minutes.                                                                                                                            2                                                                            Blend ingredients using an immersion blender or a countertop blender. Season to taste with more salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/onion-crema-from-ragazzas-pizza-bianca-205226', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}