{u'recipes': [{u'sourceName': u'She Wears Many Hats', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/721126-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 721126, u'veryPopular': True, u'lowFodmap': False, u'title': u'Irish Cream Chocolate Pie', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 123.79, u'creditText': u'She Wears Many Hats', u'extendedIngredients': [{u'originalString': u'5 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 prepared 9-inch chocolate cookie pie crust', u'aisle': u'Baking', u'name': u'chocolate cookie pie crust', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'9-inch', u'unitShort': u'9-inch', u'amount': 1.0, u'consistency': u'solid', u'id': 28111, u'unit': u'9-inch'}, {u'originalString': u'1 1⁄2 cups chocolate cookie crumbs (about 30 chocolate thin wafer cookies)', u'aisle': u'Sweet Snacks', u'name': u'cookie crumbs', u'metaInformation': [u'thin', u'( 30 chocolate wafer cookies)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10018192, u'unit': u'cups'}, {u'originalString': u'4 ounces Irish Cream Liqueur (like Baileys)', u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [u'(like Baileys)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 93764, u'unit': u'ounces'}, {u'originalString': u'8 ounces semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'ounces'}, {u'originalString': u'2 cups whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://shewearsmanyhats.com/irish-cream-chocolate-pie-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'For the chocolate crust:Preheat an oven to 350-degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine cookie crumbs and butter until well-incorporated.', u'number': 2, u'ingredients': [{u'image': None, u'id': 10018192, u'name': u'cookie crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Pour mixture into a 9-inch pie dish or plate. Press crumb mixture firmly and evenly into the bottom and up the sides.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 10 minutes. Allow to cool.For the pie filling:Whip cream until soft peaks form. Continue whipping while streaming in the Irish Cream Liqueur.Melt chocolate according to package instructions. Stir 1/2 cup of the whipped cream mixture into the melted chocolate.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Mix until smooth.Gradually add melted chocolate into remaining whipped cream; gently mix until incorporated.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into prepared pie crust. Refrigerate for about 6 hours or until set.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try McFadden Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 6965, u'instructions': u'For the chocolate crust:Preheat an oven to 350-degrees F.Combine cookie crumbs and butter until well-incorporated. Pour mixture into a 9-inch pie dish or plate. Press crumb mixture firmly and evenly into the bottom and up the sides.Bake 10 minutes. Allow to cool.For the pie filling:Whip cream until soft peaks form. Continue whipping while streaming in the Irish Cream Liqueur.Melt chocolate according to package instructions. Stir 1/2 cup of the whipped cream mixture into the melted chocolate. Mix until smooth.Gradually add melted chocolate into remaining whipped cream; gently mix until incorporated.Pour into prepared pie crust. Refrigerate for about 6 hours or until set.', u'spoonacularSourceUrl': u'https://spoonacular.com/irish-cream-chocolate-pie-721126', u'dishTypes': [], u'occasions': [u'st patricks day'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}