{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/250302-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 250302, u'veryPopular': False, u'lowFodmap': True, u'title': u'Coconut Dairy-Free Creme Caramel', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 35.0, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 teaspoon coconut extract (rum or orange extract can be substituted )', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'canned', u'(rum or orange extract can be substituted )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Original or Vanilla So Delicious Coconut Milk Beverage, shaken', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'coconut milk beverage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 99001, u'unit': u'cup'}, {u'originalString': u'2 to 3 tablespoons fresh grated coconut or desiccated coconut', u'aisle': u'Baking', u'name': u'desiccated coconut', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12108, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/coconut-dairy-free-creme-caramel', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the sugar in a small saucepan and drizzle the water over it. Swirl pan to help the sugar dissolve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the pan over high heat and bring to a boil. Do not stir! Watch carefully. Cook on high for  approximately 3 to 5 minutes, or until the sugar mixture becomes dark golden brown. Do not let it burn or smoke. Occasionally swirl the pan to distribute the syrup as one side may burn because of the balance of the burner or stove.Immediately pour the syrup into the bottom of a 4 to 6 cup casserole ovenproof dish. Allow to cool. It will harden. This will be the decoration for the top.Preheat your oven to 325\xbaF.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all filling ingredients together. Gently pour over the hardened syrup in your casserole dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 20 to 25 minutes. The center will jiggle. Allow to cool at room temperature.Once cool, refrigerate the dairy-free creme caramel for 5 hours or overnight. It can be make 2-3 days in advance.Enjoy with love!', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Creme Caramel works really well with Cream Sherry, Albarino, and Grenache. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'albarino', u'grenache', u'moscato dasti', u'port', u'tempranillo'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 218, u'instructions': u'Place the sugar in a small saucepan and drizzle the water over it. Swirl pan to help the sugar dissolve.Place the pan over high heat and bring to a boil. Do not stir! Watch carefully. Cook on high for  approximately 3 to 5 minutes, or until the sugar mixture becomes dark golden brown. Do not let it burn or smoke. Occasionally swirl the pan to distribute the syrup as one side may burn because of the balance of the burner or stove.Immediately pour the syrup into the bottom of a 4 to 6 cup casserole ovenproof dish. Allow to cool. It will harden. This will be the decoration for the top.Preheat your oven to 325\xbaF.Whisk all filling ingredients together. Gently pour over the hardened syrup in your casserole dish.Bake for 20 to 25 minutes. The center will jiggle. Allow to cool at room temperature.Once cool, refrigerate the dairy-free creme caramel for 5 hours or overnight. It can be make 2-3 days in advance.Enjoy with love!', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-dairy-free-creme-caramel-250302', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}