{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537130-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 537130, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Sprout Salad', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 156.29, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'2 tablespoons apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'5 ounces arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11959, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon crushed black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 pound brussel sprouts, quartered', u'aisle': u'Produce', u'name': u'brussel sprouts', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'pound'}, {u'originalString': u'1 cup pearl barley, cooked', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'cooked pearl barley', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20006, u'unit': u'cup'}, {u'originalString': u'1/2 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2-3 ounces Parmesan cheese, slivered', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'2 cups red seedless grapes, halved', u'aisle': u'Produce', u'name': u'red grapes', u'metaInformation': [u'red', u'seedless', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-grapes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cups'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.macheesmo.com/2013/09/roasted-brussel-sprout-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut ends off of brussel sprouts and quarter them through the center. Toss sprouts with 1 tablespoon olive oil and a big pinch of salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Spread sprouts out on a baking sheet.3) Roast sprouts for about 20-25 minutes until they are nicely browned and crispy around the edges. Stir once halfway through to ensure even cooking.4) Meanwhile, whisk together dressing ingredients and halve grapes.5)', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [], u'step': u"Drain barley when it's done and rinse with cold water. When sprouts are done, let them cool to room temperature.6) Toss arugula with a few tablespoons of dressing until the leaves are lightly coated. Toss in barley and stir to combine.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}, {u'equipment': [], u'step': u'Spread arugula out on a large serving plater.7) Top arugula and barley mixture with roasted sprouts, grapes, parmesan and a drizzle of extra dressing.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [], u'step': u"Serve immediately or chill until needed. Salad will keep okay in the fridge for a few days but is best the same day it's made.", u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 155, u'instructions': u"Directions1) Cook pearl barley according to directions until just tender. This will take 45-50 minutes in boiling water. Preheat oven to 375 degrees F.2) Cut ends off of brussel sprouts and quarter them through the center. Toss sprouts with 1 tablespoon olive oil and a big pinch of salt and pepper. Spread sprouts out on a baking sheet.3) Roast sprouts for about 20-25 minutes until they are nicely browned and crispy around the edges. Stir once halfway through to ensure even cooking.4) Meanwhile, whisk together dressing ingredients and halve grapes.5) Drain barley when it's done and rinse with cold water. When sprouts are done, let them cool to room temperature.6) Toss arugula with a few tablespoons of dressing until the leaves are lightly coated. Toss in barley and stir to combine. Spread arugula out on a large serving plater.7) Top arugula and barley mixture with roasted sprouts, grapes, parmesan and a drizzle of extra dressing. Serve immediately or chill until needed. Salad will keep okay in the fridge for a few days but is best the same day it's made.", u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-sprout-salad-537130', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}