{u'recipes': [{u'sourceName': u'Gourmande in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512270-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_6', u'cookingMinutes': 0, u'id': 512270, u'veryPopular': False, u'lowFodmap': True, u'title': u'Heirloom Tomato Salad | A Farewell to Summer', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 310.74, u'creditText': u'Gourmande in the Kitchen', u'extendedIngredients': [{u'originalString': u'2 Tablespoons aged balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'aged balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002069, u'unit': u'Tablespoons'}, {u'originalString': u'Freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 cup extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1 small bunch (about 1/4 cup) fresh basil leaves, torn', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'3 lbs. heirloom tomatoes (use a variety of colors and sizes)', u'aisle': u'Produce', u'name': u'heirloom tomatoes', u'metaInformation': [u'(use a variety of colors and sizes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u'lbs'}, {u'originalString': u'Sea salt (such as fleur de sel)', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'(such as fleur de sel)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://gourmandeinthekitchen.com/2010/heirloom-tomato-salad-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse and slice the tomatoes into 1/2 inch thick wedges and place them on a large plate or serving platter.Sprinkle with sea salt and black pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Drizzle the olive oil and balsamic vinegar over the tomatoes.Tear the basil leaves with your hands and sprinkle on top.Taste for seasoning and add more salt, pepper or vinegar if necessary.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve at room temperature with fresh burrata cheese to accompany if you have it.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad can be paired with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Rinse and slice the tomatoes into 1/2 inch thick wedges and place them on a large plate or serving platter.Sprinkle with sea salt and black pepper.Drizzle the olive oil and balsamic vinegar over the tomatoes.Tear the basil leaves with your hands and sprinkle on top.Taste for seasoning and add more salt, pepper or vinegar if necessary.Serve at room temperature with fresh burrata cheese to accompany if you have it.', u'spoonacularSourceUrl': u'https://spoonacular.com/heirloom-tomato-salad-a-farewell-to-summer-512270', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}