{u'recipes': [{u'sourceName': u'The Wanderlust Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625799-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 625799, u'veryPopular': False, u'lowFodmap': False, u'title': u'One Pan Roasted Harissa Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 235.38, u'creditText': u'The Wanderlust Kitchen', u'extendedIngredients': [{u'originalString': u'1 (14 ounce) can chickpeas, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'1 cup finely diced carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup small cauliflower florets', u'aisle': u'Produce', u'name': u'cauliflower florets', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cup'}, {u'originalString': u'2 teaspoons extra virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons harissa (mild or spicy)', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [u'(mild or spicy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1006972, u'unit': u'tablespoons'}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'6 boneless, skinless chicken thighs', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5096, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://thewanderlustkitchen.com/one-pan-roasted-harissa-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 425 degrees Fahrenheit and position a rack in the center of the oven.Toss the chicken thighs with the harissa in a large bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'id': 1006972, u'name': u'harissa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 teaspoons of the olive oil in a 12" or larger oven-proof skillet over medium-high heat. Once the oil is just barely smoking, add the chicken thighs to the pan in a single layer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Let cook undisturbed for 2 minutes. Turn the thighs over and cook for another 2 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan and set aside on a plate.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining teaspoon of oil to the pan along with the carrots and cauliflower.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Saute for 90 seconds.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chickpeas and toss well.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pot-holder.jpg', u'id': 221447, u'name': u'pot holder'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place both lemon halves in the pan cut side down, snugly against the bottom of the pan so the fruit will caramelize in the oven.Return the chicken to the pan, nestling each piece under the vegetables. Use pot holders to carefully transfer the pan to the oven. Roast, uncovered, for 25 minutes, flipping the chicken over halfway through.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Serve right out of the skillet; use tongs to squeeze the lemon juice over the chicken (watch for seeds!).', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u'Preheat your oven to 425 degrees Fahrenheit and position a rack in the center of the oven.Toss the chicken thighs with the harissa in a large bowl. Heat 2 teaspoons of the olive oil in a 12" or larger oven-proof skillet over medium-high heat. Once the oil is just barely smoking, add the chicken thighs to the pan in a single layer. Let cook undisturbed for 2 minutes. Turn the thighs over and cook for another 2 minutes. Remove from pan and set aside on a plate.Add the remaining teaspoon of oil to the pan along with the carrots and cauliflower. Saute for 90 seconds. Add the chickpeas and toss well. Place both lemon halves in the pan cut side down, snugly against the bottom of the pan so the fruit will caramelize in the oven.Return the chicken to the pan, nestling each piece under the vegetables. Use pot holders to carefully transfer the pan to the oven. Roast, uncovered, for 25 minutes, flipping the chicken over halfway through.Serve right out of the skillet; use tongs to squeeze the lemon juice over the chicken (watch for seeds!).', u'spoonacularSourceUrl': u'https://spoonacular.com/one-pan-roasted-harissa-chicken-625799', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}