{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/180996-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 180996, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheeseburger Chowder', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 144.14, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'1 lb lean (at least 80%) ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'80%', u'lean', u'(at least )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 can (1 lb 2.5 oz) Progresso\xae 99% Light creamy potato with bacon & cheese soup', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'light', u'99%', u'with bacon & cheese soup', u'progresso\xae', u'(1 lb 2.5 oz)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u'can'}, {u'originalString': u'1/4 cup sharp process cheese spread with bacon (from 5-oz jar)', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'with bacon (from 5-oz jar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1/4 cup shredded prepared cheese product (1 oz)', u'aisle': u'?', u'name': u'cheese product', u'metaInformation': [u'shredded', u'prepared'], u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'unit': u'oz'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'https://www.bettycrocker.com/recipes/cheeseburger-chowder/89c1cfb0-d07d-4908-a685-524a7799faeb', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In 2-quart saucepan, cook beef over medium heat 8 to 10 minutes, stirring occasionally, until thoroughly cooked; drain.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add soup and milk; mix well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Heat to boiling. Reduce heat to low.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add cheese spread; cook and stir until cheese spread is melted. Top individual servings with shredded cheese, tomato and onions.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chowder can be paired with Chardonnay, Riesling, and Sauvignon Blanc. Chowder can benefit from a crisp white to cut through the rich, creamy broth - or you can go big or go home with a rich, buttery chardonnay. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'riesling', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'1                               In 2-quart saucepan, cook beef over medium heat 8 to 10 minutes, stirring occasionally, until thoroughly cooked; drain.                                                          2                               Add soup and milk; mix well. Heat to boiling. Reduce heat to low. Add cheese spread; cook and stir until cheese spread is melted. Top individual servings with shredded cheese, tomato and onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheeseburger-chowder-180996', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}