{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/212110-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 212110, u'veryPopular': False, u'lowFodmap': False, u'title': u'Saucy Japanese greens with sticky sesame rice', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 211.53, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'250g long-stemmed broccoli, such as Tenderstem or purple sprouting', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u' such as tenderstem or purple sprouting'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11090, u'unit': u'g'}, {u'originalString': u'1 tbsp soft brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93830, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp brown miso paste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16112, u'unit': u'tbsp'}, {u'originalString': u'90g pack baby pak choi, each halved lengthways', u'aisle': u'Produce', u'name': u'pak choi', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 90.0, u'consistency': u'solid', u'id': 11116, u'unit': u'g'}, {u'originalString': u'1 red chilli, deseeded and diced', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'diced', u'red', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1 tbsp rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tbsp'}, {u'originalString': u'1 tsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tsp'}, {u'originalString': u'1 tbsp sesame seed, toasted', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seed', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tbsp'}, {u'originalString': u'6 spring onions, halved lengthways', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tbsp caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'140g sushi rice', u'aisle': u'Pasta and Rice', u'name': u'sushi rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 10220054, u'unit': u'g'}], u'healthScore': 69.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2872691/saucy-japanese-greens-with-sticky-sesame-rice', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Stir together all the sauce ingredientswith 1 tbsp water. Set aside.Bring a large pan of water to the boilwith the caster sugar and \xbd tsp salt.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Addthe rice and boil for 15 mins (or followingpack instructions) until just cooked.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drainwell and return to the pan. Sprinkle overthe sesame seeds and sesame oil, thencover and set aside to keep warm.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the sunflower oil in a wok untilvery hot, then toss in the broccoli andstir-fry for 2-3 mins until almost tender,adding splashes of water occasionallyto create steam.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4584, u'name': u'sunflower oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Add the pak choi andspring onions, and stir-fry for 30 secs,then stir in the sauce and cook for afurther 1-2 mins, stirring constantly.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'id': 11116, u'name': u'bok choy'}]}, {u'equipment': [], u'step': u'Spread the rice over 2 plates, divideover the stir-fry and serve straight away.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The L'Ecole 41 Chenin Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'Stir together all the sauce ingredientswith 1 tbsp water. Set aside.Bring a large pan of water to the boilwith the caster sugar and \xbd tsp salt. Addthe rice and boil for 15 mins (or followingpack instructions) until just cooked. Drainwell and return to the pan. Sprinkle overthe sesame seeds and sesame oil, thencover and set aside to keep warm.Heat the sunflower oil in a wok untilvery hot, then toss in the broccoli andstir-fry for 2-3 mins until almost tender,adding splashes of water occasionallyto create steam. Add the pak choi andspring onions, and stir-fry for 30 secs,then stir in the sauce and cook for afurther 1-2 mins, stirring constantly.Spread the rice over 2 plates, divideover the stir-fry and serve straight away.', u'spoonacularSourceUrl': u'https://spoonacular.com/saucy-japanese-greens-with-sticky-sesame-rice-212110', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}