{u'recipes': [{u'sourceName': u'Clean and Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521458-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 521458, u'veryPopular': False, u'lowFodmap': False, u'title': u'Clean and Simple Egg White "Omlette', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 200.68, u'creditText': u'Clean and Delicious', u'extendedIngredients': [{u'originalString': u'1/2 slice of light cheese (I used Havrti)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'light', u'(I used Havrti)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slice', u'amount': 0.5, u'consistency': u'solid', u'id': 1041009, u'unit': u'slice'}, {u'originalString': u'1/2 cup egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1124, u'unit': u'cup'}, {u'originalString': u'1 clove of garlic, sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'5 mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'2 tbsp of salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'tbsp'}, {u'originalString': u'1 cup of sliced zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cup'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://cleananddelicious.com/2008/01/29/clean_and_simple_egg_white_oml/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a small non stick saute pan spray a little olive oil spray before tossing in your garlic and veggies.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"Add a splash of water, pop a lid on and allow to cook over a medium heat for about five minutes or so (we're basically just giving the veggies a quick steam).\xa0", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the veggies on a plate and lay cheese on top of them.In the same pan, add your egg whites.\xa0 From here you can either cook them like a little omlette or turn them into a scramble (either way they taste they same).Lay the egg whites on top of the cheese and veggies (between the hot veggies and the hot eggs the cheese should melt) and top with salsa. Enjoy!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Omelet on the menu? Try pairing with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Moet & Chandon Nectar Imperial with a 4.6 out of 5 star rating seems like a good match. It costs about 56 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"Nectar Imp\xe9rial is the boldest and most unexpected Mo\xebt & Chandon champagne. It reflects the diversity and complementarities of the three champagne grapes and the richness of the region's best vineyards to reveal the magic of the world's most loved champagne. Lively and generous Nectar Imp\xe9rial distinguishes itself by its tropical fruitiness, its richness on the palate and its crisp finish, that instantly surprise and delight.", u'title': u'Moet & Chandon Nectar Imperial', u'price': u'$55.99', u'id': 466285, u'link': u'https://www.wine.com/product/moet-and-chandon-nectar-imperial/18222', u'imageUrl': u'https://spoonacular.com/productImages/466285-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u"In a small non stick saute pan spray a little olive oil spray before tossing in your garlic and veggies. Add a splash of water, pop a lid on and allow to cook over a medium heat for about five minutes or so (we're basically just giving the veggies a quick steam).\xa0 Put the veggies on a plate and lay cheese on top of them.In the same pan, add your egg whites.\xa0 From here you can either cook them like a little omlette or turn them into a scramble (either way they taste they same).Lay the egg whites on top of the cheese and veggies (between the hot veggies and the hot eggs the cheese should melt) and top with salsa. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/clean-and-simple-egg-white-omlette-521458', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}