{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596355-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 596355, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Cream Pie', u'diets': [u'gluten free'], u'pricePerServing': 108.77, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u"\xbc cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'3 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'3 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 teaspoon espresso powder, optional', u'aisle': u'Tea and Coffee', u'name': u'espresso powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10014214, u'unit': u'teaspoon'}, {u'originalString': u'1 cup heavy cream, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'8 ounces semisweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2013/12/chocolate-cream-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Start by blind baking the pie crust.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 400\xba.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the dough on a lightly floured surface into a 13-inch circle.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Transfer it to a 9-inch pie pan and trim the edges so that they're about an inch bigger than the pan. Tuck the edges up and under, then flute them if desired. Freeze the pie dough for 30 minutes to help retain its shape. Line the crust with parchment paper and fill with dry beans or pie weights.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the crust for 20 minutes, then remove from oven and gently remove the parchment and beans or weights. Return to the oven and continue baking another 10-20 minutes, or until the crust is golden all over. If the edges start to brown too quickly, cover them with foil.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow the crust to cool completely before filling. While the crust is baking, start working on the filling.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place the chocolate, butter and vanilla in a 2-quart mixing bowl and set aside.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the sugar, cornstarch, cocoa, espresso powder and salt in a medium saucepan.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in \xbc cup of cold heavy cream and continue whisking until the mixture is smooth. Repeat with another \xbc cup of cream, then whisk in the egg yolks.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place the saucepan over medium heat and gradually whisk in remaining cream and milk. Bring the mixture to a boil, whisking constantly. Boil for 1 minute, then pour the hot mixture over the chocolate and butter.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk or stir until the mixture is smooth, then pass the custard through a fine mesh strainer to remove any lumps or pieces of cooked egg.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place the mixture in a large, shallow bowl and place plastic wrap directly on the surface to prevent a skin from forming. Refrigerate until the mixture is thoroughly chilled. When the mixture is chilled, use a rubber spatula to scrape it into the cooled pie crust. Level the top with an offset spatula.To make the whipped cream, place the chilled cream in a mixing bowl fitted with the whisk attachment.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until soft peaks form.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sugar and vanilla and continue mixing until medium peaks form. Spoon or pipe the whipped cream onto the pie. If not serving immediately, the cream can be chilled separately and piped onto the pie just before serving.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 53, u'instructions': u"Start by blind baking the pie crust. Heat oven to 400\xba. Roll the dough on a lightly floured surface into a 13-inch circle. Transfer it to a 9-inch pie pan and trim the edges so that they're about an inch bigger than the pan. Tuck the edges up and under, then flute them if desired. Freeze the pie dough for 30 minutes to help retain its shape. Line the crust with parchment paper and fill with dry beans or pie weights. Bake the crust for 20 minutes, then remove from oven and gently remove the parchment and beans or weights. Return to the oven and continue baking another 10-20 minutes, or until the crust is golden all over. If the edges start to brown too quickly, cover them with foil. Remove from oven and allow the crust to cool completely before filling. While the crust is baking, start working on the filling. Place the chocolate, butter and vanilla in a 2-quart mixing bowl and set aside. Whisk together the sugar, cornstarch, cocoa, espresso powder and salt in a medium saucepan. Whisk in \xbc cup of cold heavy cream and continue whisking until the mixture is smooth. Repeat with another \xbc cup of cream, then whisk in the egg yolks. Place the saucepan over medium heat and gradually whisk in remaining cream and milk. Bring the mixture to a boil, whisking constantly. Boil for 1 minute, then pour the hot mixture over the chocolate and butter.Whisk or stir until the mixture is smooth, then pass the custard through a fine mesh strainer to remove any lumps or pieces of cooked egg. Place the mixture in a large, shallow bowl and place plastic wrap directly on the surface to prevent a skin from forming. Refrigerate until the mixture is thoroughly chilled. When the mixture is chilled, use a rubber spatula to scrape it into the cooled pie crust. Level the top with an offset spatula.To make the whipped cream, place the chilled cream in a mixing bowl fitted with the whisk attachment. Whisk until soft peaks form. Add the sugar and vanilla and continue mixing until medium peaks form. Spoon or pipe the whipped cream onto the pie. If not serving immediately, the cream can be chilled separately and piped onto the pie just before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-cream-pie-596355', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}