{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/671810-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 671810, u'veryPopular': True, u'lowFodmap': True, u'title': u'Peanut Butter Granola Bars with Dark Chocolate', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 53.14, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'\xbd cup brown rice syrup', u'aisle': u'Health Foods;Baking', u'name': u'brown rice syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93784, u'unit': u'cup'}, {u'originalString': u'\xbe cup chopped dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19904, u'unit': u'cup'}, {u'originalString': u'2 cups quick oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'\xbe cup roasted unsalted peanuts, crushed', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted peanuts', u'metaInformation': [u'unsalted', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16092, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1\xbc cup smooth peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 16150, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://naturallyella.com/peanut-butter-granola-bars-with-dark-chocolate/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add oats and toast, stirring occasionally, for 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and place in a bowl along with the crushed peanuts.In a small sauce pan, combine the peanut butter, brown rice syrup, vanilla, and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 93784, u'name': u'brown rice syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Heat over medium-low heat, stirring often, until the brown rice syrup easily combines with the peanut butter, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 93784, u'name': u'brown rice syrup'}]}, {u'equipment': [], u'step': u'Pour mixture over the oats and stir until well combined.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mixture will be a bit stiff and switching to using your hands may be easier.Line an 8x8 pan with parchment and transfer the mixture to the pan. Using extra parchment, press the mixture into an even layer.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place in the refrigerator (or freezer) and allow to cool but not freeze, roughly 30 minutes in the freezer or one hour in the refrigerator .', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place chocolate in a double broiler and heat over medium-low heat until chocolate has melted, scraping the sides and bottoms of the double broiler as it melts. Keep the chocolate over the water.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the granola bars from the pan and cut into 16, 1" wide and 4" tall bars. Dip the bottom half of the granola bar in chocolate and rotate it a few times to let excess chocolate run off.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place back on the parchment paper and repeat with remaining granola bars. Use any remaining chocolate to drizzle on top and return granola bars to refrigerator to let chocolate set.Store leftover granola bars at room temperature for 1 to 2 days, refrigerator for 2 weeks or freeze for up to a month.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 748, u'instructions': u'Heat a large skillet over medium heat. Add oats and toast, stirring occasionally, for 6 to 8 minutes. Remove from heat and place in a bowl along with the crushed peanuts.In a small sauce pan, combine the peanut butter, brown rice syrup, vanilla, and salt. Heat over medium-low heat, stirring often, until the brown rice syrup easily combines with the peanut butter, 2 to 3 minutes. Pour mixture over the oats and stir until well combined. Mixture will be a bit stiff and switching to using your hands may be easier.Line an 8x8 pan with parchment and transfer the mixture to the pan. Using extra parchment, press the mixture into an even layer. Place in the refrigerator (or freezer) and allow to cool but not freeze, roughly 30 minutes in the freezer or one hour in the refrigerator .Place chocolate in a double broiler and heat over medium-low heat until chocolate has melted, scraping the sides and bottoms of the double broiler as it melts. Keep the chocolate over the water.Remove the granola bars from the pan and cut into 16, 1" wide and 4" tall bars. Dip the bottom half of the granola bar in chocolate and rotate it a few times to let excess chocolate run off. Place back on the parchment paper and repeat with remaining granola bars. Use any remaining chocolate to drizzle on top and return granola bars to refrigerator to let chocolate set.Store leftover granola bars at room temperature for 1 to 2 days, refrigerator for 2 weeks or freeze for up to a month.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-granola-bars-with-dark-chocolate-671810', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}