{u'recipes': [{u'sourceName': u'Kirbie Cravings', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/228507-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 228507, u'veryPopular': True, u'lowFodmap': False, u'title': u'Four Ingredient Macaroni and Cheese', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 13.41, u'creditText': u'Kirbie Cravings', u'extendedIngredients': [{u'originalString': u'2 cups elbow macaroni', u'aisle': u'Pasta and Rice', u'name': u'elbow macaroni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10120499, u'unit': u'cups'}, {u'originalString': u'1 tsp mustard powder', u'aisle': u'Spices and Seasonings', u'name': u'mustard powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cups'}, {u'originalString': u'2 cups skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://kirbiecravings.com/2012/05/four-ingredient-macaroni-and-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring milk. mustard powder and macaroni to a simmer/low boil in a saucepan and cook for about 20 minutes until noodles are al dente or to desired doneness. Stir constantly and make sure noodles do not stick to bottom.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Remove from stove and add in cheese and stir until cheese is completely melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 383, u'instructions': u'Bring milk. mustard powder and macaroni to a simmer/low boil in a saucepan and cook for about 20 minutes until noodles are al dente or to desired doneness. Stir constantly and make sure noodles do not stick to bottom. Remove from stove and add in cheese and stir until cheese is completely melted. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/four-ingredient-macaroni-and-cheese-228507', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 25, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}