{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/803142-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 803142, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crock Pot Lemon Garlic Chicken and Veggies', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 152.34, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'6 bone in, skin on chicken thighs', u'aisle': u'Meat', u'name': u'bone in chicken thighs', u'metaInformation': [u'bone in', u', skin on'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1005091, u'unit': u''}, {u'originalString': u'1 lb. carrots, sliced into 2-3 inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'sliced into 2-3 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'lb'}, {u'originalString': u'6 sprigs fresh thyme, leaves removed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 6.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'4 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt and fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 lemon, sliced', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'3 Tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tablespoons'}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 lbs. red potatoes, quartered', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'lbs'}, {u'originalString': u'3 sprigs rosemary, stems removed, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprigs'}, {u'originalString': u'1 sweet yellow onion, quartered', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'sweet', u'yellow', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://neighborfoodblog.com/2016/09/crock-pot-lemon-garlic-chicken-and-veggies.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the potatoes, onions, and carrots in the bottom of a large slow cooker. Sprinkle generously with salt and pepper. Stir in two cloves of garlic and half of the fresh herbs.Sprinkle the chicken thighs generously with salt and pepper then nestle them in with the potatoes and carrots.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour the olive oil evenly over top, followed by the lemon juice and herbs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the lemon slices over top.Cook on high for four hours or on low for 8 hours. When the chicken is finished, remove the sliced lemon, squeezing it out a bit if you want extra lemony flavor. Preheat the broiled and place the chicken thighs on a pan under the broiler for 3-4 minutes or until browned and crisp.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Serve immediately with the vegetables.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 13, u'instructions': u'Place the potatoes, onions, and carrots in the bottom of a large slow cooker. Sprinkle generously with salt and pepper. Stir in two cloves of garlic and half of the fresh herbs.Sprinkle the chicken thighs generously with salt and pepper then nestle them in with the potatoes and carrots. Pour the olive oil evenly over top, followed by the lemon juice and herbs. Place the lemon slices over top.Cook on high for four hours or on low for 8 hours. When the chicken is finished, remove the sliced lemon, squeezing it out a bit if you want extra lemony flavor. Preheat the broiled and place the chicken thighs on a pan under the broiler for 3-4 minutes or until browned and crisp. Serve immediately with the vegetables.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-lemon-garlic-chicken-and-veggies-803142', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 260, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}