{u'recipes': [{u'sourceName': u'Life Made Simple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626086-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 626086, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coconut Oil Oatmeal Chocolate Chip Cookies', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 35.29, u'creditText': u'Life Made Simple', u'extendedIngredients': [{u'originalString': u'1 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'2 oz. chopped semi-sweet or bittersweet chocolate (or white)', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'white', u'chopped', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'\xbd c. brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'c'}, {u'originalString': u'\xbd c. melted coconut oil or coconut butter', u'aisle': u'Health Foods', u'name': u'coconut butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93746, u'unit': u'c'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 c. all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'\xbc c. granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'1 c. old-fashioned whole rolled oats (not instant or quick cook)', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [u'whole', u'quick', u'(not instant or cook)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8120, u'unit': u'c'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Sea salt for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'\xbd c. semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'c'}, {u'originalString': u'\xbe c. sweetened coconut flakes', u'aisle': u'Baking', u'name': u'sweetened coconut flakes', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12109, u'unit': u'c'}, {u'originalString': u'2 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://lifemadesimplebakes.com/2015/01/coconut-oil-oatmeal-chocolate-chip-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'In a large mixing bowl or the bowl of a stand mixer, combine the melted coconut oil, brown sugar, granulated sugar and vanilla extract, beat until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the egg and mix until combined.In a small mixing bowl whisk together the oats, flour, salt and baking soda. Gradually add the dry ingredients to the wet ingredients mixing just until combined. Fold in the chocolate chips, chopped chocolate and the coconut.Using a standard size cookie scoop portion the dough and roll into smooth balls. The chocolate may not stay in place, but just be forceful.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place balls of dough onto a plate or sheet and sprinkle with sea salt. Refrigerate for 1 hour.Preheat oven to 350, line baking sheets with parchment paper or baking mats.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Place 12 cookies on a sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the oven and bake for 10-11 minutes, being careful not to overbake! The cookies will look soft and slightly underbaked, but they should be firm on the edges and lightly brown on top.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow to cool on the pans for 2-3 minutes before transferring to a wire rack to cool completely.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'In a large mixing bowl or the bowl of a stand mixer, combine the melted coconut oil, brown sugar, granulated sugar and vanilla extract, beat until smooth. Add the egg and mix until combined.In a small mixing bowl whisk together the oats, flour, salt and baking soda. Gradually add the dry ingredients to the wet ingredients mixing just until combined. Fold in the chocolate chips, chopped chocolate and the coconut.Using a standard size cookie scoop portion the dough and roll into smooth balls. The chocolate may not stay in place, but just be forceful. Place balls of dough onto a plate or sheet and sprinkle with sea salt. Refrigerate for 1 hour.Preheat oven to 350, line baking sheets with parchment paper or baking mats. Place 12 cookies on a sheet. Place in the oven and bake for 10-11 minutes, being careful not to overbake! The cookies will look soft and slightly underbaked, but they should be firm on the edges and lightly brown on top. Remove from the oven and allow to cool on the pans for 2-3 minutes before transferring to a wire rack to cool completely.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-oil-oatmeal-chocolate-chip-cookies-626086', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}