{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223567-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 223567, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Kievs', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 80.69, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'225g dried breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'200g butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'8 skinless, boneless chicken fillets', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 8.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'fillet'}, {u'originalString': u'5 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'juice \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'pinch paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'pinch'}, {u'originalString': u'75g parmesan, grated', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'2 tbsp finely chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'100g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'4 tbsp sunflower or vegetable oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/666649/chicken-kievs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place all the garlic butter ingredients ina bowl and season well. Mash with a forkuntil well combined, shape into twosausages using cling film to help youshape it, then tightly wrap and chill orfreeze until really firm. Can be made upto 3 days in advance. When firm, sliceeach into 8 even pieces.Lay a chicken breast on a choppingboard and use a sharp knife to makea deep pocket inside the breast. Theeasiest way is to push the point of a knifeinto the fat end, keep going halfway intothe fillet. Be careful not to cut all the waythrough or the butter will leak out whencooking. Repeat with the remainingbreasts. Push 2 discs of butter insideeach chicken breast, press to flatten andre-seal with your hands. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Mix the breadcrumbs and Parmesanon one plate, and tip the eggs ontoanother. On a third plate, mix the flourwith paprika and some salt. Dip eachbreast in the flour, then the egg andfinally the breadcrumbs, repeating soeach Kiev has a double coating (thiswill make them extra crisp and helpto keep the butter inside). Chill for atleast 1 hr before cooking, or freezenow – see tips, below.To cook, heat oven to 180C/160C fan/gas 4.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Heat the oil in a large frying panover a medium-high heat. Fry the Kievsfor 2-3 mins each side until golden –you may need to do this in batches.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to a baking tray and cook for20-25 mins until cooked through.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 357, u'instructions': u'Place all the garlic butter ingredients ina bowl and season well. Mash with a forkuntil well combined, shape into twosausages using cling film to help youshape it, then tightly wrap and chill orfreeze until really firm. Can be made upto 3 days in advance. When firm, sliceeach into 8 even pieces.Lay a chicken breast on a choppingboard and use a sharp knife to makea deep pocket inside the breast. Theeasiest way is to push the point of a knifeinto the fat end, keep going halfway intothe fillet. Be careful not to cut all the waythrough or the butter will leak out whencooking. Repeat with the remainingbreasts. Push 2 discs of butter insideeach chicken breast, press to flatten andre-seal with your hands. Set aside.Mix the breadcrumbs and Parmesanon one plate, and tip the eggs ontoanother. On a third plate, mix the flourwith paprika and some salt. Dip eachbreast in the flour, then the egg andfinally the breadcrumbs, repeating soeach Kiev has a double coating (thiswill make them extra crisp and helpto keep the butter inside). Chill for atleast 1 hr before cooking, or freezenow – see tips, below.To cook, heat oven to 180C/160C fan/gas 4. Heat the oil in a large frying panover a medium-high heat. Fry the Kievsfor 2-3 mins each side until golden –you may need to do this in batches.Transfer to a baking tray and cook for20-25 mins until cooked through.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-kievs-223567', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}