{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600898-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 600898, u'veryPopular': False, u'lowFodmap': False, u'title': u'Jain Mix Kathol – Mixed Beans – Jain Style', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 480, u'pricePerServing': 284.99, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Cumin powder – 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'cumin powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'Cumin seeds – 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'Ghee (Clarified butter) – 2 tablespoons', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [u'(Clarified butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'Green chilies – 2, chopped finely', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green', u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'Mustard seeds – \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoon'}, {u'originalString': u'Rajma (Red kidney beans) – \xbc cup', u'aisle': u'Spices and Seasonings', u'name': u'rajma masala', u'metaInformation': [u'red', u'( kidney beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'id': 10193663, u'unit': u'cup'}, {u'originalString': u'Whole dried red chili – 2', u'aisle': u'Produce', u'name': u'red chili', u'metaInformation': [u'dried', u'whole', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'Red chili powder – 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'red chili powder', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'Salt – to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Tomato – 1 \xbc cups, chopped finely', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 11529, u'unit': u'cups'}, {u'originalString': u'Turmeric powder – \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'turmeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'Whole Urad dal – \xbc cup', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'urad dal', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-lentils.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93718, u'unit': u'cup'}, {u'originalString': u'Kabuli chana (Chickpeas) – \xbc cup', u'aisle': u'?', u'name': u'kabuli chana', u'metaInformation': [u'(Chickpeas)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'cup'}, {u'originalString': u'Kala Chana – \xbc cup', u'aisle': u'?', u'name': u'kala chana', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.spiceupthecurry.com/mix-kathol-jain-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Mix all dry beans and wash them under running cold water.Soak them in enough water for 8 hours or overnight. For quick soaking method, fill enough water and let it come to boil on high heat and then continue boil for 3-4 minutes. Turn off the stove and cover tightly and let it sit for 1 hour. Now your beans are ready to boil.Now discard soaking water.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Transfer soaked beans in pressure cooker.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add new 3 cups of water and salt. Cover the lid put the weight on.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let it whistle twice on high heat then lower the heat to lowest and cook for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the pressure go sown by itself then open the cover.Meanwhile heat the ghee in a pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}]}, {u'equipment': [], u'step': u'Add mustard seeds, let them pop. Then add cumin seeds.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}]}, {u'equipment': [], u'step': u'Let them sizzle.Then add broken dried red chilies. Saut\xe9 for few seconds.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add green chilies and chopped tomatoes. Cook them till they get soften and little bit mushy about 4 minutes.Then add turmeric powder, red chili powder, cumin powder and salt. (Be careful in salt because we added salt while cooking beans.)', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix well. Cook for 1 minute.Then add cooked beans with all water.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Mix well and let it simmer for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot with rice or paratha.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 8, u'instructions': u'Mix all dry beans and wash them under running cold water.Soak them in enough water for 8 hours or overnight. For quick soaking method, fill enough water and let it come to boil on high heat and then continue boil for 3-4 minutes. Turn off the stove and cover tightly and let it sit for 1 hour. Now your beans are ready to boil.Now discard soaking water. Transfer soaked beans in pressure cooker. Add new 3 cups of water and salt. Cover the lid put the weight on. Let it whistle twice on high heat then lower the heat to lowest and cook for 30 minutes. Let the pressure go sown by itself then open the cover.Meanwhile heat the ghee in a pan. Add mustard seeds, let them pop. Then add cumin seeds. Let them sizzle.Then add broken dried red chilies. Saut\xe9 for few seconds.Add green chilies and chopped tomatoes. Cook them till they get soften and little bit mushy about 4 minutes.Then add turmeric powder, red chili powder, cumin powder and salt. (Be careful in salt because we added salt while cooking beans.) Mix well. Cook for 1 minute.Then add cooked beans with all water. Mix well and let it simmer for 5 minutes.Serve hot with rice or paratha.', u'spoonacularSourceUrl': u'https://spoonacular.com/jain-mix-kathol-mixed-beans-jain-style-600898', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 540, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}