{u'recipes': [{u'sourceName': u'Gluten Free Recipe Box', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/562074-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 562074, u'veryPopular': False, u'lowFodmap': True, u'title': u'Allergy Free Gluten Free Margarine', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'whole 30', u'vegan'], u'pricePerServing': 48.21, u'creditText': u'Gluten Free Recipe Box', u'extendedIngredients': [{u'originalString': u'1/3 cup extra virgin olive oil (using grape seed oil may create a more attractive color)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'(using grape seed oil may create a more attractive color)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1/3 teaspoon guar gum', u'aisle': u'Health Foods', u'name': u'guar gum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93765, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup organic palm shortening (I used Tropical Traditions brand which is gluten-free)', u'aisle': u'Ethnic Foods', u'name': u'palm oil', u'metaInformation': [u'gluten-free', u'organic', u'(I used Tropical Traditions brand which is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 4055, u'unit': u'cup'}, {u'originalString': u'5 Tablespoons gluten-free almond milk (grain-free) or gluten-free rice milk (nut-free); (or coconut milk - which is not neutral in flavor)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'rice milk', u'metaInformation': [u'gluten-free', u'neutral', u'(grain-free)', u'(nut-free)', u'(or coconut milk - which is not in flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-milk.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 93761, u'unit': u'Tablespoons'}, {u'originalString': u'1 1/2 teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/16 - 1/8 teaspoon turmeric (I used 1/8, but it could have been a little lighter in color)', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [u'(I used 1/8, but it could have been a little lighter in color)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.0625, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://glutenfreerecipebox.com/allergy-free-gluten-free-margarine', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all ingredients in a small food processor or blender. Blend until all ingredients are mixed thoroughly, less than a minute, usually. It will be a little runny.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the mixture into a small container, cover (or not) and refrigerate until firm. Covering is recommended mainly to prevent absorption of other odors in your refrigerator.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from refrigerator to soften prior to use.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 80, u'instructions': u'Place all ingredients in a small food processor or blender. Blend until all ingredients are mixed thoroughly, less than a minute, usually. It will be a little runny.Pour the mixture into a small container, cover (or not) and refrigerate until firm. Covering is recommended mainly to prevent absorption of other odors in your refrigerator.Remove from refrigerator to soften prior to use.', u'spoonacularSourceUrl': u'https://spoonacular.com/allergy-free-gluten-free-margarine-562074', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}