{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/274783-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 274783, u'veryPopular': False, u'lowFodmap': False, u'title': u'Zesty Cheeseburger Mac Casserole', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 263.94, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 lb. extra-lean ground beef', u'aisle': u'Meat', u'name': u'extra lean ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'3/4 cup fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1/4 cup KRAFT Lite Zesty Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian dressing', u'metaInformation': [u'italian', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'1 pkg. (14 oz.) KRAFT Deluxe Macaroni & Cheese Dinner Made With 2% Milk Cheese', u'aisle': u'Pasta and Rice', u'name': u'macaroni & cheese dinner', u'metaInformation': [u'2%', u'with  milk cheese', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 32004, u'unit': u'oz'}, {u'originalString': u'1 cup KRAFT 2% Milk Shredded Sharp Cheddar Cheese, divided', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded', u'2%', u'divided', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1 pkg. (16 oz.) frozen vegetable blend (broccoli, carrots, cauliflower)', u'aisle': u'Produce', u'name': u'vegetable blend', u'metaInformation': [u'frozen', u'(broccoli, carrots, cauliflower)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11583, u'unit': u'oz'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/zesty-cheeseburger-mac-casserole-75606.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 375F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Place frozen vegetables in colander in sink. Cook Macaroni as directed on package.  Meanwhile, brown ground beef.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drain meat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour cooked macaroni over vegetables in colander to drain and quickly thaw vegetables.  Return macaroni and vegetables to saucepan.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add Cheese Sauce, milk and dressing; mix well.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add meat and 1/2 cup shredded cheese; mix well. Spoon into 2-qt. casserole sprayed with cooking spray; cover.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 35 min. or until heated through. Top with remaining shredded cheese; bake, uncovered, 3 to 4 min. or until melted.', u'length': {u'number': 38, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Southern works really well with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Pacific Rim Riesling. It has 4.2 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'Portraying bright crispness, subtle sweetness and aromas of jasmine, pear and apple, Pacific Rim Riesling exemplifies the harmony of Riesling. The sweetness plays wonderfully with fiery fare (from Thai to Mexican), while the natural acidity stands up to richer foods (from French to German).', u'title': u'Pacific Rim Riesling', u'price': u'$11.99', u'id': 446903, u'link': u'https://www.wine.com/product/pacific-rim-riesling-2011/119629', u'imageUrl': u'https://spoonacular.com/productImages/446903-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Heat oven to 375F.                                            Place frozen vegetables in colander in sink. Cook Macaroni as directed on package.  Meanwhile, brown ground beef.                                              Drain meat. Pour cooked macaroni over vegetables in colander to drain and quickly thaw vegetables.  Return macaroni and vegetables to saucepan.  Add Cheese Sauce, milk and dressing; mix well.  Add meat and 1/2 cup shredded cheese; mix well. Spoon into 2-qt. casserole sprayed with cooking spray; cover.                                             Bake 35 min. or until heated through. Top with remaining shredded cheese; bake, uncovered, 3 to 4 min. or until melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/zesty-cheeseburger-mac-casserole-274783', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}