{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/246166-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 246166, u'veryPopular': True, u'lowFodmap': False, u'title': u'Deviled Eggs', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'ketogenic'], u'preparationMinutes': 0, u'pricePerServing': 24.24, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'2 teaspoons dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'teaspoons'}, {u'originalString': u'1 dozen eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/3 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 Tbsp minced onion or shallot', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'Tbsp'}, {u'originalString': u'Paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 2028, u'unit': u'servings'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon tabasco', u'aisle': u'Condiments', u'name': u'tabasco', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/deviled_eggs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'1 First hard boil the eggs. (See how to make hard boiled eggs.) Fill up a large saucepan half-way with water and gently add the eggs. Cover the eggs with at least an inch of water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add a teaspoon of vinegar to the water (this will help contain egg whites from leaking out if any of the shells crack while cooking).', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add a pinch of salt to the water. Bring the water to a boil. Cover, and remove from heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let sit covered for 12-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain hot water from pan and run cold water over the eggs. (At this point if you crack the egg shells while the eggs are cooling, it will make it easier to peel the shells.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Let sit in the cool water a few minutes, changing the water if necessary to keep it cool.2 Peel the eggs. Using a sharp knife, slice each egg in half, lengthwise. Gently remove the yolk halves and place in a small mixing bowl. Arrange the egg white halves on a serving platter. 3 Using a fork, mash up the yolks and add mustard, mayonnaise, onion, tabasco, and a sprinkling of salt and pepper. Spoon egg yolk mixture into the egg white halves. Sprinkle with paprika.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 3538, u'instructions': u'1 First hard boil the eggs. (See how to make hard boiled eggs.) Fill up a large saucepan half-way with water and gently add the eggs. Cover the eggs with at least an inch of water. Add a teaspoon of vinegar to the water (this will help contain egg whites from leaking out if any of the shells crack while cooking). Add a pinch of salt to the water. Bring the water to a boil. Cover, and remove from heat. Let sit covered for 12-15 minutes. Drain hot water from pan and run cold water over the eggs. (At this point if you crack the egg shells while the eggs are cooling, it will make it easier to peel the shells.) Let sit in the cool water a few minutes, changing the water if necessary to keep it cool.2 Peel the eggs. Using a sharp knife, slice each egg in half, lengthwise. Gently remove the yolk halves and place in a small mixing bowl. Arrange the egg white halves on a serving platter. 3 Using a fork, mash up the yolks and add mustard, mayonnaise, onion, tabasco, and a sprinkling of salt and pepper. Spoon egg yolk mixture into the egg white halves. Sprinkle with paprika.', u'spoonacularSourceUrl': u'https://spoonacular.com/deviled-eggs-246166', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': True, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}