{u'recipes': [{u'sourceName': u"Can't Stay out of the Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/500068-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 500068, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon-Chive-Potato Bread', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 7.33, u'creditText': u"Can't Stay out of the Kitchen", u'extendedIngredients': [{u'originalString': u'\xbd cup cooked bacon, finely chopped (about 5 slices)', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked', u'finely chopped', u'( 5 slices)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10123, u'unit': u'cup'}, {u'originalString': u'4 \xbc cups bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.25, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'2 tbsp. canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1 tsp. kosher salt or sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 \xbd tsp. yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://cantstayoutofthekitchen.com/2013/03/07/bacon-chive-potato-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Measure ingredients into bread canister according to order listed.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at regular setting for 2-lb. loaf.Mine takes 3 hours 50 minutes.Allow bread to sit and cool in canister about 15 minutes.', u'length': {u'number': 65, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove bread from canister and spread top and sides with butter to prevent crust from getting too hard.Slice down.About 20 half slices.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 227, u'instructions': u'Measure ingredients into bread canister according to order listed.Bake at regular setting for 2-lb. loaf.Mine takes 3 hours 50 minutes.Allow bread to sit and cool in canister about 15 minutes.Remove bread from canister and spread top and sides with butter to prevent crust from getting too hard.Slice down.About 20 half slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-chive-potato-bread-500068', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}