{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/396581-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 396581, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pork Tenderloin with Marsala Mushroom Sauce', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 197.91, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 pound sliced fresh button mushrooms', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}, {u'originalString': u'3 tablespoons canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 package (1/2 ounce) dried chanterelle mushrooms', u'aisle': u'Produce', u'name': u'chanterelle mushrooms', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chanterelles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'solid', u'id': 11239, u'unit': u'ounce'}, {u'originalString': u'1 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'2 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon dried marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried marjoram', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2023, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried parsley flakes', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley flakes', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon dried rosemary, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'Minced fresh parsley, optional', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'4 ounces pearl onions, trimmed and peeled', u'aisle': u'Produce', u'name': u'pearl onions', u'metaInformation': [u'trimmed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10111282, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 pork tenderloins (3/4 pound each)', u'aisle': u'Meat', u'name': u'pork tenderloins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10218, u'unit': u'pound'}, {u'originalString': u'1/2 pound sliced baby portobello mushrooms', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'3/4 teaspoon salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon dried savory', u'aisle': u'Produce', u'name': u'summer savory', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/summer-savory.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 98961, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pork-tenderloin-with-marsala-mushroom-sauce', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine dried mushrooms and hot water; set aside. In another bowl, combine the dried herbs, garlic powder, 1/4 teaspoon salt and pepper. Sprinkle over pork.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, brown tenderloins in 2 tablespoons oil on all sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan and keep warm.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In the same skillet, saute the sliced mushrooms and onions in the remaining oil until mushrooms are browned.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the wine, broth and remaining salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain chanterelle mushrooms; add to the pan. Bring to a boil. Reduce heat; add pork.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chanterelles.jpg', u'id': 11239, u'name': u'chanterelle mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Cover and cook for 15-20 minutes or until a thermometer reads 145\xb0.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove pork and let stand for 5 minutes before slicing.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine cornstarch and water until smooth; gradually stir into the pan. Bring to a boil; cook and stir for 2 minutes or until thickened.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Slice pork and serve with sauce.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with parsley if desired.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 35, u'instructions': u'Directions                                                                                In a small bowl, combine dried mushrooms and hot water; set aside. In another bowl, combine the dried herbs, garlic powder, 1/4 teaspoon salt and pepper. Sprinkle over pork.                                                                                           In a large skillet, brown tenderloins in 2 tablespoons oil on all sides. Remove from pan and keep warm.                                                                                           In the same skillet, saute the sliced mushrooms and onions in the remaining oil until mushrooms are browned. Add the wine, broth and remaining salt. Drain chanterelle mushrooms; add to the pan. Bring to a boil. Reduce heat; add pork.                                                                                           Cover and cook for 15-20 minutes or until a thermometer reads 145\xb0. Remove pork and let stand for 5 minutes before slicing.                                                                                           Combine cornstarch and water until smooth; gradually stir into the pan. Bring to a boil; cook and stir for 2 minutes or until thickened.                                                                                           Slice pork and serve with sauce. Garnish with parsley if desired.                                        Yield: 6 servings.                                                                                                                         Originally published as Pork Tenderloin with Marsala Mushroom Sauce in  Taste of Home Christmas Annual                                                                                                                                                                                                Nutritional Facts                                                                             4 ounces cooked pork with 1/2 cup sauce equals 306 calories, 11 g fat (2 g saturated fat), 64 mg cholesterol, 414 mg sodium, 15 g carbohydrate, 2 g fiber, 26 g protein. Diabetic Exchanges: 3 lean meat, 1-1/2 fat, 1 starch.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-tenderloin-with-marsala-mushroom-sauce-396581', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}