{u'recipes': [{u'sourceName': u'Tickling Palates', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/564582-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 564582, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pudina Thogayal | Mint Thogayal', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 97.21, u'creditText': u'Tickling Palates', u'extendedIngredients': [{u'originalString': u'Asafetida – 1 pinch', u'aisle': u'Spices and Seasonings', u'name': u'asafetida', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032035, u'unit': u'pinch'}, {u'originalString': u'Pudina (Mint Leaves) – 1 big bunch', u'aisle': u'Pasta and Rice', u'name': u'big shells', u'metaInformation': [u'(Mint Leaves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jumbo-shells.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 10520420, u'unit': u'bunch'}, {u'originalString': u'Whole dry red chilies – 8-10', u'aisle': u'Produce', u'name': u'chilies', u'metaInformation': [u'dry red', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'Fresh grated coconut – 3 tbsp', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12104, u'unit': u'tbsp'}, {u'originalString': u'Ginger – 1 inch piece', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'Mustard seeds – 1/2 tsp', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2024, u'unit': u'tsp'}, {u'originalString': u'Oil – 1/4 tsp', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'Oil – 1 tsp', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'Salt – to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Tamarind – 1 small piece (Betel nut size)', u'aisle': u'Ethnic Foods', u'name': u'tamarind', u'metaInformation': [u'small', u'(Betel nut size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tamarind.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1019322, u'unit': u'piece'}, {u'originalString': u'Urad dal – 1 tbsp', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'urad dal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-lentils.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93718, u'unit': u'tbsp'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.ticklingpalates.com/2013/07/pudina-thogayal-recipe-mint-thogayal.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Clean the mint leaves bunch.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the leaves in a big bowl and fill it with water and leave it for 10 minutes. All the impurities and sand will settle at the bottom. Take out the leaves and place them in a colander and leave it for another 5 minutes for the excess water to drip out.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a pan with oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add urad dal, tamarind, ginger piece and whole red chilies and over a low flame saut\xe9 for 3-4 minutes till the dal becomes golden brown in color. Switch off flame and take the pan off the stove.Immediately add the mint leaves and keep saut\xe9ing. The heat of the pan is enough and you can see the leaves shrinking in size and changing color.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'red chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tamarind.png', u'id': 1019322, u'name': u'tamarind'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-lentils.jpg', u'id': 93718, u'name': u'urad dal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Let the mixture cool down.In a mixer jar or food processor, place the mint leaves mixture, grated coconut, salt and grind it together. Do not add water. Keep mixing it with a spoon in between for even grinding. If you find it very hard to grind to a paste, add just 1 tbsp of water and no more than that.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a serving bowl.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the pan with oil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add mustard seeds and when it pops, add asafetida and transfer the tempering to the thogayal and mix well.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 1032035, u'name': u'asafoetida'}]}, {u'equipment': [], u'step': u'Serve with hot steaming rice. You can either mix it with rice and eat or serve it as a side dish with any sambar or kulambu rice.This will keep well for 2 to 3 days when kept refrigerated.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14, u'instructions': u'Clean the mint leaves bunch. Place the leaves in a big bowl and fill it with water and leave it for 10 minutes. All the impurities and sand will settle at the bottom. Take out the leaves and place them in a colander and leave it for another 5 minutes for the excess water to drip out.Heat a pan with oil. Add urad dal, tamarind, ginger piece and whole red chilies and over a low flame saut\xe9 for 3-4 minutes till the dal becomes golden brown in color. Switch off flame and take the pan off the stove.Immediately add the mint leaves and keep saut\xe9ing. The heat of the pan is enough and you can see the leaves shrinking in size and changing color. Let the mixture cool down.In a mixer jar or food processor, place the mint leaves mixture, grated coconut, salt and grind it together. Do not add water. Keep mixing it with a spoon in between for even grinding. If you find it very hard to grind to a paste, add just 1 tbsp of water and no more than that. Transfer to a serving bowl.Heat the pan with oil. Add mustard seeds and when it pops, add asafetida and transfer the tempering to the thogayal and mix well.Serve with hot steaming rice. You can either mix it with rice and eat or serve it as a side dish with any sambar or kulambu rice.This will keep well for 2 to 3 days when kept refrigerated.', u'spoonacularSourceUrl': u'https://spoonacular.com/pudina-thogayal-mint-thogayal-564582', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}