{u'recipes': [{u'sourceName': u'From Brazil to You', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610021-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 610021, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Casserole Nests', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 220.88, u'creditText': u'From Brazil to You', u'extendedIngredients': [{u'originalString': u'\xbd pound (8 ounces) Tyson Trimmed and Ready Chicken Breast Tenderloin', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 5062, u'unit': u'ounces'}, {u'originalString': u'8 fettuccine nests, uncooked (pick the nests that have a wider opening in the center)', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [u'uncooked', u'(pick the nests that have a wider opening in the center)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10020409, u'unit': u''}, {u'originalString': u'2 Tablespoons chopped fresh basil leaves (or 1-2 teaspoons of dried)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'dried', u'fresh', u'chopped', u'(or 1-2 teaspoons of )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Tablespoons'}, {u'originalString': u'2 teaspoons garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup shredded reduced-fat provolone or mild cheddar cheese', u'aisle': u'Cheese', u'name': u'mild cheddar cheese', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1009, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'\xbd cup part skim ricotta cheese', u'aisle': u'Cheese', u'name': u'part skim ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1037, u'unit': u'cup'}, {u'originalString': u'\xbc cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'A pinch of salt and ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'5 cups of your favorite store-bought tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [u'store-bought', u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 11549, u'unit': u'cups'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.frombraziltoyou.org/chicken-casserole-nests/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F (about 180 degrees C).Prepare the sauce: In a medium stainless steel saucepan, mix together all ingredients until combined and bring to a boil over medium-high heat, stirring occasionally.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour into a large Pyrex or casserole dish, and set aside.For the pasta nests: Arrange uncooked pasta nests on top of the hot tomato sauce, keeping each a bit of a distance from the others. Using a spoon, ladle some of the hot tomato sauce over each nest to moisten. In a medium bowl, mix together the cheeses and peas, and set aside.Pat dry the chicken with paper towels and cut into small pieces. Season chicken pieces with salt and pepper. In a medium non-stick skillet, heat the olive oil over medium-high heat and brown the chicken (about 2-3 minutes).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Mix into the cheese-pea mixture. Spoon cheese-chicken mixture into the raw pasta nests. Cover baking dish tightly with aluminum foil (If necessary, grease the interior of the sheet with non-stick cooking spray in order to avoid the cheeses sticking to the foil).', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for about 40-45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil and sprinkle grated Parmesan cheese on top of the pasta nests if desired.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve chicken casserole nests hot (2 nests per person). A fresh salad or steamed vegetables, if desired, can accompany chicken casserole nests. Enjoy our chicken casserole nests!!!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 504, u'instructions': u'Preheat the oven to 350 degrees F (about 180 degrees C).Prepare the sauce: In a medium stainless steel saucepan, mix together all ingredients until combined and bring to a boil over medium-high heat, stirring occasionally. Pour into a large Pyrex or casserole dish, and set aside.For the pasta nests: Arrange uncooked pasta nests on top of the hot tomato sauce, keeping each a bit of a distance from the others. Using a spoon, ladle some of the hot tomato sauce over each nest to moisten. In a medium bowl, mix together the cheeses and peas, and set aside.Pat dry the chicken with paper towels and cut into small pieces. Season chicken pieces with salt and pepper. In a medium non-stick skillet, heat the olive oil over medium-high heat and brown the chicken (about 2-3 minutes). Mix into the cheese-pea mixture. Spoon cheese-chicken mixture into the raw pasta nests. Cover baking dish tightly with aluminum foil (If necessary, grease the interior of the sheet with non-stick cooking spray in order to avoid the cheeses sticking to the foil). Bake for about 40-45 minutes. Remove foil and sprinkle grated Parmesan cheese on top of the pasta nests if desired. Serve chicken casserole nests hot (2 nests per person). A fresh salad or steamed vegetables, if desired, can accompany chicken casserole nests. Enjoy our chicken casserole nests!!!', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-casserole-nests-610021', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}