{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/447203-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 447203, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baklava Tartlets', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 24.52, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'3 packages (1.9 ounces each) frozen miniature phyllo tart shells', u'aisle': u'Frozen;Baking', u'name': u'tart shells', u'metaInformation': [u'frozen', u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tart-shells.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.699999999999999, u'consistency': u'solid', u'id': 98852, u'unit': u'ounces'}, {u'originalString': u'2 cups finely chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/baklava-tartlets', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, mix the first five ingredients until blended; stir in walnuts. Spoon 2 teaspoons mixture into each tart shell. Refrigerate until serving.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bollinger Brut Special Cuvee with a 4.3 out of 5 star rating seems like a good match. It costs about 60 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'A golden color, distinctive of black grape varieties. Very fine bubbles. On the nose, it has a beautiful aromatic complexity, ripe fruit and spicy aromas, with hints of roasted apples, apple compote and peaches.  On the palate, there is a subtle combination of structure, length and vivacity. The bubbles are like velvet. Flavors of pear, brioche and spicy aromas, notes of fresh walnut.Pair with all fish, especially sushi and sashimi, shellfish such as shrimp, prawns, crayfish and grilled lobster, poultry and white meat, cashews, parmesan or prosciutto. View More', u'title': u'Bollinger Brut Special Cuvee', u'price': u'$59.99', u'id': 433020, u'link': u'https://www.wine.com/product/bollinger-brut-special-cuvee/513', u'imageUrl': u'https://spoonacular.com/productImages/433020-312x231.jpg'}]}, u'aggregateLikes': 447, u'instructions': u'Directions                                                                                In a small bowl, mix the first five ingredients until blended; stir in walnuts. Spoon 2 teaspoons mixture into each tart shell. Refrigerate until serving.                                        Yield: 45 tartlets.                                                                                                                         Originally published as Baklava Tartlets in  Taste of Home                                                                                                                                                                                                Nutritional Facts                                                                             1 tartlet equals 76 calories, 5 g fat (1 g saturated fat), 5 mg cholesterol, 24 mg sodium, 6 g carbohydrate, trace fiber, 2 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/baklava-tartlets-447203', u'dishTypes': [u'fingerfood', u'antipasti', u'dessert', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 45, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}