{u'recipes': [{u'sourceName': u'The Domestic Rebel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/631188-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 631188, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Chip Cookie Dough Cannolis', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 53.22, u'creditText': u'The Domestic Rebel', u'extendedIngredients': [{u'originalString': u'\xbe cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbe cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'About 10 pre-made cannoli shells (I use and love Ferrara brand)', u'aisle': u'Baking', u'name': u'cannoli shells', u'metaInformation': [u'(I use and love Ferrara brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannoli-shells.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 98983, u'unit': u''}, {u'originalString': u'About 1 cup miniature chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1 & \xbd cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 Tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tbsp'}, {u'originalString': u'2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'\xbc cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 23.0, u'sourceUrl': u'http://thedomesticrebel.com/2013/05/22/chocolate-chip-cookie-dough-cannolis/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of a stand mixer, beat together the butter and sugars until creamy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add in the vanilla and milk and beat to combine. Gradually add the flour a little at a time, until the dough has come together and is soft, yet still slightly stiff enough to stand up (not completely as stiff as regular cookie dough, but not goopy, either). Stir in  cup of the chocolate chips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u"Place the cookie dough into a gallon-sized Ziploc baggy; seal out the air. Snip a corner of the baggy off with scissors and pipe the filling into each of the cannoli shells. Sprinkle the ends of the shell with remaining chocolate chips. Dust with powdered sugar, if you'd like. These are best served immediately, as shells tend to get softer with time.*Note: You can usually find pre-made cannoli shells at grocery stores. Sometimes they're found in the frozen aisle, other times in the bakery, and sometimes on the baking aisle (where I find mine). If you can't seem to find them, you can try looking online, replace the cannoli shell with a cake cone (for a different taste), or try making your own cannoli dough--for which you'll need cannoli forms.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannoli-shells.jpg', u'id': 98983, u'name': u'cannoli shells'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cannoli on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1206, u'instructions': u"In the bowl of a stand mixer, beat together the butter and sugars until creamy. Add in the vanilla and milk and beat to combine. Gradually add the flour a little at a time, until the dough has come together and is soft, yet still slightly stiff enough to stand up (not completely as stiff as regular cookie dough, but not goopy, either). Stir in  cup of the chocolate chips.Place the cookie dough into a gallon-sized Ziploc baggy; seal out the air. Snip a corner of the baggy off with scissors and pipe the filling into each of the cannoli shells. Sprinkle the ends of the shell with remaining chocolate chips. Dust with powdered sugar, if you'd like. These are best served immediately, as shells tend to get softer with time.*Note: You can usually find pre-made cannoli shells at grocery stores. Sometimes they're found in the frozen aisle, other times in the bakery, and sometimes on the baking aisle (where I find mine). If you can't seem to find them, you can try looking online, replace the cannoli shell with a cake cone (for a different taste), or try making your own cannoli dough--for which you'll need cannoli forms.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chip-cookie-dough-cannolis-631188', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}