{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/571111-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 571111, u'veryPopular': False, u'lowFodmap': True, u'title': u'Homemade Skor (Toffee Bits) Hot Chocolate', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 55.32, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'1 cup of Skor Bits (or plain toffee baking bits)', u'aisle': u'Meat', u'name': u'bacon bits', u'metaInformation': [u'plain', u'(or toffee baking bits)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10862, u'unit': u'cup'}, {u'originalString': u'\xbd cup cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'\xbe cup icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1\xbd cups powdered milk', u'aisle': u'Baking', u'name': u'powdered milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1090, u'unit': u'cups'}, {u'originalString': u'1 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/homemade-skor-toffee-bits-hot-chocolate', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u"Combine the chocolate and the toffee in a larger food processor and process until it's almost completely broken down.", u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u"Add the hot chocolate powder to taste in a cup of hot water. Since we use milk powder, you don't need to use milk.Store in an airtight container for 6 weeks (or more), but it won’t last that long!", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'id': 1090, u'name': u'powdered milk'}]}], u'name': u'Add in the remaining ingredients and process until powdered, this will take a while so have patience and just let the food processor chop it all up.I usually leave some little chunks to melt in my powder.To use'}], u'aggregateLikes': 37, u'instructions': u"Combine the chocolate and the toffee in a larger food processor and process until it's almost completely broken down.Add in the remaining ingredients and process until powdered, this will take a while so have patience and just let the food processor chop it all up.I usually leave some little chunks to melt in my powder.To use:Add the hot chocolate powder to taste in a cup of hot water. Since we use milk powder, you don't need to use milk.Store in an airtight container for 6 weeks (or more), but it won’t last that long!", u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-skor-toffee-bits-hot-chocolate-571111', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}