{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/359572-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 160, u'id': 359572, u'veryPopular': False, u'lowFodmap': False, u'title': u"Flour's Famous Sticky Buns", u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 132.84, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 1/4 cups (340 grams) bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 340.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'grams'}, {u'originalString': u'1 1/2 cups (345 grams) firmly packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 345.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup (50 grams) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'1/8 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup (80 grams) heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 80.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'grams'}, {u'originalString': u'1/3 cup (110 grams) honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 110.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'grams'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup (55 grams) light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 55.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'1 cup (100 grams) pecan halves, toasted and chopped', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12142, u'unit': u'grams'}, {u'originalString': u'1/3 cup plus 1 tablespoon (82 grams) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(82 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 1/2 cups (350 grams) unbleached all-purpose flour, plus more if needed', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose', u'plus more if needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 10020081, u'unit': u'grams'}, {u'originalString': u'3/4 cup (1 1/2 sticks; 170 grams, 6 ounces) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 1/2 sticks; 170 grams, 6 ounces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1/2 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1/3 cup (80 grams) water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 80.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'grams'}], u'healthScore': 4.0, u'imageType': u'jpeg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/joanne-changs-sticky-buns-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'First, make the goo. In a medium saucepan, melt the butter over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk in the brown sugar and cook, stirring, to combine (it may look separated, that's ok).", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from the heat and whisk in the honey, cream, water, and salt. Strain to remove any undissolved lumps of brown sugar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let cool for about 30 minutes, or until cooled to room temperature. You should have about 3 cups. (The mixture can be made up to 2 weeks in advance and stored in an airtight container in the refrigerator.)', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Divide the dough in half. Use half for this recipe and reserve the other half for another use.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'On a floured work surface, roll out the brioche into rectangle about 12 by 16 inches and 1/4-inch thick. It will have the consistency of cold, damp Play-Doh and should be fairly easy to roll. Position the rectangle so a short side is facing you.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, stir together the brown sugar, granulated sugar, cinnamon, and half of the pecans. Sprinkle this mixture evenly over the entire surface of the dough. Starting from the short side farthest from you and working your way down, roll up the rectangle like a jelly roll. Try to roll tightly, so you have a nice round spiral. Trim off about 1/4- inch from each end of the roll to make them even.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404672, u'name': u'chefs knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u"Use a bench scraper or a chef's knife to cut the roll into 8 equal pieces, each about 1 1/2-inches wide. (At this point, the unbaked buns can be tightly wrapped in plastic wrap and frozen for up to 1 week. When ready to bake, thaw them, still wrapped, in the refrigerator overnight or at room temperature for 2 to 3 hours, then proceed as directed.)", u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour the goo into a 9 by 13-inch baking dish, covering the bottom evenly. Sprinkle the remaining pecans evenly over the surface. Arrange the buns, evenly spaced, in the baking dish. Cover with plastic wrap and put in a warm spot to proof until the dough is puffy, pillowy, and soft and the buns are touching-almost tripled in size, about 2 hours.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position a rack in the center of the oven, and heat to 350 degrees F.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until golden brown, about 35 to 45 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Let cool in the dish on a wire rack for 20 to 30 minutes. One at a time, invert the buns onto a serving platter, and spoon any extra goo and pecans from the bottom of the dish over the top.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'The buns are best served warm or within 4 hours of baking. They can be stored in an airtight container at room temperature for up to 1 day, and then warmed in a 325 degree F oven for 10 to 12 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'1 1/2 packages (3 1/4 teaspoons) active dry yeast or 1-ounce (28 grams) fresh cake yeast;', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'1 3/8 cups (2 3/4 sticks; 310 grams) unsalted butter, at room temperature, cut into 10 to 12 pieces', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1145, u'name': u'unsalted butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Using a stand mixer fitted with the dough hook, combine the all-purpose flour, bread flour, yeast, sugar, salt, water, and 5 of the eggs. Beat on low speed for 3 to 4 minutes, or until all the ingredients are combined. Stop the mixer, as needed, to scrape the sides and bottom of the bowl to make sure all the flour is incorporated into the wet ingredients. Once the dough has come together, beat on low speed for another 3 to 4 minutes. The dough will be very stiff and seem quite dry.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'With the mixer on low speed, add the butter, 1 piece at a time, mixing after each addition until it disappears into the dough. Continue mixing on low speed for about 10 minutes, stopping the mixer occasionally to scrape the sides and bottom of the bowl. It is important for all the butter to be thoroughly mixed into the dough. If necessary, stop the mixer occasionally and break up the dough with your hands to help mix in the butter.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Once the butter is completely incorporated, turn up the speed to medium and beat until the dough becomes sticky, soft, and somewhat shiny, another 15 minutes. It will take some time to come together. It will look shaggy and questionable at the start and then eventually it will turn smooth and silky. Turn the speed to medium-high and beat for about 1 minute. You should hear the dough make a slap-slap-slap sound as it hits the sides of the bowl. Test the dough by pulling at it; it should stretch a bit and have a little give. If it seems wet and loose and more like a batter than a dough, add a few tablespoons of flour and mix until it comes together. If it breaks off into pieces when you pull at it, continue to mix on medium speed for another 2 to 3 minutes, or until it develops more strength and stretches when you grab it. It is ready when you can gather it all together and pick it up in 1 piece.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the dough in a large bowl or plastic container and cover it with plastic wrap, pressing the wrap directly onto the surface of the dough.', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Let the dough proof (that is, grow and develop flavor) in the refrigerator for at least 6 hours or up to overnight At this point you can freeze the dough in an airtight container for up to 1 week.', u'number': 20, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 34, u'instructions': u"First, make the goo. In a medium saucepan, melt the butter over medium heat. Whisk in the brown sugar and cook, stirring, to combine (it may look separated, that's ok). Remove from the heat and whisk in the honey, cream, water, and salt. Strain to remove any undissolved lumps of brown sugar. Let cool for about 30 minutes, or until cooled to room temperature. You should have about 3 cups. (The mixture can be made up to 2 weeks in advance and stored in an airtight container in the refrigerator.)                          Divide the dough in half. Use half for this recipe and reserve the other half for another use.                          On a floured work surface, roll out the brioche into rectangle about 12 by 16 inches and 1/4-inch thick. It will have the consistency of cold, damp Play-Doh and should be fairly easy to roll. Position the rectangle so a short side is facing you.                          In a small bowl, stir together the brown sugar, granulated sugar, cinnamon, and half of the pecans. Sprinkle this mixture evenly over the entire surface of the dough. Starting from the short side farthest from you and working your way down, roll up the rectangle like a jelly roll. Try to roll tightly, so you have a nice round spiral. Trim off about 1/4- inch from each end of the roll to make them even.                          Use a bench scraper or a chef's knife to cut the roll into 8 equal pieces, each about 1 1/2-inches wide. (At this point, the unbaked buns can be tightly wrapped in plastic wrap and frozen for up to 1 week. When ready to bake, thaw them, still wrapped, in the refrigerator overnight or at room temperature for 2 to 3 hours, then proceed as directed.)                          Pour the goo into a 9 by 13-inch baking dish, covering the bottom evenly. Sprinkle the remaining pecans evenly over the surface. Arrange the buns, evenly spaced, in the baking dish. Cover with plastic wrap and put in a warm spot to proof until the dough is puffy, pillowy, and soft and the buns are touching-almost tripled in size, about 2 hours.                          Position a rack in the center of the oven, and heat to 350 degrees F.                          Bake until golden brown, about 35 to 45 minutes. Let cool in the dish on a wire rack for 20 to 30 minutes. One at a time, invert the buns onto a serving platter, and spoon any extra goo and pecans from the bottom of the dish over the top.                          The buns are best served warm or within 4 hours of baking. They can be stored in an airtight container at room temperature for up to 1 day, and then warmed in a 325 degree F oven for 10 to 12 minutes before serving.                          1 1/2 packages (3 1/4 teaspoons) active dry yeast or 1-ounce (28 grams) fresh cake yeast;                          1 3/8 cups (2 3/4 sticks; 310 grams) unsalted butter, at room temperature, cut into 10 to 12 pieces                          Using a stand mixer fitted with the dough hook, combine the all-purpose flour, bread flour, yeast, sugar, salt, water, and 5 of the eggs. Beat on low speed for 3 to 4 minutes, or until all the ingredients are combined. Stop the mixer, as needed, to scrape the sides and bottom of the bowl to make sure all the flour is incorporated into the wet ingredients. Once the dough has come together, beat on low speed for another 3 to 4 minutes. The dough will be very stiff and seem quite dry.                          With the mixer on low speed, add the butter, 1 piece at a time, mixing after each addition until it disappears into the dough. Continue mixing on low speed for about 10 minutes, stopping the mixer occasionally to scrape the sides and bottom of the bowl. It is important for all the butter to be thoroughly mixed into the dough. If necessary, stop the mixer occasionally and break up the dough with your hands to help mix in the butter.                          Once the butter is completely incorporated, turn up the speed to medium and beat until the dough becomes sticky, soft, and somewhat shiny, another 15 minutes. It will take some time to come together. It will look shaggy and questionable at the start and then eventually it will turn smooth and silky. Turn the speed to medium-high and beat for about 1 minute. You should hear the dough make a slap-slap-slap sound as it hits the sides of the bowl. Test the dough by pulling at it; it should stretch a bit and have a little give. If it seems wet and loose and more like a batter than a dough, add a few tablespoons of flour and mix until it comes together. If it breaks off into pieces when you pull at it, continue to mix on medium speed for another 2 to 3 minutes, or until it develops more strength and stretches when you grab it. It is ready when you can gather it all together and pick it up in 1 piece.                          Put the dough in a large bowl or plastic container and cover it with plastic wrap, pressing the wrap directly onto the surface of the dough. Let the dough proof (that is, grow and develop flavor) in the refrigerator for at least 6 hours or up to overnight At this point you can freeze the dough in an airtight container for up to 1 week.", u'spoonacularSourceUrl': u'https://spoonacular.com/flours-famous-sticky-buns-359572', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 220, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}