{u'recipes': [{u'sourceName': u'The Hill Country Cook', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/539079-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 539079, u'veryPopular': False, u'lowFodmap': False, u'title': u'Totally Teriyaki Marinade', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 82.2, u'creditText': u'The Hill Country Cook', u'extendedIngredients': [{u'originalString': u'3 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'4 gloves garlic, smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 inch ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'6 green onions (optional)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/2 bottle Hoison sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'bottles', u'unitShort': u'bottle', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'bottle'}, {u'originalString': u'2 cups soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'cups'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://thehillcountrycook.com/2012/09/teriyaki-chicken.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all ingredients in a glass container, stir well.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place chicken in marinade for 2-4 hours, or overnight. Turn pieces of chicken occasionally to evenly coat. If you wish to use some marinade as a glaze while cooking, reserve some marinade before putting in the chicken. BBQ for best results, bbq for approximately 12-15 minutes each side, or until juices run clear, or thickest part of chicken reads 180 degrees.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Dry Creek Vineyard Dry Chenin Blanc, Wine with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This beautiful wine is wonderfully consistent vintage after vintage. We receive superior Chenin Blanc fruit from the Wilson Ranch in Clarksburg, allowing us to produce an expressive, nuanced and delicious wine. At first swirl, aromatics of white pear, pineapple and banana spring forward from the glass. On the palate, the wine is refreshing with flavors of ripe tangerine and peaches. The mouthfeel is lively, but rich and has a subtle creaminess. 100% stainless steel fermentation guarantees the fresh fruit character fans of this wine have come to appreciate over the years. This is the quintessential summer sipper and the perfect wine to pair with fresh oysters!', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 79, u'instructions': u'Combine all ingredients in a glass container, stir well. Place chicken in marinade for 2-4 hours, or overnight. Turn pieces of chicken occasionally to evenly coat. If you wish to use some marinade as a glaze while cooking, reserve some marinade before putting in the chicken. BBQ for best results, bbq for approximately 12-15 minutes each side, or until juices run clear, or thickest part of chicken reads 180 degrees.', u'spoonacularSourceUrl': u'https://spoonacular.com/totally-teriyaki-marinade-539079', u'dishTypes': [u'seasoning', u'marinade'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}