{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/449167-556x370.jpg', u'cheap': True, u'gaps': u'no', u'cookingMinutes': 0, u'id': 449167, u'veryPopular': False, u'lowFodmap': False, u'title': u"Witch's Broom", u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 1.89, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'6 pieces black licorice', u'aisle': u'Sweet Snacks', u'name': u'black licorice', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-licorice-candy.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98851, u'unit': u'pieces'}, {u'originalString': u'6 pieces green shoestring licorice', u'aisle': u'Sweet Snacks', u'name': u'black licorice', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-licorice-candy.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98851, u'unit': u'pieces'}, {u'originalString': u'6 pretzel rods', u'aisle': u'Savory Snacks', u'name': u'pretzel rods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-rods.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10019047, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/witch-s-broom', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut one green shoestring licorice into 1-in. lengths. Arrange around end of one pretzel rod to form broom bristles; tightly wrap bristles with one black shoestring licorice, tucking in end to secure. Repeat with remaining ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 26, u'instructions': u"Directions                                                                                Cut one green shoestring licorice into 1-in. lengths. Arrange around end of one pretzel rod to form broom bristles; tightly wrap bristles with one black shoestring licorice, tucking in end to secure. Repeat with remaining ingredients.                                        Yield: 6 brooms.                                                                                                                         Originally published as Witch's Broom in  Taste of HomeOctober 2011, p32                                                                                                                                                                                                        Nutritional Facts                                                                             1 broom equals 106 calories, trace fat (0 saturated fat), 0 cholesterol, 142 mg sodium, 24 g carbohydrate, trace fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/witchs-broom-449167', u'dishTypes': [u'side dish'], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}