{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523378-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 523378, u'veryPopular': False, u'lowFodmap': False, u'title': u'Graham Crackers', u'diets': [u'dairy free'], u'pricePerServing': 12.47, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'1 Tbs Almond Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'Tbs'}, {u'originalString': u'30g (2 Tbs) Unsweetened Applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 9019, u'unit': u'Tbs'}, {u'originalString': u'1/2 tsp Baking Soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 tsp Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'42g (2 Tbs) Honey or Agave', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbs'}, {u'originalString': u'42g (2 Tbs) Molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'Tbs'}, {u'originalString': u'1/4 tsp Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'48g (1/4 cup) Sucanat**', u'aisle': u'Health Foods;Baking', u'name': u'sucanat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19908, u'unit': u'cup'}, {u'originalString': u'1 tsp Vanilla Extract**', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'28g (2 Tbs) Walnut Oil (or any other neutral oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'walnut oil', u'metaInformation': [u'or any other neutral oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnut-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4528, u'unit': u'Tbs'}, {u'originalString': u'180g (1+1/2 cups) Whole Wheat Flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat', u'(1+1/2 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 180.0, u'consistency': u'solid', u'id': 20080, u'unit': u'g'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://dessertswithbenefits.com/graham-crackers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Tape down a large square of parchment paper onto your counter using a sturdy tape (I used packing tape around all four sides) and line a cookie pan with parchment paper, set aside.In a small bowl add the Dry II ingredient (whole wheat flour) and set aside. In a medium-sized mixing bowl, add the Dry I ingredients and whisk, set aside.In a small bowl, stir together the Wet ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Pour this over the Dry I ingredients and stir.  Sprinkle some of the flour set aside (Dry II) onto the mixture and mix in using your fingers.  Do this until the mixture can form a kneadable ball.Dust the parchment paper square with the flour set aside (Dry II) and knead the dough, adding more flour when needed.  Once you form a ball, let the dough sit for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oven to 350 or 375 degrees Fahrenheit (read * above).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll the dough using a rolling pin to about 1/8" thick, sprinkling with flour if needed.  Slice crackers using a pizza cutter and use a spatula to lift each square onto the prepared pan about 2 inches apart.  Poke holes into the crackers using a fork, then bake for 14-16 minutes at 350 degrees, or 10-12 minutes at 375 (baking time depends on size of crackers, just keep watch and take the crackers out when the edges have browned)', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 146, u'instructions': u'Tape down a large square of parchment paper onto your counter using a sturdy tape (I used packing tape around all four sides) and line a cookie pan with parchment paper, set aside.In a small bowl add the Dry II ingredient (whole wheat flour) and set aside. In a medium-sized mixing bowl, add the Dry I ingredients and whisk, set aside.In a small bowl, stir together the Wet ingredients.  Pour this over the Dry I ingredients and stir.  Sprinkle some of the flour set aside (Dry II) onto the mixture and mix in using your fingers.  Do this until the mixture can form a kneadable ball.Dust the parchment paper square with the flour set aside (Dry II) and knead the dough, adding more flour when needed.  Once you form a ball, let the dough sit for 10 minutes.Heat the oven to 350 or 375 degrees Fahrenheit (read * above).  Roll the dough using a rolling pin to about 1/8" thick, sprinkling with flour if needed.  Slice crackers using a pizza cutter and use a spatula to lift each square onto the prepared pan about 2 inches apart.  Poke holes into the crackers using a fork, then bake for 14-16 minutes at 350 degrees, or 10-12 minutes at 375 (baking time depends on size of crackers, just keep watch and take the crackers out when the edges have browned)', u'spoonacularSourceUrl': u'https://spoonacular.com/graham-crackers-523378', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 22, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}