{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/60996-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 60996, u'veryPopular': False, u'lowFodmap': False, u'title': u"Bill Yosses' Black Forest Cake", u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 2.53, u'extendedIngredients': [{u'originalString': u'3/4 cup Dutch-process cocoa powder', u'aisle': u'Baking', u'name': u'dutch process cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dutch-process-cocoa-powder.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019165, u'unit': u'cup'}, {u'originalString': u'3 large egg yolks , at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'7 large eggs , at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 1/4 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'8 Tbsp. (1 stick) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp. vanilla extract | Get the recipe!', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups whole wheat (or whole grain) pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat', u'whole', u'(or grain)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020080, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.oprah.com/food/Bill-Yosses-Black-Forest-Cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Note: This recipe makes the cake itself, with a whipped cream, shaved chocolate, and cherry topping. Bill Yosses serves the cake in a chocolate box (pictured).To make cake: Preheat oven to 325. Spray an 11" x 17" baking pan with cooking spray, then line bottom with parchment paper and spray again. Position an oven rack in middle of the oven.Melt butter; transfer to a bowl to cool. In a medium bowl, sift together flour and cocoa; set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Whisk eggs, yolks, salt, vanilla, and sugar in a mixing bowl set over a pot of simmering water until just warm to the touch; transfer bowl to a stand mixer with whisk attachment and beat on medium-high speed until very light and tripled in volume, about 10 minutes. Gently fold in flour mixture until incorporated. Gently fold about 1/3 of the egg-flour mixture into reserved melted butter, and then fold butter mixture into remaining egg-flour mixture.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread batter evenly in pan and bake until cake springs back after touching, about 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer pan to rack and cool completely.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Remove from pan; transfer with parchment to a cutting board; cut cake into 4 equal pieces horizontally, to make thin layers.To make whipped cream: In a small saucepan, evenly sprinkle gelatin over cold water; let stand 1 minute, then stir frequently for 2 minutes; cook over medium-low heat until gelatin completely dissolves; remove from heat. In a large bowl combine cream and vanilla; beat until soft peaks form, then beat in confectioner's sugar and gelatin, each in a steady stream. Beat until stiff peaks form.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Transfer to a pastry bag fitted with a 1/2-inch hole, or a Ziploc bag with a corner cut off.To make cherry filling: Stir together cherries, cornstarch, sugar, honey, lemon zest, and lemon juice. Bring to a boil; then simmer, stirring, until thickened, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a shallow bowl and cool; then blend until almost smooth. Chill until ready to use.To make simple syrup: Stir together 1/2 cup water, sugar, honey, and rum or kirsch (if using) in a small saucepan. Bring to a boil, then remove from heat and transfer to a bowl; chill until ready to use.To make chocolate shavings: Melt chocolate and shortening in a 1-quart saucepan over very low heat until melted and smooth, stirring frequently.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Pour chocolate mixture into a foil-lined loaf pan. Refrigerate until chocolate is firm, about 2 hours.', u'number': 8, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place 1 cake piece on a platter, then pipe whipped cream around edge to form a border.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 1/3 of cherry filling in center, then spread more whipped cream on top, covering cherry filling. Top with another cake layer; repeat layering process 2 more times until last cake layer is used. Thinly frost the entire cake with whipped cream and freeze until the whipped cream is firm, about 30 minutes. Frost cake with remaining whipped cream and sprinkle with chocolate shavings.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with cherries on top.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, or refrigerate.', u'number': 4, u'ingredients': []}], u'name': u'Remove chocolate from pan. Using a vegetable peeler, draw blade across the surface of chocolate to make shavings.To assemble cake'}], u'aggregateLikes': 15, u'instructions': u'Note: This recipe makes the cake itself, with a whipped cream, shaved chocolate, and cherry topping. Bill Yosses serves the cake in a chocolate box (pictured).To make cake: Preheat oven to 325. Spray an 11" x 17" baking pan with cooking spray, then line bottom with parchment paper and spray again. Position an oven rack in middle of the oven.Melt butter; transfer to a bowl to cool. In a medium bowl, sift together flour and cocoa; set aside.Whisk eggs, yolks, salt, vanilla, and sugar in a mixing bowl set over a pot of simmering water until just warm to the touch; transfer bowl to a stand mixer with whisk attachment and beat on medium-high speed until very light and tripled in volume, about 10 minutes. Gently fold in flour mixture until incorporated. Gently fold about 1/3 of the egg-flour mixture into reserved melted butter, and then fold butter mixture into remaining egg-flour mixture.Spread batter evenly in pan and bake until cake springs back after touching, about 25 minutes. Transfer pan to rack and cool completely. Remove from pan; transfer with parchment to a cutting board; cut cake into 4 equal pieces horizontally, to make thin layers.To make whipped cream: In a small saucepan, evenly sprinkle gelatin over cold water; let stand 1 minute, then stir frequently for 2 minutes; cook over medium-low heat until gelatin completely dissolves; remove from heat. In a large bowl combine cream and vanilla; beat until soft peaks form, then beat in confectioner\'s sugar and gelatin, each in a steady stream. Beat until stiff peaks form. Transfer to a pastry bag fitted with a 1/2-inch hole, or a Ziploc bag with a corner cut off.To make cherry filling: Stir together cherries, cornstarch, sugar, honey, lemon zest, and lemon juice. Bring to a boil; then simmer, stirring, until thickened, about 10 minutes. Transfer to a shallow bowl and cool; then blend until almost smooth. Chill until ready to use.To make simple syrup: Stir together 1/2 cup water, sugar, honey, and rum or kirsch (if using) in a small saucepan. Bring to a boil, then remove from heat and transfer to a bowl; chill until ready to use.To make chocolate shavings: Melt chocolate and shortening in a 1-quart saucepan over very low heat until melted and smooth, stirring frequently. Pour chocolate mixture into a foil-lined loaf pan. Refrigerate until chocolate is firm, about 2 hours. Remove chocolate from pan. Using a vegetable peeler, draw blade across the surface of chocolate to make shavings.To assemble cake: Place 1 cake piece on a platter, then pipe whipped cream around edge to form a border. Spread 1/3 of cherry filling in center, then spread more whipped cream on top, covering cherry filling. Top with another cake layer; repeat layering process 2 more times until last cake layer is used. Thinly frost the entire cake with whipped cream and freeze until the whipped cream is firm, about 30 minutes. Frost cake with remaining whipped cream and sprinkle with chocolate shavings. Garnish with cherries on top. Serve immediately, or refrigerate.', u'spoonacularSourceUrl': u'https://spoonacular.com/bill-yosses-black-forest-cake-60996', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 250, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}