{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/497536-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 497536, u'veryPopular': False, u'lowFodmap': False, u'title': u'Greek Chicken Milanese', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 526.79, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'4 boneless, skinless breasts', u'aisle': u'Meat', u'name': u'duck breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/duck-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 98912, u'unit': u''}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tbsp feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1019, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'5-7 grape tomatoes, sliced in half', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10111529, u'unit': u''}, {u'originalString': u'2 tbsp kalamata olives, sliced', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1009195, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'1-2 tbsp olive oil, more if needed', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 cup of panko crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'1/2 tsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'2 tbsp roasted bell pepper, diced', u'aisle': u'Canned and Jarred', u'name': u'roasted red bell pepper', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11916, u'unit': u'tbsp'}, {u'originalString': u'3 cups of spring mixed salad greens', u'aisle': u'Produce', u'name': u'salad greens', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u"Fran's Vinaigrette, to taste", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinaigrette', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4135, u'unit': u'servings'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2012/08/greek-chicken-milanese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}], u'step': u"Make the vinaigrette (see link above for Fran's Vinaigrette).Take each chicken breast and place them, one at a time, in a zip lock bag. Pound the chicken breasts to 1/2 inch thickness using a meat mallet.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'id': 4135, u'name': u'vinaigrette'}]}, {u'equipment': [], u'step': u'Cut the chicken breast in half and set aside. Repeat with the remaining pieces of chicken.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the flour into another bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the eggs and milk into a separate bowl and beat with a fork until well combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Combine the panko with the oregano, garlic powder, paprika, sea salt and freshly cracked pepper, to taste; mix well.Dredge the chicken in flour; dip in egg; dredge in panko mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place coated chicken on a baking tray that is covered in wax paper. Repeat with the remaining pieces of chicken.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the baking tray into the refrigerator for at least 30 minutes. This will help the breading stick to the chicken.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large skillet over medium heat. Once the pan is hot, add the chicken, cooking a few pieces at a time. Cook for 3-4 minutes; turn chicken over and cook 2-3 minutes or until golden brown and cooked through.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place onto a plate lined with paper towels to soak up any remaining grease.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the vinaigrette thoroughly then drizzle it onto the greens, tomato halves, roasted bell pepper, kalamata olives, and feta cheese; toss to coat evenly.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'id': 1009195, u'name': u'kalamata olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'id': 4135, u'name': u'vinaigrette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Serve a piece of chicken with a large spoonful of greens on each plate. Enjoy.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 279, u'instructions': u"Make the vinaigrette (see link above for Fran's Vinaigrette).Take each chicken breast and place them, one at a time, in a zip lock bag. Pound the chicken breasts to 1/2 inch thickness using a meat mallet. Cut the chicken breast in half and set aside. Repeat with the remaining pieces of chicken. Pour the flour into another bowl.  Combine the eggs and milk into a separate bowl and beat with a fork until well combined. Combine the panko with the oregano, garlic powder, paprika, sea salt and freshly cracked pepper, to taste; mix well.Dredge the chicken in flour; dip in egg; dredge in panko mixture. Place coated chicken on a baking tray that is covered in wax paper. Repeat with the remaining pieces of chicken. Place the baking tray into the refrigerator for at least 30 minutes. This will help the breading stick to the chicken.Heat the olive oil in a large skillet over medium heat. Once the pan is hot, add the chicken, cooking a few pieces at a time. Cook for 3-4 minutes; turn chicken over and cook 2-3 minutes or until golden brown and cooked through.  Place onto a plate lined with paper towels to soak up any remaining grease.Whisk the vinaigrette thoroughly then drizzle it onto the greens, tomato halves, roasted bell pepper, kalamata olives, and feta cheese; toss to coat evenly.Serve a piece of chicken with a large spoonful of greens on each plate. Enjoy.", u'spoonacularSourceUrl': u'https://spoonacular.com/greek-chicken-milanese-497536', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}