{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/173502-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 200, u'id': 173502, u'veryPopular': False, u'lowFodmap': False, u'title': u'Classic Beef Stew', u'diets': [u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 457.39, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'2 medium carrots, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 medium stalk celery, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'medium', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 dried bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried bay leaf', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 lb boneless beef chuck, tip or round roast, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'elk round roast', u'metaInformation': [u'boneless', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 35177, u'unit': u'lb'}, {u'originalString': u'2 tablespoons Gold Medal\xae all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'gold medal\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 medium green bell pepper, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 small onion, chopped (1/4 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 large unpeeled potato, cut into 1 1/2-inch pieces', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'large', u'unpeeled', u'cut into 1 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon vegetable oil or shortening', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'https://www.bettycrocker.com/recipes/classic-beef-stew/38aa1b3f-3f9b-44d8-a9c6-2f4e879613de', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In 12-inch skillet or 4-quart Dutch oven, heat oil over medium heat 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add beef; cook about 15 minutes, stirring occasionally, until brown on all sides.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add water, 1/2 teaspoon salt and the pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Heat to boiling. Reduce heat to low. Cover; simmer 2 hours to 2 hours 30 minutes or until beef is almost tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Stir in remaining ingredients except cold water and flour. Cover; cook about 30 minutes or until vegetables are tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove bay leaf.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'In tightly covered jar or container, shake cold water and flour; gradually stir into beef mixture.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Heat to boiling, stirring constantly. Boil and stir 1 minute until thickened.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Beef Stew can be paired with Cabernet Sauvignon, Malbec, and Shiraz. These full-bodied red wines are the perfect accompaniment for hearty beef stew. You could try Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'Cabernet Sauvignon 100% View More', u'title': u"Vincent Bouquet Cabernet Sauvignon Vin de Pays d'Oc", u'price': u'$7.99', u'id': 454922, u'link': u'https://www.wine.com/product/vincent-bouquet-cabernet-sauvignon-vin-de-pays-doc-2006/101798', u'imageUrl': u'https://spoonacular.com/productImages/454922-312x231.jpg'}]}, u'aggregateLikes': 224, u'instructions': u'1                               In 12-inch skillet or 4-quart Dutch oven, heat oil over medium heat 1 to 2 minutes. Add beef; cook about 15 minutes, stirring occasionally, until brown on all sides.                                                          2                               Add water, 1/2 teaspoon salt and the pepper. Heat to boiling. Reduce heat to low. Cover; simmer 2 hours to 2 hours 30 minutes or until beef is almost tender.                                                          3                               Stir in remaining ingredients except cold water and flour. Cover; cook about 30 minutes or until vegetables are tender. Remove bay leaf.                                                          4                               In tightly covered jar or container, shake cold water and flour; gradually stir into beef mixture. Heat to boiling, stirring constantly. Boil and stir 1 minute until thickened.', u'spoonacularSourceUrl': u'https://spoonacular.com/classic-beef-stew-173502', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 225, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}