{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/534160-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 534160, u'veryPopular': True, u'lowFodmap': False, u'title': u'Grandma’s Italian Meatball', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 198.38, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'1 cup breadcrumbs (Grandma recommends Italian style)', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'italian', u'recommends style', u'(Grandma )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Fresh Basil (for garnish, if desired)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'(for garnish, if desired)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'2 cloves of garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'4 garlic gloves, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 teaspoon fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons kosher salt, add more to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'2 pounds ground beef (I used 80% lean meat to 20% fat)', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'80%', u'20%', u'lean', u'(I used meat to fat)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pounds'}, {u'originalString': u'4 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'Freshly grated Parmesan cheese (for garnish, if desired)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated', u'(for garnish, if desired)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'6 ounces tomato paste (use less if a thinner consistency is desired)', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'(use less if a thinner consistency is desired)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11887, u'unit': u'ounces'}, {u'originalString': u'7 cups (56 ounces) crushed tomatoes (I recommend Cento Brand, imported from Italy)', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'crushed', u'(I recommend Cento Brand, imported from Italy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 56.0, u'consistency': u'solid', u'id': 11529, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon yellow onion, finely minced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup yellow onions, minced', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.jessicagavin.com/test-kitchen/favorite-recipes/grandmas-italian-meatball-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Heat olive oil over medium low heat and saut\xe9 onion and garlic until onions are translucent, 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add tomato paste and stir well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add tomatoes and simmer 30 minutes. Season tomato sauce with salt to taste.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine all ingredients in a large bowl and mix using your hand.Cook a small test piece, taste for the correct seasoning level, correct seasoning if needed.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Roll meatballs to the size of a large egg, about 3 ounces in weight.Line a baking sheet with foil. Evenly space the meatballs on the sheet.Set the oven rack to the lower middle position.Broil the meatballs until browned, about 10 minutes, then turn over. Cook for an additional 2-3 minutes.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add meatballs to the tomato sauce. Simmer on low heat for at least 1 \xbd hours, checking and stirring every 15 minutes, or as needed.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the meatballs from the sauce into a separate bowl, cover to keep warm. Stir the sauce; adjust consistency with small amounts of water if too thick. Correct seasoning if needed.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish meatballs with fresh basil and Parmesan cheese.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian on the menu? Try pairing with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Fonterutoli Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 652, u'instructions': u'Heat olive oil over medium low heat and saut\xe9 onion and garlic until onions are translucent, 3 minutes.Add tomato paste and stir well. Add tomatoes and simmer 30 minutes. Season tomato sauce with salt to taste.Combine all ingredients in a large bowl and mix using your hand.Cook a small test piece, taste for the correct seasoning level, correct seasoning if needed.Roll meatballs to the size of a large egg, about 3 ounces in weight.Line a baking sheet with foil. Evenly space the meatballs on the sheet.Set the oven rack to the lower middle position.Broil the meatballs until browned, about 10 minutes, then turn over. Cook for an additional 2-3 minutes.Add meatballs to the tomato sauce. Simmer on low heat for at least 1 \xbd hours, checking and stirring every 15 minutes, or as needed. Remove the meatballs from the sauce into a separate bowl, cover to keep warm. Stir the sauce; adjust consistency with small amounts of water if too thick. Correct seasoning if needed. Garnish meatballs with fresh basil and Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/grandmas-italian-meatball-534160', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}