{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220910-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 160, u'id': 220910, u'veryPopular': False, u'lowFodmap': False, u'title': u"Roast chicken with leek, tarragon & goat's cheese stuffing", u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 127.25, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g fresh white breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'a large chicken, about 2\xbd kg 5lb 8oz', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'oz'}, {u'originalString': u'2-3 sprigs of fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'sprigs'}, {u'originalString': u'2-3 sprigs of fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u"about 100g 4oz soft fresh goat's cheese (rindless) or ricotta", u'aisle': u'Cheese', u'name': u"goat's cheese", u'metaInformation': [u'fresh', u'soft', u'(rindless)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1159, u'unit': u'g'}, {u'originalString': u'2 medium leeks, trimmed and washed', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'washed', u'medium', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 Spanish onion, trimmed and washed', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'spanish', u'washed', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 tbsp finely grated parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tbsp'}, {u'originalString': u'3-4 bushy sprigs of fresh tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'tarragon', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2041, u'unit': u''}, {u'originalString': u'85g unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2282/roast-chicken-with-leek-tarragon-and-goats-cheese-', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Chop the leeks and onion fairly finely: use the pulse button if chopping them in a food processor, so they don’t turn to mush. Melt 25g/1oz butter in a large frying pan placed over a lowish heat and fry the vegetables gently for about 10 minutes, stirring frequently, until soft. Set the pan aside to cool.Strip off all the herb leaves and put them in a food processor with the remaining butter, the cheeses, breadcrumbs and the cooled vegetables. Season, then pulse until the mixture is a rough, sticky, dough-like mass.Preheat the oven to 200C/gas 6/fan 180C.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Place the chicken with the large cavity facing towards you.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove and discard any fat remaining inside the opening. Now gently separate the skin over the breast area from the flesh beneath: use the tip of a small knife to get going, then gently ease your fingers in between and work them to the far end on both sides of the breast bone.Without tearing the skin, push in dollops of stuffing, massaging them right down and over the flesh. (Put any leftover stuffing into the small neck cavity.) Pull the skin back into place and seal in the stuffing by stitching 2-3 wooden toothpicks through the edges of the opening, like a needle in a tapestry. You can make the stuffing up to 24 hours ahead, keeping it cling-filmed in the fridge.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Put the chicken in a snug-fitting roasting tin, smear the skin with oil and season. Roast the chicken, breast-side up, for 30 minutes. Turn the chicken on its side, basting with any juices, and roast for a further 30 minutes, then roast for an equal period on the other side. Now turn the chicken breast-side up again, and continue to roast for 10-30 minutes, or until the juices run clear when a skewer is poked into the thickest part of the thigh.Leave the chicken to rest in the tin for 15-20 minutes, loosely draped with foil. To serve, first remove the toothpicks, then carve the chicken, spooning some of the soft stuffing onto each serving.', u'length': {u'number': 110, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Roasted Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'Chop the leeks and onion fairly finely: use the pulse button if chopping them in a food processor, so they don’t turn to mush. Melt 25g/1oz butter in a large frying pan placed over a lowish heat and fry the vegetables gently for about 10 minutes, stirring frequently, until soft. Set the pan aside to cool.Strip off all the herb leaves and put them in a food processor with the remaining butter, the cheeses, breadcrumbs and the cooled vegetables. Season, then pulse until the mixture is a rough, sticky, dough-like mass.Preheat the oven to 200C/gas 6/fan 180C. Place the chicken with the large cavity facing towards you. Remove and discard any fat remaining inside the opening. Now gently separate the skin over the breast area from the flesh beneath: use the tip of a small knife to get going, then gently ease your fingers in between and work them to the far end on both sides of the breast bone.Without tearing the skin, push in dollops of stuffing, massaging them right down and over the flesh. (Put any leftover stuffing into the small neck cavity.) Pull the skin back into place and seal in the stuffing by stitching 2-3 wooden toothpicks through the edges of the opening, like a needle in a tapestry. You can make the stuffing up to 24 hours ahead, keeping it cling-filmed in the fridge.Put the chicken in a snug-fitting roasting tin, smear the skin with oil and season. Roast the chicken, breast-side up, for 30 minutes. Turn the chicken on its side, basting with any juices, and roast for a further 30 minutes, then roast for an equal period on the other side. Now turn the chicken breast-side up again, and continue to roast for 10-30 minutes, or until the juices run clear when a skewer is poked into the thickest part of the thigh.Leave the chicken to rest in the tin for 15-20 minutes, loosely draped with foil. To serve, first remove the toothpicks, then carve the chicken, spooning some of the soft stuffing onto each serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/roast-chicken-with-leek-tarragon-goats-cheese-stuffing-220910', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 160, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}