{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/2778-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 2778, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet and Savory Tofu Eel', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 99.24, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'2 1/2 teaspoons mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 93830, u'unit': u'teaspoons'}, {u'originalString': u'2 full-size sheets toasted Nori', u'aisle': u'Ethnic Foods', u'name': u'nori', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 2.0, u'consistency': u'liquid', u'id': 11446, u'unit': u'sheets'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Japanese soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons Japanese soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'2 pinches sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinches'}, {u'originalString': u'1 pound firm tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16162, u'unit': u'pound'}, {u'originalString': u'1 1/2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.foodrepublic.com/2012/06/04/sweet-and-savory-tofu-eel-recipe', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the glaze:  For the glaze, combine the sugar, mirin and soy sauce in a very small pan. Bring to a boil over medium-high heat, stirring to dissolve the sugar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u'Let boil for about 2 minutes, until tan foam appears on the surface. Lower the heat to vigorously simmer for 1 to 2 minutes, until slightly thickened. Set aside to cool completely. The finished glaze should be syrupy, with a strong salty sweetness. There should be 3 to 4 tablespoons.  For the tofu eel mix:  Use scissors to cut each sheet of nori in half lengthwise. Set aside 1 piece for the moment. Stack the remaining 3 pieces and cut them in half lengthwise to yield 6 strips that are roughly 2 inches wide and 8 inches long. Set them aside in a dry spot. Tear the reserved piece of nori into 3/4-inch pieces.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Put them in a clean, dry spice grinder (or coffee grinder dedicated to spice grinding) and process into small flakes that resemble graphite. Dont worry if they are not a fine size.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a small bowl and set aside. Break up the tofu into 6 to 8 chunks. Working in 2 or 3 batches, put the tofu in a non-terry dishtowel or piece of muslin, then gather it up. Standing over a sink, firmly squeeze and massage. You want some moisture left in the tofu but you dont want it wet. Unwrap and you should have about 11 ounces (roughly 11/3 cups packed).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the tofu to a bowl. Use a potato masher to even out the texture of the tofu.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the salt, sugar, soy sauce, 2 teaspoons of cornstarch and 1 brimming teaspoon of the seaweed flakes; discard or save leftover flakes for another use. Mash the mixture again to create a fairly smooth mixture. Divide the tofu mixture into 6 even portions. In a small bowl, dissolve the remaining 11/2 tablespoons cornstarch with the water. Set this glue and the tofu mixture aside.  To assemble the eel:  Put a nori strip on your work surface, rougher side facing up. Give the cornstarch slurry a stir, then brush it on the seaweed, taking care to cover the edges.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Spread a portion of the tofu mixture over the seaweed. Do your best to even out the surface with your fingers, the flat side of the knife blade, or a wooden dowel rolling pin. Now use the spine of the knife to create a faux eel fillet. Lightly tap out shallow lines across the tofu mixture, working from one end to the other. Then, gently press the knife spine down the middle to evoke the backbone. Turn your knife over to its normal position, then halve the strip crosswise.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the 2 strips on a parchment paperlined baking sheet. Repeat with the remaining seaweed strips and tofu mixture. When done, cover loosely with a dishtowel to prevent drying.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chopsticks.jpg', u'id': 405596, u'name': u'chopsticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1/3 inch of oil in a medium skillet over medium-high heat to between 350 and 360F. If you dont have a deep-fry thermometer, gauge the oil temperature by sticking a dry bamboo chopstick into the oil; if bubbles rise immediately to the surface, the oil is ready. Fry the strips 3 at a time, carefully laying each one, tofu side facing down, in the oil. The strip should initially sink, then quickly rise and raucously sizzle. The strip should slightly bend upward, as if it were arching toward you. Oil will naturally pool on the seaweed. Fry for about 2 minutes, until the tofu side is golden, crisp, and puffed up. Use two spatulas to turn the strips over. Fry the nori side for about 45 seconds, until taut and slightly crisp.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain on paper towel, tofu side up. Return the oil to temperature between batches. The strips are good hot, warm, or at room temperature as long as they are somewhat crisp on the tofu side. To serve, cut each strip crosswise or on a steep diagonal into 3/4- to 1-inch-wide pieces. Arrange on a plate (or put atop a bowl of rice) and spoon or drizzle some of the glaze on top. You can also elect to drizzle the glaze on the strips before cutting and plating them.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 29, u'instructions': u'For the glaze:  For the glaze, combine the sugar, mirin and soy sauce in a very small pan. Bring to a boil over medium-high heat, stirring to dissolve the sugar. Let boil for about 2 minutes, until tan foam appears on the surface. Lower the heat to vigorously simmer for 1 to 2 minutes, until slightly thickened. Set aside to cool completely. The finished glaze should be syrupy, with a strong salty sweetness. There should be 3 to 4 tablespoons.  For the tofu eel mix:  Use scissors to cut each sheet of nori in half lengthwise. Set aside 1 piece for the moment. Stack the remaining 3 pieces and cut them in half lengthwise to yield 6 strips that are roughly 2 inches wide and 8 inches long. Set them aside in a dry spot. Tear the reserved piece of nori into 3/4-inch pieces. Put them in a clean, dry spice grinder (or coffee grinder dedicated to spice grinding) and process into small flakes that resemble graphite. Dont worry if they are not a fine size. Transfer to a small bowl and set aside. Break up the tofu into 6 to 8 chunks. Working in 2 or 3 batches, put the tofu in a non-terry dishtowel or piece of muslin, then gather it up. Standing over a sink, firmly squeeze and massage. You want some moisture left in the tofu but you dont want it wet. Unwrap and you should have about 11 ounces (roughly 11/3 cups packed). Transfer the tofu to a bowl. Use a potato masher to even out the texture of the tofu. Add the salt, sugar, soy sauce, 2 teaspoons of cornstarch and 1 brimming teaspoon of the seaweed flakes; discard or save leftover flakes for another use. Mash the mixture again to create a fairly smooth mixture. Divide the tofu mixture into 6 even portions. In a small bowl, dissolve the remaining 11/2 tablespoons cornstarch with the water. Set this glue and the tofu mixture aside.  To assemble the eel:  Put a nori strip on your work surface, rougher side facing up. Give the cornstarch slurry a stir, then brush it on the seaweed, taking care to cover the edges. Spread a portion of the tofu mixture over the seaweed. Do your best to even out the surface with your fingers, the flat side of the knife blade, or a wooden dowel rolling pin. Now use the spine of the knife to create a faux eel fillet. Lightly tap out shallow lines across the tofu mixture, working from one end to the other. Then, gently press the knife spine down the middle to evoke the backbone. Turn your knife over to its normal position, then halve the strip crosswise. Place the 2 strips on a parchment paperlined baking sheet. Repeat with the remaining seaweed strips and tofu mixture. When done, cover loosely with a dishtowel to prevent drying. Heat 1/3 inch of oil in a medium skillet over medium-high heat to between 350 and 360F. If you dont have a deep-fry thermometer, gauge the oil temperature by sticking a dry bamboo chopstick into the oil; if bubbles rise immediately to the surface, the oil is ready. Fry the strips 3 at a time, carefully laying each one, tofu side facing down, in the oil. The strip should initially sink, then quickly rise and raucously sizzle. The strip should slightly bend upward, as if it were arching toward you. Oil will naturally pool on the seaweed. Fry for about 2 minutes, until the tofu side is golden, crisp, and puffed up. Use two spatulas to turn the strips over. Fry the nori side for about 45 seconds, until taut and slightly crisp. Drain on paper towel, tofu side up. Return the oil to temperature between batches. The strips are good hot, warm, or at room temperature as long as they are somewhat crisp on the tofu side. To serve, cut each strip crosswise or on a steep diagonal into 3/4- to 1-inch-wide pieces. Arrange on a plate (or put atop a bowl of rice) and spoon or drizzle some of the glaze on top. You can also elect to drizzle the glaze on the strips before cutting and plating them.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-savory-tofu-eel-2778', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}