{u'recipes': [{u'sourceName': u'Fuss Free Cooking', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/494193-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 494193, u'veryPopular': False, u'lowFodmap': False, u'title': u'[] Grilled Thai Red Curry Steak & Noodles Stir Fry', u'diets': [u'dairy free'], u'pricePerServing': 431.46, u'creditText': u'Fuss Free Cooking', u'extendedIngredients': [{u'originalString': u'1 cup beef stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u'\xbd brown onion, sliced', u'aisle': u'Produce', u'name': u'brown onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}, {u'originalString': u'1 tbsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'1 large carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'Fresh coriander & chilli for garnish optional', u'aisle': u'Produce', u'name': u'chilli', u'metaInformation': [u'fresh', u'for garnish optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11819, u'unit': u'servings'}, {u'originalString': u'1 \xbd tbsp cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp cornflour', u'aisle': u'Baking', u'name': u'cornflour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tbsp'}, {u'originalString': u'400g fresh Hokkien noodles, loosen by hand', u'aisle': u'Ethnic Foods', u'name': u'hokkien noodles', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 98967, u'unit': u'g'}, {u'originalString': u'1 bunch of choy sum, chopped', u'aisle': u'Produce', u'name': u'ong choy', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-spinach.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11503, u'unit': u'bunch'}, {u'originalString': u'2 Porterhouse steaks', u'aisle': u'Meat', u'name': u'porterhouse steaks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tbone-or-porterhouse-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10023003, u'unit': u''}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Soy sauce to taste', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'servings'}, {u'originalString': u'1 tbsp Thai red curry paste', u'aisle': u'Ethnic Foods', u'name': u'thai red curry paste', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93605, u'unit': u'tbsp'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.fussfreecooking.com/recipe-categories/meat-recipes/recipe-grilled-thai-red-curry-steak-noodles-stir-fry/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Start by marinating the beef. On a plate, mix 1 tablespoon of Thai red curry paste, 1 \xbd tablespoon of cooking and some salt to taste. Coat the steaks with the mixture and allow them to marinate for 30 minutes if time permits. If not, you can let them marinate while you are prepping the vegetables and loosening the noodles by hand, no need to blanch.In a stir fry pan, add beef stock, brown sugar, 1 tablespoon of Thai red curry paste and cornflour. Stir until well combine and cook over high heat until the mixture thickens.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'id': 93605, u'name': u'thai red curry paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the sauce to a heat-proof measuring jug. Clean the stir fry pan. In the meantime, place a square grill pan on a stove and start heating it up over medium-high heat. To cook the noodles, add cooking oil to the stir fry pan. When the oil is hot, add onion and carrot.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute until slightly soften.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Add choy sum and continue to saute the vegetables are soften to your liking.While waiting for the vegetables to soften, place the marinated steaks onto the grill pan. Cook them on both sides to your liking and set them aside to rest before slicing into thin slices.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add noodles and saute until heat through.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add 3/4 cups of the sauce and stir to combine. Check for taste, add more soy sauce if required.To serve, transfer the noodles onto a bowl, top with sliced steak, lightly drizzle with the remaining sauce as well as add the garnishes.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are my top picks for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try Ghost Pines Napa County Sonoma County Merlot. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"Working without sourcing constraints, our winemakers selected Merlot clusters contributing layered flavors of dark berries, licorice and espresso alongside lots of richness, full-bodied structure, and desirable length. In addition to these flavors, you'll taste hints of cigar paper, cocoa, caramel and nutmeg wrapped around a remarkably smooth mid-palate full of velvety texture and depth. On the long finish, you'll find suggestions of toasty oak, mouth-filling black fruit, and cola framed by plush tannins.", u'title': u'Ghost Pines Napa County Sonoma County Merlot', u'price': u'$26.65', u'id': 428399, u'link': u'https://www.amazon.com/Ghost-Pines-County-Sonoma-Merlot/dp/B01A8WOVRW', u'imageUrl': u'https://spoonacular.com/productImages/428399-312x231.jpg'}]}, u'aggregateLikes': 155, u'instructions': u'Start by marinating the beef. On a plate, mix 1 tablespoon of Thai red curry paste, 1 \xbd tablespoon of cooking and some salt to taste. Coat the steaks with the mixture and allow them to marinate for 30 minutes if time permits. If not, you can let them marinate while you are prepping the vegetables and loosening the noodles by hand, no need to blanch.In a stir fry pan, add beef stock, brown sugar, 1 tablespoon of Thai red curry paste and cornflour. Stir until well combine and cook over high heat until the mixture thickens. Transfer the sauce to a heat-proof measuring jug. Clean the stir fry pan. In the meantime, place a square grill pan on a stove and start heating it up over medium-high heat. To cook the noodles, add cooking oil to the stir fry pan. When the oil is hot, add onion and carrot. Saute until slightly soften. Add choy sum and continue to saute the vegetables are soften to your liking.While waiting for the vegetables to soften, place the marinated steaks onto the grill pan. Cook them on both sides to your liking and set them aside to rest before slicing into thin slices.Add noodles and saute until heat through. Add 3/4 cups of the sauce and stir to combine. Check for taste, add more soy sauce if required.To serve, transfer the noodles onto a bowl, top with sliced steak, lightly drizzle with the remaining sauce as well as add the garnishes. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/-grilled-thai-red-curry-steak-noodles-stir-fry-494193', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}