{u'recipes': [{u'sourceName': u'Boulder Locavore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522203-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 522203, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gluten-Free Spring Lemon-Herb Popovers', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 43.21, u'creditText': u'Boulder Locavore', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon freshly ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 full stick of chilled unsalted butter (for greasing the pan; it will not all be used)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'chilled', u'(for greasing the pan; it will not all be used)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u''}, {u'originalString': u"\xbe cups King Arthur's Gluten-Free Flour blend*", u'aisle': u'Baking', u'name': u'cake flour blend', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'1 \xbd tablespoons fresh Chives, finely diced', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'fresh', u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh Dill, finely diced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [u'fresh', u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoon'}, {u'originalString': u'4 large Eggs, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd teaspoon Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon fresh Lemon Zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon fresh Sorrel, finely diced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'sorrel', u'metaInformation': [u'fresh', u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sorrel.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93621, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon fresh Thyme leaves, finely diced', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [u'fresh', u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Whole Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://boulderlocavore.com/2014/03/gluten-free-spring-lemon-herb-popovers-2.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a non-stick popover pan in the cold oven and preheat to 400 degrees.  While the oven is heating combine the flour, salt and pepper in a small mixing bowl and stir to combine.  Also combine the lemon zest and herbs in a separate small bowl and using a dining fork to stir the herbs together.When oven has almost reached 400 degrees, place room temperature eggs in a blender, pulse 1-2 seconds only to lightly blend.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Place the milk in a microwave-safe container and heat on high for 45 seconds.  Stir and heat 30 additional seconds on high (alternatively milk may be heated on the stove; it should be very warm to the touch but not simmering as it can cook the eggs).Turn blend on a very low speed and slowly pour in milk to combine it with the eggs.  Do not over blend.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the flour mixture to the eggs and milk in the blender.  Pulse only to combine; it will be a watery batter.  When the oven reaches 400 degrees, remove the new stick of unsalted butter from the refrigerator.  Peel back the wrapping to expose about 2 inches of the butter stick, leaving the wrapper on the opposite end so you may maintain a firm grasp of it when greasing the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the heated popover pan from the oven and place on a heat proof surface such as a cooling rack.  Grasping the butter by the wrapped end, swirl the stick around inside each popover mold a few times to coat the sides and bottom.  The butter will melt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Pour the fresh herbs into the blender and pulse just to mix up the batter and integrate the herbs.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour evenly into all of the six popover molds, filling them approximately \xbe full.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the plan in the oven.  DO NOT OPEN THE OVEN WHILE THE POPOVERS ARE COOKING!  This will cause them to deflate.Cook the popovers at 400 degrees for 20 minutes.  Reduce the heat to 375 for an additional 15-20 minutes.  Popovers should be expanded over the top of the molds, dark brown and firm when removing from the oven.  The longer the popovers cook, the more they hold their form when removed from the oven.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from oven.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the popovers from the pan onto a cooling rack.  Stick a sharp knife in the side of each popover, making a small slit (1/2 inch) to allow steam to escape.  Ensure the slit side of the popover is facing upwards.  Allow the popovers to cool to the touch and serve warm.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 3545, u'instructions': u'Place a non-stick popover pan in the cold oven and preheat to 400 degrees.  While the oven is heating combine the flour, salt and pepper in a small mixing bowl and stir to combine.  Also combine the lemon zest and herbs in a separate small bowl and using a dining fork to stir the herbs together.When oven has almost reached 400 degrees, place room temperature eggs in a blender, pulse 1-2 seconds only to lightly blend.Place the milk in a microwave-safe container and heat on high for 45 seconds.  Stir and heat 30 additional seconds on high (alternatively milk may be heated on the stove; it should be very warm to the touch but not simmering as it can cook the eggs).Turn blend on a very low speed and slowly pour in milk to combine it with the eggs.  Do not over blend.Add the flour mixture to the eggs and milk in the blender.  Pulse only to combine; it will be a watery batter.  When the oven reaches 400 degrees, remove the new stick of unsalted butter from the refrigerator.  Peel back the wrapping to expose about 2 inches of the butter stick, leaving the wrapper on the opposite end so you may maintain a firm grasp of it when greasing the pan.Remove the heated popover pan from the oven and place on a heat proof surface such as a cooling rack.  Grasping the butter by the wrapped end, swirl the stick around inside each popover mold a few times to coat the sides and bottom.  The butter will melt.Pour the fresh herbs into the blender and pulse just to mix up the batter and integrate the herbs.  Pour evenly into all of the six popover molds, filling them approximately \xbe full.Place the plan in the oven.  DO NOT OPEN THE OVEN WHILE THE POPOVERS ARE COOKING!  This will cause them to deflate.Cook the popovers at 400 degrees for 20 minutes.  Reduce the heat to 375 for an additional 15-20 minutes.  Popovers should be expanded over the top of the molds, dark brown and firm when removing from the oven.  The longer the popovers cook, the more they hold their form when removed from the oven.Remove pan from oven.  Remove the popovers from the pan onto a cooling rack.  Stick a sharp knife in the side of each popover, making a small slit (1/2 inch) to allow steam to escape.  Ensure the slit side of the popover is facing upwards.  Allow the popovers to cool to the touch and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-spring-lemon-herb-popovers-522203', u'dishTypes': [u'side dish'], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}