{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/831433-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 831433, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Studio, a Bertazzoni stove and Grandma’s lasagne', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 139.91, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'150 g of all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'Breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 18079, u'unit': u'servings'}, {u'originalString': u'Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'50 g of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'150 g of durum wheat semolina flour', u'aisle': u'Baking', u'name': u'durum wheat flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 20076, u'unit': u'g'}, {u'originalString': u'3 medium eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon of extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'60 g of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'400 g of fresh mozzarella', u'aisle': u'Cheese', u'name': u'fresh mozzarella', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 1026, u'unit': u'g'}, {u'originalString': u'1 l of milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'l'}, {u'originalString': u'Grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'80 g of grated Parmigiano Reggiano', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 80.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'1 pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://en.julskitchen.com/first-course/fresh-pasta/grandmas-lasagne', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Sift the flour with the semolina flour, pour them on a wooden board and make a well in the middle.Break in the eggs and add a good pinch of salt and a tablespoon of olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix the flour and the eggs with a fork until crumbly, then knead the dough, adding cold water if needed.After a while the dough should have the right consistency: smooth, velvety and no longer sticky.Wrap it in plastic film and let it stand for 30 minutes at room temperature.Melt the butter in a saucepan. When melted, spoon in the flour and whisk for a few minutes until golden and toasted.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour in the cold milk in a thin stream, stirring constantly to avoid lumps.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let cook the bchamel sauce for a few minutes until thickened and season with a good pinch of salt and grated nutmeg.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out the dough into paper thin sheets of pasta. Leave the pasta sheets on a tablecloth dusted with semolina flour and prepare all the ingredients for the lasagne.Spoon some of the meat sauce on the bottom of a large tray, then line it with enough sheet of pasta to cover it. Spoon the bchamel and spread it evenly over the pasta, then spoon the meat sauce and spread it. Sprinkle with grated Parmigiano Reggiano. Tear the mozzarella into bite sized morsels and scatter it onto the lasagne. Cover the mozzarella with sheets of pasta, and repeat for seven layers.Finish with bchamel sauce, meat sauce, mozzarella, a good dusting of Parmigiano Reggiano and breadcrumbs, for a nice and golden crust.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmigiano reggiano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [], u'step': u'Add a few slivers of butter and bake for about 30 minutes, or until golden brown and bubbling.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve immediately, or, better, let it rest and reheat before serving.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Montepulciano, Sangiovese, and Chianti are my top picks for Lasagne. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'Dark chocolate and raspberries, harmonious, great palate authority', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Sift the flour with the semolina flour, pour them on a wooden board and make a well in the middle.Break in the eggs and add a good pinch of salt and a tablespoon of olive oil.Mix the flour and the eggs with a fork until crumbly, then knead the dough, adding cold water if needed.After a while the dough should have the right consistency: smooth, velvety and no longer sticky.Wrap it in plastic film and let it stand for 30 minutes at room temperature.Melt the butter in a saucepan. When melted, spoon in the flour and whisk for a few minutes until golden and toasted.Pour in the cold milk in a thin stream, stirring constantly to avoid lumps.Let cook the bchamel sauce for a few minutes until thickened and season with a good pinch of salt and grated nutmeg.Heat oven to 200C.Roll out the dough into paper thin sheets of pasta. Leave the pasta sheets on a tablecloth dusted with semolina flour and prepare all the ingredients for the lasagne.Spoon some of the meat sauce on the bottom of a large tray, then line it with enough sheet of pasta to cover it. Spoon the bchamel and spread it evenly over the pasta, then spoon the meat sauce and spread it. Sprinkle with grated Parmigiano Reggiano. Tear the mozzarella into bite sized morsels and scatter it onto the lasagne. Cover the mozzarella with sheets of pasta, and repeat for seven layers.Finish with bchamel sauce, meat sauce, mozzarella, a good dusting of Parmigiano Reggiano and breadcrumbs, for a nice and golden crust. Add a few slivers of butter and bake for about 30 minutes, or until golden brown and bubbling.Serve immediately, or, better, let it rest and reheat before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-studio-a-bertazzoni-stove-and-grandmas-lasagne-831433', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}