{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/213604-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 213604, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican chicken tortillas', u'diets': [], u'pricePerServing': 366.63, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 large ripe avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'ripe', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'250g cooked chicken, chopped', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cooked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'g'}, {u'originalString': u'6 soft flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'handful chopped coriander', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'2 tsp lime or lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'175g Red Leicester cheese, grated', u'aisle': u'Cheese', u'name': u'red leicester cheese', u'metaInformation': [u'red', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/manchego.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 93667, u'unit': u'g'}, {u'originalString': u'4 tbsp soured cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soured cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tbsp'}, {u'originalString': u'2 medium tomatoes, sliced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 58.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1447/mexican-chicken-tortillas', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 40, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a non-stickfrying pan over amedium heat, swirl1 tsp of the oilaround, then add atortilla. Sprinkle ahandful of the cheeseover one half of thetortilla, followed bysome chicken and afew tomato slices.Season with a littlesalt and pepper. Cookfor a few moments tomelt the cheese, then fold over and cook until thetortilla is crisp.Turn the tortilla out of the panand cut into quarters. Repeat', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-tomato.jpg', u'id': 10511529, u'name': u'tomato slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'with another flour tortilla tomake another child’s portion.For the adults’ version,start by making a simpleguacamole. Halve, stone, peeland slice the avocado, thenmash it with the lime or lemonjuice and a little seasoning.Make the tortillas as before,adding a little choppedcoriander.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'id': 10218364, u'name': u'flour tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Serve two each andcut into halves rather thanquarters.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with theguacamole and souredcream, scattered with a littlemore coriander.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 40, u'instructions': u'Heat a non-stickfrying pan over amedium heat, swirl1 tsp of the oilaround, then add atortilla. Sprinkle ahandful of the cheeseover one half of thetortilla, followed bysome chicken and afew tomato slices.Season with a littlesalt and pepper. Cookfor a few moments tomelt the cheese, then fold over and cook until thetortilla is crisp.Turn the tortilla out of the panand cut into quarters. Repeat                                                             with another flour tortilla tomake another child’s portion.For the adults’ version,start by making a simpleguacamole. Halve, stone, peeland slice the avocado, thenmash it with the lime or lemonjuice and a little seasoning.Make the tortillas as before,adding a little choppedcoriander. Serve two each andcut into halves rather thanquarters. Serve with theguacamole and souredcream, scattered with a littlemore coriander.', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-chicken-tortillas-213604', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}