{u'recipes': [{u'sourceName': u'Give Recipe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/581922-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 581922, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stuffed Dried Eggplants And Peppers', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 568.04, u'creditText': u'Give Recipe', u'extendedIngredients': [{u'originalString': u'20 tbsp rice or bulgur (1 for each pepper and eggplant)', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'bulgur', u'metaInformation': [u'for each pepper and eggplant)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 20.0, u'consistency': u'solid', u'id': 20012, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp dried mint', u'aisle': u'Spices and Seasonings', u'name': u'dried mint', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2066, u'unit': u'tbsp'}, {u'originalString': u'10 dried eggplants', u'aisle': u'Produce', u'name': u'eggplants', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'4 cloves garlic, diced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbd lemon, squeezed', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'\xbd cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 large onions, thinly chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd bunch of parsley, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'10 dried red bell peppers', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 tbsp pepper (or tomato) paste', u'aisle': u'Ethnic Foods', u'name': u'red pepper paste', u'metaInformation': [u'(or tomato)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016973, u'unit': u'tbsp'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 tomatoes, diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'\xbd cup hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 liter water to boil dried vegetables', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'liter'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.giverecipe.com/stuffed-dried-eggplants-and-peppers.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Boil 1 liter water in a pot and put dried eggplants and dried peppers into it. Boil them about 3 or 5 minutes until they soften. Take them into cold water and drain.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Mix all stuffing ingredients and stuff eggplants and peppers with this mixture. Use your hands at this step. Do not ovefill them as rice and bulgur will rise. Just leave about half inch space on the top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'id': 20012, u'name': u'bulgur'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place them in a pot and if there is any juice left from the filling mixture, pour it in this pot. Cover the pot and cook it over high heat for about 5 minutes, then add \xbd cup hot water and bring it to the lowest heat. It will be done after about 30 minutes. You can understand it by checking the softness of rice and bulgur.This can be served both warm and cold. And it’s the icing on the cake if you drizzle some yogurt on these stuffed dried eggplants and peppers.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'id': 20012, u'name': u'bulgur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 19, u'instructions': u'Boil 1 liter water in a pot and put dried eggplants and dried peppers into it. Boil them about 3 or 5 minutes until they soften. Take them into cold water and drain.Mix all stuffing ingredients and stuff eggplants and peppers with this mixture. Use your hands at this step. Do not ovefill them as rice and bulgur will rise. Just leave about half inch space on the top.Place them in a pot and if there is any juice left from the filling mixture, pour it in this pot. Cover the pot and cook it over high heat for about 5 minutes, then add \xbd cup hot water and bring it to the lowest heat. It will be done after about 30 minutes. You can understand it by checking the softness of rice and bulgur.This can be served both warm and cold. And it’s the icing on the cake if you drizzle some yogurt on these stuffed dried eggplants and peppers.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-dried-eggplants-and-peppers-581922', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}