{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519114-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 519114, u'veryPopular': True, u'lowFodmap': False, u'title': u'Meatball Hash Brown Bake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 234.57, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'1 can (10 3/4 oz) condensed cream of chicken soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of chicken soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6016, u'unit': u'oz'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6-8 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 lb ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1 package (30 oz) frozen shredded hash brown potatoes, divided', u'aisle': u'Frozen', u'name': u'hash brown potatoes', u'metaInformation': [u'shredded', u'frozen', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 11390, u'unit': u'oz'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 1/2 tsp pepper, divided', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 tsp salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3/4 c. crushed saltine crackers (about 20 crackers)', u'aisle': u'Savory Snacks', u'name': u'saltine crackers', u'metaInformation': [u'crushed', u'( 20 crackers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 18228, u'unit': u'c'}, {u'originalString': u'1 c. shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'c'}, {u'originalString': u'1 c. sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'c'}], u'healthScore': 9.0, u'imageType': u'png', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/2011/10/meatball-hash-brown-bake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, lightly beat eggs. Stir in cracker crumbs, garlic, 1 tsp salt and 1/2 tsp pepper.Crumble beef over mixture; mix well. Shape into 1 in meatballs. In a covered skillet over low heat, cook the meatballs in a small amount of water until brown; drain.In a bowl, combine the soup, sour cream, cheese, onion and remaining salt and pepper. With paper towels, pat hash browns dry. Stir into the soup mixture.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'id': 11390, u'name': u'hash browns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to a greased 13 x 9 in baking dish. Arrange meatballs over top pressing lightly into mixture. Cover and bake at 350 degrees for 45 minutes. Uncover; bake 15 minutes longer or until meat is no longer pink and potatoes are tender.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2150, u'instructions': u'In a bowl, lightly beat eggs. Stir in cracker crumbs, garlic, 1 tsp salt and 1/2 tsp pepper.Crumble beef over mixture; mix well. Shape into 1 in meatballs. In a covered skillet over low heat, cook the meatballs in a small amount of water until brown; drain.In a bowl, combine the soup, sour cream, cheese, onion and remaining salt and pepper. With paper towels, pat hash browns dry. Stir into the soup mixture. Transfer to a greased 13 x 9 in baking dish. Arrange meatballs over top pressing lightly into mixture. Cover and bake at 350 degrees for 45 minutes. Uncover; bake 15 minutes longer or until meat is no longer pink and potatoes are tender.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatball-hash-brown-bake-519114', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}