{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536725-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 536725, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tofu Mac and Cheese', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 204.67, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1/3 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 pound macaroni', u'aisle': u'Pasta and Rice', u'name': u'macaroni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20499, u'unit': u'pound'}, {u'originalString': u'2/3-1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8 ounces sharp cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'ounces'}, {u'originalString': u'1 pound tofu (silken is best)', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'(silken is best)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16162, u'unit': u'pound'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.macheesmo.com/2012/04/tofu-mac-and-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u"Add tofu to a food processor and pulse until it's in a grainy texture.2)", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u"Pour in yogurt, milk, and cheddar cheese and process until it's smooth. If it looks a little grainy it's okay, but if it's very grainy than add in a bit more milk.3) Cook macaroni according to package.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Drain.4)', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add butter to pot along with macaroni and stir over low heat until butter is melted. 5) Stir in all the cheese sauce and stir until heated and melted, about 5 minutes.6) In a large skillet add butter over medium heat with the bread crumbs and red pepper flakes. Cook until crumbs are lightly browned.7) Season macaroni with salt and pepper.8)', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}]}, {u'equipment': [], u'step': u'Serve immediately topped with seasoned bread crumbs!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese can be paired with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. One wine you could try is Pine Ridge Chenin Blanc - Viognier. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'The 2014 release of this intriguing blend delights the nose with a charming bouquet of enticing aromas of fresh Meyer lemon, fuzzy peach, ripe honeydew melon and yellow plum, mingled with touches of citrus blossom and white tea. The clean, vibrant palate enters with juicy pomelo, sweet lychee and honeyedtangerine fruits, balanced by vibrant acidity and hints of yellow apple and key lime pie that last through the crisp and refreshing finish.With its balanced acidity, this versatile wine pairs well with a number of dishes, from light salads to seafood to, most notably, foods with a hint of spiciness - its subtle sweetness provides balance alongside a touch of heat. Try Chenin Blanc + Viognier with a flavorful Thai curry, a sushi dish, such asa spicy tuna roll, or seared halibut. Blend: 80% Chenin Blanc, 20% Viognier', u'title': u'Pine Ridge Chenin Blanc - Viognier', u'price': u'$12.99', u'id': 438881, u'link': u'https://www.wine.com/product/pine-ridge-chenin-blanc-viognier-2014/142668', u'imageUrl': u'https://spoonacular.com/productImages/438881-312x231.jpg'}]}, u'aggregateLikes': 132, u'instructions': u"Directions1) Add tofu to a food processor and pulse until it's in a grainy texture.2) Pour in yogurt, milk, and cheddar cheese and process until it's smooth. If it looks a little grainy it's okay, but if it's very grainy than add in a bit more milk.3) Cook macaroni according to package. Drain.4) Add butter to pot along with macaroni and stir over low heat until butter is melted. 5) Stir in all the cheese sauce and stir until heated and melted, about 5 minutes.6) In a large skillet add butter over medium heat with the bread crumbs and red pepper flakes. Cook until crumbs are lightly browned.7) Season macaroni with salt and pepper.8) Serve immediately topped with seasoned bread crumbs!", u'spoonacularSourceUrl': u'https://spoonacular.com/tofu-mac-and-cheese-536725', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}