{u'recipes': [{u'sourceName': u'Delish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/765735-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 195, u'id': 765735, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Aloha Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 251.78, u'creditText': u'Delish', u'extendedIngredients': [{u'originalString': u'1/2 c. brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'c'}, {u'originalString': u'1 tsp. canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp. freshly grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'3/4 c. ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 11935, u'unit': u'c'}, {u'originalString': u'1/2 c. low-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 16424, u'unit': u'c'}, {u'originalString': u'1 pineapple, sliced into rings and halved', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'halved', u'sliced into rings and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'1 c. unsweetened pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9273, u'unit': u'c'}, {u'originalString': u'Scallions, for garnish', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'1 lb. boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.delish.com/cooking/recipe-ideas/recipes/a47354/grilled-aloha-chicken-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make Marinade: In a large bowl, combinepineapple juice, ketchup, soy sauce, brown sugar, garlic, and ginger and whiskuntil combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add chicken to a large Ziploc bag or baking dishand pour over marinade.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Let marinate in the refrigerator at least 3 hours andup to overnight.When ready to grill, heat grill to high. Oilgrates and add chicken. Baste with marinade and grill until charred, 8 minutesper side.Toss pineapple with oil and grill until charred,2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve chicken with pineapple garnish withscallions.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Make Marinade: In a large bowl, combinepineapple juice, ketchup, soy sauce, brown sugar, garlic, and ginger and whiskuntil combined.Add chicken to a large Ziploc bag or baking dishand pour over marinade. Let marinate in the refrigerator at least 3 hours andup to overnight.When ready to grill, heat grill to high. Oilgrates and add chicken. Baste with marinade and grill until charred, 8 minutesper side.Toss pineapple with oil and grill until charred,2 minutes.Serve chicken with pineapple garnish withscallions.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-aloha-chicken-765735', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 205, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}