{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/445629-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 445629, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Dinner Soup', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 149.34, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (28 ounces) Italian crushed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'italian', u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounces'}, {u'originalString': u'1 small carrot, thinly sliced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 celery rib, thinly sliced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'1 can (14-1/2 ounces) reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'reduced-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounces'}, {u'originalString': u'1 cup uncooked elbow macaroni', u'aisle': u'Pasta and Rice', u'name': u'elbow macaroni', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10120499, u'unit': u'cup'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 medium green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 teaspoon Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 tablespoons grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'7 tablespoons shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 1028, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 medium sweet red pepper, chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'sweet', u'red', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound boneless skinless chicken breasts, cubed', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/italian-dinner-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a nonstick Dutch oven coated with cooking spray, cook the chicken over medium heat until no longer pink.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and keep warm.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add peppers, onion, celery and carrot to pan; cook and stir until crisp-tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic; cook 1 minute longer.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the chicken, water, tomatoes, broth, Parmesan cheese and seasonings. Bring to a boil. Reduce heat; simmer, uncovered, for 40 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Stir in macaroni; cook 20 minutes longer or until macaroni is tender. Sprinkle each serving with mozzarella cheese.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Santa Margherita Chianti Classico Riserva with a 4.2 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The aromas of this complex red wine range from cherries and plums to gladiolus flowers and earthy flint. The tannic, oak-aged flavors are bright and round, with a dry, warm, earthy finish. Recommended for barbecued meat, like sliced Chianina steak, or with game, such as pheasant stuffed with truffles. It is also excellent with mature cheese.', u'title': u'Santa Margherita Chianti Classico Riserva', u'price': u'$26.99', u'id': 436659, u'link': u'https://www.wine.com/product/santa-margherita-chianti-classico-riserva-2013/167314', u'imageUrl': u'https://spoonacular.com/productImages/436659-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Directions                                                                                In a nonstick Dutch oven coated with cooking spray, cook the chicken over medium heat until no longer pink. Remove and keep warm.                                                                                           Add peppers, onion, celery and carrot to pan; cook and stir until crisp-tender. Add the garlic; cook 1 minute longer. Add the chicken, water, tomatoes, broth, Parmesan cheese and seasonings. Bring to a boil. Reduce heat; simmer, uncovered, for 40 minutes.                                                                                            Stir in macaroni; cook 20 minutes longer or until macaroni is tender. Sprinkle each serving with mozzarella cheese.                                        Yield: 7 servings (about 2-1/2 quarts).                                                                                                                         Originally published as Italian Dinner Soup in  Light & TastyFebruary/March 2008, p47                                                                                                                                                                                                        Nutritional Facts                                                                             1-1/2 cups equals 203 calories, 4 g fat (2 g saturated fat), 42 mg cholesterol, 707 mg sodium, 22 g carbohydrate, 3 g fiber, 20 g protein. Diabetic Exchanges: 2 lean meat, 1-1/2 starch.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-dinner-soup-445629', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 7, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}