{u'recipes': [{u'sourceName': u'101 Cooking for Two', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/574239-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 140, u'id': 574239, u'veryPopular': True, u'lowFodmap': False, u'title': u'Uncooked Macaroni Crock Pot Mac and Cheese', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 58.36, u'creditText': u'101 Cooking for Two', u'extendedIngredients': [{u'originalString': u'\xbc t black pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 10211821, u'unit': u't'}, {u'originalString': u'1 T butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'T'}, {u'originalString': u'\xbd t dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002024, u'unit': u't'}, {u'originalString': u'\xbc t garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u't'}, {u'originalString': u'1 cup Standard Macaroni', u'aisle': u'Pasta and Rice', u'name': u'macaroni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20499, u'unit': u'cup'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'\xbc t paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u't'}, {u'originalString': u'\xbd t salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u't'}, {u'originalString': u'1 cup Cheese. I used sharp cheddar', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.101cookingfortwo.com/2013/01/easiest-and-greatest-crock-pot-creamy.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Dump 2 cups milk, 1 cup standard (not whole wheat or other non-standard) macaroni, \xbd t dry mustard, \xbd t salt, \xbc t each of pepper, garlic powder and paprika, and l T butter into a smallish slow cooker. I used a 3.5 qt one.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Mix well.Cook on low. Stir well at 1 hour into the cooking. Cook another hour or so until pasta is al dente. Slow cookers vary some your time may vary some. DO NOT COOK BY TIME ONLY HERE.When the pasta is al dente, drain any free fluid, add 1 cup of shredded cheese. I used sharp cheddar this time.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}]}, {u'equipment': [], u'step': u'Mix very well.Continue on low until cooked to your taste. About 5-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Lambrusco, and Riesling are my top picks for Macaroni and Cheese. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. You could try Essay Chenin Blanc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 9 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 14165, u'instructions': u'Dump 2 cups milk, 1 cup standard (not whole wheat or other non-standard) macaroni, \xbd t dry mustard, \xbd t salt, \xbc t each of pepper, garlic powder and paprika, and l T butter into a smallish slow cooker. I used a 3.5 qt one. Mix well.Cook on low. Stir well at 1 hour into the cooking. Cook another hour or so until pasta is al dente. Slow cookers vary some your time may vary some. DO NOT COOK BY TIME ONLY HERE.When the pasta is al dente, drain any free fluid, add 1 cup of shredded cheese. I used sharp cheddar this time. Mix very well.Continue on low until cooked to your taste. About 5-15 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/uncooked-macaroni-crock-pot-mac-and-cheese-574239', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 145, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}