{u'recipes': [{u'sourceName': u'A Farm Girls Dabbles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497733-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497733, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caramel Custard Pots with Salted Caramel Sauce', u'diets': [], u'pricePerServing': 116.66, u'creditText': u'A Farm Girls Dabbles', u'extendedIngredients': [{u'originalString': u'crushed chocolate cookie wafers', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafers', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10118157, u'unit': u'servings'}, {u'originalString': u'2 T. light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19350, u'unit': u'T'}, {u'originalString': u'5 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 c. heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'c'}, {u'originalString': u'1/4 tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'lightly sweetened whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'lightly sweetened whipped cream', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 93814, u'unit': u'servings'}, {u'originalString': u'3/4 c. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'4 T. chilled unsalted butter, cut into 1/2" cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'chilled', u'cut into 1/2" cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'T'}, {u'originalString': u'1/2 vanilla bean, split lengthwise', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'2 T. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'T'}, {u'originalString': u'1 c. whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.afarmgirlsdabbles.com/2012/04/04/caramel-custard-pots-with-salted-caramel-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Center a rack in the oven. Preheat oven to 300\xb0. Line a large roasting pan (with sides that are at least 2'' tall) with a double layer of paper towels. Then place eight wide mouth half-pint mason jars on top of the paper towels. Fill a tea kettle with water and put it on to boil. When the water boils, turn off the heat.Stir the cream and milk together and warm them in the microwave or in a saucepan over medium heat. Set aside.Measure out 1/4 cup of the sugar and set it aside.Put a large heavy-bottomed saucepan (I used a nonstick pan) over medium-high heat and sprinkle in 2 tablespoons of the remaining sugar. As soon as the sugar melts and starts to caramelize, stir it. When the color is uniform, stir in another 2 tablespoons of sugar and continue to stir until it is melted and colored. Continue with the remaining 1/4 cup sugar, adding it 2 tablespoons at a time. When all the sugar is deep amber, almost mahogany colored, stand away from the pan so you don't get splattered, and stir in the warm liquid. The mixture will bubble furiously and probably seize up, but don't panic. Just keep stirring patiently and it will smooth out. Pull the pan from the heat.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Put the eggs, yolks, and reserved 1/4 cup sugar in a large glass measuring cup or a small bowl and whisk until pale and slightly thickened. Still whisking, drizzle in a little of the warm caramel liquid. This will gently warm the eggs so they won't curdle.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisking constantly, slowly pour in the remaining liquid. If there is foam at the top of the custard, skim it off with a spoon. If you leave the foam, it will form little craters on top of the baked custards. It's not a crime, but the custards are definitely prettier without the little foam craters. Divide the custard evenly between the mason jars.", u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour enough hot water from the tea kettle into the roasting pan to come halfway up the sides of the mason jars. Cover the pan snugly with foil, poke two holes in two opposite corners and very carefully and steadily slide the pan into the oven.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the custards for 45 to 50 minutes, or until the tops darken a bit and the custards jiggle a little only in the center when tapped or lightly shaken. Very carefully remove the roasting pan from the oven and place it on a cooling rack. Allow the custards to rest in their warm bath for 10 minutes, then peel off the foil and transfer the mason jars from the hot water (careful!!) to the cooling rack. Refrigerate when they reach room temperature. When the custards are cool, cover them tightly with their mason jar lids.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place cream in a small pitcher. Scrape in seeds from vanilla bean and then also add the bean. Set aside. Stir sugar, corn syrup, and water in a heavy saucepan over medium heat until sugar dissolves. Increase heat to medium-high and bring to a boil, occasionally swirling pan and brushing down sides with a wet pastry brush. It will thicken and turn deeper in color. After about 5 to 6 minutes, it should be deep amber in color. Don't let it get too dark. If it starts to smell a bit burnt, immediately remove pan from heat. Gradually add vanilla cream. The mixture will bubble vigorously.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk over medium heat until smooth and thick, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and whisk in butter and salt. Strain into a heatproof bowl.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let cool slightly. I prefer to eat the caramel custard pots chilled. Spoon some of the salted caramel sauce over each custard and top with some lightly sweetened whipped cream and crushed cookie wafers. It is best to prepare this dessert the day before you want to eat them. The custards should chill for a few hours or overnight to set properly. Just prepare the custards, caramel sauce, and cookie crumbles the day prior. And make the sweetened whipped cream on the day you want to serve. The pots can be completely assembled a few hours before serving.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 93814, u'name': u'lightly sweetened whipped cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Custard. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1741, u'instructions': u"Center a rack in the oven. Preheat oven to 300\xb0. Line a large roasting pan (with sides that are at least 2'' tall) with a double layer of paper towels. Then place eight wide mouth half-pint mason jars on top of the paper towels. Fill a tea kettle with water and put it on to boil. When the water boils, turn off the heat.Stir the cream and milk together and warm them in the microwave or in a saucepan over medium heat. Set aside.Measure out 1/4 cup of the sugar and set it aside.Put a large heavy-bottomed saucepan (I used a nonstick pan) over medium-high heat and sprinkle in 2 tablespoons of the remaining sugar. As soon as the sugar melts and starts to caramelize, stir it. When the color is uniform, stir in another 2 tablespoons of sugar and continue to stir until it is melted and colored. Continue with the remaining 1/4 cup sugar, adding it 2 tablespoons at a time. When all the sugar is deep amber, almost mahogany colored, stand away from the pan so you don't get splattered, and stir in the warm liquid. The mixture will bubble furiously and probably seize up, but don't panic. Just keep stirring patiently and it will smooth out. Pull the pan from the heat.Put the eggs, yolks, and reserved 1/4 cup sugar in a large glass measuring cup or a small bowl and whisk until pale and slightly thickened. Still whisking, drizzle in a little of the warm caramel liquid. This will gently warm the eggs so they won't curdle. Whisking constantly, slowly pour in the remaining liquid. If there is foam at the top of the custard, skim it off with a spoon. If you leave the foam, it will form little craters on top of the baked custards. It's not a crime, but the custards are definitely prettier without the little foam craters. Divide the custard evenly between the mason jars. Pour enough hot water from the tea kettle into the roasting pan to come halfway up the sides of the mason jars. Cover the pan snugly with foil, poke two holes in two opposite corners and very carefully and steadily slide the pan into the oven. Bake the custards for 45 to 50 minutes, or until the tops darken a bit and the custards jiggle a little only in the center when tapped or lightly shaken. Very carefully remove the roasting pan from the oven and place it on a cooling rack. Allow the custards to rest in their warm bath for 10 minutes, then peel off the foil and transfer the mason jars from the hot water (careful!!) to the cooling rack. Refrigerate when they reach room temperature. When the custards are cool, cover them tightly with their mason jar lids. Place cream in a small pitcher. Scrape in seeds from vanilla bean and then also add the bean. Set aside. Stir sugar, corn syrup, and water in a heavy saucepan over medium heat until sugar dissolves. Increase heat to medium-high and bring to a boil, occasionally swirling pan and brushing down sides with a wet pastry brush. It will thicken and turn deeper in color. After about 5 to 6 minutes, it should be deep amber in color. Don't let it get too dark. If it starts to smell a bit burnt, immediately remove pan from heat. Gradually add vanilla cream. The mixture will bubble vigorously. Whisk over medium heat until smooth and thick, about 2 minutes. Remove from heat and whisk in butter and salt. Strain into a heatproof bowl. Let cool slightly. I prefer to eat the caramel custard pots chilled. Spoon some of the salted caramel sauce over each custard and top with some lightly sweetened whipped cream and crushed cookie wafers. It is best to prepare this dessert the day before you want to eat them. The custards should chill for a few hours or overnight to set properly. Just prepare the custards, caramel sauce, and cookie crumbles the day prior. And make the sweetened whipped cream on the day you want to serve. The pots can be completely assembled a few hours before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-custard-pots-with-salted-caramel-sauce-497733', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}