{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/513976-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 513976, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skillet Chicken Marsala: A classic Italian made easy', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 312.01, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'12 oz. fettuccine (or your choice of pasta)', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [u'(or your choice of pasta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'oz'}, {u'originalString': u'\xbc c. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'\xbc tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. lemon pepper', u'aisle': u'Spices and Seasonings', u'name': u'lemon pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012030, u'unit': u'tsp'}, {u'originalString': u'1 c. dry Marsala wine', u'aisle': u'Alcoholic Beverages', u'name': u'marsala wine', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14057, u'unit': u'c'}, {u'originalString': u'10 oz. sliced mushrooms (I used Crimini)', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced', u'(I used Crimini)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'2 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 lb. boneless, skinless chicken breasts, cut into large bite-sized pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'large', u'cut into  bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://wearychef.com/2013/05/18/skillet-chicken-marsala/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring large pot of salted water to a boil. Cook pasta according to package directions, drain, and set aside.Meanwhile, combine flour, salt, lemon pepper, and garlic powder in a medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'id': 1012030, u'name': u'lemon pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add diced chicken and toss to coat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a large skillet or dutch oven over medium-high heat. When oil is very hot, add chicken with the excess flour. Stir and cook for about 2 minutes until chicken is well coated with oil.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add mushrooms, and continue to stir fry for 3-4 minutes, until chicken is mostly cooked on the outside.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in wine about a couple tablespoons at a time, stirring constantly and scraping the bottom of the pan. Continue until all wine has been added, reduce heat to medium, and simmer for 5-6 minutes, until chicken is cooked through. Stir in chicken broth and return to a simmer.Turn off heat, add cooked pasta, and toss to coat pasta with sauce. Enjoy!', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Marsalan on the menu? Try pairing with Chardonnay, Merlot, and Pinot Noir. Chicken in a creamy sauce can pair beautifully with a chardonnay. With the earthy mushrooms and darker sauce, chicken marsala can definitely hold up to a red wine like merlot or pinot noir. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'merlot', u'pinot noir'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Bring large pot of salted water to a boil. Cook pasta according to package directions, drain, and set aside.Meanwhile, combine flour, salt, lemon pepper, and garlic powder in a medium bowl. Add diced chicken and toss to coat.Heat olive oil in a large skillet or dutch oven over medium-high heat. When oil is very hot, add chicken with the excess flour. Stir and cook for about 2 minutes until chicken is well coated with oil. Add mushrooms, and continue to stir fry for 3-4 minutes, until chicken is mostly cooked on the outside.Pour in wine about a couple tablespoons at a time, stirring constantly and scraping the bottom of the pan. Continue until all wine has been added, reduce heat to medium, and simmer for 5-6 minutes, until chicken is cooked through. Stir in chicken broth and return to a simmer.Turn off heat, add cooked pasta, and toss to coat pasta with sauce. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-chicken-marsala-a-classic-italian-made-easy-513976', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}