{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/433747-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 433747, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sicilian Meat Roll', u'diets': [u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 166.0, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3/4 cup soft bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'8 thin slices fully cooked ham', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'fully cooked', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 7214, u'unit': u'slices'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 pounds ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'3/4 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'3 thin slices part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'solid', u'id': 1028, u'unit': u'slices'}, {u'originalString': u'1-1/2 cups (6 ounces) shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1028, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup tomato juice', u'aisle': u'Beverages', u'name': u'tomato juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11886, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/sicilian-meat-roll', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the bread crumbs, eggs, tomato juice, parsley, garlic, oregano, salt and pepper. Crumble beef over the mixture and mix well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'id': 11886, u'name': u'tomato juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'On a pieces of heavy-duty foil, pat meat mixture into a 12-in. x 10-in. rectangle.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the ham and shredded cheese on loaf to within 1/2 in. of edges.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Roll up, jelly-roll style, beginning with the short end and peeling foil away while rolling.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place on a greased baking pan with seam side down; seal ends.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake, uncovered, at 350\xb0 for 1 hour and 10 minutes or until meat is no longer pink and a meat thermometer reaches 160\xb0. Top with sliced cheese; bake 5 minutes longer or until cheese is melted.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 165, u'instructions': u'Directions                                                                                In a large bowl, combine the bread crumbs, eggs, tomato juice, parsley, garlic, oregano, salt and pepper. Crumble beef over the mixture and mix well.                                                                                            On a pieces of heavy-duty foil, pat meat mixture into a 12-in. x 10-in. rectangle. Place the ham and shredded cheese on loaf to within 1/2 in. of edges. Roll up, jelly-roll style, beginning with the short end and peeling foil away while rolling.                                                                                            Place on a greased baking pan with seam side down; seal ends. Bake, uncovered, at 350\xb0 for 1 hour and 10 minutes or until meat is no longer pink and a meat thermometer reaches 160\xb0. Top with sliced cheese; bake 5 minutes longer or until cheese is melted.                                        Yield: 8 servings.                                                                                                                         Originally published as Sicilian Meat Roll in  ReminisceJanuary/February 1998, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 375 calories, 23 g fat (11 g saturated fat), 163 mg cholesterol, 580 mg sodium, 5 g carbohydrate, trace fiber, 36 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/sicilian-meat-roll-433747', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}