{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/277930-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 277930, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pulled Pork & Red Onion Melt', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 40.83, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'2 Tbsp. KRAFT Original Barbecue Sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'Tbsp'}, {u'originalString': u'8 slices Italian bread (1/2 inch thick)', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'italian', u'(1/)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slices'}, {u'originalString': u'4 KRAFT Singles', u'aisle': u'Cheese', u'name': u'kraft singles', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1190, u'unit': u''}, {u'originalString': u'1/4 cup thinly sliced red onions', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'1/2 cup shredded cooked pork', u'aisle': u'Refrigerated', u'name': u'shredded pork', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10073, u'unit': u'cup'}, {u'originalString': u'2 Tbsp. unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/pulled-pork-red-onion-139114.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine meat and barbecue sauce.  Fill bread slices with meat mixture, Singles and onions to make 4 sandwiches.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Spread outsides of sandwiches with butter.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook in skillet on medium heat 4 min. on each side or until sandwiches are golden brown on both sides.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 7, u'instructions': u'Combine meat and barbecue sauce.  Fill bread slices with meat mixture, Singles and onions to make 4 sandwiches.                                             Spread outsides of sandwiches with butter.                                            Cook in skillet on medium heat 4 min. on each side or until sandwiches are golden brown on both sides.', u'spoonacularSourceUrl': u'https://spoonacular.com/pulled-pork-red-onion-melt-277930', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}