{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/493603-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 493603, u'veryPopular': False, u'lowFodmap': False, u'title': u'Schnitzel And Biscuits With Bratwurst Gravy', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 2605.28, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'1 tablespoon + 2 1/2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'2 bratwursts', u'aisle': u'Meat', u'name': u'bratwursts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 7013, u'unit': u''}, {u'originalString': u'1/2 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2031, u'unit': u'servings'}, {u'originalString': u'2 cups cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 egg, for egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'for egg wash'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'servings'}, {u'originalString': u'1 quart milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'quart'}, {u'originalString': u'nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'oil, for sauteeing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for sauteeing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1 cup panko', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'8 veal or pork loin medallions, about 2-3 ounces each, pounded out thin', u'aisle': u'Meat', u'name': u'pork loin', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10225, u'unit': u''}, {u'originalString': u'1 tablespoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 1/2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 87.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.foodrepublic.com/2014/04/24/schnitzel-and-biscuits-bratwurst-gravy-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 85, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For gravy:  Prepare the gravy by chopping the bratwurst into pieces. Brown in the butter, then add flour. Stir over medium heat for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bratwurst.jpg', u'id': 7013, u'name': u'bratwurst'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the dry ingredients and whisk them so they incorporate evenly in a large bowl. Then add cream and bring together with your hands. Do not work this dough.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll out about 3/4-inch thick and punch large 4-inch circles with a ring cutter. Any scrap dough can be re-rolled. Lay onto a buttered cookie sheet, brush with egg wash and bake at 400F for about 9 or 10 minutes until golden.  For schnitzel:  While the biscuits are cooling, season the meat and dredge in flour. Dig meat in the egg and finish in the panko. Pan fry in a large cast iron pan until golden on each side, adding some butter as the schnitzels cook. Squeeze some lemon on them as they come out of the pan and sprinkle a little more salt.  For Assembly:  Fry a few eggs to finish and serve the biscuits, cut in half with a schnitzel in the center, ladling the gravy over. A salad on the side is nice.  Check out some other schnitzels on Food Republic:  Pork Wiener Schnitzel Recipe Olive-Oil Poached Veal With Lobster Schnitzel Recipe Sumac-Spiced Eggplant Schnitzel Recipe', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u'Add the milk and bring to a boil. Lower the heat and add seasoning to taste.  For biscuits'}], u'winePairing': {u'pairingText': u'Dornfelder and Riesling are great choices for Schnitzel. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'For gravy:  Prepare the gravy by chopping the bratwurst into pieces. Brown in the butter, then add flour. Stir over medium heat for about 5 minutes. Add the milk and bring to a boil. Lower the heat and add seasoning to taste.  For biscuits:  Combine the dry ingredients and whisk them so they incorporate evenly in a large bowl. Then add cream and bring together with your hands. Do not work this dough. Roll out about 3/4-inch thick and punch large 4-inch circles with a ring cutter. Any scrap dough can be re-rolled. Lay onto a buttered cookie sheet, brush with egg wash and bake at 400F for about 9 or 10 minutes until golden.  For schnitzel:  While the biscuits are cooling, season the meat and dredge in flour. Dig meat in the egg and finish in the panko. Pan fry in a large cast iron pan until golden on each side, adding some butter as the schnitzels cook. Squeeze some lemon on them as they come out of the pan and sprinkle a little more salt.  For Assembly:  Fry a few eggs to finish and serve the biscuits, cut in half with a schnitzel in the center, ladling the gravy over. A salad on the side is nice.  Check out some other schnitzels on Food Republic:  Pork Wiener Schnitzel Recipe Olive-Oil Poached Veal With Lobster Schnitzel Recipe Sumac-Spiced Eggplant Schnitzel Recipe', u'spoonacularSourceUrl': u'https://spoonacular.com/schnitzel-and-biscuits-with-bratwurst-gravy-493603', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}