{u'recipes': [{u'sourceName': u'Beyond Frosting', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/840249-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 840249, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skinnier Coconut Cream Cake', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 60.86, u'creditText': u'Beyond Frosting', u'extendedIngredients': [{u'originalString': u'1 teaspoon coconut extract', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'teaspoon'}, {u'originalString': u'1 cup diet 7up or seltzer', u'aisle': u'Beverages', u'name': u'diet pop', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14146, u'unit': u'cup'}, {u'originalString': u'3 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1 container fat-free Cool Whip (8 oz)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free cool whip', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'1 container coconut Greek yogurt (5.3 oz)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.3, u'consistency': u'liquid', u'id': 1256, u'unit': u'oz'}, {u'originalString': u'1 box white cake', u'aisle': u'Bakery/Bread', u'name': u'lb cake', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'liquid', u'id': 18133, u'unit': u'box'}, {u'originalString': u'1 can fat-free sweetened condensed milk (14 oz)', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'fat-free', u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'\xbd cup unsweetened coconut, toasted', u'aisle': u'Baking', u'name': u'unsweetened coconut', u'metaInformation': [u'unsweetened', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'1 cup shredded coconut, unsweetened preferred', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://beyondfrosting.com/2017/01/13/skinnier-coconut-cream-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the cake: Preheat the oven to 350F. Lightly grease a 9-inch by 13-inch pan.In a large mixing bowl, combine the white cake mix, diet 7up, egg whites, Greek yogurt and coconut extract. Beat all the ingredients until well combined. Lastly fold in the coconut.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the batter into the prepared pan and bake at 350F for 18-22 minutes. To check the cake for doneness, stick a toothpick into the center of the cake. If your toothpick comes out clean, then your cake is done. Allow the cake to cool for 30 minutes.Before you turn off your oven, toast the coconut for the topping for 5-10 minutes until the coconut turns lightly brown.For the topping: Use a wooden spoon or small round object to poke holes all over the top of the cake.', u'length': {u'number': 62, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Pour the can of sweetened condensed milk over top of the cake, trying to spread evenly. Allow it to soak into the cake while the cake is cooling. Cool completely.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}]}, {u'equipment': [], u'step': u'Spread the Cool Whip over the cooled cake and garnish with the toasted coconut. This cake must be refrigerated after the Cool Whip has been added.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'For the cake: Preheat the oven to 350F. Lightly grease a 9-inch by 13-inch pan.In a large mixing bowl, combine the white cake mix, diet 7up, egg whites, Greek yogurt and coconut extract. Beat all the ingredients until well combined. Lastly fold in the coconut.Pour the batter into the prepared pan and bake at 350F for 18-22 minutes. To check the cake for doneness, stick a toothpick into the center of the cake. If your toothpick comes out clean, then your cake is done. Allow the cake to cool for 30 minutes.Before you turn off your oven, toast the coconut for the topping for 5-10 minutes until the coconut turns lightly brown.For the topping: Use a wooden spoon or small round object to poke holes all over the top of the cake. Pour the can of sweetened condensed milk over top of the cake, trying to spread evenly. Allow it to soak into the cake while the cake is cooling. Cool completely.Spread the Cool Whip over the cooled cake and garnish with the toasted coconut. This cake must be refrigerated after the Cool Whip has been added.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinnier-coconut-cream-cake-840249', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}