{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/522267-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 522267, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cherry Pizza Crostata Dolce (Cherry Ricotta Pie) with Port Cherry Sauce', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 131.86, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'1 cup cherries, pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'cup'}, {u'originalString': u'1 pound fresh cherries, pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'fresh', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'pound'}, {u'originalString': u"1 cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'2 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'Grated zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u"1 Tbs Limoncello (I've also used Orange Liqueur or Amaretto)", u'aisle': u'Alcoholic Beverages', u'name': u'limoncello', u'metaInformation': [u"(I've also used Orange Liqueur or Amaretto)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/limoncello.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 99021, u'unit': u'Tbs'}, {u'originalString': u'1/2 port wine', u'aisle': u'Alcoholic Beverages', u'name': u'port wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/port.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 10114057, u'unit': u''}, {u'originalString': u'2 cups / 1 pound ricotta', u'aisle': u'Cheese', u'name': u'ricotta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 cups unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10020081, u'unit': u'cups'}, {u'originalString': u'1 cup (1/2 pound) cold unsalted butter, cut into 1/2-inch cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'pound'}, {u'originalString': u'\xbd tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 large whole egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole egg', u'metaInformation': [u'whole', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.creative-culinary.com/cherry-ricotta-pie-pizza-dolce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the flour, sugar, salt, and lemon zest in the work bowl of a food processor and pulse briefly to combine the ingredients. Scatter the butter around the bowl and pulse until the mixture is crumbly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the whole egg and egg yolks and process until the mixture is just beginning to clump together in the work bowl.    Turn the dough out onto a lightly floured work surface and pat it together into a thick disk. Wrap tightly in plastic and refrigerate for at least 1 hour, or until well chilled.    On a lightly floured surface, roll out the larger portion into an 12-13-inch circle about 1/8 inch thick or slightly thicker. Carefully wrap the dough around the rolling pin put it into a round pizza dish or on a baking sheet. Gently press the dough into the bottom and up the sides of the pan or if using a baking sheet, make an identifiable rim on the outside edge of the dough.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the pan in the refrigerator to chill for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oven to 350 degrees F.    Using a hand mixer or whisk, beat the ricotta until smooth and creamy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the eggs, the sugar, the vanilla, the liqueur and the ground cinnamon.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'ground cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove the dough from the fridge and carefully pour and spread the Ricotta Filling onto the dough not more than about an inch from the edges (leaving a border).', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [], u'step': u'Place the pitted cherries all over the Filling.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake until the dough is puffed and golden brown and the Ricotta Filling is puffed and set in the center, about 30 to 45 minutes depending on the thickness of the dough and your oven. Keep an eye on it; mine was perfect at about 40 minutes when golden brown.', u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to cool slightly.    Top with some of the Port/Cherry sauce and serve warm or at room temperature.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/port.jpg', u'id': 10114057, u'name': u'port'}]}, {u'equipment': [], u'step': u'Combine all ingredients together and simmer until sauce is thickened and coats the back of a spoon; approximately 10-15 minutes.    Cool until thickened.    Refrigerate leftovers.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Angel Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'Put the flour, sugar, salt, and lemon zest in the work bowl of a food processor and pulse briefly to combine the ingredients. Scatter the butter around the bowl and pulse until the mixture is crumbly. Add the whole egg and egg yolks and process until the mixture is just beginning to clump together in the work bowl.    Turn the dough out onto a lightly floured work surface and pat it together into a thick disk. Wrap tightly in plastic and refrigerate for at least 1 hour, or until well chilled.    On a lightly floured surface, roll out the larger portion into an 12-13-inch circle about 1/8 inch thick or slightly thicker. Carefully wrap the dough around the rolling pin put it into a round pizza dish or on a baking sheet. Gently press the dough into the bottom and up the sides of the pan or if using a baking sheet, make an identifiable rim on the outside edge of the dough. Put the pan in the refrigerator to chill for 30 minutes.    Heat the oven to 350 degrees F.    Using a hand mixer or whisk, beat the ricotta until smooth and creamy. Whisk in the eggs, the sugar, the vanilla, the liqueur and the ground cinnamon.    Remove the dough from the fridge and carefully pour and spread the Ricotta Filling onto the dough not more than about an inch from the edges (leaving a border).    Place the pitted cherries all over the Filling.    Bake until the dough is puffed and golden brown and the Ricotta Filling is puffed and set in the center, about 30 to 45 minutes depending on the thickness of the dough and your oven. Keep an eye on it; mine was perfect at about 40 minutes when golden brown.    Remove from oven and allow to cool slightly.    Top with some of the Port/Cherry sauce and serve warm or at room temperature.    Combine all ingredients together and simmer until sauce is thickened and coats the back of a spoon; approximately 10-15 minutes.    Cool until thickened.    Refrigerate leftovers.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-pizza-crostata-dolce-cherry-ricotta-pie-with-port-cherry-sauce-522267', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}