{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/553227-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553227, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten Free No bake frozen Lemonade Cheesecake', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 171.16, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'1 tablespoon chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'3/4 cup frozen lemonade concentrate, thawed', u'aisle': u'Frozen', u'name': u'lemonade concentrate', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonade.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 14292, u'unit': u'cup'}, {u'originalString': u'2 8oz 1/3 less fat cream cheese', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 43274, u'unit': u'oz'}, {u'originalString': u'2 cups old fashion oats, Gluten Free. You can also use almond meal', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'Crust', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'1 cup pitted prunes', u'aisle': u'Dried Fruits;Produce', u'name': u'prunes', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9291, u'unit': u'cup'}, {u'originalString': u'2 tablespoons soy milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16235, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon agar powder, you can use 1 tablespoon of unflavored gelatin instead or omit this all together.', u'aisle': u'?', u'name': u'omit this all together', u'metaInformation': [u'unflavored', u'canned'], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tablespoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.eatgood4life.com/gluten-free-no-bake-frozen-lemonade/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line the bottom of a 9 inch spring form pan with plastic wrap, like in the picture. This will allow you to release the cheesecake better when it is set, although it is not necessary.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place oats in the food processor and pulse until they are pulverized. About 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remainder of the ingredients and pulse until mixture comes together. About 1-2 minutes.Press the crust mixture down onto the spring form pan and place in the fridge while you work on the filling.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the agar powder and lemonade in a small sauce pan and heat for about 1 minute, just to dissolve the powder.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place this with the remaining filling ingredients in a bowl and whip together until the mixture is smooth.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour filling over the crust and freeze for about 3-4 hours. Before serving, run a knife over the edge of the cheesecake to loosen it up and place the cheesecake on a pretty plate.You may need about 20 minutes to bring the cheesecake a bit to room temperature to be able to cut it through.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 284, u'instructions': u'Line the bottom of a 9 inch spring form pan with plastic wrap, like in the picture. This will allow you to release the cheesecake better when it is set, although it is not necessary.Place oats in the food processor and pulse until they are pulverized. About 1 minute. Add the remainder of the ingredients and pulse until mixture comes together. About 1-2 minutes.Press the crust mixture down onto the spring form pan and place in the fridge while you work on the filling.Place the agar powder and lemonade in a small sauce pan and heat for about 1 minute, just to dissolve the powder. Place this with the remaining filling ingredients in a bowl and whip together until the mixture is smooth.Pour filling over the crust and freeze for about 3-4 hours. Before serving, run a knife over the edge of the cheesecake to loosen it up and place the cheesecake on a pretty plate.You may need about 20 minutes to bring the cheesecake a bit to room temperature to be able to cut it through.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-no-bake-frozen-lemonade-cheesecake-553227', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}