{u'recipes': [{u'sourceName': u'Bakers Royale', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/673359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 673359, u'veryPopular': True, u'lowFodmap': False, u'title': u'Breakfast Parfait', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 52.12, u'creditText': u'Bakers Royale', u'extendedIngredients': [{u'originalString': u'2 Chobani \xae Almond Coco Loco', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'chobani \xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u''}, {u'originalString': u'1/4 cup blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'1/4 cup granola', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8212, u'unit': u'cup'}, {u'originalString': u'1/4 cup cooked Quaker\xae Organic Instant Oatmeal', u'aisle': u'Cereal', u'name': u'instant oatmeal', u'metaInformation': [u'organic', u'cooked', u'quaker\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8640, u'unit': u'cup'}, {u'originalString': u'1/4 cup raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'1 Chobani vanilla Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 99033, u'unit': u''}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.bakersroyale.com/breakfast/breakfast-parfait/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the vanilla yogurt, blueberries and cooked oatmeal in a blender and blend until combined. Layer blueberry mixture with Almond Coco Loco yogurt and then finish with the toppings from the Chobani  Flip.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Parfait works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1668, u'instructions': u'Place the vanilla yogurt, blueberries and cooked oatmeal in a blender and blend until combined. Layer blueberry mixture with Almond Coco Loco yogurt and then finish with the toppings from the Chobani  Flip.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-parfait-673359', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}