{u'recipes': [{u'sourceName': u'Farm Girl Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556605-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 556605, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chipotle Creamy Tomato Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 106.34, u'creditText': u'Farm Girl Gourmet', u'extendedIngredients': [{u'originalString': u'2 teaspoons adobo sauce (from canned chipotle chiles)', u'aisle': u'Ethnic Foods', u'name': u'adobo sauce', u'metaInformation': [u'canned', u'(from chipotle chiles)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6979, u'unit': u'teaspoons'}, {u'originalString': u'1 medium chipotle chile pepper', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chile pepper', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'2 ounces light cream cheese, tub style, cut into small pieces (I used fat-free)', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'light', u'fat-free', u'tub style', u'small', u'cut into  pieces (i used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 cup fat-free half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free half and half', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1199, u'unit': u'cup'}, {u'originalString': u'1/2 15-ounce can no-salt-added navy beans, drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'navy beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.5, u'consistency': u'solid', u'id': 16038, u'unit': u'ounce'}, {u'originalString': u'2 14.5-ounce cans no-salt-added diced tomatoes (or home canned)', u'aisle': u'Canned and Jarred', u'name': u'no salt added diced tomatoes', u'metaInformation': [u'diced', u'canned', u'(or home )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 11885, u'unit': u'ounce'}, {u'originalString': u'1 1/2 tablespoons extra-virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup fat-free sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'fat-free', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.farmgirlgourmet.com/2013/09/chipotle-creamy-tomato-soup.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Heat 1 teaspoon of the oil in a large saucepan.  Cook onion until beginning to lightly brown, about 4 minutes, stirring frequently.  Stir in the tomatoes, beans, chipotle pepper, and sauce.  Bring to a boil over high heat, reduce heat, cover and simmer 25 minutes, or until onions are very tender; remove from heat.Working in batches, puree the tomato mixture in a blender (be sure to hold down lid).  Return to saucepan.', u'length': {u'number': 29, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the half-and-half and cream cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Place over medium heat and cook until heated through and cheese has melted.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat, stir in the salt and remaining 2 teaspoons oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve topped with sour cream.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 945, u'instructions': u'Heat 1 teaspoon of the oil in a large saucepan.  Cook onion until beginning to lightly brown, about 4 minutes, stirring frequently.  Stir in the tomatoes, beans, chipotle pepper, and sauce.  Bring to a boil over high heat, reduce heat, cover and simmer 25 minutes, or until onions are very tender; remove from heat.Working in batches, puree the tomato mixture in a blender (be sure to hold down lid).  Return to saucepan.  Whisk in the half-and-half and cream cheese.  Place over medium heat and cook until heated through and cheese has melted.  Remove from heat, stir in the salt and remaining 2 teaspoons oil.  Serve topped with sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-creamy-tomato-soup-556605', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}