{u'recipes': [{u'sourceName': u'Stephs Bite by Bite', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/485745-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 485745, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Taco', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 2, u'pricePerServing': 111.75, u'creditText': u'Stephs Bite by Bite', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 wedge Laughing Cow Garlic and Herb Cheese Spread', u'aisle': u'Cheese', u'name': u'boursin herb cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99188, u'unit': u''}, {u'originalString': u'1 brown rice tortilla [or any other type]', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 20040, u'unit': u''}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/4 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6164, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon soy milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16235, u'unit': u'tablespoon'}, {u'originalString': u'Handful of spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'Handful'}, {u'originalString': u'2 whole eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.stephsbitebybite.com/2013/04/02/breakfast-taco/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl whisk the eggs, egg white, and milk together, just until the yolks are combined. Spray a small skillet with cooking spray and place over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in the egg mixture and swirl around the pan, do not touch the eggs once the go in the pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the eggs cook for a few minutes until they start to set. Once the base of the omelet is set you can lift up the side of the omelet and tip the pan so that any excess liquid egg runs in to the bottom of the pan to cook. Again, let the eggs sit and cook a few more minutes until the top of the eggs have almost no liquid-ness to them. Then flip the egg patty over to cook just for a minute or two on the other side. Fold the omelet patty in half so that it resembles an omelet.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place tortilla in microwave and heat for 20-30 seconds, just to slightly warm up the tortilla.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove from microwave and spread the cheese over half of the tortilla.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place the spinach over the cheese and top the spinach with the folded egg omelet. Schmear some salsa over the top of the omelet and fold the empty side of the tortilla over the top top resemble a taco.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 12, u'instructions': u'In a small bowl whisk the eggs, egg white, and milk together, just until the yolks are combined. Spray a small skillet with cooking spray and place over medium heat. Pour in the egg mixture and swirl around the pan, do not touch the eggs once the go in the pan. Let the eggs cook for a few minutes until they start to set. Once the base of the omelet is set you can lift up the side of the omelet and tip the pan so that any excess liquid egg runs in to the bottom of the pan to cook. Again, let the eggs sit and cook a few more minutes until the top of the eggs have almost no liquid-ness to them. Then flip the egg patty over to cook just for a minute or two on the other side. Fold the omelet patty in half so that it resembles an omelet. Place tortilla in microwave and heat for 20-30 seconds, just to slightly warm up the tortilla. Remove from microwave and spread the cheese over half of the tortilla. Place the spinach over the cheese and top the spinach with the folded egg omelet. Schmear some salsa over the top of the omelet and fold the empty side of the tortilla over the top top resemble a taco.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-taco-485745', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 7, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}