{u'recipes': [{u'sourceName': u'Guilty Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/550581-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 550581, u'veryPopular': False, u'lowFodmap': False, u'title': u'Primal Chili', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 396.73, u'creditText': u'Guilty Kitchen', u'extendedIngredients': [{u'originalString': u'2 small sweet bell peppers, diced', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'diced', u'sweet', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'28 fl oz. can diced tomatoes (no salt added)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'no salt added', u'canned', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'fl. oz.s', u'unitShort': u'fl. oz.', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'fl. oz.'}, {u'originalString': u'2 stalks celery (and leaves), chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped', u'(and leaves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1-2 tbsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp coconut aminos', u'aisle': u'Health Foods;Condiments', u'name': u'coconut aminos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 98929, u'unit': u'tbsp'}, {u'originalString': u'1 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1/4 cup fresh cilantro, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, peeled and minced or grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'250g ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10219, u'unit': u'g'}, {u'originalString': u'250g ground sirloin', u'aisle': u'Meat', u'name': u'ground sirloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 10023567, u'unit': u'g'}, {u'originalString': u'5 large kale leaves, stem removed and leaves chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11233, u'unit': u''}, {u'originalString': u'1 leek (white part only), sliced into half moons', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'white', u'sliced into half moons', u'( part only)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'2 tsp porcini mushroom powder (optional but optimal!)', u'aisle': u'Produce', u'name': u'mushroom', u'metaInformation': [u'(optional but optimal!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'tsp'}, {u'originalString': u'1/2 lb. mushrooms, sliced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'lb'}, {u'originalString': u'1 large onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'fresh cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 tbsp fat (coconut oil, animal fat, ghee, etc.)', u'aisle': u'Meat', u'name': u'duck fat', u'metaInformation': [u'(coconut oil, animal fat, ghee, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4574, u'unit': u'tbsp'}, {u'originalString': u'sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2-3 sundried tomatoes, finely diced', u'aisle': u'Canned and Jarred;Produce', u'name': u'sundried tomatoes', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11955, u'unit': u''}, {u'originalString': u'2 tbsp tomato paste (no sugar added)', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'(no sugar added)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}, {u'originalString': u'2 small zucchini, sliced into half moons', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'small', u'sliced into half moons'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 77.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://guiltykitchen.com/2012/08/28/primal-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot, melt the fat over medium high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add in the garlic, onions, leeks and mushrooms. Brown them completely before removing them from the pot and setting aside in a large bowl. Keeping the heat where it is, add in the ground meat and evenly brown it. This should take about 5-7 minutes. Once brown, add the vegetables back into the pot.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the remaining vegetables into the pot, along with the canned tomatoes, sun dried tomatoes and tomato paste. Finally, add in the the seasonings (chili, cumin, oregano, coriander, mushroom powder and aminos) and season to taste with the salt and pepper. Cook until the vegetables are softened.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'id': 10011693, u'name': u'canned tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add in the cilantro and kale and cook for an additional 4-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Serve with sliced avocados on top.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Campo Viejo Cava Brut ros\xe9 with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A bright sparkling pink color. Pleasant and powerful on the nose with a strong presence of ripe red berries.With has a rounded, pleasant feel in the mouth. View More', u'title': u'Campo Viejo Cava Brut Rose', u'price': u'$11.99', u'id': 468840, u'link': u'https://www.wine.com/product/campo-viejo-cava-brut-rose/132863', u'imageUrl': u'https://spoonacular.com/productImages/468840-312x231.jpg'}]}, u'aggregateLikes': 158, u'instructions': u'In a large pot, melt the fat over medium high heat. Add in the garlic, onions, leeks and mushrooms. Brown them completely before removing them from the pot and setting aside in a large bowl. Keeping the heat where it is, add in the ground meat and evenly brown it. This should take about 5-7 minutes. Once brown, add the vegetables back into the pot. Add the remaining vegetables into the pot, along with the canned tomatoes, sun dried tomatoes and tomato paste. Finally, add in the the seasonings (chili, cumin, oregano, coriander, mushroom powder and aminos) and season to taste with the salt and pepper. Cook until the vegetables are softened.Add in the cilantro and kale and cook for an additional 4-5 minutes. Serve with sliced avocados on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/primal-chili-550581', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}