{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/738986-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 738986, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coca-Cola Carnitas', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 73.86, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 cup Coca-Cola', u'aisle': u'Beverages', u'name': u'coca cola', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coca-cola.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14400, u'unit': u'cup'}, {u'originalString': u'Corn tortillas, for serving', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 18363, u'unit': u'servings'}, {u'originalString': u'3 sprigs fresh tarragon', u'aisle': u'Produce', u'name': u'fresh tarragon', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2041, u'unit': u'sprigs'}, {u'originalString': u'2 sprigs fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'1 tablespoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tablespoon'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds fatty pork shoulder or pork butt, cut into 2-inch cubes', u'aisle': u'Meat', u'name': u'pork butt', u'metaInformation': [u'cut into 2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/boston-butt-or-pork-butt.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10084, u'unit': u'pounds'}, {u'originalString': u'Suggested toppings: salsa verde, diced onions, cilantro leaves, sliced radishes, lime wedges and sliced avocado', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa verde', u'metaInformation': [u'diced', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'liquid', u'id': 27028, u'unit': u'leaves'}, {u'originalString': u"Pork fat or neutral oil such as canola or vegetable oil, for frying (see Cook's Note)", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying', u'neutral', u"(see Cook's Note)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 8.0, u'imageType': u'jpeg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/marcela-valladolid/coca-cola-carnitas.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Sprinkle the pork on all sides with the garlic powder and plenty of salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u"Heat the pork fat over medium-high heat in a small, heavy Dutch oven or braiser (see Cook's Note).", u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pork and fry on all sides until well browned, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the Coca-Cola and 1/2 cup water (there should be just enough liquid to cover the sides of the meat). Bring to a boil and reduce to a simmer.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the tarragon, bay leaves and thyme. Cover and simmer until the pork is tender, about 1 1/2 hours; the Coca-Cola will caramelize and the liquid will evaporate completely.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer the pork to a cutting board and shred.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with warm corn tortillas (charred over a flame) and toppings on the side: salsa verde, diced onions, cilantro, radishes, lime wedges and avocado.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}]}], u'name': u''}], u'aggregateLikes': 3349, u'instructions': u"Watch how to make this recipe.                    Sprinkle the pork on all sides with the garlic powder and plenty of salt and pepper.                          Heat the pork fat over medium-high heat in a small, heavy Dutch oven or braiser (see Cook's Note). Add the pork and fry on all sides until well browned, about 20 minutes. Add the Coca-Cola and 1/2 cup water (there should be just enough liquid to cover the sides of the meat). Bring to a boil and reduce to a simmer. Add the tarragon, bay leaves and thyme. Cover and simmer until the pork is tender, about 1 1/2 hours; the Coca-Cola will caramelize and the liquid will evaporate completely.                          Transfer the pork to a cutting board and shred. Serve with warm corn tortillas (charred over a flame) and toppings on the side: salsa verde, diced onions, cilantro, radishes, lime wedges and avocado.", u'spoonacularSourceUrl': u'https://spoonacular.com/coca-cola-carnitas-738986', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}