{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/218521-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 218521, u'veryPopular': False, u'lowFodmap': True, u'title': u'Pancetta chicken wraps', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 35, u'pricePerServing': 252.5, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 boneless chicken breast fillets', u'aisle': u'Meat', u'name': u'boneless chicken breast', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 5062, u'unit': u'fillet'}, {u'originalString': u'12 fresh sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'200g pack smoked pancetta slices', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'g'}, {u'originalString': u'4 small stems of tomatoes on the vine', u'aisle': u'Produce', u'name': u'vine ripened tomatoes', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3225/pancetta-chicken-wraps', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Arrange a quarter of the pancetta slices in a row on a board, overlapping them slightly along their long sides. Put a chicken breast at one end so that it lies across the slices of pancetta, top with 3 sage leaves and sprinkle with a little sea salt and freshly ground black pepper. Wrap the chicken in the pancetta so that it is completely enclosed. Repeat to make 4 parcels altogether.Spoon the oil into a large heavy pan (a cast-iron saut\xe9 pan is ideal, or you could use a roasting tin).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the pan on the barbecue and heat for 1–2 mins until hot, then lay the chicken parcels in the pan and cook for 7–8 mins on each side. The pancetta will become golden and crispy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the parcels, lay the tomatoes in the pan and shake to coat in the cooking juices, then heat through for a couple of minutes. Return the chicken to the pan, take the pan off the heat and leave the chicken to rest in it for about 10 mins, so it will cut more easily.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'Arrange a quarter of the pancetta slices in a row on a board, overlapping them slightly along their long sides. Put a chicken breast at one end so that it lies across the slices of pancetta, top with 3 sage leaves and sprinkle with a little sea salt and freshly ground black pepper. Wrap the chicken in the pancetta so that it is completely enclosed. Repeat to make 4 parcels altogether.Spoon the oil into a large heavy pan (a cast-iron saut\xe9 pan is ideal, or you could use a roasting tin). Put the pan on the barbecue and heat for 1–2 mins until hot, then lay the chicken parcels in the pan and cook for 7–8 mins on each side. The pancetta will become golden and crispy.Remove the parcels, lay the tomatoes in the pan and shake to coat in the cooking juices, then heat through for a couple of minutes. Return the chicken to the pan, take the pan off the heat and leave the chicken to rest in it for about 10 mins, so it will cut more easily.', u'spoonacularSourceUrl': u'https://spoonacular.com/pancetta-chicken-wraps-218521', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}