{u'recipes': [{u'sourceName': u'A Healthy Life for Me', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/812305-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 11, u'id': 812305, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fava Bean and Manchego Crostini', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 25.39, u'creditText': u'A Healthy Life for Me', u'extendedIngredients': [{u'originalString': u'2 cups Fava Beans (thawed if using frozen)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'fava beans', u'metaInformation': [u'frozen', u'thawed', u'( if using )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16053, u'unit': u'cups'}, {u'originalString': u'1 loaf of sourdough or french bread, sliced 1/2” thin', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18029, u'unit': u'loaf'}, {u'originalString': u'1 large cloves of garlic, sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 teaspoons of dried Italian Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'dried', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'Zest of 1 Lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1/2 cup cubed Manchego Cheese', u'aisle': u'Cheese', u'name': u'manchego cheese', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/manchego.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93821, u'unit': u'cup'}, {u'originalString': u'1/2 cup Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Pinch of Salt & Pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'pinch'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://ahealthylifeforme.com/fava-bean-and-manchego-crostini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400On a baking sheet line bread in a single layer and bake until bread is starting to brown and becomes crunchy, about 6-8 minutes. If you are using the entire loaf you will need to use two baking sheets.Meanwhile combine all ingredients in a food processor and blend to a paste', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove bread from oven and spread each piece of bread with a heaping spoonful of manchego puree, spreading.Grate extra manchego cheese over top {optional} and set back in oven to quickly warm and melt cheese, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/manchego.jpg', u'id': 93821, u'name': u'manchego cheese'}]}, {u'equipment': [], u'step': u'Serve', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Billecart-Salmon Brut ros\xe9 ( Magnum). Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 170 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Persistent mousse, with fine bubbles rising slowly. Pale salmon pink in color, with a shade of gold. A nose of red fruits and fresh pear. Delicate fruit on the palate, elegant, and showing great finesse.', u'title': u'Billecart-Salmon Brut Rose ( Magnum)', u'price': u'$169.99', u'id': 457927, u'link': u'https://www.wine.com/product/billecart-salmon-brut-rose-15-liter-magnum/57383', u'imageUrl': u'https://spoonacular.com/productImages/457927-312x231.jpg'}]}, u'aggregateLikes': 226, u'instructions': u'Preheat oven to 400On a baking sheet line bread in a single layer and bake until bread is starting to brown and becomes crunchy, about 6-8 minutes. If you are using the entire loaf you will need to use two baking sheets.Meanwhile combine all ingredients in a food processor and blend to a pasteRemove bread from oven and spread each piece of bread with a heaping spoonful of manchego puree, spreading.Grate extra manchego cheese over top {optional} and set back in oven to quickly warm and melt cheese, about 3 minutes.Serve', u'spoonacularSourceUrl': u'https://spoonacular.com/fava-bean-and-manchego-crostini-812305', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 16, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}