{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/582951-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 582951, u'veryPopular': False, u'lowFodmap': True, u'title': u'Kahl\xfaa Pumpkin Spice Latte Cocktail', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 636.93, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'pinch of cinnamon, for topping', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'pinch'}, {u'originalString': u'1 30ml half and half or cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 1049, u'unit': u'ml'}, {u'originalString': u'\xbd part Kahl\xfaa French Vanilla', u'aisle': u'Alcoholic Beverages', u'name': u'kahlua', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coffee-liqueur.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93716, u'unit': u''}, {u'originalString': u'1 30ml pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 11424, u'unit': u'ml'}, {u'originalString': u'1 30ml Kahl\xfaa Pumpkin Spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'ml'}, {u'originalString': u'whipped cream, for topping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1054, u'unit': u'serving'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://dailydishrecipes.com/kahlua-pumpkin-spice-latte-cocktail/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all three Kahl\xfaa flavors and the pumpkin puree in a cocktail shaker.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}]}, {u'equipment': [], u'step': u'Pour into a cocktail glass. Gently pour the half and half over the top in a swirl pattern. Top with whipped cream and sprinkle with cinnamon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}], u'name': u''}], u'aggregateLikes': 301, u'instructions': u'Combine all three Kahl\xfaa flavors and the pumpkin puree in a cocktail shaker. Pour into a cocktail glass. Gently pour the half and half over the top in a swirl pattern. Top with whipped cream and sprinkle with cinnamon.', u'spoonacularSourceUrl': u'https://spoonacular.com/kahla-pumpkin-spice-latte-cocktail-582951', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}