{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/208372-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 208372, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cook the Book: New Orleans Style Red Beans', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 59.49, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 bay leaf, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 celery stalks, peeled and finely chopped', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2 teaspoons coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Hot sauce, for serving', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'1 small onion, finely chopped (about 1 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 ham bone end, ham hock, or cured pork product of some kind (2 or 3 slices of bacon will work, too)', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [u'(2 or 3 slices of bacon will work, too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10010219, u'unit': u''}, {u'originalString': u'1/2 red or green bell pepper, cored, seeded, and chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'green', u'red', u'cored', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 pound dried red kidney beans, soaked overnight in cold water', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red kidney beans', u'metaInformation': [u'dried', u'red', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 16033, u'unit': u'pound'}, {u'originalString': u'2 teaspoons Tabasco sauce, plus more for serving', u'aisle': u'Condiments', u'name': u'tabasco sauce', u'metaInformation': [u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'10 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 10.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'White rice for serving', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'white', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'servings'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2010/02/new-orleans-style-red-beans-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large pot.  Swirl in the oil.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, celery, bell pepper, and garlic and saute until soft and lightly caramelized, 11 to 12 minutes,', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain and discard the soaking liquid from the beans and add the beans to the pot.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in the fresh water and stir.  Bring to a boil, reduce the heat, and simmer uncovered for 1 hour.  Skim off any foam that rises to the surface.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the ham bone, Tabasco sauce, salt, thyme, and bay leaf.  Continue to cook until the beans are soft and tender, 30 to 60 minutes more.  (The time will vary depending on the age of the beans, so taste frequently.)  Using the back of a spoon or a spatula, crush some of the beans against the side of the pan to create a slightly creamy consistency.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 14, u'instructions': u'Procedures                                                                              1                                                                            Heat a large pot.  Swirl in the oil.  Add the onion, celery, bell pepper, and garlic and saute until soft and lightly caramelized, 11 to 12 minutes,                                                                                                                            2                                                                            Drain and discard the soaking liquid from the beans and add the beans to the pot.  Pour in the fresh water and stir.  Bring to a boil, reduce the heat, and simmer uncovered for 1 hour.  Skim off any foam that rises to the surface.                                                                                                                            3                                                                            Add the ham bone, Tabasco sauce, salt, thyme, and bay leaf.  Continue to cook until the beans are soft and tender, 30 to 60 minutes more.  (The time will vary depending on the age of the beans, so taste frequently.)  Using the back of a spoon or a spatula, crush some of the beans against the side of the pan to create a slightly creamy consistency.', u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-new-orleans-style-red-beans-208372', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}