{u'recipes': [{u'sourceName': u'Pressure Cooking Today', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/487267-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 487267, u'veryPopular': True, u'lowFodmap': False, u'title': u'Quick White Chicken Chili', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 94.12, u'creditText': u'Pressure Cooking Today', u'extendedIngredients': [{u'originalString': u'2 cans (15.5 ounce) cannellini beans or other white bean, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned white cannellini beans', u'metaInformation': [u'white', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 10016051, u'unit': u'ounce'}, {u'originalString': u'2 cans (14 ounce) chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounce'}, {u'originalString': u'2 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced or pressed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 can (4 ounces) diced green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'diced', u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounces'}, {u'originalString': u'1 large onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 jar (16 ounce) salsa verde', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa verde', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 27028, u'unit': u'ounce'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 cups cooked, diced or shredded chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'diced', u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cups'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoon cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.pressurecookingtoday.com/2013/10/quick-white-chicken-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Select Saut\xe9 and add the oil to the pressure cooker pot. When oil is hot, add the onion and cook, stirring occasionally until the onion is tender, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for an additional minute.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add chicken, chicken broth, salsa verde, green chilies, cumin, red pepper flakes and beans to the pressure cooking pot. Lock lid in place, select High Pressure, 5 minutes cook time and press start. When timer beeps, turn off pressure cooker, wait 5 minutes, then do a quick pressure release to release any remaining pressure. In a small bowl, dissolve cornstarch in 3 tablespoons water. Select Simmer and add cornstarch mixture to the pot stirring constantly until chili thickens.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add salt and pepper to taste.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Served topped with sour cream, diced avocado, tortilla chips, and shredded cheese.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 421, u'instructions': u'Select Saut\xe9 and add the oil to the pressure cooker pot. When oil is hot, add the onion and cook, stirring occasionally until the onion is tender, about 5 minutes. Add the garlic and cook for an additional minute.Add chicken, chicken broth, salsa verde, green chilies, cumin, red pepper flakes and beans to the pressure cooking pot. Lock lid in place, select High Pressure, 5 minutes cook time and press start. When timer beeps, turn off pressure cooker, wait 5 minutes, then do a quick pressure release to release any remaining pressure. In a small bowl, dissolve cornstarch in 3 tablespoons water. Select Simmer and add cornstarch mixture to the pot stirring constantly until chili thickens. Add salt and pepper to taste. Served topped with sour cream, diced avocado, tortilla chips, and shredded cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-white-chicken-chili-487267', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}