{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223313-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 160, u'id': 223313, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow-roast chicken with homemade gravy', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 292.29, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g soft butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2kg chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'kg'}, {u'originalString': u'1l chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'l'}, {u'originalString': u'2 tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'2 tsp fresh thyme leaves (or use 1 tsp dried), plus sprigs to serve', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'dried', u'fresh', u'(or use 1 tsp )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'1 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/358606/slowroast-chicken-with-homemade-gravy', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 160C/140C fan/gas 3 andput the chicken in a roasting tin.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put thebutter into a small bowl and add the herbsand plenty of seasoning. Grate in the zestfrom the lemon and mash everythingtogether with the butter using a fork. Rubthis over the chicken breasts, legs andwings, then push the whole grated lemoninto the big cavity of the chicken.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Pourhalf the stock into the tin. Use a largesheet of tin foil (or a couple of smallerpieces) to cover the chicken and scrunchtogether the foil along the edges of thetin so the whole thing is sealed. Put inthe oven and set your timer for 2 hrs.Carefully remove the foil from thechicken, increase oven to 220C/200C fan/gas 7, and put the chicken back in foranother 30 mins. If you’re making the', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Crunchy roast potatoes (see 'Goes well with'), put them in now, under thechicken. After 30 mins, take the chickenout of the oven and lift it onto a servingdish (move the potatoes up). Snuglycover the chicken with foil and set asidewhile you make the gravy.Tip the chicken juices and stock fromthe tin into a jug.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Put the tin over a mediumheat on your hob and use a woodenspoon to stir in the flour and Marmite, ifusing, with a splash of the juices to makea paste. If you want, spoon the fat off thetop of the chicken juices in the jug, thengradually stir this into the tin to make asmooth gravy.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add as much of the restof the stock as you need to make a goodgravy, then serve with the chicken.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try District 7 Estate Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 125, u'instructions': u"Heat oven to 160C/140C fan/gas 3 andput the chicken in a roasting tin. Put thebutter into a small bowl and add the herbsand plenty of seasoning. Grate in the zestfrom the lemon and mash everythingtogether with the butter using a fork. Rubthis over the chicken breasts, legs andwings, then push the whole grated lemoninto the big cavity of the chicken. Pourhalf the stock into the tin. Use a largesheet of tin foil (or a couple of smallerpieces) to cover the chicken and scrunchtogether the foil along the edges of thetin so the whole thing is sealed. Put inthe oven and set your timer for 2 hrs.Carefully remove the foil from thechicken, increase oven to 220C/200C fan/gas 7, and put the chicken back in foranother 30 mins. If you’re making theCrunchy roast potatoes (see 'Goes well with'), put them in now, under thechicken. After 30 mins, take the chickenout of the oven and lift it onto a servingdish (move the potatoes up). Snuglycover the chicken with foil and set asidewhile you make the gravy.Tip the chicken juices and stock fromthe tin into a jug. Put the tin over a mediumheat on your hob and use a woodenspoon to stir in the flour and Marmite, ifusing, with a splash of the juices to makea paste. If you want, spoon the fat off thetop of the chicken juices in the jug, thengradually stir this into the tin to make asmooth gravy. Add as much of the restof the stock as you need to make a goodgravy, then serve with the chicken.", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-roast-chicken-with-homemade-gravy-223313', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 170, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}