{u'recipes': [{u'sourceName': u'White on Rice Couple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/589867-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 589867, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baked Brie Dip w/sun dried tomatoes, thyme', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 683.76, u'creditText': u'White on Rice Couple', u'extendedIngredients': [{u'originalString': u'Baguette or crackers', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 18033, u'unit': u'servings'}, {u'originalString': u'about 10 oz. Brie', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 1006, u'unit': u'oz'}, {u'originalString': u'1 heaping teaspoon of dried thyme or 3/4 teaspoon fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'dried', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'2 medium garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'fresh cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'8 oz. jar of sun dried tomatoes packed in oil, drained & chopped', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun dried tomatoes', u'metaInformation': [u'dried', u'packed in oil, drained & chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11955, u'unit': u'oz'}], u'healthScore': 55.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://whiteonricecouple.com/recipes/appetizers-spreadable-dips/baked-brie-dip-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove rind from Brie, then cut brie into cubes.3. In medium bowl, combine sun dried tomatoes, garlic, thyme, fresh cracked black pepper4. In small-medium baking dish, layer the base with about 1/3 of the sun dried tomato mixture, then top with 1/2 of the chopped brie. Repeat the layering until the top layer is the sun dried tomato mixture.6.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in oven for about 30 minutes, or until the brie completely melts and becomes bubbly. You may need to stir the dip one time, about 15 minutes into the baking to combine the layers.7.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Serve warm, with bread or crackers', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 4414, u'instructions': u'1. Preheat oven to 350 degrees2. Remove rind from Brie, then cut brie into cubes.3. In medium bowl, combine sun dried tomatoes, garlic, thyme, fresh cracked black pepper4. In small-medium baking dish, layer the base with about 1/3 of the sun dried tomato mixture, then top with 1/2 of the chopped brie. Repeat the layering until the top layer is the sun dried tomato mixture.6. Bake in oven for about 30 minutes, or until the brie completely melts and becomes bubbly. You may need to stir the dip one time, about 15 minutes into the baking to combine the layers.7. Serve warm, with bread or crackers', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-brie-dip-w-sun-dried-tomatoes-thyme-589867', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}