{u'recipes': [{u'sourceName': u'Nutrition Stripped ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537863-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 537863, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raw Peach Tart', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 40, u'pricePerServing': 110.23, u'creditText': u'Nutrition Stripped ', u'extendedIngredients': [{u'originalString': u'1 cup almond, raw and ground', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1 cup dates, pitted', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9087, u'unit': u'cup'}, {u'originalString': u'1 tsp. ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'local honey drizzle on top (optional, it should be sweet enough!)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'sweet', u'(optional, it should be enough!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'servings'}, {u'originalString': u'1 juice of lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 Tbs. lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'Tbs'}, {u'originalString': u'3 cups fresh peaches, sliced (about 4 peaches or until your tarts are filled!)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'sliced', u'( 4 peaches or until your tarts are filled!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 9236, u'unit': u'cups'}, {u'originalString': u'1 cups cashews, raw and ground', u'aisle': u'Nuts;Savory Snacks', u'name': u'raw cashews', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cups'}, {u'originalString': u'\xbd tsp. sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1 cup walnuts, raw and ground', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://nutritionstripped.com/raw-peach-tart/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"CRUST//Grind all nuts in a nut grinder (coffee grinder that's clean of course) or Vitamix until finely chopped. It's okay to have some chucks!", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine all the CRUST ingredients into your Vitamix (or high speed blender or food processor) until well combined.This "dough" will be very sticky (similar to my Almond Coconut Date Balls), but should hold together when pressed in between your fingers. If your mixture is too wet or moist simply add more ground nuts.If you\'re using mini tart pans, divide the mixture evenly.Using your tart pan (10-12in.) or mini tart pans, gently press the Nut/Date dough into the pan and up the sides. Press firmly until a crust is formed.Chill in the freezer (at least 2 hours) or refrigerator (overnight).FILLING//', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [], u'step': u'Cut the peaches in half, remove the pit.Thinly slice the peaches long ways (as shown in the picture), and arrange in a circular pattern or simply lay flat.Sprinkle with fresh squeezed lemon juice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Serve immediately or wrap tightly with clear wrap and keep in the refrigerator.ENJOY!', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 240, u'instructions': u'CRUST//Grind all nuts in a nut grinder (coffee grinder that\'s clean of course) or Vitamix until finely chopped. It\'s okay to have some chucks!Combine all the CRUST ingredients into your Vitamix (or high speed blender or food processor) until well combined.This "dough" will be very sticky (similar to my Almond Coconut Date Balls), but should hold together when pressed in between your fingers. If your mixture is too wet or moist simply add more ground nuts.If you\'re using mini tart pans, divide the mixture evenly.Using your tart pan (10-12in.) or mini tart pans, gently press the Nut/Date dough into the pan and up the sides. Press firmly until a crust is formed.Chill in the freezer (at least 2 hours) or refrigerator (overnight).FILLING//Cut the peaches in half, remove the pit.Thinly slice the peaches long ways (as shown in the picture), and arrange in a circular pattern or simply lay flat.Sprinkle with fresh squeezed lemon juice.Serve immediately or wrap tightly with clear wrap and keep in the refrigerator.ENJOY!', u'spoonacularSourceUrl': u'https://spoonacular.com/raw-peach-tart-537863', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}