{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/564826-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 564826, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Jelly Cheesecake', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 281.58, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'150 grams digestive biscuits processed or pounded into fine crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 18079, u'unit': u'grams'}, {u'originalString': u'75 grams butter melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'1 block (250 grams) cream cheese softened at room temperature for about 3 hours', u'aisle': u'Cheese', u'name': u'cream cheese block', u'metaInformation': [u'softened', u'for 3 hours', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1186, u'unit': u'grams'}, {u'originalString': u'1 level tbsp gelatin powder', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u''}, {u'originalString': u'45 grams icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 45.0, u'consistency': u'solid', u'id': 19336, u'unit': u'grams'}, {u'originalString': u'A Crust', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'1 box (90 grams) strawberry jelly (jell-o) (Note: I used Tortally brand)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry jelly', u'metaInformation': [u'(jell-o)', u'(Note: I used Tortally brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 90.0, u'consistency': u'solid', u'id': 11019297, u'unit': u'grams'}, {u'originalString': u'5 strawberries cut off the top, half each strawberry lengthwise then trim the top into a "V" heart shape', u'aisle': u'Meat', u'name': u'Top Sirloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/top-sirloin-steak.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'liquid', u'id': 23584, u'unit': u''}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'3/4 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.noobcook.com/strawberry-jelly-cheesecake/2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'(A) Crust', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine biscuit crumbs and melted butter and mix well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour biscuit mixture into the tray, levelling the crust with a flat spatula. Allow to chill in fridge for about an hour, or until the crust is hardened.(B) Cheesecake Layer', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Dissolve gelatin powder in a bowl of hot water, allow to cool for a few minutes.Meanwhile, add softened cream cheese, vanilla and sugar to electric mixer.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until the mixture is light and fluffy.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add cooled gelatin mixture, a little at a time and whisk until the batter is smooth.Use a fork to prick holes all over the biscuit base.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [], u'step': u'Pour the cream cheese mixture on to the biscuit base. Arrange and press 9 strawberry halves (3 by 3 grid) into the cream cheese mixture, letting each strawberry sink in gently. Allow to chill in fridge for at least four hours or overnight.(C) Jelly Layer', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, add jelly powder and boiling water.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to dissolve the jelly crystals completely, then add cold water.Gently pour the cooled jelly mixture over the cream cheese layer. Return to fridge and chill for a few hours until the jelly is set.To serve, divide and cut the cheesecake to 9 equal pieces. With each slice, wipe your knife clean with a kitchen towel and dip the blade in water. Store in an airtight container in the fridge for a few days.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 189, u'instructions': u'(A) CrustIn a large bowl, combine biscuit crumbs and melted butter and mix well. Pour biscuit mixture into the tray, levelling the crust with a flat spatula. Allow to chill in fridge for about an hour, or until the crust is hardened.(B) Cheesecake LayerDissolve gelatin powder in a bowl of hot water, allow to cool for a few minutes.Meanwhile, add softened cream cheese, vanilla and sugar to electric mixer. Whisk until the mixture is light and fluffy.Add cooled gelatin mixture, a little at a time and whisk until the batter is smooth.Use a fork to prick holes all over the biscuit base. Pour the cream cheese mixture on to the biscuit base. Arrange and press 9 strawberry halves (3 by 3 grid) into the cream cheese mixture, letting each strawberry sink in gently. Allow to chill in fridge for at least four hours or overnight.(C) Jelly LayerIn a bowl, add jelly powder and boiling water. Whisk to dissolve the jelly crystals completely, then add cold water.Gently pour the cooled jelly mixture over the cream cheese layer. Return to fridge and chill for a few hours until the jelly is set.To serve, divide and cut the cheesecake to 9 equal pieces. With each slice, wipe your knife clean with a kitchen towel and dip the blade in water. Store in an airtight container in the fridge for a few days.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-jelly-cheesecake-564826', u'dishTypes': [], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}