{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/587283-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 587283, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Easiest Fish Tacos', u'diets': [u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 251.19, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'1 can black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 16018, u'unit': u'can'}, {u'originalString': u'chopped cilantro, to taste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'8 pieces frozen prepared fish sticks', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [u'frozen', u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'pieces'}, {u'originalString': u'8 small flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'2 limes, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'1/3 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/2 cup diced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/3 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 can sweet corn, drained', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'sweet corn', u'metaInformation': [u'sweet', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11168, u'unit': u'can'}, {u'originalString': u'1 tablespoon taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'tablespoon'}, {u'originalString': u'2 large tomatoes, diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.laurenslatest.com/the-easiest-fish-tacos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook fish sticks according to package directions until golden and crispy.While fish is cooking, make the sauce: stir all ingredients together until smooth.For the salad, stir all ingredients together until evenly mixed.To assemble, place 1 piece of fish onto 1 tortilla and top with salad, sauce, lettuce and avocado.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The King Estate Signature Collection Pinot Gris with a 4.3 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish.', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 1825, u'instructions': u'Cook fish sticks according to package directions until golden and crispy.While fish is cooking, make the sauce: stir all ingredients together until smooth.For the salad, stir all ingredients together until evenly mixed.To assemble, place 1 piece of fish onto 1 tortilla and top with salad, sauce, lettuce and avocado. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-easiest-fish-tacos-587283', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}