{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/620099-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 620099, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brownie Pie', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 108.74, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'5 Tbsp unsalted butter, diced into 1 Tbsp pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbsp'}, {u'originalString': u'Salted caramel sauce', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19364, u'unit': u'servings'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 Tbsp all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 - 4 Tbsp ice water', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'Tbsp'}, {u'originalString': u'1/2 cup packed light-brown sugar', u'aisle': u'Baking', u'name': u'light-brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 cup semi-sweet chocolate chips, divided', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'2 Tbsp shortening, cold and diced into pieces', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [u'diced', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4615, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'Tbsp'}, {u'originalString': u'2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.cookingclassy.com/2014/11/brownie-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a mixing bowl whisk together flour, sugar and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add cold butter and shortening, then using a long pronged fork, cut into flour mixture until mixture resembles coarse crumbs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Drizzle ice water into mixture one tablespoon at a time, while tossing with a rubber spatula and adding water just until mixture starts to come together (it shouldn't fully come together while mixing, don't overwork it, but when pressed together it should hold). Drop mixture onto a sheet of plastic wrap then press and shape into about a 4 to 5-inch round disk. Wrap with plastic wrap and refrigerate 30 minutes.Dust a work surface with flour then unwrap chilled dough and place on floured surface. Dust top with flour and roll out into an even 12-inch round (pinch together areas that crack on edges as rolling). Carefully fold dough in half then fold in half once more, carefully transfer dough to pie a 9-inch pie plate (I used regular not deep dish) and place tip of the triangle in center of pie plate and unfold dough to fit plate. Trim uneven edges (while still leaving about 1-inch overhang) and tuck overhang underneath and flute as desired. Preheat oven to 375 degrees and transfer crust to freezer and chill 20 minutes. Cover chilled crust with two sheets of foil (one going each direction) and wrap around edges of crust. Fill pie with weights or about 2 lbs of dry beans.", u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven 20 minutes, then remove from oven and carefully remove weights and foil. Return to oven and bake 5 minutes longer. Cool completely to room temperature.To make the filling:Preheat oven to 325 degrees.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add 3/4 cup of the chocolate chips and the butter to a microwave safe bowl.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Heat on HIGH power in 30 second increments, stirring between each interval, until melted and smooth. Stir in canola oil and cocoa powder, mixing until well blended. In a medium mixing bowl, stir together brown sugar, granulated sugar, eggs, vanilla and salt.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add chocolate mixture to sugar mixture and stir until combined. Stir in flour then stir in remaining 1/4 cup chocolate chips.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Spread pecans over bottom of pie crust into an even layer, the pour and spread filling evenly over pecans.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake in preheated until toothpick inserted into center only comes out with a small amount of batter, about 40 minutes. Cool at room temperature about 1 1/2 hours until just warm, then slice and serve with sweetened whipped cream, ice cream or optional salted caramel sauce. Recipe source: filling adapted from both allrecipes and Cooks Illustrated', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Angel Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 1728, u'instructions': u"In a mixing bowl whisk together flour, sugar and salt. Add cold butter and shortening, then using a long pronged fork, cut into flour mixture until mixture resembles coarse crumbs. Drizzle ice water into mixture one tablespoon at a time, while tossing with a rubber spatula and adding water just until mixture starts to come together (it shouldn't fully come together while mixing, don't overwork it, but when pressed together it should hold). Drop mixture onto a sheet of plastic wrap then press and shape into about a 4 to 5-inch round disk. Wrap with plastic wrap and refrigerate 30 minutes.Dust a work surface with flour then unwrap chilled dough and place on floured surface. Dust top with flour and roll out into an even 12-inch round (pinch together areas that crack on edges as rolling). Carefully fold dough in half then fold in half once more, carefully transfer dough to pie a 9-inch pie plate (I used regular not deep dish) and place tip of the triangle in center of pie plate and unfold dough to fit plate. Trim uneven edges (while still leaving about 1-inch overhang) and tuck overhang underneath and flute as desired. Preheat oven to 375 degrees and transfer crust to freezer and chill 20 minutes. Cover chilled crust with two sheets of foil (one going each direction) and wrap around edges of crust. Fill pie with weights or about 2 lbs of dry beans. Bake in preheated oven 20 minutes, then remove from oven and carefully remove weights and foil. Return to oven and bake 5 minutes longer. Cool completely to room temperature.To make the filling:Preheat oven to 325 degrees. Add 3/4 cup of the chocolate chips and the butter to a microwave safe bowl. Heat on HIGH power in 30 second increments, stirring between each interval, until melted and smooth. Stir in canola oil and cocoa powder, mixing until well blended. In a medium mixing bowl, stir together brown sugar, granulated sugar, eggs, vanilla and salt. Add chocolate mixture to sugar mixture and stir until combined. Stir in flour then stir in remaining 1/4 cup chocolate chips.Spread pecans over bottom of pie crust into an even layer, the pour and spread filling evenly over pecans. Bake in preheated until toothpick inserted into center only comes out with a small amount of batter, about 40 minutes. Cool at room temperature about 1 1/2 hours until just warm, then slice and serve with sweetened whipped cream, ice cream or optional salted caramel sauce. Recipe source: filling adapted from both allrecipes and Cooks Illustrated", u'spoonacularSourceUrl': u'https://spoonacular.com/brownie-pie-620099', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 190, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}