{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/4498-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 4498, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten-free Wild Salmon With Rosemary Sweet Potatoes And Lemon', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'pricePerServing': 479.18, u'extendedIngredients': [{u'originalString': u'1/2 lb fresh asparagus', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11011, u'unit': u'lb'}, {u'originalString': u'2 tsp dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'1 tbsp fresh rosemary, chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tbsp'}, {u'originalString': u'1 clove garlic, pressed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 tbsp lemon juice, freshly squeezed', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'Zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tbsp extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'8 oz wild salmon cut into 2 (4 oz) servings', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'wild', u'cut into 2 (4 oz) servings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 15076, u'unit': u'oz'}, {u'originalString': u'Pinch sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'2 small sweet potatoes, sliced', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 small yellow onion, sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.doctoroz.com/videos/gluten-free-wild-salmon-rosemary-sweet-potatoes-and-lemon-asparagus', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Cut a piece of parchment paper to fit on a cookie sheet, and then lay it on the sheet. Wash the unpeeled sweet potatoes and onions and slice 1/4-inch thick. Put sweet potatoes and onions on the parchment paper in a single layer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drizzle with olive oil and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 15 minutes.Meanwhile, mix garlic, dry mustard, lemon juice and rosemary to make a paste, and set aside.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove sweet potatoes and onions from oven (keep on the cookie sheet).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Place the asparagus on the paper next to the sweet potatoes and onions. Sprinkle the lemon zest and on the asparagus. Lay salmon on top of the asparagus and onions.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread mustard paste on top of salmon.Return sheet to oven and roast for 12 minutes. Salmon is done when flesh flakes with gentle pressure.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Casa Catelli Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 61, u'instructions': u'Preheat oven to 425F. Cut a piece of parchment paper to fit on a cookie sheet, and then lay it on the sheet. Wash the unpeeled sweet potatoes and onions and slice 1/4-inch thick. Put sweet potatoes and onions on the parchment paper in a single layer. Drizzle with olive oil and salt. Bake for 15 minutes.Meanwhile, mix garlic, dry mustard, lemon juice and rosemary to make a paste, and set aside.Remove sweet potatoes and onions from oven (keep on the cookie sheet). Place the asparagus on the paper next to the sweet potatoes and onions. Sprinkle the lemon zest and on the asparagus. Lay salmon on top of the asparagus and onions. Spread mustard paste on top of salmon.Return sheet to oven and roast for 12 minutes. Salmon is done when flesh flakes with gentle pressure.Recipe courtesy of Dr. Mark Hyman.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-wild-salmon-with-rosemary-sweet-potatoes-and-lemon-4498', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}