{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/868586-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 868586, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Shrimp with Chile Gremolata', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 476.84, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 freshly ground pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 red serrano or Fresno chile, seeds removed if desired, finely chopped', u'aisle': u'Produce', u'name': u'chile', u'metaInformation': [u'red', u'seeds removed if desired, finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 red serrano or Fresno chiles, with seeds, halved lengthwise', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [u'red', u'with seeds, halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1/4 cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped fresh flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 garlic clove, finely grated', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'6 garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt, freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 lemon, cut into wedges', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 tablespoon finely grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 pounds large shrimp, peeled, deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/roasted-shrimp-with-chile-gremolata-51223810', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix chile, garlic, herbs, zest, and oil in a small bowl; season with salt and pepper. Squeeze lemon over shrimp; top with gremolata.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Per serving: 460 calories, 35 g Fat, 1 g fiber', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Nutritional analysis provided by Bon Apptit', u'number': 3, u'ingredients': []}], u'name': u'For gremolata and assembly'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat chiles, garlic, bay leaves, and oil in a small saucepan over medium heat until just beginning to sizzle, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Remove chile oil from heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'id': 1014053, u'name': u'chili oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Toss shrimp and chile oil in a 3-quart baking dish; roast, turning halfway through, until shrimp are cooked through, 810 minutes.', u'length': {u'number': 810, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'id': 1014053, u'name': u'chili oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u'For shrimp'}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Casa Catelli Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 1125, u'instructions': u'PreparationFor shrimp:                                        Preheat oven to 450F. Heat chiles, garlic, bay leaves, and oil in a small saucepan over medium heat until just beginning to sizzle, about 2 minutes. Remove chile oil from heat.                                                                            Toss shrimp and chile oil in a 3-quart baking dish; roast, turning halfway through, until shrimp are cooked through, 810 minutes.                                    For gremolata and assembly:                                        Mix chile, garlic, herbs, zest, and oil in a small bowl; season with salt and pepper. Squeeze lemon over shrimp; top with gremolata.                                    Per serving: 460 calories, 35 g Fat, 1 g fiberNutritional analysis provided by Bon Apptit', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-shrimp-with-chile-gremolata-868586', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}