{u'recipes': [{u'sourceName': u'Fork Knife Swoon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/572274-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 572274, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ginger Spiced Banana Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 37.66, u'creditText': u'Fork Knife Swoon', u'extendedIngredients': [{u'originalString': u'2 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'6-7 (about 3-1/2 cups) very ripe bananas, mashed', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'very ripe', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 9040, u'unit': u'cups'}, {u'originalString': u'1/4 tsp cardamom*', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'4 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/2 cup fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 tbsp fresh ginger, finely minced', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'2 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2011, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/2 cup (1 stick) unsalted butter, softened.', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.forkknifeswoon.com/food-drink/breakfast-brunch/2013/09/ginger-spiced-banana-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees. Prepare two 4-inch-by-8-1/2-inch loaf pans; grease the bottom and sides of each pan with butter and dust lightly with flour. Set aside.In a mixing bowl, use the back of a large fork to mash together the bananas, Greek yogurt, milk and ginger. The mixture should be well-mixed with small chunks of banana remaining.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add to a stand-up mixer. With the mixer running on low speed, add the vanilla, butter, egg whites and sugar, until well-combined.Sift together the flour, baking soda, cinnamon, cloves, nutmeg, salt, and cardamom, if using.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the dry ingredients to the mixer, a half cup at a time until just mixed. Be careful not to overbeat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Pour the batter into the prepared loaf pans.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 1 hour, until the tops are golden brown and a cake-tester inserted into the middle of each loaf comes out clean.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the pans from the oven and let cool on a baking rack for 10-15 mins. Run a knife around the edge of the pans, and gently flip over to remove the loaves.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Let cool completely on a baking rack. Slice and serve.The bread can be stored for up to a week, if refrigerated and wrapped in aluminum foil or plastic wrap. It will continue to get more moist over time.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Dessert Bread. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 3384, u'instructions': u'Preheat the oven to 350 degrees. Prepare two 4-inch-by-8-1/2-inch loaf pans; grease the bottom and sides of each pan with butter and dust lightly with flour. Set aside.In a mixing bowl, use the back of a large fork to mash together the bananas, Greek yogurt, milk and ginger. The mixture should be well-mixed with small chunks of banana remaining. Add to a stand-up mixer. With the mixer running on low speed, add the vanilla, butter, egg whites and sugar, until well-combined.Sift together the flour, baking soda, cinnamon, cloves, nutmeg, salt, and cardamom, if using. Add the dry ingredients to the mixer, a half cup at a time until just mixed. Be careful not to overbeat. Pour the batter into the prepared loaf pans.Bake for 1 hour, until the tops are golden brown and a cake-tester inserted into the middle of each loaf comes out clean. Remove the pans from the oven and let cool on a baking rack for 10-15 mins. Run a knife around the edge of the pans, and gently flip over to remove the loaves. Let cool completely on a baking rack. Slice and serve.The bread can be stored for up to a week, if refrigerated and wrapped in aluminum foil or plastic wrap. It will continue to get more moist over time.', u'spoonacularSourceUrl': u'https://spoonacular.com/ginger-spiced-banana-bread-572274', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}