{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/583026-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 583026, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon Fried Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 119.66, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'8 slices of bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'4 cups of rice, cooked and cooled to room temperature (mine was still warm)', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooled', u'cooked', u'room temperature', u'(mine was still warm)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u"1 teaspoon Siracha (optional) (I didn't have any so we left it out)", u'aisle': u'Condiments', u'name': u'siracha', u'metaInformation': [u"(I didn't have any so we left it out)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}, {u'originalString': u'4 Tablespoons of soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tablespoons'}, {u'originalString': u'2 Tablespoons of vegetable oil, divided (you can use more if needed - I used the bacon grease instead)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'divided', u'canned', u'(you can use more if needed - I used the bacon grease instead)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'Tablespoons'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://dailydishrecipes.com/bacon-fried-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large pan over medium heat cook the bacon until crisp, turning to evenly cook both sides. (we didn\'t "crisp" ours, fully cooked but instead left it just a little soft in areas.)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer your bacon to a paper towel covered plate to drain.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour all but a couple tablespoons of bacon grease into a glass bowl to cool. You want to leave a bit of it for the flavor.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add 1 Tablespoon of the vegetable oil and heat for about a minute or two.Crack each of the eggs gently into the oil and fry until the whites are cooked through. (Jess did each of hers sunny-side up, so that's what I did and I loved the yolk mixed with the fried rice and bacon.)When the eggs are done cooking, remove them from the pan and place on a plate (they will go on top of each serving)Now, add the final Tablespoon of vegetable oil to the pan.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the onion and saute until it softens, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the soy sauce and rice (also the siracha if using). Stir-fry the rice until it is evenly coated in soy sauce and begins to sizzle on the bottom of the pan.Scrape the bottom of the pan several times to keep the rice from sticking and to get the loose flavor pieces free. They really are a huge part of this.Next, crumble up your bacon or chop it and add it to the rice. Toss it all together to combine it.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Remove from the heat and scoop four servings on to individual plates. Top each serving with an egg and serve immediately.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 172, u'instructions': u'In a large pan over medium heat cook the bacon until crisp, turning to evenly cook both sides. (we didn\'t "crisp" ours, fully cooked but instead left it just a little soft in areas.)Transfer your bacon to a paper towel covered plate to drain.Pour all but a couple tablespoons of bacon grease into a glass bowl to cool. You want to leave a bit of it for the flavor.Add 1 Tablespoon of the vegetable oil and heat for about a minute or two.Crack each of the eggs gently into the oil and fry until the whites are cooked through. (Jess did each of hers sunny-side up, so that\'s what I did and I loved the yolk mixed with the fried rice and bacon.)When the eggs are done cooking, remove them from the pan and place on a plate (they will go on top of each serving)Now, add the final Tablespoon of vegetable oil to the pan. Add the onion and saute until it softens, about 1 minute.Add the soy sauce and rice (also the siracha if using). Stir-fry the rice until it is evenly coated in soy sauce and begins to sizzle on the bottom of the pan.Scrape the bottom of the pan several times to keep the rice from sticking and to get the loose flavor pieces free. They really are a huge part of this.Next, crumble up your bacon or chop it and add it to the rice. Toss it all together to combine it.Remove from the heat and scoop four servings on to individual plates. Top each serving with an egg and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-fried-rice-583026', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}