{u'recipes': [{u'sourceName': u'Fit Foodie Finds', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/734614-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 734614, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blender Lemon Blueberry Pancakes', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 34.92, u'creditText': u'Fit Foodie Finds', u'extendedIngredients': [{u'originalString': u'1 cup almond milk, unsweetened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 banana, medium', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 cup blueberries, fresh', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'3 tablespoons coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs, large', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon lemon extract', u'aisle': u'Baking', u'name': u'lemon extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 12311111, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tablespoon'}, {u'originalString': u'⅛ teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1.5 cups white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 93824, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'png', u'spoonacularScore': 12.0, u'sourceUrl': u'http://fitfoodiefinds.com/2016/04/blender-lemon-blueberry-pancakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place blueberries, banana, eggs, vanilla extract, unsweetened almond milk, honey, and lemon extract in a high-speed blender. Blend on high until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'id': 12311111, u'name': u'lemon extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add in the rest of the dry ingredients and blend on high until smooth. Finally, add melted coconut oil and blend until smooth. At this point, your mixture should be thick, but thin enough to pour into pancakes. If it's too thick, add a splash more almond milk.Turn a skillet to medium heat and spray with coconut oil cooking spray. Using a  cup scoop, pour batter onto skillet. Cook for about 1 to 2 minutes or until bubbles start to form on your pancakes. Flip and cook for an additional 1-2 minutes.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}], u'name': u''}], u'aggregateLikes': 83, u'instructions': u"Place blueberries, banana, eggs, vanilla extract, unsweetened almond milk, honey, and lemon extract in a high-speed blender. Blend on high until smooth. Add in the rest of the dry ingredients and blend on high until smooth. Finally, add melted coconut oil and blend until smooth. At this point, your mixture should be thick, but thin enough to pour into pancakes. If it's too thick, add a splash more almond milk.Turn a skillet to medium heat and spray with coconut oil cooking spray. Using a  cup scoop, pour batter onto skillet. Cook for about 1 to 2 minutes or until bubbles start to form on your pancakes. Flip and cook for an additional 1-2 minutes.", u'spoonacularSourceUrl': u'https://spoonacular.com/blender-lemon-blueberry-pancakes-734614', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}