{u'recipes': [{u'sourceName': u'Picky Eater Blog', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/626875-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 626875, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetarian Panang Curry with Tofu', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 258.06, u'creditText': u'Picky Eater Blog', u'extendedIngredients': [{u'originalString': u'2 bell peppers, sliced', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'1 head broccoli, cut into florets', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'cut into florets'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11090, u'unit': u'head'}, {u'originalString': u'1 tbsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'3 carrots, sliced on a diagonal', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/8-1/4 tsp cayenne pepper (I used 1/4 tsp for a nice kick)', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'for a nice kick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'Cooked brown rice for serving', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 20041, u'unit': u'servings'}, {u'originalString': u'2 tbsp crunchy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'crunchy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10016098, u'unit': u'tbsp'}, {u'originalString': u'20oz block extra firm tofu, drained and cut into 1 inch cubes', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'firm', u'drained', u'cut into 1 inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'oz'}, {u'originalString': u'1 tbsp organic extra virgin coconut oil, plus 1 tsp coconut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'2 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'2 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'2 14oz cans light coconut milk', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'oz'}, {u'originalString': u'1 tbsp fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp lower sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'lower sodium soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 16424, u'unit': u'tbsp'}, {u'originalString': u'1 tsp crushed peanuts (per serving)', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'crushed', u'per serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16091, u'unit': u'tsp'}, {u'originalString': u'dash of salt (to taste)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dash'}, {u'originalString': u'2 shallots, diced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3-4 tbsp thai red curry paste', u'aisle': u'Ethnic Foods', u'name': u'thai red curry paste', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93605, u'unit': u'tbsp'}, {u'originalString': u'2 zucchini, quartered and sliced', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'sliced', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 65.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://pickyeaterblog.com/vegetarian-panang-curry-with-tofu/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place tofu on several layers of paper towels. Cover with additional paper towels.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Let stand for 30 minutes, pressing down occasionally.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a wok or large skillet over medium-high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 tablespoon oil to pan; swirl to coat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add tofu; saut 8 minutes or until golden brown, stirring occasionally.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove tofu from pan; keep warm.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 tsp coconut oil to the pan.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add shallots, bell pepper, and carrots - saute 5 minutes. Then add the zucchini and broccoli - saute another 5 minutes until cooked lightly. In a medium pot, add peanut butter, curry paste, cumin, coriander, and cayenne; cook 15 seconds.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'id': 93605, u'name': u'curry paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add coconut milk, soy sauce, and sugar, stirring with a whisk until smooth.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add in tofu and simmer 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour tofu and sauce into the pan with the veggies. Simmer 5 minutes until the veggies have soaked up the sauce.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Remove from heat and gently stir in lime juice.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}]}, {u'equipment': [], u'step': u'Serve with brown rice, and top with 1 tsp crushed peanuts per serving.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}]}], u'name': u''}], u'aggregateLikes': 30, u'instructions': u'Place tofu on several layers of paper towels. Cover with additional paper towels. Let stand for 30 minutes, pressing down occasionally. Heat a wok or large skillet over medium-high heat. Add 1 tablespoon oil to pan; swirl to coat. Add tofu; saut 8 minutes or until golden brown, stirring occasionally. Remove tofu from pan; keep warm.Add 1 tsp coconut oil to the pan. Add shallots, bell pepper, and carrots - saute 5 minutes. Then add the zucchini and broccoli - saute another 5 minutes until cooked lightly. In a medium pot, add peanut butter, curry paste, cumin, coriander, and cayenne; cook 15 seconds. Add coconut milk, soy sauce, and sugar, stirring with a whisk until smooth. Add in tofu and simmer 2-3 minutes.Pour tofu and sauce into the pan with the veggies. Simmer 5 minutes until the veggies have soaked up the sauce. Remove from heat and gently stir in lime juice. Serve with brown rice, and top with 1 tsp crushed peanuts per serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetarian-panang-curry-with-tofu-626875', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}