{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528590-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 528590, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tropical Hummingbird Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 95.76, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 (8-ounce) can crushed pineapple, with juice', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'with juice', u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'ounce'}, {u'originalString': u'1/2 cup shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'1/2 tsp Coconut Extract', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'tsp'}, {u'originalString': u"1 pound (1 box) confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [u'(1 box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'pound'}, {u'originalString': u'8 ounces cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'4 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'All-purpose flour, for pans', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'for pans'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 20081, u'unit': u'servings'}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 large mango, mashed', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'large', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'2 tablespoon milk, or more if needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup finely chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'3 cups self-rising flour', u'aisle': u'Baking', u'name': u'self-rising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20129, u'unit': u'cups'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1/2 cup toasted shredded cocnut', u'aisle': u'?', u'name': u'cocnut', u'metaInformation': [u'shredded', u'toasted'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.countrycleaver.com/2012/05/tropical-hummingbird-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees. Spray and flour three 9-inch round cake pans, tapping out excess flour. Set aside.Prepare the cake; in a large bowl, stir to combine self-rising flour, sugar, oil, pecans, crushed mango, crushed pineapple, shredded coconut, vanilla, cinnamon, and eggs.Divide batter evenly between prepared pans, smoothing with an offset spatula.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1019354, u'name': u'crushed pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20129, u'name': u'self rising flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for about 11-12 minutes, rotating pans and continue baking for an additional 11-22 minutes. Cook until toothpicks inserted into the cakes come out clean.', u'length': {u'number': 34, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer pans to a wire rack to cool 10 minutes. Turn out cakes onto wire rack and allow to cool completely.In a stand mixer bowl fitted with a paddle attachment, combine sugar, cream cheese, coconut extract, butter, vanilla, and 2 tablespoons of milk until frosting is smooth. If needed, add more milk, 1 teaspoon at a time, to reach a thin spreading consistency.Level the tops of each cake with serrated knife or cake leveler.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Place the first layer on the cake plate.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the top of the first layer with about 1/3 cup of frosting.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place second layer of cake on top of first and spread about 1/3 cup of frosting on top of this layer.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place the 3rd and final layer on top of the second layer bottom side up, so when you frost it, there will be no crumbs coming off into the frosting.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the 3 layers of cake with the remaining frosting. Swirl the frosting with the back of a spoon to achieve a rustic swirled pattern. Gently press toasted coconut into the sides of the cake until they stick.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 39, u'instructions': u'Preheat oven to 325 degrees. Spray and flour three 9-inch round cake pans, tapping out excess flour. Set aside.Prepare the cake; in a large bowl, stir to combine self-rising flour, sugar, oil, pecans, crushed mango, crushed pineapple, shredded coconut, vanilla, cinnamon, and eggs.Divide batter evenly between prepared pans, smoothing with an offset spatula. Bake for about 11-12 minutes, rotating pans and continue baking for an additional 11-22 minutes. Cook until toothpicks inserted into the cakes come out clean. Transfer pans to a wire rack to cool 10 minutes. Turn out cakes onto wire rack and allow to cool completely.In a stand mixer bowl fitted with a paddle attachment, combine sugar, cream cheese, coconut extract, butter, vanilla, and 2 tablespoons of milk until frosting is smooth. If needed, add more milk, 1 teaspoon at a time, to reach a thin spreading consistency.Level the tops of each cake with serrated knife or cake leveler. Place the first layer on the cake plate. Spread the top of the first layer with about 1/3 cup of frosting. Place second layer of cake on top of first and spread about 1/3 cup of frosting on top of this layer. Place the 3rd and final layer on top of the second layer bottom side up, so when you frost it, there will be no crumbs coming off into the frosting. Spread the 3 layers of cake with the remaining frosting. Swirl the frosting with the back of a spoon to achieve a rustic swirled pattern. Gently press toasted coconut into the sides of the cake until they stick.', u'spoonacularSourceUrl': u'https://spoonacular.com/tropical-hummingbird-cake-528590', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}