{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/754256-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 754256, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prosciutto Cotto Pinwheels', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 128.06, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2/3 cup fresh ricotta cheese, at room temperature', u'aisle': u'Cheese', u'name': u'fresh ricotta cheese', u'metaInformation': [u'fresh', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup chopped jarred giardiniera (Italian pickled vegetables)', u'aisle': u'Canned and Jarred', u'name': u'hot giardiniera', u'metaInformation': [u'italian', u'jarred', u'chopped', u'( pickled vegetables)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-antipasti.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 99014, u'unit': u'cup'}, {u'originalString': u'2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup freshly grated parmigiano-reggiano cheese', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'12 slices (1/2 pound) thinly sliced prosciutto cotto (Italian cooked ham)', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'italian', u'cooked', u'thinly sliced', u'( ham)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10010123, u'unit': u'pound'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/prosciutto-cotto-pinwheels.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the ricotta, rosemary, parmigiano and olive oil in a bowl with a rubber spatula until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [], u'step': u'Lay 2 pieces of prosciutto cotto on a board in front of you lengthwise, overlapping by half and patching holes where needed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [], u'step': u'Spread about 2 tablespoons of the cheese mixture evenly over the prosciutto. Sprinkle the side closest to you with 2 tablespoons giardiniera and press gently into the cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [], u'step': u'Roll the prosciutto into a pinwheel starting with the edge closest to you, rolling away from you.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Repeat with the remaining prosciutto and filling. Wrap each roll tightly in plastic wrap and chill in the refrigerator at least 4 hours to firm up. To serve, unwrap the rolls and slice into 3/4-inch pieces with a sharp knife.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [], u'step': u'Photograph by Ryan Liebe', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 194, u'instructions': u'Mix the ricotta, rosemary, parmigiano and olive oil in a bowl with a rubber spatula until smooth.                          Lay 2 pieces of prosciutto cotto on a board in front of you lengthwise, overlapping by half and patching holes where needed. Spread about 2 tablespoons of the cheese mixture evenly over the prosciutto. Sprinkle the side closest to you with 2 tablespoons giardiniera and press gently into the cheese. Roll the prosciutto into a pinwheel starting with the edge closest to you, rolling away from you.                          Repeat with the remaining prosciutto and filling. Wrap each roll tightly in plastic wrap and chill in the refrigerator at least 4 hours to firm up. To serve, unwrap the rolls and slice into 3/4-inch pieces with a sharp knife.                          Photograph by Ryan Liebe', u'spoonacularSourceUrl': u'https://spoonacular.com/prosciutto-cotto-pinwheels-754256', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 260, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}