{u'recipes': [{u'sourceName': u'Just as Delish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/624423-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 624423, u'veryPopular': False, u'lowFodmap': False, u'title': u'Flourless Chocolate Cake (Gluten, Grain, Nut & Dairy Free)', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 315.06, u'creditText': u'Just as Delish', u'extendedIngredients': [{u'originalString': u'1 large Mixing Bowl', u'aisle': u'Bread', u'name': u'bread bowl', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99169, u'unit': u''}, {u'originalString': u'1 medium heatproof Bowl', u'aisle': u'Bread', u'name': u'bread bowl', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99169, u'unit': u''}, {u'originalString': u'200g 60% Dark Chocolate (I use Callebaut 60%) - finely chopped', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'60%', u'finely chopped', u'(I use Callebaut )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'8 Medium Eggs (about 60g each) - separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 480.0, u'consistency': u'solid', u'id': 1123, u'unit': u'g'}, {u'originalString': u'10” Springform Cake Tin - lined', u'aisle': u'Bakery/Bread', u'name': u'lb cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pound-cake.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 18133, u'unit': u'servings'}, {u'originalString': u'Small Pot', u'aisle': u'Meat', u'name': u'pot roast', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pot-roast.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 23612, u'unit': u'servings'}, {u'originalString': u'a Pinch of Salt - optional', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'inch'}, {u'originalString': u'140g Molasses Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.justasdelish.com/flourless-chocolate-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 135.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pre-heat Oven to 135C. Line the bottom of a 10 springform cake tin with baking paper and oil the sides with butter/olive oil.Bring a small pot with a bit of water to simmer.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place dark chocolate into a heat proof bowl, and place on top of the pot melt the chocolate.Meanwhile, whisk egg whites on high speed to soft peaks, the egg whites look light, airy and will flop down when turn over.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'id': 19904, u'name': u'dark chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the whisked egg whites to a big bowl to set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add egg yolks and molasses into the 1st bowl, and whisk on high speed until pale yellow and airy.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add in cocoa powder and whisk well.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the mixer, add in melted chocolate and stir well with a rubber spatula.  Stir  egg whites into the batter to lighten the batter, then gently fold in the rest of the egg whites. Its ok if theres a few streaks of egg white, dont overfold or the cake will deflate. This video shows how how to beat the egg whites and fold into the liquid batter.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour batter into the prepared cake tin, and smooth the top with a rubber spatula.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake until the cake pulls away from the sides of the tin and is set in the center, 45 to 50 minutes. Cool completely on a wire rack; remove sides of tin. Best to serve at room temperature, dusted with cacao powder. Top with some berries if preferred.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 67, u'instructions': u'Pre-heat Oven to 135C. Line the bottom of a 10 springform cake tin with baking paper and oil the sides with butter/olive oil.Bring a small pot with a bit of water to simmer. Place dark chocolate into a heat proof bowl, and place on top of the pot melt the chocolate.Meanwhile, whisk egg whites on high speed to soft peaks, the egg whites look light, airy and will flop down when turn over. Transfer the whisked egg whites to a big bowl to set aside.  Add egg yolks and molasses into the 1st bowl, and whisk on high speed until pale yellow and airy. Add in cocoa powder and whisk well.  Remove the bowl from the mixer, add in melted chocolate and stir well with a rubber spatula.  Stir  egg whites into the batter to lighten the batter, then gently fold in the rest of the egg whites. Its ok if theres a few streaks of egg white, dont overfold or the cake will deflate. This video shows how how to beat the egg whites and fold into the liquid batter.  Pour batter into the prepared cake tin, and smooth the top with a rubber spatula.  Bake until the cake pulls away from the sides of the tin and is set in the center, 45 to 50 minutes. Cool completely on a wire rack; remove sides of tin. Best to serve at room temperature, dusted with cacao powder. Top with some berries if preferred.', u'spoonacularSourceUrl': u'https://spoonacular.com/flourless-chocolate-cake-gluten-grain-nut-dairy-free-624423', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}