{u'recipes': [{u'sourceName': u'From Away', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609215-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 609215, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp Linguine with Lemon and Feta', u'diets': [u'pescatarian'], u'pricePerServing': 420.25, u'creditText': u'From Away', u'extendedIngredients': [{u'originalString': u'8 ounces cooked linguine', u'aisle': u'Pasta and Rice', u'name': u'cooked linguine', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10720421, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1 cup crumbled light feta', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'light', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1/4 cup finely chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Juice and zest from a lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 pound shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'6 ounces fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounces'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.fromaway.com/cooking/shrimp-linguine-with-lemon-and-feta', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan or stock pot, combine olive oil, parsley, lemon juice, lemon zest, garlic, and red pepper. When garlic and red pepper become fragrant, add shrimp and cook until opaque, about three minutes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Remove from heat, and add spinach and feta. Stir to combine, then add hot cooked pasta. Toss and serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20421, u'name': u'cooked pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Attems Ramato Pinot Grigio. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pinot Grigio Ramato continues a tradition of the Republic of Venice, since “ramato”, or coppery, was the term referred to Pinot Grigio in contracts. A special vinification practice led to the use of this term: the must remains in contact with the skins for 24 hours and this practice gives the wine a very distinctive coppery hue. Attems Cupra Ramato boasts a rich, fruity bouquet, and opens full and weighty on the palate, with multi-faceted flavors.It is perfect when paired with fatty fish, with delicate or vegetable-based antipasti, the ideal companion to summer dishes, and is delicious as well as an aperitif.', u'title': u'Attems Ramato Pinot Grigio', u'price': u'$13.99', u'id': 452761, u'link': u'https://www.wine.com/product/attems-ramato-pinot-grigio-2014/160114', u'imageUrl': u'https://spoonacular.com/productImages/452761-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'In a large saucepan or stock pot, combine olive oil, parsley, lemon juice, lemon zest, garlic, and red pepper. When garlic and red pepper become fragrant, add shrimp and cook until opaque, about three minutes. Remove from heat, and add spinach and feta. Stir to combine, then add hot cooked pasta. Toss and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-linguine-with-lemon-and-feta-609215', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}