{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'korean'], u'image': u'https://spoonacular.com/recipeImages/212541-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 212541, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick & easy Korean pork', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 238.49, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tbsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'3 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'thumb-sized piece ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1\xbd tbsp Korean chilli paste', u'aisle': u'Ethnic Foods', u'name': u'korean chili paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1016973, u'unit': u'tbsp'}, {u'originalString': u'1 large lettuce, such as Little Gem or iceberg, leaves washed and separated, cooked white short-grain rice, to serve', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'white', u' such as little gem or iceberg, leaves washed and separated, cooked  short-grain rice, to serve', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u''}, {u'originalString': u'2 tbsp mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93830, u'unit': u'tbsp'}, {u'originalString': u'2 Conference pears, peeled and cored', u'aisle': u'Produce', u'name': u'pears', u'metaInformation': [u'cored', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'500g good-quality pork belly, skin and ribs removed (you can ask your butcher to do this), carved into thin slices', u'aisle': u'Meat', u'name': u'pork belly', u'metaInformation': [u'thin', u'canned', u'(you can ask your butcher to do this)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-belly.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 10005, u'unit': u'g'}, {u'originalString': u'3 tbsp Korean soy bean paste', u'aisle': u'Ethnic Foods', u'name': u'seasoned soy bean paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoned-soybean-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 99166, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'1 tsp roasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tsp'}, {u'originalString': u'1 tsp sesame seed', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tsp'}, {u'originalString': u'1 tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'\xbd spring onion, white part only, finely chopped', u'aisle': u'Produce', u'name': u'spring onion', u'metaInformation': [u'white', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'\xbd white onion', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/quick-easy-korean-pork', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put all the ingredients for the marinade in a food processor and blend until smooth. Season to taste, then pour over the sliced pork. You can now cook the meat straight away, but for best results allow it to marinate in the fridge for at least 30 mins.Make the ssamjang sauce (if using) by mixing all of the ingredients together, then set aside.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoned-soybean-paste.jpg', u'id': 99166, u'name': u'seasoned soybean paste'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a griddle pan over a high heat and cook the pork in batches for2-3 mins each side until charred and cooked through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with white rice and a few lettuce leaves. To eat, place a small scoop of rice in a leaf, then a piece of pork, smear with ssamjang sauce (if using) and wrap up.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoned-soybean-paste.jpg', u'id': 99166, u'name': u'seasoned soybean paste'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Korean on the menu? Try pairing with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.  View More', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Put all the ingredients for the marinade in a food processor and blend until smooth. Season to taste, then pour over the sliced pork. You can now cook the meat straight away, but for best results allow it to marinate in the fridge for at least 30 mins.Make the ssamjang sauce (if using) by mixing all of the ingredients together, then set aside.Heat a griddle pan over a high heat and cook the pork in batches for2-3 mins each side until charred and cooked through. Serve with white rice and a few lettuce leaves. To eat, place a small scoop of rice in a leaf, then a piece of pork, smear with ssamjang sauce (if using) and wrap up.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-easy-korean-pork-212541', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}