{u'recipes': [{u'sourceName': u'The Pioneer Woman', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/427966-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 427966, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mexican Layer Dip', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 193.15, u'creditText': u'The Pioneer Woman', u'extendedIngredients': [{u'originalString': u'1 can Black Olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'can'}, {u'originalString': u'1 can Diced Green Chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u'can'}, {u'originalString': u'Ground Cumin, to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'servings'}, {u'originalString': u'1 cup Guacamole', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009037, u'unit': u'cup'}, {u'originalString': u'3/4 cups Monterey Jack Cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'1 cup Pico De Gallo', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pico de gallo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pico-de-gallo.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 27027, u'unit': u'cup'}, {u'originalString': u'1 can Refried Beans', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'refried beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 16202, u'unit': u'can'}, {u'originalString': u'3/4 cups Grated Sharp Cheddar Cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1031009, u'unit': u'cups'}, {u'originalString': u'1 cup Sour Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'Tabasco Sauce, To Taste', u'aisle': u'Condiments', u'name': u'tabasco sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://thepioneerwoman.com/cooking/2009/01/mexican-layer-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Begin by throwing the refried beans into a small pan over medium-low heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}]}, {u'equipment': [], u'step': u'Add several dashes of Tabasco sauce and a small can of (undrained) diced green chilies. Stir well. Next, sprinkle a little bit of ground Cumin.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread the beans on the bottom of a glass bowl or high-sided dish. Over this sprinkle the sharp cheddar. Next, plop your sour cream. And spread it into a single layer, being careful not to disturb the cheese underneath.The next layer is the guacamole.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Spread it over the sour cream. Follow this with a layer of Monterey Jack Cheese and a nice sprinkling of chopped black olives. Lastly, place a generous layer of Pico de Gallo. You can also, if you have the gumption for it, sprinkle some diced jalapenos over top.Enjoy!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pico-de-gallo.jpg', u'id': 27027, u'name': u'pico de gallo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'id': 1059195, u'name': u'black olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}], u'name': u''}], u'aggregateLikes': 1031, u'instructions': u'Begin by throwing the refried beans into a small pan over medium-low heat. Add several dashes of Tabasco sauce and a small can of (undrained) diced green chilies. Stir well. Next, sprinkle a little bit of ground Cumin. Spread the beans on the bottom of a glass bowl or high-sided dish. Over this sprinkle the sharp cheddar. Next, plop your sour cream. And spread it into a single layer, being careful not to disturb the cheese underneath.The next layer is the guacamole. Spread it over the sour cream. Follow this with a layer of Monterey Jack Cheese and a nice sprinkling of chopped black olives. Lastly, place a generous layer of Pico de Gallo. You can also, if you have the gumption for it, sprinkle some diced jalapenos over top.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-layer-dip-427966', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}