{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/695847-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 695847, u'veryPopular': True, u'lowFodmap': False, u'title': u'Italian Wedding Soup', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 301.65, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'4 cups chopped cabbage (about 1/2 small head)', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'small', u'chopped', u'( 1/2 head)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cups'}, {u'originalString': u'1 15-ounce can white beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned white beans', u'metaInformation': [u'white', u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16051, u'unit': u'ounce'}, {u'originalString': u'1 cup chopped carrots (2 medium)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'(2 medium)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup chopped celery (2 medium stalks)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'medium', u'chopped', u'(2 stalks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 large egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 teaspoon crushed fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2018, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup finely chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'8 cups coarsely chopped escarole or thinly sliced kale leaves (about 1 bunch)', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'thinly sliced', u'coarsely chopped', u'( 1 bunch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'8 cups low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1 cup chopped onion (1 medium)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'(1 medium)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup freshly grated Romano cheese', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound ground turkey breast', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'pound'}, {u'originalString': u'1 cup fresh whole-wheat breadcrumbs (see Tip)', u'aisle': u'Pasta and Rice', u'name': u'whole-wheat breadcrumbs', u'metaInformation': [u'fresh', u'whole-wheat', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 99025, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/italian_wedding_soup.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine turkey, breadcrumbs, egg, parsley, garlic, Worcestershire, fennel seeds, pepper and salt in a large bowl. Refrigerate for 10 minutes to firm up. With damp hands, shape the mixture into 32 (1-inch) meatballs (about 1 scant tablespoon each).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 teaspoons oil in a large nonstick skillet over medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the meatballs and cook, turning occasionally, until browned on all sides, 7 to 9 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u'To prepare meatballs'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat 1 tablespoon oil in a soup pot or Dutch oven over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, carrots and celery and cook, stirring, until the onion is translucent, 7 to 9 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add cabbage and cook, stirring, 5 minutes more. Stir in broth, beans, escarole (or kale) and the meatballs and any juice. Bring just to a boil, reduce heat to maintain a simmer and cook, stirring occasionally, until the vegetables are tender, 20 to 25 minutes. Top each portion with 1 tablespoon grated cheese.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}], u'name': u'Remove from the heat and add wine, stirring gently to loosen any browned bits.To prepare soup'}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Felsina Chianti Colli Senesi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 2883, u'instructions': u'To prepare meatballs: Combine turkey, breadcrumbs, egg, parsley, garlic, Worcestershire, fennel seeds, pepper and salt in a large bowl. Refrigerate for 10 minutes to firm up. With damp hands, shape the mixture into 32 (1-inch) meatballs (about 1 scant tablespoon each).Heat 2 teaspoons oil in a large nonstick skillet over medium heat. Add the meatballs and cook, turning occasionally, until browned on all sides, 7 to 9 minutes. Remove from the heat and add wine, stirring gently to loosen any browned bits.To prepare soup: Heat 1 tablespoon oil in a soup pot or Dutch oven over medium heat. Add onion, carrots and celery and cook, stirring, until the onion is translucent, 7 to 9 minutes. Add cabbage and cook, stirring, 5 minutes more. Stir in broth, beans, escarole (or kale) and the meatballs and any juice. Bring just to a boil, reduce heat to maintain a simmer and cook, stirring occasionally, until the vegetables are tender, 20 to 25 minutes. Top each portion with 1 tablespoon grated cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-wedding-soup-695847', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter', u'wedding'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}