{u'recipes': [{u'sourceName': u'Olgas Flavor Factory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/717364-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 717364, u'veryPopular': False, u'lowFodmap': False, u'title': u'One Dish Asparagus and Mushroom Pasta', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 297.91, u'creditText': u'Olgas Flavor Factory', u'extendedIngredients': [{u'originalString': u'1 lb asparagus', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'lb'}, {u'originalString': u'\xbc cup dry porcini mushrooms, optional (rehydrated and minced)', u'aisle': u'Produce;Ethnic Foods', u'name': u'dried porcini mushrooms', u'metaInformation': [u'dry', u'minced', u'(rehydrated and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/porcini-mushrooms-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011268, u'unit': u'cup'}, {u'originalString': u'8 oz. fresh mushrooms, sliced', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'1-2 Tablespoon fresh parsley, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tablespoon'}, {u'originalString': u'fresh parsley, minced, to garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'4 teaspoons oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbc cup Parmesan cheese, finely grated', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 oz uncooked pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'oz'}, {u'originalString': u'salt, ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 cups chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.olgasflavorfactory.com/main-course/one-dish-asparagus-mushroom-pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare all the ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut off the tough, fibrous bottom part of the apparatus and cut the rest of the asparagus into about 2 inch pieces. Chop the onion, slice the fresh mushrooms. Rehydrate the dry mushrooms by covering them with boiling water and letting them soak for about 10 minutes, drain the water and mince the mushrooms.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'fresh mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat 2 teaspoons of oil in a 12 inch nonstick skillet and add the asparagus. Season with salt and pepper and cook for about 2-4 minutes on high heat. Set the asparagus aside in a medium bowl.In the same skillet, add the remaining 2 teaspoons of oil and add the onion, fresh mushrooms, dry mushrooms and minced garlic. Season with salt and pepper. Cook on medium heat for about 8 minutes, until tender and golden brown.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'fresh mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the dry pasta to the skillet and pour in the broth. Bring to a boil then reduce the heat to a simmer. Cook the pasta, covered, 10-12 minutes, until the pasta is cooked through.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Pour in the heavy cream and the Parmesan cheese, mixing to combine.Turn off the heat and add the asparagus to the pasta.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve with fresh parsley and more Parmesan cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'fresh parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23, u'instructions': u'Prepare all the ingredients. Cut off the tough, fibrous bottom part of the apparatus and cut the rest of the asparagus into about 2 inch pieces. Chop the onion, slice the fresh mushrooms. Rehydrate the dry mushrooms by covering them with boiling water and letting them soak for about 10 minutes, drain the water and mince the mushrooms.Heat 2 teaspoons of oil in a 12 inch nonstick skillet and add the asparagus. Season with salt and pepper and cook for about 2-4 minutes on high heat. Set the asparagus aside in a medium bowl.In the same skillet, add the remaining 2 teaspoons of oil and add the onion, fresh mushrooms, dry mushrooms and minced garlic. Season with salt and pepper. Cook on medium heat for about 8 minutes, until tender and golden brown.Add the dry pasta to the skillet and pour in the broth. Bring to a boil then reduce the heat to a simmer. Cook the pasta, covered, 10-12 minutes, until the pasta is cooked through.Pour in the heavy cream and the Parmesan cheese, mixing to combine.Turn off the heat and add the asparagus to the pasta.Serve with fresh parsley and more Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-dish-asparagus-and-mushroom-pasta-717364', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}