{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/203240-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 203240, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mustard Braised Beef', u'diets': [], u'pricePerServing': 684.76, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u"2 1/2 pounds brisket, tied in a round with butcher's twine", u'aisle': u'Meat', u'name': u'beef brisket', u'metaInformation': [u"with butcher's twine"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-brisket.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'liquid', u'id': 13023, u'unit': u'pounds'}, {u'originalString': u'3 cups beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/3 cup Cognac', u'aisle': u'Alcoholic Beverages', u'name': u'cognac', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 10414037, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 cups dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14097, u'unit': u'cups'}, {u'originalString': u'1 tablespoon chopped fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'1 head of garlic, cloves separated, skin on', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'separated', u', skin on'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon ground mustard seeds', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 tablespoons unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 10020081, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1/2 tablespoon whole grain mustard', u'aisle': u'Condiments', u'name': u'whole grain mustard', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoon'}, {u'originalString': u'2 yellow onions, thinly sliced', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/11/mustard-braised-beef-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Rub the brisket all over with the mustard and thyme, wrap in plastic wrap, and refrigerate for two hours to overnight.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Season the beef liberally with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat the olive oil over medium-heat in a Dutch oven.  When the oil shimmers, brown the meat on all sides: this should take about 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Set the meat aside, and add the onions to the pan.  You may need to add an additional tablespoon of olive oil if the pan is too dry.  Saut\xe9 just until slightly softened, about 1 minute.  Deglaze with the Cognac, scraping up all the brown bits from the bottom of the pan.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'id': 10414037, u'name': u'cognac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'4', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the brisket back in the pot, along with the red wine and beef broth.  Bring to a boil, then reduce to a simmer.  Cover the pot, and simmer for 3 hours.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}]}, {u'equipment': [], u'step': u'5', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'After 3 hours, set the meat aside to rest.  Boil the liquid in the Dutch oven vigorously until 4 cups remains.  Lift out the garlic cloves, and squeeze the contents back into the pan.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Pour the liquid, onions, and garlic into the food processor.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'6', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Mash together the butter and flour until well combined, and add along with the two mustards to the food processor.  Whiz until smooth.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'7', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}], u'step': u'Cut the twine off the brisket, and slice into thin slices.', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with the mustard gravy.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 144, u'instructions': u'Procedures                                                                              1                                                                            Rub the brisket all over with the mustard and thyme, wrap in plastic wrap, and refrigerate for two hours to overnight.                                                                                                                            2                                                                            Season the beef liberally with salt and pepper.  Heat the olive oil over medium-heat in a Dutch oven.  When the oil shimmers, brown the meat on all sides: this should take about 12 minutes.                                                                                                                            3                                                                            Set the meat aside, and add the onions to the pan.  You may need to add an additional tablespoon of olive oil if the pan is too dry.  Saut\xe9 just until slightly softened, about 1 minute.  Deglaze with the Cognac, scraping up all the brown bits from the bottom of the pan.                                                                                                                            4                                                                            Place the brisket back in the pot, along with the red wine and beef broth.  Bring to a boil, then reduce to a simmer.  Cover the pot, and simmer for 3 hours.                                                                                                                            5                                                                            After 3 hours, set the meat aside to rest.  Boil the liquid in the Dutch oven vigorously until 4 cups remains.  Lift out the garlic cloves, and squeeze the contents back into the pan.  Pour the liquid, onions, and garlic into the food processor.                                                                                                                            6                                                                            Mash together the butter and flour until well combined, and add along with the two mustards to the food processor.  Whiz until smooth.                                                                                                                            7                                                                            Cut the twine off the brisket, and slice into thin slices.  Serve with the mustard gravy.', u'spoonacularSourceUrl': u'https://spoonacular.com/mustard-braised-beef-203240', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 195, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}