{u'recipes': [{u'sourceName': u'I Wash You Dry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/791989-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 791989, u'veryPopular': False, u'lowFodmap': False, u'title': u'15 Minute Caprese Pasta Skillet', u'diets': [], u'preparationMinutes': 2, u'pricePerServing': 132.75, u'creditText': u'I Wash You Dry', u'extendedIngredients': [{u'originalString': u'8 ounces fresh angel hair pasta', u'aisle': u'Pasta and Rice', u'name': u'angel hair pasta', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angelhair.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10020420, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup fresh, chopped basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'8 ounces grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'ounces'}, {u'originalString': u'kosher salt and fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/2 cup fresh small mozzarella balls (or diced fresh mozzarella)', u'aisle': u'Cheese', u'name': u'mozzarella balls', u'metaInformation': [u'fresh', u'diced', u'small', u'(or mozzarella)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-balls.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93790, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.iwashyoudry.com/2016/06/27/15-minute-caprese-pasta-skillet/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of salted water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a large skillet over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the tomatoes to the skillet. Cook until blistered and beginning to pop open, approximately 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for 1 minute. Stir in the basil, butter and vinegar.  Turn the heat to low and simmer for 5 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Add the pasta to the water and cook according to package directions.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Transfer to the pasta to the skillet using tongs.  Turn the heat off and toss the pasta with the sauce.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the mozzarella and toss to combine. Season with salt and pepper, to taste.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve immediately', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 148, u'instructions': u'Bring a large pot of salted water to a boil. Heat olive oil in a large skillet over medium heat.  Add the tomatoes to the skillet. Cook until blistered and beginning to pop open, approximately 5 minutes.  Add the garlic and cook for 1 minute. Stir in the basil, butter and vinegar.  Turn the heat to low and simmer for 5 minutes.Add the pasta to the water and cook according to package directions.Transfer to the pasta to the skillet using tongs.  Turn the heat off and toss the pasta with the sauce.  Add the mozzarella and toss to combine. Season with salt and pepper, to taste.Serve immediately', u'spoonacularSourceUrl': u'https://spoonacular.com/15-minute-caprese-pasta-skillet-791989', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}