{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507888-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 507888, u'veryPopular': True, u'lowFodmap': False, u'title': u'Paska Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 150, u'pricePerServing': 218.46, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 egg yolk, beaten with 1 tablespoon water', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'with 1 tablespoon water', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'5 egg yolks, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'7 to 8 cups all-purpose flour, divided', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup golden raisins (optional)', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup unsalted butter, melted and cooled to room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'2 cups whole milk, warmed to 110 degrees F', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 cakes fresh yeast (or substitute 2 packets active dry yeast - 4\xbd teaspoons)', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'fresh', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.browneyedbaker.com/2013/03/27/paska-bread-ukrainian-or-polish-easter-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 67, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, stir the yeast into the warm milk to dissolve and let sit for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add 3 cups flour and mix with a wooden spoon. Cover the bowl with plastic wrap and place in a warm, draft-free area until the dough has doubled in size. 2. If you choose to use the golden raisins, soak the raisins for 30 minutes in warm water, then drain and pat dry with paper towels before using.3.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'id': 9297, u'name': u'golden raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the dough to the bowl of an electric mixer and add the sugar, melted butter, egg yolks, salt, vanilla, golden raisins and 4 cups of flour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'id': 9297, u'name': u'golden raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Mix on low to medium-low speed until the dough comes together, adding more flour a tablespoon at a time, if needed. Turn the dough out onto a lightly floured surface and knead until it forms a smooth dough, about 5 minutes, again adding more flour a tablespoons at a time, if needed. Divide the dough into three equal sections and shape into loaves, then transfer to three 8x4-inch greased loaf pans. Cover lightly with plastic wrap and let rise until doubled in size.4. Preheat oven to 400 degrees F.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Brush the tops of the loaves with the egg wash.5.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake the loaves for 10 minutes, then reduce the temperature to 350 degrees F and bake for an additional 40 minutes, or until the loaves are golden brown. If the loaves are beginning to get too dark, place a tented or loose piece of foil over top. Allow the bread to cool for about 20 minutes in the pans, then turn the loaves onto a wire rack to cool completely. Wrap leftover bread in plastic wrap and keep at room temperature for up to 3 days.Notes:This bread freezes well. Wrap baked loaves in plastic wrap and then in foil and store in the freezer. Alternatively, wrap loaves in plastic wrap then place in airtight freezer bags.If you are using dark, non-stick loaf pans, be sure to reduce the oven temperature by 25 degrees F.', u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 716, u'instructions': u'1. In a large bowl, stir the yeast into the warm milk to dissolve and let sit for 5 minutes. Add 3 cups flour and mix with a wooden spoon. Cover the bowl with plastic wrap and place in a warm, draft-free area until the dough has doubled in size. 2. If you choose to use the golden raisins, soak the raisins for 30 minutes in warm water, then drain and pat dry with paper towels before using.3. Transfer the dough to the bowl of an electric mixer and add the sugar, melted butter, egg yolks, salt, vanilla, golden raisins and 4 cups of flour. Mix on low to medium-low speed until the dough comes together, adding more flour a tablespoon at a time, if needed. Turn the dough out onto a lightly floured surface and knead until it forms a smooth dough, about 5 minutes, again adding more flour a tablespoons at a time, if needed. Divide the dough into three equal sections and shape into loaves, then transfer to three 8x4-inch greased loaf pans. Cover lightly with plastic wrap and let rise until doubled in size.4. Preheat oven to 400 degrees F. Brush the tops of the loaves with the egg wash.5. Bake the loaves for 10 minutes, then reduce the temperature to 350 degrees F and bake for an additional 40 minutes, or until the loaves are golden brown. If the loaves are beginning to get too dark, place a tented or loose piece of foil over top. Allow the bread to cool for about 20 minutes in the pans, then turn the loaves onto a wire rack to cool completely. Wrap leftover bread in plastic wrap and keep at room temperature for up to 3 days.Notes:This bread freezes well. Wrap baked loaves in plastic wrap and then in foil and store in the freezer. Alternatively, wrap loaves in plastic wrap then place in airtight freezer bags.If you are using dark, non-stick loaf pans, be sure to reduce the oven temperature by 25 degrees F.', u'spoonacularSourceUrl': u'https://spoonacular.com/paska-bread-507888', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 210, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}