{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/551926-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 551926, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kung Pao Chicken Skewers', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 40, u'pricePerServing': 237.07, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u'2 Tb. Chinese black vinegar (or rice vinegar)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'black vinegar', u'metaInformation': [u'black', u'chinese', u'(or rice vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012053, u'unit': u'Tb'}, {u'originalString': u'3 Tb. brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tb'}, {u'originalString': u'1 Tb. chile-garlic sauce (or sriracha)', u'aisle': u'Ethnic Foods', u'name': u'chile garlic sauce', u'metaInformation': [u'(or sriracha)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'liquid', u'id': 93749, u'unit': u'Tb'}, {u'originalString': u'1 lb. cremini mushrooms', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'lb'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 tsp. grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped green onions for garnish', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 whole pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'2 tsp. sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tsp'}, {u'originalString': u'1 1/2 lb. boneless, skinless chicken breast', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.aspicyperspective.com/2012/06/kung-pao-chicken-skewers.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Soak 12-15 wooden skewers in water for at least 30 minutes. Preheat the grill to medium heat.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place the first seven ingredients in gallon zip bag. Shake to combine.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Cut the chicken into 1 - 1 1/2 inch chunks and place in the bag to marinade for 30 minutes.Meanwhile, cut the pineapple into 1 - 1 1/2 inch chunks.Then carefully slide the chicken, mushrooms and pineapple chunks on the skewers.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the skewers on the grill and brush with the remaining marinade.Grill for 5 minutes per side, and brush with marinade again when you flip the skewers.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Serve warm with Bush's Bourbon and Brown Sugar Grillin' Beans and a sprinkle of fresh green onions.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 340, u'instructions': u"Soak 12-15 wooden skewers in water for at least 30 minutes. Preheat the grill to medium heat.Place the first seven ingredients in gallon zip bag. Shake to combine.Cut the chicken into 1 - 1 1/2 inch chunks and place in the bag to marinade for 30 minutes.Meanwhile, cut the pineapple into 1 - 1 1/2 inch chunks.Then carefully slide the chicken, mushrooms and pineapple chunks on the skewers.Place the skewers on the grill and brush with the remaining marinade.Grill for 5 minutes per side, and brush with marinade again when you flip the skewers. Serve warm with Bush's Bourbon and Brown Sugar Grillin' Beans and a sprinkle of fresh green onions.", u'spoonacularSourceUrl': u'https://spoonacular.com/kung-pao-chicken-skewers-551926', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}