{u'recipes': [{u'sourceName': u'Buns in My Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575802-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 575802, u'veryPopular': True, u'lowFodmap': False, u'title': u'Oven Fried Spicy Ranch Chicken Strips', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 185.41, u'creditText': u'Buns in My Oven', u'extendedIngredients': [{u'originalString': u'8 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1-1/4 pounds chicken breast tenders', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'pounds'}, {u'originalString': u'1 tablespoon milk or bottled hot sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'tablespoon'}, {u'originalString': u'1-1/2 cups panko bread crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cups'}, {u'originalString': u'1 cup Hidden Valley Spicy Ranch Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.bunsinmyoven.com/2014/04/01/oven-fried-spicy-ranch-chicken-strips/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the butter to a large rimmed baking sheet and place in the oven until the butter has melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the pan from the oven and set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the ranch dressing to a pie plate and thin it out with 1 tablespoon of milk or hot sauce, depending on how spicy you want things. Stir to combine.In a separate pie plate, add the panko bread crumbs.Coat each piece of chicken in the ranch dressing and then the bread crumbs, pressing so they adhere to the chicken.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place each piece of chicken on the baking sheet in the melted butter.Return to the oven and bake for 8 minutes, flip each piece of chicken over, and continue baking for about 10 minutes or until the chicken is cooked through.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 15647, u'instructions': u'Heat oven to 400 degrees. Add the butter to a large rimmed baking sheet and place in the oven until the butter has melted. Remove from the pan from the oven and set aside.Add the ranch dressing to a pie plate and thin it out with 1 tablespoon of milk or hot sauce, depending on how spicy you want things. Stir to combine.In a separate pie plate, add the panko bread crumbs.Coat each piece of chicken in the ranch dressing and then the bread crumbs, pressing so they adhere to the chicken. Place each piece of chicken on the baking sheet in the melted butter.Return to the oven and bake for 8 minutes, flip each piece of chicken over, and continue baking for about 10 minutes or until the chicken is cooked through.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-fried-spicy-ranch-chicken-strips-575802', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}