{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/250513-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 250513, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Panna Cotta with Almond Brittle', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 238.42, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'2 Teaspoons Agar Agar Powder', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11663, u'unit': u'Teaspoons'}, {u'originalString': u'1 cup Sliced, Toasted Almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'toasted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons Light Corn Syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19350, u'unit': u'Tablespoons'}, {u'originalString': u'2 Tablespoons Cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tablespoons'}, {u'originalString': u'2/3 cup Plain Non-Dairy Milk (your choice of type)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [u'plain', u'(your choice of type)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'Fresh Mint Leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'Leave', u'unitShort': u'Leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'Leaves'}, {u'originalString': u'1 cup Granulated Sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/8 Teaspoon Ground Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2010, u'unit': u'Teaspoon'}, {u'originalString': u'Orange Supremes', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9200, u'unit': u'servings'}, {u'originalString': u'1 Teaspoon Orange Zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'Teaspoon'}, {u'originalString': u'Pomegranate Arils', u'aisle': u'Produce', u'name': u'pomegranate arils', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9286, u'unit': u'servings'}, {u'originalString': u'2 Teaspoons Rose Water', u'aisle': u'Gourmet', u'name': u'rose water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rose-water.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10411111, u'unit': u'Teaspoons'}, {u'originalString': u'Pinch Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3 Bags Hibiscus Tea', u'aisle': u'Tea and Coffee', u'name': u'tea', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'Bags', u'unitShort': u'Bags', u'amount': 3.0, u'consistency': u'solid', u'id': 14355, u'unit': u'Bags'}, {u'originalString': u'1/2 Teaspoon Vanilla Extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'Teaspoon'}, {u'originalString': u'2/3 cup Vegan “Sour Cream”', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vegan sour cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 93608, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tablespoons'}, {u'originalString': u'2 6-Ounce Containers Greek-Style Coconut Yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'greek-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'Ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'Ounce'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/vegan-panna-cotta-with-almond-brittle', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Lightly grease six 3-1/2-Inch fluted mini tart or brioche molds and place them on a sheet pan for easier maneuvering. Set aside.In a small saucepan, vigorously whisk together the agar, “milk,” and sugar until there are no lumps remaining. Set the pan over medium-low heat, and gently whisk until the mixture begins to bubble and thicken. Take the pan off the stove to stir in both the “sour cream” and coconut yogurt, mixing until smooth, and then return it to the heat very briefly. Cook the mixture just until bubbles begin to slowly break on the surface, whisking the whole time.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 11663, u'name': u'agar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add in the rose water and vanilla, whisk to incorporate, and quickly transfer the contents of the saucepan to your prepared molds. Gently tap each one on the counter to knock out any air bubbles before smoothing out the tops with a spatula.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rose-water.jpg', u'id': 10411111, u'name': u'rose water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Let cool completely at room temperature before thoroughly chilling.For the hibiscus sauce, plunk the tea bags into the water in a small saucepan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Place it on the stove over medium heat, and bring to a boil. Immediately turn off the heat and cover, allowing the tea to steep for 20 to 30 minutes. Once deeply rose red in hue, remove the tea bags and allow the excess liquid to drip out, but do not squeeze them- This will cloud the mixture. Separately, stir together the sugar, orange zest, and cornstarch until thoroughly combined, and add these dry goods into the saucepan. Return it to the heat, and cook, stirring occasionally, until the sugar is dissolved and the liquid bubbling and fully thickened.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'tea'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool before chilling in the fridge.To make the almond brittle, begin by combining the sugar, water, corn syrup, cinnamon, and salt in a medium saucepan over moderate heat. Resist the urge to stir, and gently swirl the pan to mix the contents instead. Bring the mixture up to a boil, and continue to cool until the sugar caramelizes and turns a pale amber color. Meanwhile, set out a silpat or piece of parchment paper nearby where the brittle can come to rest. Once the sugar syrup has reached the right shade of golden brown, quickly stir in the sliced almonds to coat them evenly in the mixture, and waste no time in pouring everything onto your prepared silpat or parchment. Smooth out the brittle into as thin a layer as possible.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let cool completely before breaking it into pieces.To serve, spoon about 1/4 – 1/3 cup of the hibiscus sauce onto the plate, and turn out one panna cotta on top. Wedge a piece of the almond brittle into the crest of the panna cotta, fan out three citrus surpremes alongside, and sprinkle pomegranate arils on top. Finish it all off with a few mint leaves to garnish. Repeat for the remaining plates.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'aggregateLikes': 70, u'instructions': u'Lightly grease six 3-1/2-Inch fluted mini tart or brioche molds and place them on a sheet pan for easier maneuvering. Set aside.In a small saucepan, vigorously whisk together the agar, “milk,” and sugar until there are no lumps remaining. Set the pan over medium-low heat, and gently whisk until the mixture begins to bubble and thicken. Take the pan off the stove to stir in both the “sour cream” and coconut yogurt, mixing until smooth, and then return it to the heat very briefly. Cook the mixture just until bubbles begin to slowly break on the surface, whisking the whole time. Add in the rose water and vanilla, whisk to incorporate, and quickly transfer the contents of the saucepan to your prepared molds. Gently tap each one on the counter to knock out any air bubbles before smoothing out the tops with a spatula. Let cool completely at room temperature before thoroughly chilling.For the hibiscus sauce, plunk the tea bags into the water in a small saucepan. Place it on the stove over medium heat, and bring to a boil. Immediately turn off the heat and cover, allowing the tea to steep for 20 to 30 minutes. Once deeply rose red in hue, remove the tea bags and allow the excess liquid to drip out, but do not squeeze them- This will cloud the mixture. Separately, stir together the sugar, orange zest, and cornstarch until thoroughly combined, and add these dry goods into the saucepan. Return it to the heat, and cook, stirring occasionally, until the sugar is dissolved and the liquid bubbling and fully thickened. Let cool before chilling in the fridge.To make the almond brittle, begin by combining the sugar, water, corn syrup, cinnamon, and salt in a medium saucepan over moderate heat. Resist the urge to stir, and gently swirl the pan to mix the contents instead. Bring the mixture up to a boil, and continue to cool until the sugar caramelizes and turns a pale amber color. Meanwhile, set out a silpat or piece of parchment paper nearby where the brittle can come to rest. Once the sugar syrup has reached the right shade of golden brown, quickly stir in the sliced almonds to coat them evenly in the mixture, and waste no time in pouring everything onto your prepared silpat or parchment. Smooth out the brittle into as thin a layer as possible. Let cool completely before breaking it into pieces.To serve, spoon about 1/4 – 1/3 cup of the hibiscus sauce onto the plate, and turn out one panna cotta on top. Wedge a piece of the almond brittle into the crest of the panna cotta, fan out three citrus surpremes alongside, and sprinkle pomegranate arils on top. Finish it all off with a few mint leaves to garnish. Repeat for the remaining plates.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-panna-cotta-with-almond-brittle-250513', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}