{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/449886-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 449886, u'veryPopular': False, u'lowFodmap': False, u'title': u"Peanut Lover's Pie", u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 106.35, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'7 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup caramel ice cream topping', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel ice cream topping', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19364, u'unit': u'cup'}, {u'originalString': u'3 pints chocolate ice cream, softened', u'aisle': u'Frozen', u'name': u'chocolate ice cream', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-ice-cream.png', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 3.0, u'consistency': u'liquid', u'id': 19270, u'unit': u'pints'}, {u'originalString': u'1-1/2 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'1 cup plus 1 tablespoon peanut butter, divided', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'3/4 cup coarsely chopped peanut butter cups, divided', u'aisle': u'Sweet Snacks', u'name': u'peanut butter cups', u'metaInformation': [u'divided', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19150, u'unit': u'cup'}, {u'originalString': u'6 tablespoons honey-roasted peanuts, divided', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted peanuts', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 16092, u'unit': u'tablespoons'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/peanut-lover-s-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Chop 1 tablespoon of peanuts; set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the remaining peanuts in a food processor; cover and process until ground. In a small bowl, combine the ground nuts, cracker crumbs and butter. Press onto the bottom and up the sides of an ungreased 9-in. pie plate. Freeze until firm, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the ice cream and 1 cup peanut butter until blended. Spoon half into crust. Return remaining ice cream mixture to the freezer. Cover and freeze pie until almost firm, about 1 hour. Sprinkle with about two-thirds of the chopped peanut butter cups. Freeze for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Meanwhile, resoften remaining ice cream mixture.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread over peanut butter cups (pie will be very full). Cover and freeze for at least 2 hours or until almost firm. Sprinkle with chopped peanuts and remaining chopped peanut butter cups. Cover and freeze until firm, about 1 hour longer.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}]}, {u'equipment': [], u'step': u'Remove from the freezer 15 minutes before serving.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Combine caramel topping and remaining peanut butter; drizzle some over dessert plates. Top with a piece of pie; drizzle with remaining caramel mixture.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}], u'name': u''}], u'aggregateLikes': 105, u'instructions': u"Directions                                                                                Chop 1 tablespoon of peanuts; set aside. Place the remaining peanuts in a food processor; cover and process until ground. In a small bowl, combine the ground nuts, cracker crumbs and butter. Press onto the bottom and up the sides of an ungreased 9-in. pie plate. Freeze until firm, about 30 minutes.                                                                                           In a large bowl, combine the ice cream and 1 cup peanut butter until blended. Spoon half into crust. Return remaining ice cream mixture to the freezer. Cover and freeze pie until almost firm, about 1 hour. Sprinkle with about two-thirds of the chopped peanut butter cups. Freeze for 30 minutes.                                                                                           Meanwhile, resoften remaining ice cream mixture. Spread over peanut butter cups (pie will be very full). Cover and freeze for at least 2 hours or until almost firm. Sprinkle with chopped peanuts and remaining chopped peanut butter cups. Cover and freeze until firm, about 1 hour longer.                                                                                           Remove from the freezer 15 minutes before serving. Combine caramel topping and remaining peanut butter; drizzle some over dessert plates. Top with a piece of pie; drizzle with remaining caramel mixture.                                        Yield: 8 servings.                                                                                                                         Originally published as Peanut Lover's Pie in  Quick CookingJuly/August 2005, p23                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 729 calories, 47 g fat (18 g saturated fat), 61 mg cholesterol, 565 mg sodium, 69 g carbohydrate, 5 g fiber, 17 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-lovers-pie-449886', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}