{u'recipes': [{u'sourceName': u'Betty Crocker', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/178488-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 178488, u'veryPopular': False, u'lowFodmap': False, u'title': u'Game Day Cupcakes', u'diets': [u'dairy free'], u'preparationMinutes': 35, u'pricePerServing': 157.17, u'creditText': u'Betty Crocker', u'extendedIngredients': [{u'originalString': u'24 milk chocolate covered almonds (from 3 oz box)', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [u'(from 3 oz box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 19081, u'unit': u''}, {u'originalString': u"1 box Betty Crocker\xae SuperMoist\xae devil's food cake mix", u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [u'betty crocker\xae', u'supermoist\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18087, u'unit': u'box'}, {u'originalString': u'Betty Crocker\xae gel food color', u'aisle': u'Baking', u'name': u'food color', u'metaInformation': [u'betty crocker\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'1 container Betty Crocker\xae Whipped fluffy white frosting', u'aisle': u'Baking', u'name': u'frosting', u'metaInformation': [u'white', u'betty crocker\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'solid', u'id': 19230, u'unit': u'container'}, {u'originalString': u'4 rolls Betty Crocker\xae Fruit Roll-Ups\xae chewy fruit snack, any flavor (from 5-oz box)', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'betty crocker\xae', u'(from 5-oz box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9431, u'unit': u''}, {u'originalString': u'1 tube (4.25 oz) Betty Crocker\xae white decorating icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [u'white', u'betty crocker\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.25, u'consistency': u'solid', u'id': 10019230, u'unit': u'oz'}, {u'originalString': u'24 thin pretzel sticks', u'aisle': u'Savory Snacks', u'name': u'pretzel sticks', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzel-sticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 10119047, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'https://www.bettycrocker.com/recipes/game-day-cupcakes/454f3f8c-ce29-495d-b663-53e5b77b8572', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350\xb0F (325\xb0F for dark or nonstick pans).', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place paper baking cup in each of 24 regular-size muffin pans.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Make and bake cake as directed on box for 24 cupcakes. Cool in pans 10 minutes; remove from pans to cooling racks. Cool completely, about 30 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To create your favorite team colors, divide 3/4 cup frosting between two small bowls.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add desired food color to each bowl, and stir until thoroughly blended.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}]}, {u'equipment': [], u'step': u'Spread frosting over cupcakes; sprinkle with stars. For footballs, pipe laces on almonds with decorator frosting.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Cut each fruit snack into 6 triangles. Wrap each triangle around one end of each pretzel for flag.  Decorate each cupcake with a football and flag. Store loosely covered.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cupcakes. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'1                               Heat oven to 350\xb0F (325\xb0F for dark or nonstick pans). Place paper baking cup in each of 24 regular-size muffin pans.                                                          2                               Make and bake cake as directed on box for 24 cupcakes. Cool in pans 10 minutes; remove from pans to cooling racks. Cool completely, about 30 minutes.                                                          3                               To create your favorite team colors, divide 3/4 cup frosting between two small bowls. Add desired food color to each bowl, and stir until thoroughly blended.  Spread frosting over cupcakes; sprinkle with stars. For footballs, pipe laces on almonds with decorator frosting. Cut each fruit snack into 6 triangles. Wrap each triangle around one end of each pretzel for flag.  Decorate each cupcake with a football and flag. Store loosely covered.', u'spoonacularSourceUrl': u'https://spoonacular.com/game-day-cupcakes-178488', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}