{u'recipes': [{u'sourceName': u'Eggless Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/246984-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 246984, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Whole Wheat, Oatmeal, Chocolate Chip Cookies', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 174.32, u'creditText': u'Eggless Cooking', u'extendedIngredients': [{u'originalString': u'whole wheat flour - all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 20081, u'unit': u'servings'}, {u'originalString': u'1/4 cup almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'almond butter - peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 12195, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'brown sugar - white sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 19334, u'unit': u'servings'}, {u'originalString': u'1/4 cup vegan butter substitute, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter substitute', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 4073, u'unit': u'cup'}, {u'originalString': u'1/4 cup melted coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'vegan butter - dairy butter or solidified coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'servings'}, {u'originalString': u'coconut oil - any other neutral flavor oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'neutral'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'servings'}, {u'originalString': u'1/4 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1 tablespoon ener-g egg replacer (What is ener-g?)', u'aisle': u'Health Foods;Baking', u'name': u'Ener-G egg replacer', u'metaInformation': [u'(What is ener-g?)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93658, u'unit': u'tablespoon'}, {u'originalString': u'add ins - any dried fruit, nuts, chocolate chips', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 9431, u'unit': u'servings'}, {u'originalString': u'1/4 cup chopped pistachios', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'1/2 cup quick cooking oats', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8402, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup vegan chocolate chips', u'aisle': u'Health Foods;Baking', u'name': u'vegan chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 98848, u'unit': u'cup'}, {u'originalString': u'5 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20080, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.egglesscooking.com/2012/12/10/vegan-whole-wheat-oatmeal-chocolate-chip-cookies-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F/180C for 15 minutes.  Beat together the egg replacer powder and water; set aside.In a medium bowl stir together the dry ingredients.In a large bowl beat together the brown sugar, vegan butter substitute and oil.  Once it is smooth add the almond butter, ener-g mix and vanilla extract and beat well.Fold in the flour mix and combine well.  Stir in the chocolate chips, cranberries and pistachios.Scoop out 1 tablespoonful of dough for each cookie and place it on a baking sheet 2 inches apart.  Flatten the dough lightly with fingers.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-butter.jpg', u'id': 12195, u'name': u'almond butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Bake for 12-14 minutes, or until cookies are golden brown and dry on top.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the cookie sheet out of the oven and leave the cookies on it for another 5 minutes before transferring to a wire rack to cool completely.  Store the cookies in an air tight container.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 49, u'instructions': u'Preheat oven to 350F/180C for 15 minutes.  Beat together the egg replacer powder and water; set aside.In a medium bowl stir together the dry ingredients.In a large bowl beat together the brown sugar, vegan butter substitute and oil.  Once it is smooth add the almond butter, ener-g mix and vanilla extract and beat well.Fold in the flour mix and combine well.  Stir in the chocolate chips, cranberries and pistachios.Scoop out 1 tablespoonful of dough for each cookie and place it on a baking sheet 2 inches apart.  Flatten the dough lightly with fingers.Bake for 12-14 minutes, or until cookies are golden brown and dry on top.  Remove the cookie sheet out of the oven and leave the cookies on it for another 5 minutes before transferring to a wire rack to cool completely.  Store the cookies in an air tight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-whole-wheat-oatmeal-chocolate-chip-cookies-246984', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 42, u'servings': 30, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}