{u'recipes': [{u'sourceName': u'Mother Rimmy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/531599-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 531599, u'veryPopular': False, u'lowFodmap': False, u'title': u'Egg White Frittata with Kale and Mushrooms', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'pricePerServing': 105.21, u'creditText': u'Mother Rimmy', u'extendedIngredients': [{u'originalString': u'12 large egg whites, whipped with a whisk, or 10 ounces of commercial eggs whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'with a whisk,', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'\xbd tablespoon fresh thyme, minced', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'2 cups kale, finely chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'2 cups mushrooms, finely chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'\xbd cup onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'3 ea Laughing Cow Cheese', u'aisle': u'?', u'name': u'ea laughing cow cheese', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'unit': u''}], u'healthScore': 92.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://motherrimmy.com/easy-egg-white-frittata-with-kale-and-mushrooms-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.Preheat a medium sized non-stick skillet over medium heat and spray with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions, mushrooms and kale. Cook for 5 minutes until tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat and add Laughing Cow cheese and thyme. Stir to melt cheese into the vegetables, then spread evenly over the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add egg whites and season with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Bake for 15 - 20 minutes until eggs are cooked through.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frittata works really well with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Banfi Rosa Regale Brachetto with a 4.8 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'Festive cranberry in color with an aromatic bouquet with hints of raspberries, strawberries and rose. A fresh raspberry taste, with crisp acidity, enticing the palate with an initial softness, graduating to a round and luscious finish. View More', u'title': u'Banfi Rosa Regale Brachetto', u'price': u'$20.99', u'id': 433356, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-2015/152879', u'imageUrl': u'https://spoonacular.com/productImages/433356-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Preheat oven to 350 degrees.Preheat a medium sized non-stick skillet over medium heat and spray with cooking spray.Add onions, mushrooms and kale. Cook for 5 minutes until tender.Remove from heat and add Laughing Cow cheese and thyme. Stir to melt cheese into the vegetables, then spread evenly over the pan. Add egg whites and season with salt and pepper.Bake for 15 - 20 minutes until eggs are cooked through.', u'spoonacularSourceUrl': u'https://spoonacular.com/egg-white-frittata-with-kale-and-mushrooms-531599', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}