{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522717-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 522717, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp and broccoli stir fry', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 284.02, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u"1 tsp. of chili oil (available in supermarkets) or a couple of finely sliced bird's eye chilis", u'aisle': u'Produce;Ethnic Foods', u'name': u"bird's eye chilis", u'metaInformation': [u'finely sliced', u'(available in supermarkets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11670, u'unit': u'tsp'}, {u'originalString': u'1 head of broccoli, trimmed and broken into florets', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11090, u'unit': u'head'}, {u'originalString': u'4 cloves of garlic. minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'a small piece of ginger, grated', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1 tbsp. of oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'tbsp'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'a drizzle of sesame seed oil', u'aisle': u'Ethnic Foods', u'name': u'sesame seed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'servings'}, {u'originalString': u'250 g. of large shrimps, shelled and de-veined', u'aisle': u'Seafood', u'name': u'shrimps', u'metaInformation': [u'shelled', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'g'}, {u'originalString': u'sugar, to taste', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'about 1 tsp. of corn or tapioca starch', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93696, u'unit': u'tsp'}, {u'originalString': u'2 tbsps. of vegetable cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsps'}, {u'originalString': u'1/3 c. of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14412, u'unit': u'c'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://casaveneracion.com/shrimp-and-broccoli-stir-fry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Pre-cook the broccoli. Boil about four cups of water in a pan. Throw in the broccoli florets. When the water boils once more, turn off the heat and scoop out the broccoli. Dump the florets into a bowl of iced water. Stir a little, let them get really cold then drain.Set the heat on low and pour the cooking oil in a wok.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 10011090, u'name': u'broccoli florets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the garlic and ginger. Cook gently for a couple of minutes to allow them to flavor the oil.Turn up the heat. When the oil is smoking, add the shrimps. Stir fry just until the shrimps change color.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the broccoli.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Pour in the sauce. Stir until the sauce thickens and is no longer cloudy.Tip the contents of the wok onto a serving platter and serve the shrimp and broccoli stir fry immediately.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is King Estate Signature Collection Pinot Gris. It has 4.3 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish.', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'InstructionsPre-cook the broccoli. Boil about four cups of water in a pan. Throw in the broccoli florets. When the water boils once more, turn off the heat and scoop out the broccoli. Dump the florets into a bowl of iced water. Stir a little, let them get really cold then drain.Set the heat on low and pour the cooking oil in a wok. Add the garlic and ginger. Cook gently for a couple of minutes to allow them to flavor the oil.Turn up the heat. When the oil is smoking, add the shrimps. Stir fry just until the shrimps change color. Add the broccoli. Pour in the sauce. Stir until the sauce thickens and is no longer cloudy.Tip the contents of the wok onto a serving platter and serve the shrimp and broccoli stir fry immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-and-broccoli-stir-fry-522717', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}