{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/309817-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 309817, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caesar Salad', u'diets': [u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 256.81, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 whole anchovy fillets', u'aisle': u'Canned and Jarred;Seafood', u'name': u'anchovy', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 15001, u'unit': u'fillet'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 loaf crusty French bread', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loafs', u'unitShort': u'loaf', u'amount': 0.5, u'consistency': u'solid', u'id': 10018029, u'unit': u'loaf'}, {u'originalString': u'2 tablespoons (and up to 3 tablespoons) Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [u'(and up to 3 tablespoons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves fresh garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 whole lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'whole', u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/4 cup freshly grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Fresh Parmesan wedge', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'Hearts of romaine lettuce', u'aisle': u'Produce', u'name': u'romaine hearts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10011251, u'unit': u'servings'}, {u'originalString': u'1 dash salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dash'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 32.0, u'imageType': u'jpeg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/caesar-salad-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place the anchovies into a blender or food processor. Throw in the Dijon mustard, vinegar, Worcestershire, garlic and lemon juice. Pulse the processor or blend on low speed for several seconds. Scrape down the sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'With the food processor or blender on, drizzle the olive oil into the mixture in a small stream. Scrape down the sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the Parmesan, salt and a generous grind of black pepper. Pulse the whole thing together and mix until thoroughly combined. Refrigerate the dressing for a few hours (it just gets better!) before using it on the salad.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'For the croutons: Slice the bread into thick slices and cut them into 1-inch cubes. Throw them onto a baking sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a small saucepan or skillet over low heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Crush-but don't chop-the garlic and add them to the oil. Use a spoon to move the garlic around in the pan. After 3 to 5 minutes, turn off the heat and remove the garlic from the pan.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Slowly drizzle the olive oil over the bread cubes.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix together with your hands, and then sprinkle lightly with salt. Toss and cook in the pan until golden brown and crisp. (', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add a little butter for more flavor!)', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/peeler.png', u'id': 404693, u'name': u'peeler'}], u'step': u'For the salad: Wash and dry the hearts of romaine lettuce. Leave them whole. Use a vegetable peeler and shave off large, thin slices of Parmesan.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'id': 10011251, u'name': u'romaine hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Drizzle about half of the dressing over the top of the hearts. Throw in a good handful of the Parmesan shavings. Give it a good initial toss, just so you can evaluate how much more dressing you need.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Add more dressing and Parmesan to taste.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Add the cooled croutons. Toss gently.', u'number': 13, u'ingredients': []}], u'name': u'For the dressing'}], u'aggregateLikes': 14, u'instructions': u"Watch how to make this recipe.                    For the dressing: Place the anchovies into a blender or food processor. Throw in the Dijon mustard, vinegar, Worcestershire, garlic and lemon juice. Pulse the processor or blend on low speed for several seconds. Scrape down the sides.                          With the food processor or blender on, drizzle the olive oil into the mixture in a small stream. Scrape down the sides. Add the Parmesan, salt and a generous grind of black pepper. Pulse the whole thing together and mix until thoroughly combined. Refrigerate the dressing for a few hours (it just gets better!) before using it on the salad.                          For the croutons: Slice the bread into thick slices and cut them into 1-inch cubes. Throw them onto a baking sheet.                          Heat the olive oil in a small saucepan or skillet over low heat.                          Crush-but don't chop-the garlic and add them to the oil. Use a spoon to move the garlic around in the pan. After 3 to 5 minutes, turn off the heat and remove the garlic from the pan.                          Slowly drizzle the olive oil over the bread cubes. Mix together with your hands, and then sprinkle lightly with salt. Toss and cook in the pan until golden brown and crisp. (Add a little butter for more flavor!)                          For the salad: Wash and dry the hearts of romaine lettuce. Leave them whole. Use a vegetable peeler and shave off large, thin slices of Parmesan.                          Drizzle about half of the dressing over the top of the hearts. Throw in a good handful of the Parmesan shavings. Give it a good initial toss, just so you can evaluate how much more dressing you need.                          Add more dressing and Parmesan to taste. Add the cooled croutons. Toss gently.", u'spoonacularSourceUrl': u'https://spoonacular.com/caesar-salad-309817', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}