{u'recipes': [{u'sourceName': u'Dinners Dishes and Desserts', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/489687-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 489687, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti with Kale & Sausage #SundaySupper', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 104.72, u'creditText': u'Dinners Dishes and Desserts', u'extendedIngredients': [{u'originalString': u'12 oz bulk Italian Sausage (I used Hot)', u'aisle': u'Meat', u'name': u'bulk pork sausage', u'metaInformation': [u'italian', u'hot', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 7063, u'unit': u'oz'}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 large bunch kale, trimmed and chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'large', u'trimmed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11233, u'unit': u'bunch'}, {u'originalString': u'\xbd cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pound spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'pound'}, {u'originalString': u'\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://dinnersdishesanddesserts.com/spaghetti-with-kale-sausage-sundaysupper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook pasta according to the package directions.In a large skillet over medium heat, brown the sausage until fully cooked, about 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add water and cream, simmer until it is reduced by half (about 5 minutes).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the kale, and toss until it is wilted.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Add the pasta, and toss to combine. Sprinkle with cheese to serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 80, u'instructions': u'Cook pasta according to the package directions.In a large skillet over medium heat, brown the sausage until fully cooked, about 7 minutes. Add water and cream, simmer until it is reduced by half (about 5 minutes). Add the kale, and toss until it is wilted. Add the pasta, and toss to combine. Sprinkle with cheese to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-with-kale-sausage-sundaysupper-489687', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}