{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/534193-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 534193, u'veryPopular': False, u'lowFodmap': False, u'title': u'Steamed Pork Bun', u'diets': [], u'preparationMinutes': 240, u'pricePerServing': 19.02, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'2 \xbc teaspoon active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon baking powder mixed with 1 \xbd tablespoon water', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [u'mixed', u'with 1 \xbd tablespoon water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'12 tablespoons chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'tablespoons'}, {u'originalString': u'4 cups All-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbd cup extra-fine granulated sugar (Pulse in a grinder for 30 seconds)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'for 30 seconds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'tablespoons'}, {u'originalString': u'4 tablespoons peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'tablespoons'}, {u'originalString': u'2 cups barbecue pork (char siu), \xbc inch dice', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [u'(char siu)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10010219, u'unit': u'cups'}, {u'originalString': u'2 teaspoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoons'}, {u'originalString': u'4 teaspoons shallots, minced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11677, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoon dark soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup warm water (105\xb0F)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(105\xb0F)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 cup whole milk, warm (105\xb0F)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'(105\xb0F)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 tablespoon lard or shortening', u'aisle': u'?', u'name': u'lard', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'unit': u'tablespoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.jessicagavin.com/test-kitchen/breads-savories/steamed-pork-bun-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For the filling base heat the oil over medium heat and saut\xe9 the shallots 2 minutes or until light brown.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the flour, stir to combine, and cook 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the chicken stock, stir well, and cook 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [], u'step': u'Add soy sauce and cook one minute.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in cut pork and seasoning ingredients (oyster sauce, sugar, peanut oil, and sesame oil). Chill until very firm.Dissolve sugar in warm water, sprinkle yeast over; let stand 2-3 minutes, and then stir to mix well.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'id': 6176, u'name': u'oyster sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'id': 4042, u'name': u'peanut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}, {u'equipment': [], u'step': u'Let set until it starts to foam, 10 minutes.Sift flour and make well in the center.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the lard/ shortening, sugar, yeast mixture, and milk. The fat will not completely dissolve into the liquid.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Combine liquid mixture with the flour; gradually incorporate the flour with the liquid to make dough.Knead the dough for 10 minutes, sprinkling with flour as necessary.Use the oil to grease the outside of the dough; cover and let rest in warm area 1 \xbd hours or until double in size.Punch dough down and flatten out to about \xbe inch thick.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Spread the baking powder mixture evenly on the dough (this acts as a stabilizer).', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}]}, {u'equipment': [], u'step': u'Roll dough up and knead about 10 minutes, or until smooth and satiny. The dough should be firmer than regular white bread dough.Cover and let rest 30 minutes.Divide the dough into four equal parts.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Roll one part by hand to form a rope approximately 9 inches long and 1\xbc inch in diameter.Mark into 6 equal parts, 1 \xbd inch long.Holding the dough with one hand, grip at the first mark with the thumb and index finger of the other hand and tear away briskly to break off a small dough piece. Continue breaking until you have 24 pieces.Flatten each piece of dough with your palm.Using a rolling pin, roll each into a round disk, making quarter turn with each roll.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Roll to leave the center thick; thinner edges are easier to pleat.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Place about 1 tablespoon of filling at the center of each dough round, flat side up.Gather the edges by first pleating counterclockwise, and then twisting to seal securely.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place the bun round side up on a square piece of parchment paper (2.5 X 2.5 inches).', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}], u'step': u'Let buns rest, covered for at least 30 minutes.Steam on high heat for 8 to 10 minutes. Do not uncover the steamer any time during the steaming. If a flat lid steamer is used, wrap the lid in a kitchen towel to prevent condensed steam from dripping on the buns.', u'length': {u'number': 38, u'unit': u'minutes'}, u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Steamed Bun. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 260, u'instructions': u'For the filling base heat the oil over medium heat and saut\xe9 the shallots 2 minutes or until light brown. Add the flour, stir to combine, and cook 1 minute.Add the chicken stock, stir well, and cook 2 minutes. Add soy sauce and cook one minute.Remove from heat and stir in cut pork and seasoning ingredients (oyster sauce, sugar, peanut oil, and sesame oil). Chill until very firm.Dissolve sugar in warm water, sprinkle yeast over; let stand 2-3 minutes, and then stir to mix well. Let set until it starts to foam, 10 minutes.Sift flour and make well in the center. Whisk together the lard/ shortening, sugar, yeast mixture, and milk. The fat will not completely dissolve into the liquid. Combine liquid mixture with the flour; gradually incorporate the flour with the liquid to make dough.Knead the dough for 10 minutes, sprinkling with flour as necessary.Use the oil to grease the outside of the dough; cover and let rest in warm area 1 \xbd hours or until double in size.Punch dough down and flatten out to about \xbe inch thick. Spread the baking powder mixture evenly on the dough (this acts as a stabilizer). Roll dough up and knead about 10 minutes, or until smooth and satiny. The dough should be firmer than regular white bread dough.Cover and let rest 30 minutes.Divide the dough into four equal parts. Roll one part by hand to form a rope approximately 9 inches long and 1\xbc inch in diameter.Mark into 6 equal parts, 1 \xbd inch long.Holding the dough with one hand, grip at the first mark with the thumb and index finger of the other hand and tear away briskly to break off a small dough piece. Continue breaking until you have 24 pieces.Flatten each piece of dough with your palm.Using a rolling pin, roll each into a round disk, making quarter turn with each roll.Roll to leave the center thick; thinner edges are easier to pleat.Place about 1 tablespoon of filling at the center of each dough round, flat side up.Gather the edges by first pleating counterclockwise, and then twisting to seal securely. Place the bun round side up on a square piece of parchment paper (2.5 X 2.5 inches).Let buns rest, covered for at least 30 minutes.Steam on high heat for 8 to 10 minutes. Do not uncover the steamer any time during the steaming. If a flat lid steamer is used, wrap the lid in a kitchen towel to prevent condensed steam from dripping on the buns.', u'spoonacularSourceUrl': u'https://spoonacular.com/steamed-pork-bun-534193', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 280, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}