{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/695372-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 695372, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lamb & White Bean Chili', u'diets': [u'dairy free'], u'preparationMinutes': 40, u'pricePerServing': 208.59, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1/2 cup bulgur', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'bulgur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20012, u'unit': u'cup'}, {u'originalString': u'1 14-ounce can no-salt-added diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons extra-virgin olive oil or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoons'}, {u'originalString': u'1 small eggplant (about 1 pound), diced (4 cups)', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'diced', u'small', u'(4 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u'pound'}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1 pound lean ground lamb (see Tip)', u'aisle': u'Meat', u'name': u'lean ground lamb', u'metaInformation': [u'lean', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 17353, u'unit': u'pound'}, {u'originalString': u'2 15-ounce cans no-salt-added small white beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'no salt added diced tomatoes', u'metaInformation': [u'white', u'small', u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 11885, u'unit': u'ounce'}, {u'originalString': u'1 large onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tablespoons paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/lamb_white_bean_chili.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat oil in a Dutch oven over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add ground lamb, onion and garlic. Cook, stirring and breaking up the meat with a wooden spoon, until the meat is no longer pink, 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add eggplant, and cook, stirring occasionally, until the eggplant is starting to soften, 5 to 7 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [], u'step': u'Add bulgur, chili powder, paprika, cumin, cinnamon, allspice and salt and cook, stirring, until aromatic, 30 seconds to 1 minute.Stir in tomatoes and beans.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'id': 20012, u'name': u'bulgur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add water and bring to a boil. Reduce heat to a simmer, partially cover the pot and cook, stirring occasionally, until the liquid is reduced and thickened and the bulgur is tender, about 50 minutes.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'id': 20012, u'name': u'bulgur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are great choices for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Bohigas Brut Reserva Cava with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale yellow colour. Constant and small bubble. Foam of great persistence. Very fruity aromas, especially of white fruit (acid apple and pear) on shades of peel of citrics and white flowers. In the background, some spicy notes owed to ageing (cinnamon) and cookies. It is a well-structured "cava" in the mouth. Well picked up over its acidity that tenses it overall from beginning to end. The bubble lends a creamy feeling, and it gives volume and softness to the structure that returns acidity and widens the aromas of white fruits and spices that are repeated in the mouth. Its balanced end harmonizes its acidity, and leaves a memory of freshness and volume owing to its light sugar content View More', u'title': u'Bohigas Brut Reserva Cava', u'price': u'$16.99', u'id': 440298, u'link': u'https://www.wine.com/product/bohigas-brut-reserva-cava/131248', u'imageUrl': u'https://spoonacular.com/productImages/440298-312x231.jpg'}]}, u'aggregateLikes': 358, u'instructions': u'Heat oil in a Dutch oven over medium-high heat. Add ground lamb, onion and garlic. Cook, stirring and breaking up the meat with a wooden spoon, until the meat is no longer pink, 3 to 5 minutes.Add eggplant, and cook, stirring occasionally, until the eggplant is starting to soften, 5 to 7 minutes.Add bulgur, chili powder, paprika, cumin, cinnamon, allspice and salt and cook, stirring, until aromatic, 30 seconds to 1 minute.Stir in tomatoes and beans.Add water and bring to a boil. Reduce heat to a simmer, partially cover the pot and cook, stirring occasionally, until the liquid is reduced and thickened and the bulgur is tender, about 50 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-white-bean-chili-695372', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}