{u'recipes': [{u'sourceName': u'Amandas Cooking', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/527112-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 527112, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kung Pao Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 141.64, u'creditText': u'Amandas Cooking', u'extendedIngredients': [{u'originalString': u'1 tablespoon black vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'black vinegar', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012053, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 teaspoons low-sodium soy sauce, divided', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'teaspoons'}, {u'originalString': u'1/2 small onion, cut into 1-inch dice', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'cut into 1-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 red bell pepper, cut into 1-inch dice', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into 1-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'2-3 red dried chiles', u'aisle': u'Produce', u'name': u'red chiles', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 boneless, skinless chicken breasts, cut into 1-inch chunks', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into 1-inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 1/2 cups sugar snap peas', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10011300, u'unit': u'cups'}, {u'originalString': u'3 tablespoons fat free chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'fat free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'tablespoons'}, {u'originalString': u'1/2 yellow bell pepper, cut into 1-inch dice', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'cut into 1-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://amandascookin.com/2013/06/kung-pao-chicken.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, combine the cornstarch with 1 teaspoon of the soy sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Pour over chicken and toss to combine. Set aside to marinate for ten minutes. Soak dried chiles in hot water for several minutes.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from water and chop. For a less spicy dish, discard some or all of the seeds.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat wok over high heat. Ad canola oil and swirl to coat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken, spread it out across the surface of the pan. Sear on both sides until lightly browned, but not cooked all the way through, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chiles, garlic, bell pepper, onion and snap peas. Stir fry several minutes, until fragrant.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'id': 10011300, u'name': u'sugar snap peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add remaining one teaspoon of soy sauce, the broth and vinegar. Bring to a simmer and turn heat down to medium low. Cook for 2-3 minutes, until chicken is cooked through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Kung Pao Chicken. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.  View More', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'In a bowl, combine the cornstarch with 1 teaspoon of the soy sauce. Pour over chicken and toss to combine. Set aside to marinate for ten minutes. Soak dried chiles in hot water for several minutes. Remove from water and chop. For a less spicy dish, discard some or all of the seeds.Heat wok over high heat. Ad canola oil and swirl to coat. Add the chicken, spread it out across the surface of the pan. Sear on both sides until lightly browned, but not cooked all the way through, about 4 minutes.Add the chiles, garlic, bell pepper, onion and snap peas. Stir fry several minutes, until fragrant. Add remaining one teaspoon of soy sauce, the broth and vinegar. Bring to a simmer and turn heat down to medium low. Cook for 2-3 minutes, until chicken is cooked through.', u'spoonacularSourceUrl': u'https://spoonacular.com/kung-pao-chicken-527112', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}