{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/224621-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 224621, u'veryPopular': False, u'lowFodmap': False, u'title': u'Churros with chocolate dipping sauce', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 111.51, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'few chunks of bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'chunks', u'unitShort': u'chunks', u'amount': 3.0, u'consistency': u'solid', u'id': 18064, u'unit': u'chunks'}, {u'originalString': u'50g butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'3 tbsp golden syrup', u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93829, u'unit': u'tbsp'}, {u'originalString': u'100ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'250g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'200g bar dark chocolate, not too bitter, broken into chunks', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate bar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 10019904, u'unit': u'g'}, {u'originalString': u'100g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'about 1 liter sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'liter'}, {u'originalString': u'\xbd tsp vanilla extract, if you have some', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'100ml whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2459641/churros-with-chocolate-dipping-sauce', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Boil the kettle, then measure 350ml boiling water into a jug and add the melted butter and vanilla extract. Sift the flour and baking powder into a big mixing bowl with a big pinch of salt. Make a well in the centre, then pour in the contents of the jug and very quickly beat into the flour with a wooden spoon until lump-free. Rest for 10-15 mins while you make the sauce. Put all the sauce ingredients into a pan and gently melt together, stirring occasionally until you have a smooth shiny sauce. Keep warm on a low heat. Fill a large deep saucepan one-third full of oil.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat until a cube of bread browns in 45 seconds – 1 min. Cover a tray with kitchen paper and mix the caster sugar and cinnamon together.Fit a star nozzle to a piping bag, 1.5-2cm wide is a good size. Fill with the rested dough, then pipe 2-3 strips directly into the pan, snipping off each dough strip with a pair of kitchen scissors. Fry until golden brown and crisp, then remove with a slotted spoon and drain on the kitchen paper-lined tray. Carry on cooking the rest of the dough in batches, sprinkling the cooked churros with some cinnamon sugar as you go. Once you’ve cooked all the churros, toss with any remaining cinnamon sugar and serve with the chocolate sauce, for dipping.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar.jpg', u'id': 10219335, u'name': u'cinnamon sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Spanish works really well with Tempranillo, Albarino, and Grenache. When pairing wine with Spanish dishes, why not follow the rule 'what grows together goes together'? We recommend albari\xf1o for white wine and garnachan and tempranillo for red. The Orgasmic Wine Company Oh! Orgasmic , Tempranillo with a 5 out of 5 star rating seems like a good match. It costs about 80 dollars per bottle.", u'pairedWines': [u'tempranillo', u'albarino', u'grenache'], u'productMatches': [{u'description': u'Hints of tobacco and shows off subtle earthiness. Dark cherry on the nose invites the first taste of this popular varietal. Spice and the suggestion of leather give this a grip that leads you to appreciate the medium tannins and lingering finish. At Naked Winery, we are on a mission to cut the divorce rate by encouraging couples to share a glass of wine nightly. We "Aim to Tease" with labels are just a bit risqu\xe9 because we believe the experience surrounding wine should be fun. Set the mood for fun and romance with premium wines, exotic brands and provocative back labels. Get Uncorked\xae and enjoy what life unexpectedly brings you.', u'title': u'Orgasmic Wine Company Oh! Orgasmic , Tempranillo', u'price': u'$80.0', u'id': 429968, u'link': u'https://www.amazon.com/Orgasmic-Wine-Company-Washington-Tempranillo/dp/B013KDWX7G', u'imageUrl': u'https://spoonacular.com/productImages/429968-312x231.jpg'}]}, u'aggregateLikes': 301, u'instructions': u'Boil the kettle, then measure 350ml boiling water into a jug and add the melted butter and vanilla extract. Sift the flour and baking powder into a big mixing bowl with a big pinch of salt. Make a well in the centre, then pour in the contents of the jug and very quickly beat into the flour with a wooden spoon until lump-free. Rest for 10-15 mins while you make the sauce. Put all the sauce ingredients into a pan and gently melt together, stirring occasionally until you have a smooth shiny sauce. Keep warm on a low heat. Fill a large deep saucepan one-third full of oil. Heat until a cube of bread browns in 45 seconds – 1 min. Cover a tray with kitchen paper and mix the caster sugar and cinnamon together.Fit a star nozzle to a piping bag, 1.5-2cm wide is a good size. Fill with the rested dough, then pipe 2-3 strips directly into the pan, snipping off each dough strip with a pair of kitchen scissors. Fry until golden brown and crisp, then remove with a slotted spoon and drain on the kitchen paper-lined tray. Carry on cooking the rest of the dough in batches, sprinkling the cooked churros with some cinnamon sugar as you go. Once you’ve cooked all the churros, toss with any remaining cinnamon sugar and serve with the chocolate sauce, for dipping.', u'spoonacularSourceUrl': u'https://spoonacular.com/churros-with-chocolate-dipping-sauce-224621', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}