{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536517-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 536517, u'veryPopular': False, u'lowFodmap': False, u'title': u'Parmesan and Chive Corn Muffins', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 33.03, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons chopped chives, divided', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups fat-free buttermilk (see notes section on how to make your own)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free buttermilk', u'metaInformation': [u'fat-free', u'(see notes section on how to make your own)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 93650, u'unit': u'cups'}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon ground red pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'3 ounces grated fresh Parmigiano-Reggiano cheese (about 3/4 cup), divided', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'fresh', u'divided', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup yellow cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'yellow cornmeal', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.acedarspoon.com/parmesan-and-chive-corn-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Combine the first 3 ingredients. Lightly spoon flour into a dry measuring cup, level with knife.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine flour and next 6 ingredients (through pepper) in a bowl, stirring well with a whisk.Make a well in the center of the flour mixture and add milk to the mixture stirring until moist.Stir in 2 ounces of cheese (1/2 cup) and 2 tablespoons chives.Spoon into 12 muffin cups coated with cooking spray or muffin tins. Sprinkle muffin tins evenly with remaining 1 ounce cheese and remaining 1 tablespoon chives.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake at 400 degrees to 13 minutes or until a wooden toothpick inserted in the center comes out with most crumbs clinging.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Remove muffins from tins, cool on wire rack', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Cornbread. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Eroica Riesling. It has 4.2 out of 5 stars and a bottle costs about 24 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'This Eroica shows the crisp acidity of the 2007 vintage, which was the best acidity holding year in the past five years. The wine delivers mandarin orange and sweet lime aromas and flavors with subtle mineral notes. The cooler September, along with selecting fruit from higher elevation and cooler sites, contributed to the mouth-watering acidity balanced by beautiful Washington Riesling fruit.An amazing pairing with sweet, flavorful Dungeness crab. View More', u'title': u'Eroica Riesling', u'price': u'$23.99', u'id': 434655, u'link': u'https://www.wine.com/product/eroica-riesling-2007/96190', u'imageUrl': u'https://spoonacular.com/productImages/434655-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Preheat oven to 400 degrees.Combine the first 3 ingredients. Lightly spoon flour into a dry measuring cup, level with knife.Combine flour and next 6 ingredients (through pepper) in a bowl, stirring well with a whisk.Make a well in the center of the flour mixture and add milk to the mixture stirring until moist.Stir in 2 ounces of cheese (1/2 cup) and 2 tablespoons chives.Spoon into 12 muffin cups coated with cooking spray or muffin tins. Sprinkle muffin tins evenly with remaining 1 ounce cheese and remaining 1 tablespoon chives.Bake at 400 degrees to 13 minutes or until a wooden toothpick inserted in the center comes out with most crumbs clinging.Remove muffins from tins, cool on wire rack', u'spoonacularSourceUrl': u'https://spoonacular.com/parmesan-and-chive-corn-muffins-536517', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 23, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}