{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604537-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 604537, u'veryPopular': False, u'lowFodmap': False, u'title': u'Zesty Gluten-Free Orange Pancakes with Wild Blueberry-Orange Sauce', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 11.2, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup frozen Wild Blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'wild', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'\xbd cup + 2 tablespoons gluten-free flour blend', u'aisle': u'Baking', u'name': u'cake flour blend', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020129, u'unit': u'cup'}, {u'originalString': u'\xbc cup plain or vanilla dairy-free milk alternative (your choice of type!)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [u'plain', u'(your choice of type!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon granulated sugar (or honey)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'(or honey)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon melted margarine (can substitute melted coconut oil)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [u'melted', u'(can substitute coconut oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4073, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon freshly squeezed orange juice*', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9206, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/gluten-free-orange-pancakes', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine all ingredients in a small sauce pan and place on low heat while preparing pancakes. Stir occasionally. Smash wild blueberries to desired consistency.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 1009050, u'name': u'wild blueberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all dry ingredients together in a medium mixing bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add all wet ingredients (including the zest) and whisk until well combined; the batter will be thin.Preheat a griddle or electric skillet to medium heat. Spray with oil. Make sure pan is hot before scooping batter.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Pour batter by the scant \xbc cup onto the griddle into pancake shapes. Batter is thin so not much is needed for each pancake. Wait until pancake bubbles before flipping. Flip and cook other side. Continue process until all batter is used.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour sauce over pancakes while warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 78, u'instructions': u'Combine all ingredients in a small sauce pan and place on low heat while preparing pancakes. Stir occasionally. Smash wild blueberries to desired consistency.Whisk all dry ingredients together in a medium mixing bowl. Add all wet ingredients (including the zest) and whisk until well combined; the batter will be thin.Preheat a griddle or electric skillet to medium heat. Spray with oil. Make sure pan is hot before scooping batter. Pour batter by the scant \xbc cup onto the griddle into pancake shapes. Batter is thin so not much is needed for each pancake. Wait until pancake bubbles before flipping. Flip and cook other side. Continue process until all batter is used.Pour sauce over pancakes while warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/zesty-gluten-free-orange-pancakes-with-wild-blueberry-orange-sauce-604537', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}