{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/217207-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 217207, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chorizo, caper & rocket pizza', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 136.76, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tbsp capers, drained', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tbsp'}, {u'originalString': u'handful cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'handful'}, {u'originalString': u'2 small cooking chorizo, diced', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 7019, u'unit': u''}, {u'originalString': u'olive oil, to drizzle', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 pack pizza base mix', u'aisle': u'Baking', u'name': u'pizza mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 98924, u'unit': u''}, {u'originalString': u'3 tbsp tomato pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11549, u'unit': u'tbsp'}, {u'originalString': u'handful rocket', u'aisle': u'Produce', u'name': u'rocket', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'handful'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1506638/chorizo-caper-and-rocket-pizza', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Make up the pizza base following packinstructions and put on a baking sheet.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread over the tomato pizza sauce.Leave to rise in a warm place for 5 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 240.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 240C/220C fan/gas 9.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the chorizo in a cold frying pan overa low heat, then gradually increase it –the chorizo should give off enough oil sothat you don’t need to add any more.Cook for 2-3 mins until it releases itsoil and starts to crisp.Scatter the chorizo, capers andtomatoes over the pizza base. Cookfor 12-15 mins or until the base is crisp,scatter with the rocket,', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Hills Vineyard Rosato di Sangiovese with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'strawberry , raspberry , cherry', u'title': u'Hills Vineyard Rosato di Sangiovese', u'price': u'$14.95', u'id': 430938, u'link': u'https://www.amazon.com/Texas-Hills-Vineyard-Rosato-Sangiovese/dp/B00CHCHU8E', u'imageUrl': u'https://spoonacular.com/productImages/430938-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Make up the pizza base following packinstructions and put on a baking sheet.Spread over the tomato pizza sauce.Leave to rise in a warm place for 5 mins.Heat oven to 240C/220C fan/gas 9.Put the chorizo in a cold frying pan overa low heat, then gradually increase it –the chorizo should give off enough oil sothat you don’t need to add any more.Cook for 2-3 mins until it releases itsoil and starts to crisp.Scatter the chorizo, capers andtomatoes over the pizza base. Cookfor 12-15 mins or until the base is crisp,scatter with the rocket,', u'spoonacularSourceUrl': u'https://spoonacular.com/chorizo-caper-rocket-pizza-217207', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}