{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/728882-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 728882, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Cheddar Swiss Breakfast Sandwich', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 81.11, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'2 thin slices of good bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'good', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'Sliced cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'serving'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Butter (or light butter)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'light butter', u'metaInformation': [u'light', u'(or butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.png', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 4602, u'unit': u'serving'}, {u'originalString': u'A bit of mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'serving'}, {u'originalString': u'Sliced swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1040, u'unit': u'serving'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/grilled-cheddar-swiss-breakfast-sandwich/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the egg in a bowl and sprinkle with Red Robin Seasoning (or salt) & freshly ground pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a nonstick frying pan over medium heat and lightly butter. When the pan is hot, pour in the egg. Wait until the egg is mostly set, then fold it over itself, flip and let it cook a minute longer to make sure the egg is done.While the egg is cooking, spread butter on the bottom (outside) side of the bread and a light spread of mustard on the inside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the swiss cheese on top of this, then add the egg (cutting if necessary to fit the sandwich), then the cheddar cheese. Top with the 2nd slice of bread with a thin spread of mustard on the inside, butter on the outside.Reduce heat to medium low or low. Set the sandwich in the pan. Cover and let it cook until the swiss cheese is melting and the bottom is golden brown. Flip the sandwich over and let it cook until the cheddar cheese is melted and the other side is golden brown.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Transfer the sandwich to a plate with a spatula and enjoy!', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'Whisk the egg in a bowl and sprinkle with Red Robin Seasoning (or salt) & freshly ground pepper.Heat a nonstick frying pan over medium heat and lightly butter. When the pan is hot, pour in the egg. Wait until the egg is mostly set, then fold it over itself, flip and let it cook a minute longer to make sure the egg is done.While the egg is cooking, spread butter on the bottom (outside) side of the bread and a light spread of mustard on the inside. Put the swiss cheese on top of this, then add the egg (cutting if necessary to fit the sandwich), then the cheddar cheese. Top with the 2nd slice of bread with a thin spread of mustard on the inside, butter on the outside.Reduce heat to medium low or low. Set the sandwich in the pan. Cover and let it cook until the swiss cheese is melting and the bottom is golden brown. Flip the sandwich over and let it cook until the cheddar cheese is melted and the other side is golden brown. Transfer the sandwich to a plate with a spatula and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-cheddar-swiss-breakfast-sandwich-728882', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}