{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/341936-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 341936, u'veryPopular': False, u'lowFodmap': False, u'title': u'Deconstructed Cannoli Chips and Dip', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 318.16, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Canola oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u"1/2 cup confectioners' sugar, plus more for dusting", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [u'for dusting', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 cup maraschino cherries, chopped', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9328, u'unit': u'cup'}, {u'originalString': u'3 tablespoons orange liqueur', u'aisle': u'Alcoholic Beverages', u'name': u'orange liqueur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/temporary-orange-liqueur.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10414534, u'unit': u'tablespoons'}, {u'originalString': u'1/2 orange, zested', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1/2 cup pistachios, coarsely chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'1 cup miniature semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'2 cups whole milk ricotta', u'aisle': u'Cheese', u'name': u'skim milk ricotta', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93630, u'unit': u'cups'}, {u'originalString': u'1 package (about 36) square wonton wrappers, cut diagonally in half', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'( 36)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'package'}], u'healthScore': 13.0, u'imageType': u'jpeg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/jeff-mauro/deconstructed-cannoli-chips-and-dip-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 41, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Fill a Dutch oven one-third full with oil and heat to 350 degrees F.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Fry the wontons in one layer, not overcrowding the pot. Flip the wontons once or twice until golden brown, 4 to 5 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the wontons with tongs or a slotted spoon and drain on a large wire rack set over a shallow pan. Repeat until all the wontons are fried.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the ricotta, sugar and liqueur until well combined in a large bowl. Whip the cream in a separate bowl until soft peaks form, using a hand mixer. Fold the whipped cream and 1/2 cup of the chocolate chips gently into the ricotta mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the ricotta-cream mixture to a medium dip bowl or 8-by-8-inch baking dish and spread evenly. Starting from the left side of bowl, make a row, from top to bottom, of pistachios, followed by a row of the remaining 1/2 cup chocolate chips, then the cherries. Grate fresh orange zest over the bowl and plate the wonton chips on the side. Dust the chips with sugar and serve.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}]}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Watch how to make this recipe.                    Fill a Dutch oven one-third full with oil and heat to 350 degrees F.                          Fry the wontons in one layer, not overcrowding the pot. Flip the wontons once or twice until golden brown, 4 to 5 minutes. Remove the wontons with tongs or a slotted spoon and drain on a large wire rack set over a shallow pan. Repeat until all the wontons are fried.                          Mix the ricotta, sugar and liqueur until well combined in a large bowl. Whip the cream in a separate bowl until soft peaks form, using a hand mixer. Fold the whipped cream and 1/2 cup of the chocolate chips gently into the ricotta mixture.                          Add the ricotta-cream mixture to a medium dip bowl or 8-by-8-inch baking dish and spread evenly. Starting from the left side of bowl, make a row, from top to bottom, of pistachios, followed by a row of the remaining 1/2 cup chocolate chips, then the cherries. Grate fresh orange zest over the bowl and plate the wonton chips on the side. Dust the chips with sugar and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/deconstructed-cannoli-chips-and-dip-341936', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}