{u'recipes': [{u'sourceName': u'Cookie Monster Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/490403-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 490403, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vegetable-Filled Macaroni and Cheese', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 153.63, u'creditText': u'Cookie Monster Cooking', u'extendedIngredients': [{u'originalString': u'8 ounces baby bella mushrooms, sliced', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11266, u'unit': u'ounces'}, {u'originalString': u'2 cups chopped broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cups'}, {u'originalString': u'2 cups freshly grated cheddar cheese, divided', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'divided', u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1009, u'unit': u'cups'}, {u'originalString': u'1 cup cottage cheese', u'aisle': u'Cheese', u'name': u'cottage cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1012, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup plain greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3 cups roughly chopped fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'13 ounces whole wheat penne pasta', u'aisle': u'Pasta and Rice', u'name': u'whole wheat penne pasta', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-penne.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.0, u'consistency': u'solid', u'id': 99182, u'unit': u'ounces'}, {u'originalString': u'1 zucchini, chopped', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://cookiemonstercooking.com/2013/01/11/vegetable-filled-macaroni-and-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.Cook the pasta according to the package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain and then place in a large bowl. Meanwhile, add the butter and olive oil to a large skillet set over medium heat.  Once the butter is melted, add in the onion.  Cook until soft, about 4 to 5 minutes.Stir in the garlic and broccoli and cook for about 2 minutes.  Next add in the zucchini and mushrooms and cook until the veggies are tender, another 5 to 8 minutes.  If needed, add in another 1 teaspoon olive oil to keep them from sticking to the pan.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in the spinach and cook until wilted.  Turn off the heat and stir in the salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the vegetable mixture to the large bowl with the pasta.  Next add in the cottage cheese, yogurt and 1 \xbd cups of the cheddar cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'id': 1012, u'name': u'cottage cheese'}]}, {u'equipment': [], u'step': u'Mix until well combined.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread the mixture in a 9 by 13 inch baking dish and then sprinkle with the remaining \xbd cup of cheddar.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}]}, {u'equipment': [], u'step': u'Bake for 20 minutes, until heated through and the cheese is melted.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Lambrusco, and Riesling are my top picks for Macaroni and Cheese. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. One wine you could try is Essay Chenin Blanc. It has 4.2 out of 5 stars and a bottle costs about 9 dollars.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 494, u'instructions': u'Preheat the oven to 350 degrees.Cook the pasta according to the package directions.  Drain and then place in a large bowl. Meanwhile, add the butter and olive oil to a large skillet set over medium heat.  Once the butter is melted, add in the onion.  Cook until soft, about 4 to 5 minutes.Stir in the garlic and broccoli and cook for about 2 minutes.  Next add in the zucchini and mushrooms and cook until the veggies are tender, another 5 to 8 minutes.  If needed, add in another 1 teaspoon olive oil to keep them from sticking to the pan.  Add in the spinach and cook until wilted.  Turn off the heat and stir in the salt and pepper.Add the vegetable mixture to the large bowl with the pasta.  Next add in the cottage cheese, yogurt and 1 \xbd cups of the cheddar cheese.  Mix until well combined.  Spread the mixture in a 9 by 13 inch baking dish and then sprinkle with the remaining \xbd cup of cheddar.  Bake for 20 minutes, until heated through and the cheese is melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetable-filled-macaroni-and-cheese-490403', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}