{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520018-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 520018, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Best Soft and Fluffy Honey Dinner Rolls', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 26.06, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'3 3/4 to 4 cups bread flour (I use King Arthur Unbleached Bread Flour)', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'(I use King Arthur Unbleached Bread Flour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.75, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'3 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'2 1/4 teaspoons instant dry yeast (one 1/4-ounce packet, I use Red Star Platinum)', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [u'red', u'dry', u'(one 1/4-ounce packet, I use Star Platinum)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 10118375, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 cup water, warmed to 120 to 130F for Red Star Platinum yeast (or 105 to 115F for most other yeast, or according to package directions)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'red', u'warmed', u'for  star platinum yeast (or 105 to 115f for most other yeast, or according to package directions)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.averiecooks.com/2012/11/honey-dinner-rolls.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add water to a glass measuring cup or microwave-safe bowl and heat on high power to warm it, about 30 seconds. Testing with a thermometer is highly recommended, but if testing with your finger, water should feel warm but not hot. To the bowl of a stand mixer fitted with the paddle attachment, add the water and sprinkle the yeast on top of it. Beat on low speed for about 10 seconds, just to combine; let mixture stand for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Add the egg, 1/4 cup honey, oil, salt, and mix until well-combined, about 2 minutes on low to medium-low speed.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add 3 cups flour and beat until a sloppy, wet, loose dough forms. Scrape off any dough bits stuck to the paddle, remove the paddle attachment, and put on the dough hook.  With the dough hook attached, turn mixer on low speed, and slowly sprinkle in remaining 3/4 cup flour. If necessary to obtain soft, smooth, non-sticky dough, sprinkle in the full 1 cup flour that remains (for a total of 4 cups flour, rather than 3 3/4 cups, noting that the more flour used, the denser the finished rolls will be). Knead dough for about 8 minutes. It will be firm, smooth, not sticky, and elastic. Turn dough out onto a Silpat Non-Stick Baking Mat or floured work surface and knead dough by hand for 1 to 2 minutes, just to get into the nooks and crannies with your fingers the dough hook may have missed and make sure dough is very smooth and uniform in texture.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place mounded ball of dough in a cooking sprayed or lightly greased large bowl and cover with plasticwrap.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Place bowl in a warm place until it has doubled in size, about 2 hours. Tip - Preheating your oven for 1 minute to 400F, then shutting it off (make sure you shut it off), and quickly sliding the bowl in so the hot air doesn't escape is one way to create a warm environment; think 85 or 90F summer day warm environment. A cooler environment simply means dough will take longer to rise. After dough has risen and doubled, punch it down to release the air bubbles, and turn it out onto a Silpat or floured work surface. Knead for about 1 minute. Mound dough into a ball, place it back into the bowl, cover it, and allow it to rest and relax for about 10 minutes, making it easier to shape into rolls. Prepare a 9-by-13-inch baking pan by lining it with aluminum foil, spray with cooking spray; set aside.", u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place dough on Silpat or floured work surface, and using your hands, roll it into a long cylinder shape, about 12 to 15 inches in length, and it will about 3 to 4 inches in girth. Divide the log into 12 uniformly-sized pieces with a dough cutter or sharp knife.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Roll each piece into a ball, creating surface tension on the top of the ball by stretching the dough over itself a bit and pinch off the bottom, tucking the dough into itself.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Place each piece into the prepared pan, seam side down, uniformly spaced, four rows by three. (Dough may also be rolled into just a simple 'plain ball', without pulling on the top surface of dough to create tension and not bothering to pinch off the bottom a bit, but I find they rise better and are fluffier if they're pinched off rather than just round dough globes)  After all pieces are in the pan, cover it with plasticwrap and allow to dough to rise for about 30 minutes. While dough rises, preheat oven to 400F. A good place for this rise is placing baking pan on the stovetop while oven is preheating for the carryover warmth. Prepare honey-butter mixture by melting butter in a microwave-safe bowl on high power, about 1 minute. To the melted butter, add 2 tablespoons honey and stir to combine; set aside. After the rolls have risen and before baking, brush tops and sides of dough with the honey-butter mixture, getting into the sides and crevices and with a pastry brush.", u'length': {u'number': 31, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake rolls for about 15 minutes or until golden; they bake up very fast and watch them closely so the honey-butter mixture doesn't burn in this very hot oven. Allow rolls to cool before serving.", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with Honey Butter or Cinnamon-Sugar Butter', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Rolls may be stored at room temperature in an airtight container or ziplock bag for up to 4 days.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Rolls also freeze very well and can be made from start to finish, cooled, and placed in a freezer-safe airtight container or a ziplock for up to 3 months. When ready to serve, unthaw them and if desired, immediately prior to serving warm them in a low oven (~175 to 200F) for a few minutes and just until warmed.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 45001, u'instructions': u"Add water to a glass measuring cup or microwave-safe bowl and heat on high power to warm it, about 30 seconds. Testing with a thermometer is highly recommended, but if testing with your finger, water should feel warm but not hot. To the bowl of a stand mixer fitted with the paddle attachment, add the water and sprinkle the yeast on top of it. Beat on low speed for about 10 seconds, just to combine; let mixture stand for 10 minutes. Add the egg, 1/4 cup honey, oil, salt, and mix until well-combined, about 2 minutes on low to medium-low speed. Add 3 cups flour and beat until a sloppy, wet, loose dough forms. Scrape off any dough bits stuck to the paddle, remove the paddle attachment, and put on the dough hook.  With the dough hook attached, turn mixer on low speed, and slowly sprinkle in remaining 3/4 cup flour. If necessary to obtain soft, smooth, non-sticky dough, sprinkle in the full 1 cup flour that remains (for a total of 4 cups flour, rather than 3 3/4 cups, noting that the more flour used, the denser the finished rolls will be). Knead dough for about 8 minutes. It will be firm, smooth, not sticky, and elastic. Turn dough out onto a Silpat Non-Stick Baking Mat or floured work surface and knead dough by hand for 1 to 2 minutes, just to get into the nooks and crannies with your fingers the dough hook may have missed and make sure dough is very smooth and uniform in texture. Place mounded ball of dough in a cooking sprayed or lightly greased large bowl and cover with plasticwrap. Place bowl in a warm place until it has doubled in size, about 2 hours. Tip - Preheating your oven for 1 minute to 400F, then shutting it off (make sure you shut it off), and quickly sliding the bowl in so the hot air doesn't escape is one way to create a warm environment; think 85 or 90F summer day warm environment. A cooler environment simply means dough will take longer to rise. After dough has risen and doubled, punch it down to release the air bubbles, and turn it out onto a Silpat or floured work surface. Knead for about 1 minute. Mound dough into a ball, place it back into the bowl, cover it, and allow it to rest and relax for about 10 minutes, making it easier to shape into rolls. Prepare a 9-by-13-inch baking pan by lining it with aluminum foil, spray with cooking spray; set aside. Place dough on Silpat or floured work surface, and using your hands, roll it into a long cylinder shape, about 12 to 15 inches in length, and it will about 3 to 4 inches in girth. Divide the log into 12 uniformly-sized pieces with a dough cutter or sharp knife. Roll each piece into a ball, creating surface tension on the top of the ball by stretching the dough over itself a bit and pinch off the bottom, tucking the dough into itself. Place each piece into the prepared pan, seam side down, uniformly spaced, four rows by three. (Dough may also be rolled into just a simple 'plain ball', without pulling on the top surface of dough to create tension and not bothering to pinch off the bottom a bit, but I find they rise better and are fluffier if they're pinched off rather than just round dough globes)  After all pieces are in the pan, cover it with plasticwrap and allow to dough to rise for about 30 minutes. While dough rises, preheat oven to 400F. A good place for this rise is placing baking pan on the stovetop while oven is preheating for the carryover warmth. Prepare honey-butter mixture by melting butter in a microwave-safe bowl on high power, about 1 minute. To the melted butter, add 2 tablespoons honey and stir to combine; set aside. After the rolls have risen and before baking, brush tops and sides of dough with the honey-butter mixture, getting into the sides and crevices and with a pastry brush. Bake rolls for about 15 minutes or until golden; they bake up very fast and watch them closely so the honey-butter mixture doesn't burn in this very hot oven. Allow rolls to cool before serving. Serve with Honey Butter or Cinnamon-Sugar Butter Rolls may be stored at room temperature in an airtight container or ziplock bag for up to 4 days. Rolls also freeze very well and can be made from start to finish, cooled, and placed in a freezer-safe airtight container or a ziplock for up to 3 months. When ready to serve, unthaw them and if desired, immediately prior to serving warm them in a low oven (~175 to 200F) for a few minutes and just until warmed.", u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-soft-and-fluffy-honey-dinner-rolls-520018', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}