{u'recipes': [{u'sourceName': u'Moms Dish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511312-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 511312, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheese Dumpling', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 94.48, u'creditText': u'Moms Dish', u'extendedIngredients': [{u'originalString': u'Melted Butter; for serving', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups Large Curd Cottage Cheese', u'aisle': u'Cheese', u'name': u'cheese curd', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheese-curds.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 98921, u'unit': u'cups'}, {u'originalString': u'2 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups All-purpose Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Jam; for serving', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19297, u'unit': u'servings'}, {u'originalString': u'5 tablespoons Salted Butter; (melted)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'melted', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoons'}, {u'originalString': u'Sour Cream; for serving', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'1/2 cups Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://momsdish.com/recipe/389/cheese-dumpling-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Into a large bowl, combine eggs together with cottage cheese, sugar and melted butter. Into the mixture, fold in flour in small portions. Note: depending on the flour you use, you may need to add a bit more. Dough will be sticky, but should be possible to work with, on a well floured surface.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Place dough onto a well floured surface, roll out stains of dough and cut them into one inch pieces. Cook dumplings in small portions in a boiling water, this way they don't stick together.", u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drain cooked dumplings and coat with melted butter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve with a side of sour cream, fruits or favorite jam.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 66, u'instructions': u"Into a large bowl, combine eggs together with cottage cheese, sugar and melted butter. Into the mixture, fold in flour in small portions. Note: depending on the flour you use, you may need to add a bit more. Dough will be sticky, but should be possible to work with, on a well floured surface. Place dough onto a well floured surface, roll out stains of dough and cut them into one inch pieces. Cook dumplings in small portions in a boiling water, this way they don't stick together. Drain cooked dumplings and coat with melted butter. Serve with a side of sour cream, fruits or favorite jam.", u'spoonacularSourceUrl': u'https://spoonacular.com/cheese-dumpling-511312', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}