{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223011-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 223011, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate & hazelnut praline tart', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 118.38, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'200g dark chocolate (70% cocoa)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'70%', u'( cocoa)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'50g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'50g ground almonds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'ground almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 93740, u'unit': u'g'}, {u'originalString': u'85g blanched hazelnuts', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 12120, u'unit': u'g'}, {u'originalString': u'1 tablespoon Frangelico liqueur or brandy', u'aisle': u'Alcoholic Beverages', u'name': u'pear liqueur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 98988, u'unit': u'tablespoon'}, {u'originalString': u'225g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/5719/chocolate-and-hazelnut-praline-tart', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the pastry. Cream together the butter and sugar, then add flour and almonds. Bring everything together with the egg. If the pastry is very soft, chill for 20 mins. If not, roll out to fit a deepish 23cm fluted flan tin; if the pastrybreaks, press scraps of pastry into the gaps, leaving a slight overhang. Chill for 20 mins.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6. Line the case with baking parchment and baking beans, then bake for 10 mins.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Remove beans and cook for another 10 mins until golden.Meanwhile, toast the nuts in a dry pan until starting to brown. Scatter over 4 tbsp of sugar, cook until it caramelises, then tip nuts onto a baking tray lined with parchment. Leave to cool, then roughly chop. Over a pan of barely simmering water, melt the chocolate, butter and alcohol together, then set aside to cool slightly. Over the same pan, beat the egg, yolksand remaining sugar until pale and fluffy. Take off the heat, then fold in the chocolate mix.When case is cooked, remove from oven and turn the heat down to 160C/fan 140C/gas 3. Scatter most of the hazelnuts over the base, then tip in the chocolate mix, pressing it down slightly. Cook the tart for 15-20 mins until the chocolate has almost set. Leave to cool, then serve scattered with the remaining nuts. Can be made up to 1 day ahead.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 162, u'instructions': u'Make the pastry. Cream together the butter and sugar, then add flour and almonds. Bring everything together with the egg. If the pastry is very soft, chill for 20 mins. If not, roll out to fit a deepish 23cm fluted flan tin; if the pastrybreaks, press scraps of pastry into the gaps, leaving a slight overhang. Chill for 20 mins. Heat oven to 200C/fan 180C/gas 6. Line the case with baking parchment and baking beans, then bake for 10 mins. Remove beans and cook for another 10 mins until golden.Meanwhile, toast the nuts in a dry pan until starting to brown. Scatter over 4 tbsp of sugar, cook until it caramelises, then tip nuts onto a baking tray lined with parchment. Leave to cool, then roughly chop. Over a pan of barely simmering water, melt the chocolate, butter and alcohol together, then set aside to cool slightly. Over the same pan, beat the egg, yolksand remaining sugar until pale and fluffy. Take off the heat, then fold in the chocolate mix.When case is cooked, remove from oven and turn the heat down to 160C/fan 140C/gas 3. Scatter most of the hazelnuts over the base, then tip in the chocolate mix, pressing it down slightly. Cook the tart for 15-20 mins until the chocolate has almost set. Leave to cool, then serve scattered with the remaining nuts. Can be made up to 1 day ahead.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-hazelnut-praline-tart-223011', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}