{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/522918-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 522918, u'veryPopular': False, u'lowFodmap': False, u'title': u'A la chicken schnitzel or milanesa (fried breaded escalopes)', u'diets': [u'dairy free'], u'pricePerServing': 145.86, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'about 1/4 c. of flour stirred with 1 tsp. of salt and 1 tsp. of ground pepper', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'with 1 tsp. of salt and 1 tsp. of ground pepper'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'about 3/4 c. of panko (Japanese bread crumbs) stirred with about 2 tbsps. of chopped herbs (we used parsley and thyme but you can use other herbs that you think will go well with chicken)', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [u'with 2 tbsps. of chopped herbs (we used parsley and thyme but you can use other herbs that you think will go well with chicken)', u'(Japanese bread crumbs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10018079, u'unit': u'c'}, {u'originalString': u'4 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'about 1 c. of vegetable cooking oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable cooking oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'c'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://casaveneracion.com/a-la-chicken-schnitzel-or-milanesa-fried-breaded-escalopes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Holding your knife on a 45 degree angle, slice each chicken breast on the bias into three portions. Take a large sheet of baking paper or cling wrap, place the chicken slices (two to three at a time) on one side, cover with the other half and pound with a mallet until about an eighth of an inch thick. You now have your escalopes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the seasoned flour, egg and bread crumbs in three shallow bowls then position the bowls side by side like an assembly line.Dredge an escalope in flour making sure every part of the surface is coated.Dip the floured escalope in the beaten egg.Then coat with bread crumbs.Repeat until all the escalopes have been dredged, dipped and coated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Heat the cooking oil which should be at least half an inch deep so that it reaches the sides of the chicken.Fry the chicken, one or two at a time, until the bread crumbs are lightly browned. Flip to brown the other side. The frying takes a very short time since the chicken has been pounded to such thinness that it only needs a few minutes to cook. Bread crumbs burn fast so don’t fry for too long.As each piece of chicken cooks, lift out of the oil and place on a plate lined with paper towels.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [], u'step': u'Serve the schnitzel (or milanesa or whatever you want to call it) immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Schnitzel works really well with Dornfelder and Riesling. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'InstructionsHolding your knife on a 45 degree angle, slice each chicken breast on the bias into three portions. Take a large sheet of baking paper or cling wrap, place the chicken slices (two to three at a time) on one side, cover with the other half and pound with a mallet until about an eighth of an inch thick. You now have your escalopes.Place the seasoned flour, egg and bread crumbs in three shallow bowls then position the bowls side by side like an assembly line.Dredge an escalope in flour making sure every part of the surface is coated.Dip the floured escalope in the beaten egg.Then coat with bread crumbs.Repeat until all the escalopes have been dredged, dipped and coated.Heat the cooking oil which should be at least half an inch deep so that it reaches the sides of the chicken.Fry the chicken, one or two at a time, until the bread crumbs are lightly browned. Flip to brown the other side. The frying takes a very short time since the chicken has been pounded to such thinness that it only needs a few minutes to cook. Bread crumbs burn fast so don’t fry for too long.As each piece of chicken cooks, lift out of the oil and place on a plate lined with paper towels.Serve the schnitzel (or milanesa or whatever you want to call it) immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/a-la-chicken-schnitzel-or-milanesa-fried-breaded-escalopes-522918', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}