{u'recipes': [{u'sourceName': u'I Adore Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/546762-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 546762, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easiest Chocolate Mousse Layered Cake', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 108.17, u'creditText': u'I Adore Food', u'extendedIngredients': [{u'originalString': u'1 cup of chocolate chips, whichever kind you want, I used semi-sweet', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'4 strips of clear acetate, 4 to 5 inches high', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 4.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'strips'}, {u'originalString': u'1 round cookie cutter, about 2 1/2 in wide', u'aisle': u'Sweet Snacks', u'name': u'cookie', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 10118192, u'unit': u''}, {u'originalString': u'4 dessert wafer sheets', u'aisle': u'Alcoholic Beverages', u'name': u'dessert wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 4.0, u'consistency': u'liquid', u'id': 10014057, u'unit': u'sheets'}, {u'originalString': u'1 1/2 cup of heavy cream (35%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'35%', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 cup of fresh raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://iadorefood.com/recipes/easiest-chocolate-mousse-layered-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Start by melting a cup of chocolate chip either in a double boiler or in the microwave. Pick your favorite kind of chocolate (dark, semi sweet or event white!). If you decide to melt your chocolate in the microwave, put it in for about 10 seconds at a time, mixing it in between each time, until it is completely melted and smooth. Be careful not to over cook it.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Let the chocolate sit for about 10 minutes, stirring it frequently.While your chocolate is cooling, whip your heavy cream into soft peaks.With a spatula, fold your chocolate in your whipped cream until nice and smooth. Make sure to fold and not whip the chocolate in so you don't lose too much air from your whipped cream.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Put the chocolate mousse in the fridge for about 15 to 30 minutes.In the meantime, with a round cookie cutter, cut circles into the piece of wafer.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Cut about 4 to 5 per person. This makes 4 servings so cut about 20 circles.With the cookie cutter, measure how much acetate you will need to roll around the dessert. Make sure the end overlaps onto the starting piece.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [], u'step': u'Cut 4 of them.Prepare 8 pieces of clear tape to tape the acetate together around the mousse. By putting the acetate strip, you will have a nice and smooth round dessert, just like the picture above shows.Put your chocolate mousse in a piping bag.Take 4 dessert plates and one at a time, do the following steps:Put a piece of wafer in the middle on your plate. Pipe a good layer of chocolate mousse on it, about half an inch thick.Put another wafer on top and repeat the piping. Do it for three other times, or two if you are happy with the height. Always end with a wafer on top.Wrap the acetate strip around the dessert and make it a tight as possible. Tape it.  Once the acetate is taped on, lightly press on the top wafer to evenly distribute the mousse so there are no more gaps between the mousse and the wafers.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add a bit more mousse on top of the top wafer and put it in the fridge.Leave it in the fridge for at least an hour before serving but I personally leave them in for about 3 hours so the wafers have time to soften up.Just before serving, take the acetate of slowly and serve with fresh raspberries or with raspberry coulis.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 111, u'instructions': u"Start by melting a cup of chocolate chip either in a double boiler or in the microwave. Pick your favorite kind of chocolate (dark, semi sweet or event white!). If you decide to melt your chocolate in the microwave, put it in for about 10 seconds at a time, mixing it in between each time, until it is completely melted and smooth. Be careful not to over cook it.Let the chocolate sit for about 10 minutes, stirring it frequently.While your chocolate is cooling, whip your heavy cream into soft peaks.With a spatula, fold your chocolate in your whipped cream until nice and smooth. Make sure to fold and not whip the chocolate in so you don't lose too much air from your whipped cream.Put the chocolate mousse in the fridge for about 15 to 30 minutes.In the meantime, with a round cookie cutter, cut circles into the piece of wafer. Cut about 4 to 5 per person. This makes 4 servings so cut about 20 circles.With the cookie cutter, measure how much acetate you will need to roll around the dessert. Make sure the end overlaps onto the starting piece. Cut 4 of them.Prepare 8 pieces of clear tape to tape the acetate together around the mousse. By putting the acetate strip, you will have a nice and smooth round dessert, just like the picture above shows.Put your chocolate mousse in a piping bag.Take 4 dessert plates and one at a time, do the following steps:Put a piece of wafer in the middle on your plate. Pipe a good layer of chocolate mousse on it, about half an inch thick.Put another wafer on top and repeat the piping. Do it for three other times, or two if you are happy with the height. Always end with a wafer on top.Wrap the acetate strip around the dessert and make it a tight as possible. Tape it.  Once the acetate is taped on, lightly press on the top wafer to evenly distribute the mousse so there are no more gaps between the mousse and the wafers. Add a bit more mousse on top of the top wafer and put it in the fridge.Leave it in the fridge for at least an hour before serving but I personally leave them in for about 3 hours so the wafers have time to soften up.Just before serving, take the acetate of slowly and serve with fresh raspberries or with raspberry coulis.", u'spoonacularSourceUrl': u'https://spoonacular.com/easiest-chocolate-mousse-layered-cake-546762', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}