{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/700728-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 700728, u'veryPopular': True, u'lowFodmap': False, u'title': u'Onion, Celery, and Mushroom Stuffing', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 127.38, u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'8 cups gluten-free bread cubes', u'aisle': u'Bakery/Bread', u'name': u'bread cubes', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 18064, u'unit': u'cups'}, {u'originalString': u'4 Tbs. vegan butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbs'}, {u'originalString': u'8 oz. button or cremini mushrooms, chopped', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'\xbd tsp. dried rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'\xbc cup fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 Tbs. fresh sage, chopped or 1 tsp. dried sage', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'dried', u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. fresh thyme, chopped or 1 tsp. dried thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'dried', u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'Tbs'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd tsp. fresh ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp. Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1/8 tsp. nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'2 Tbs. extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd tsp. dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'ribs celery, chopped', u'aisle': u'Produce', u'name': u'ribs celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'rib', u'unitShort': u'ribs', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'4-5 cups low-sodium vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.onegreenplanet.org/plant-based-recipes/onion-celery-and-mushroom-stuffing/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees. In a large skillet, heat the oil and butter over medium-high heat until melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add in the onion and celery and let cook until softened but not brown, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the mushrooms and let cook until softened and browned, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix in the garlic and the seasonings.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the parsley and the bread cubes to the skillet.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18064, u'name': u'bread cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Mix well. Moisten the cubes with broth until it is soft but not wet.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Remove the bay leaf and let the mixture cool.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Transfer the stuffing to a large casserole dish tha has been brushed with some oil or cooking spray.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Bake until the stuffing is set and crisp, about 15 minutes.Then turn the casserole dish around and cook 5 more minutes until browned to your liking. Enjoy!', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 962, u'instructions': u'<p>Preheat the oven to 400 degrees. In a large skillet, heat the oil and butter over medium-high heat until melted. Add in the onion and celery and let cook until softened but not brown, about 4 minutes. Add the mushrooms and let cook until softened and browned, about 5 minutes. Mix in the garlic and the seasonings.</p><p>Add the parsley and the bread cubes to the skillet. Mix well. Moisten the cubes with broth until it is soft but not wet. Remove the bay leaf and let the mixture cool.</p><p>Transfer the stuffing to a large casserole dish tha has been brushed with some oil or cooking spray. Bake until the stuffing is set and crisp, about 15 minutes.Then turn the casserole dish around and cook 5 more minutes until browned to your liking. Enjoy!</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/onion-celery-and-mushroom-stuffing-700728', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}