{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/736274-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 736274, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caesar Salad Taco Bites', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 40, u'pricePerServing': 7.12, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon anchovy paste or 1 anchovy, minced', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'anchovy paste', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovy-paste.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10015002, u'unit': u'teaspoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 tablespoon lemon juice (1/2 lemon)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'(1/2 lemon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'2 tablespoons plus 1 cup freshly grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'5 cups finely shredded romaine lettuce (2 romaine hearts)', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'shredded', u'finely', u'(2 romaine hearts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'36 tortilla chip scoops', u'aisle': u'Savory Snacks', u'name': u'tortilla chip scoops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 36.0, u'consistency': u'solid', u'id': 10019056, u'unit': u''}, {u'originalString': u'1/4 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpeg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/caesar-salad-taco-bites.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, whisk together the mayonnaise, Worcestershire, garlic, lemon juice, anchovy paste, salt and 2 tablespoons Parmesan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovy-paste.png', u'id': 10015002, u'name': u'anchovy paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the lettuce to the dressing; toss well to coat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a medium skillet over medium heat and spray with nonstick spray. Sprinkle 1/4 cup of the remaining Parmesan evenly over the bottom of the pan. Cook until the cheese is bubbly and beginning to brown, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove from the heat, let cool for 1 minute, and then invert the cheese onto a parchment-lined baking sheet with the help of an offset spatula. Set aside to cool completely. Repeat with the remaining Parmesan. When all of the frico is fully cooled, break into bite-size pieces.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Scoop a small spoonful of the salad into each of the tortilla cups. Top with a piece of frico and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 559, u'instructions': u'In a large bowl, whisk together the mayonnaise, Worcestershire, garlic, lemon juice, anchovy paste, salt and 2 tablespoons Parmesan. Add the lettuce to the dressing; toss well to coat.                          Heat a medium skillet over medium heat and spray with nonstick spray. Sprinkle 1/4 cup of the remaining Parmesan evenly over the bottom of the pan. Cook until the cheese is bubbly and beginning to brown, 3 to 4 minutes. Remove from the heat, let cool for 1 minute, and then invert the cheese onto a parchment-lined baking sheet with the help of an offset spatula. Set aside to cool completely. Repeat with the remaining Parmesan. When all of the frico is fully cooled, break into bite-size pieces.                          Scoop a small spoonful of the salad into each of the tortilla cups. Top with a piece of frico and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/caesar-salad-taco-bites-736274', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}