{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/559415-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 559415, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Crab Cakes', u'diets': [u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 263.82, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'1 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'8 ounces crab meat', u'aisle': u'Seafood', u'name': u'crab meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10015136, u'unit': u'ounces'}, {u'originalString': u'1/2 cup crushed crackers', u'aisle': u'Savory Snacks', u'name': u'crackers', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18621, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tbsp fresh chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'1 green onion chopped', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'4 tsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'3 tbsp mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp tabasco sauce or any hot sauce', u'aisle': u'Condiments', u'name': u'tabasco sauce', u'metaInformation': [u'or any hot sauce'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6168, u'unit': u'tsp'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.jocooks.com/main-courses/easy-crab-cakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Basically this is very easy to do. In a medium bowl start by whisking together the egg, mayonnaise, lemon juice, hot sauce, parsley and green onion.With a wooden spoon start stirring in the crab meat, but be very gentle with it. Gradually add the crackers, you may add more crackers until you get the right consistency.In a skillet heat the butter on medium heat. Form the crab mixture into 4 patties.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 10015136, u'name': u'crabmeat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Place the patties in the skilled and cook until golden brown, about 5 min per side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with your favorite side dish.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The King Estate Signature Collection Pinot Gris with a 4.3 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish. View More', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 185, u'instructions': u'Basically this is very easy to do. In a medium bowl start by whisking together the egg, mayonnaise, lemon juice, hot sauce, parsley and green onion.With a wooden spoon start stirring in the crab meat, but be very gentle with it. Gradually add the crackers, you may add more crackers until you get the right consistency.In a skillet heat the butter on medium heat. Form the crab mixture into 4 patties. Place the patties in the skilled and cook until golden brown, about 5 min per side.Serve with your favorite side dish.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-crab-cakes-559415', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}