{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628380-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_6', u'id': 628380, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beet apple carrot juice', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 101.21, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'3-4 organic apples', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'3 organic small to medium beets', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'small to medium', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'1 lb organic carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'lb'}, {u'originalString': u'2 inch piece ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.eatgood4life.com/beet-apple-carrot-juice/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}], u'step': u"Wash all your produce before putting through thejuicer.There is no need to peel them if organic. If you can't afford organic produce or if it is not available to you just spray them with apple cider vinegar and wash very well.I use mason jars to store my juice but it is best when the juice is consumed inmmediately!", u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u"Wash all your produce before putting through thejuicer.There is no need to peel them if organic. If you can't afford organic produce or if it is not available to you just spray them with apple cider vinegar and wash very well.I use mason jars to store my juice but it is best when the juice is consumed inmmediately!", u'spoonacularSourceUrl': u'https://spoonacular.com/beet-apple-carrot-juice-628380', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}