{u'recipes': [{u'sourceName': u'In Simones Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618480-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 618480, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lime curd tarts with kumquats', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 79.98, u'creditText': u'In Simones Kitchen', u'extendedIngredients': [{u'originalString': u'2.5 cups (310 gr) all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [u'(310 gr)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'150g butter (at roomtemperature)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(at roomtemperature)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'6 eggs (lightly beaten)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3-4 limes (you need about 3/4 of a cup)', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'(you need 3/4 of a cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'3 tbsp ice-cold water or just enough to hold the pastry together', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18337, u'unit': u'tbsp'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'56 gr sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grs', u'unitShort': u'gr', u'amount': 56.0, u'consistency': u'solid', u'id': 19335, u'unit': u'gr'}, {u'originalString': u'280g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 280.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://insimoneskitchen.com/lime-curd-tarts-kumquats-step-2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the sugar into a medium stainless steel saucepan. Wash and dry the limes, then finely grate the zest of 2 limes, and add the zest to the sugar.Squeeze all 3 limes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour the juice into the saucepan with the sugar, add the soft butter in pieces and the lightly beaten eggs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Place the smaller saucepan into a larger one, partly filled with hot water (au bain marie/double boiler) and simmer until the cream begins to thicken. Stir constantly with a wooden spoon. Never allow the curd to boil! it should only simmer very gently.Ladle the lime curd into perfectly clean jam jars. Close the lids tightly and store in the fridge. Lemon curd is perishable because of the eggs, so dont store it for more then two weeks. Or use directly on these tarts', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'At least 30 minutes before rolling and baking (or up to 1 day in advance) prepare the pastry. In the bowl of a food processor, fitted with a plastic blade, pulse together the flour and salt.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Add the butter and pulse rapidly, about 40-50 times, or until the butter is blended into the flour and is coarse and the size of small peas.Gradually add the water in a small trickle, with the processor running. Continue adding just as the pastry starts coming together in the shape of a loose, crumbly ball.Turn out onto a lightly floured surface. Form into a disc, about 1" high, and wrap tightly with plastic wrap.Refrigerate for at least 30 minutes or overnight.When ready to bake take out your dough from the fridge and put it on a lightly floured surface.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Roll the pastry quickly out till thin enough and lift it into whichever form you have prepared. (round,square, little or big) Line it carefully along the sides and remove the excess dough.Blind bake your pastry by lining it first with baking paper and then weighing it down with beans or rice.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Bake in a preheated oven at 180 C for about 20 minutes. Take out the tins, remove the baking weights and brush your pastry with egg wash. Put it back into the oven and continue baking for another 10 minutes.Take out of the oven.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 6, u'instructions': u'Put the sugar into a medium stainless steel saucepan. Wash and dry the limes, then finely grate the zest of 2 limes, and add the zest to the sugar.Squeeze all 3 limes. Pour the juice into the saucepan with the sugar, add the soft butter in pieces and the lightly beaten eggs. Place the smaller saucepan into a larger one, partly filled with hot water (au bain marie/double boiler) and simmer until the cream begins to thicken. Stir constantly with a wooden spoon. Never allow the curd to boil! it should only simmer very gently.Ladle the lime curd into perfectly clean jam jars. Close the lids tightly and store in the fridge. Lemon curd is perishable because of the eggs, so dont store it for more then two weeks. Or use directly on these tartsAt least 30 minutes before rolling and baking (or up to 1 day in advance) prepare the pastry. In the bowl of a food processor, fitted with a plastic blade, pulse together the flour and salt. Add the butter and pulse rapidly, about 40-50 times, or until the butter is blended into the flour and is coarse and the size of small peas.Gradually add the water in a small trickle, with the processor running. Continue adding just as the pastry starts coming together in the shape of a loose, crumbly ball.Turn out onto a lightly floured surface. Form into a disc, about 1" high, and wrap tightly with plastic wrap.Refrigerate for at least 30 minutes or overnight.When ready to bake take out your dough from the fridge and put it on a lightly floured surface. Roll the pastry quickly out till thin enough and lift it into whichever form you have prepared. (round,square, little or big) Line it carefully along the sides and remove the excess dough.Blind bake your pastry by lining it first with baking paper and then weighing it down with beans or rice. Bake in a preheated oven at 180 C for about 20 minutes. Take out the tins, remove the baking weights and brush your pastry with egg wash. Put it back into the oven and continue baking for another 10 minutes.Take out of the oven.', u'spoonacularSourceUrl': u'https://spoonacular.com/lime-curd-tarts-with-kumquats-618480', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}