{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/218239-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': -1455, u'id': 218239, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pickled Shrimp and Vegetables', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 1500, u'pricePerServing': 371.95, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'3 large celery ribs, sliced diagonally (1/4 inch thick)', u'aisle': u'Produce', u'name': u'celery ribs', u'metaInformation': [u'large', u'sliced', u'(1/)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 large fennel bulb (sometimes labeled "anise"; 1 lb), stalks discarded', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 tablespoons fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2018, u'unit': u'tablespoons'}, {u'originalString': u'1 cup chopped fresh flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'3 large garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 tablespoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoons'}, {u'originalString': u'3 to 4 large lemons', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'4 tablespoons pickling spices (from a 2 1/2-oz jar)', u'aisle': u'Spices and Seasonings', u'name': u'pickling spices', u'metaInformation': [u'(from a 2 1/2-oz jar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickling-spices.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1012001, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon dried hot red-pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'dried', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'3 lb large shrimp in shell (21 to 25 per lb), peeled, tail and first shell segment left intact, and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'deveined', u'peeled', u'per lb), , tail and first shell segment left intact, and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 large Turkish bay leaves or 1 California', u'aisle': u'Produce;Spices and Seasonings', u'name': u'turkish bay leaves', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 jumbo sweet onion such as Vidalia (1 lb), halved lengthwise and thinly sliced crosswise', u'aisle': u'Produce', u'name': u'vidalia onion', u'metaInformation': [u'sweet', u'halved lengthwise', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u'lb'}, {u'originalString': u'2 cups white-wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white-wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cups'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Pickled-Shrimp-and-Vegetables-1222212', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a 6- to 8-quart pot of water to a boil with remaining 2 tablespoons kosher salt, 2 tablespoons pickling spices, 1 tablespoon fennel seeds, remaining one third of garlic, and bay leaves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickling-spices.jpg', u'id': 1012001, u'name': u'pickling spices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Meanwhile, quarter fennel bulb lengthwise and cut crosswise into 1/4-inch-thick slices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel bulb'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add sliced fennel to boiling water and cook, stirring occasionally, 3 minutes, then transfer with a slotted spoon to marinade. Return water to a boil, then add celery and cook, stirring occasionally, 1 minute.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Transfer celery with a slotted spoon to marinade. Return water to a boil, then add onion and cook, stirring occasionally, 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Transfer onion with a slotted spoon to marinade. Return water to a boil and cook shrimp, stirring occasionally, until just cooked through (no longer translucent inside), about 1 1/2 minutes, then transfer with a slotted spoon to marinade. Stir shrimp and vegetables until coated well.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'When shrimp and vegetables have cooled to room temperature, transfer to a large airtight container and marinate, chilled, stirring once or twice, until shrimp is pickled and flavors have developed, at least 8 hours. Season with salt and pepper and transfer shrimp and vegetables to a platter with a slotted spoon and drizzle shrimp with some of marinade. Stir in parsley just before serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u'Cook vegetables and shrimp'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404778, u'name': u'box grater'}], u'step': u'Finely grate 3 tablespoons lemon zest using small holes of a box grater, then squeeze 3/4 cup juice from lemons.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer zest and juice to a large bowl and add vinegar, oil, sugar, red-pepper flakes, 2 tablespoons kosher salt, 2 tablespoons pickling spices, 1 tablespoon fennel seeds, and two thirds of garlic, whisking until combined well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickling-spices.jpg', u'id': 1012001, u'name': u'pickling spices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u'Make marinade'}, {u'steps': [{u'equipment': [], u'step': u'Shrimp and vegetables can be marinated up to 2 days.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u"Cooks' Note"}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Maso Canali Pinot Grigio. It has 4.6 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal. View More', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 201, u'instructions': u"Preparation                                        Make marinade:                Finely grate 3 tablespoons lemon zest using small holes of a box grater, then squeeze 3/4 cup juice from lemons. Transfer zest and juice to a large bowl and add vinegar, oil, sugar, red-pepper flakes, 2 tablespoons kosher salt, 2 tablespoons pickling spices, 1 tablespoon fennel seeds, and two thirds of garlic, whisking until combined well.                                                            Cook vegetables and shrimp:                Bring a 6- to 8-quart pot of water to a boil with remaining 2 tablespoons kosher salt, 2 tablespoons pickling spices, 1 tablespoon fennel seeds, remaining one third of garlic, and bay leaves.                                                                Meanwhile, quarter fennel bulb lengthwise and cut crosswise into 1/4-inch-thick slices. Add sliced fennel to boiling water and cook, stirring occasionally, 3 minutes, then transfer with a slotted spoon to marinade. Return water to a boil, then add celery and cook, stirring occasionally, 1 minute. Transfer celery with a slotted spoon to marinade. Return water to a boil, then add onion and cook, stirring occasionally, 2 minutes. Transfer onion with a slotted spoon to marinade. Return water to a boil and cook shrimp, stirring occasionally, until just cooked through (no longer translucent inside), about 1 1/2 minutes, then transfer with a slotted spoon to marinade. Stir shrimp and vegetables until coated well.                                                                When shrimp and vegetables have cooled to room temperature, transfer to a large airtight container and marinate, chilled, stirring once or twice, until shrimp is pickled and flavors have developed, at least 8 hours. Season with salt and pepper and transfer shrimp and vegetables to a platter with a slotted spoon and drizzle shrimp with some of marinade. Stir in parsley just before serving.                                                Cooks' Note:             Shrimp and vegetables can be marinated up to 2 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/pickled-shrimp-and-vegetables-218239', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}