{u'recipes': [{u'sourceName': u'Nutmeg Nanny', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/586792-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 586792, u'veryPopular': True, u'lowFodmap': False, u'title': u'Poblano Macaroni and Cheese', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 140.92, u'creditText': u'Nutmeg Nanny', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon cayenne powder', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 cup Cotija cheese (I could not find)', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [u'(I could not find)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001019, u'unit': u'cup'}, {u'originalString': u'8 oz. elbow pasta', u'aisle': u'Pasta and Rice', u'name': u'elbow pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10120499, u'unit': u'oz'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'4 cloves of minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon lime zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon mustard powder', u'aisle': u'Spices and Seasonings', u'name': u'mustard powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'2 Poblano chiles', u'aisle': u'Produce', u'name': u'poblano chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 15.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'4 cups grated white cheddar', u'aisle': u'Cheese', u'name': u'white cheddar', u'metaInformation': [u'white', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1011009, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.nutmegnanny.com/2011/09/10/poblano-macaroni-and-cheese-the-homesick-texan-cookbook-spotlight-cook-off/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Roast the poblano chilies under the broiler until blackened, about 5 minutes per side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [], u'step': u'Place the chiles in a paper sack or plastic food-storage bag, close it tightly, and let the for 20 minutes. Take the chiles out of the bag and rub off the skin. Take the chiles out of the bag and rub off the skin.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Remove the stem and seeds and chop the chiles into 1-inch long pieces.Bring a large pot of salted water to a boil and add the pasta. Cook according to your package's directions ad then drain the pasta. (You want the pasta to be cooked but not mushy; cook for 5 minutes.)Preheat the oven to 375. Grease a large baking dish or a large 12 inch cast-iron skillet, and pour the drained pasta into the dish.In a pot (you can use the pot the pasta cooked in or you can do this while the pasta boils), on low heat melt the butter.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the garlic and cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the flour and cook until a light brown, toasty paste is formed, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk in the milk and stir until it's thickened a bit but still fluid, about 1 to 2 minutes.", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Remove the pot from the heat and stir in the mustard powder, cayenne, cumin, lime zest, cilantro, and chopped poblano chiles. Adjust seasonings and add salt and black pepper.Slowly add half of the cheddar cheese and stir until it's melted and well combined into the sauce. (If the sauce has cooled too much and the cheese won't melt, return the pot to low heat on the stove seems a little thick return it to the stove until soft again. If however, the sauce gets too thick, like a custard, you can thin it by stirring in milk, a teaspoon at a time.)", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour sauce over pasta and top with the remaining half of the cheddar cheese and bake uncovered for 20 minutes or until brown and bubbling. Sprinkle with Cotija cheese, and serve immediately.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1001019, u'name': u'cotija cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Lambrusco, and Riesling are my top picks for Macaroni and Cheese. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. The Dry Creek Vineyard Dry Chenin Blanc, Wine with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'This beautiful wine is wonderfully consistent vintage after vintage. We receive superior Chenin Blanc fruit from the Wilson Ranch in Clarksburg, allowing us to produce an expressive, nuanced and delicious wine. At first swirl, aromatics of white pear, pineapple and banana spring forward from the glass. On the palate, the wine is refreshing with flavors of ripe tangerine and peaches. The mouthfeel is lively, but rich and has a subtle creaminess. 100% stainless steel fermentation guarantees the fresh fruit character fans of this wine have come to appreciate over the years. This is the quintessential summer sipper and the perfect wine to pair with fresh oysters!', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 17675, u'instructions': u"Roast the poblano chilies under the broiler until blackened, about 5 minutes per side. Place the chiles in a paper sack or plastic food-storage bag, close it tightly, and let the for 20 minutes. Take the chiles out of the bag and rub off the skin. Take the chiles out of the bag and rub off the skin. Remove the stem and seeds and chop the chiles into 1-inch long pieces.Bring a large pot of salted water to a boil and add the pasta. Cook according to your package's directions ad then drain the pasta. (You want the pasta to be cooked but not mushy; cook for 5 minutes.)Preheat the oven to 375. Grease a large baking dish or a large 12 inch cast-iron skillet, and pour the drained pasta into the dish.In a pot (you can use the pot the pasta cooked in or you can do this while the pasta boils), on low heat melt the butter. Add the garlic and cook for 1 minute. Whisk in the flour and cook until a light brown, toasty paste is formed, about 1 minute. Whisk in the milk and stir until it's thickened a bit but still fluid, about 1 to 2 minutes. Remove the pot from the heat and stir in the mustard powder, cayenne, cumin, lime zest, cilantro, and chopped poblano chiles. Adjust seasonings and add salt and black pepper.Slowly add half of the cheddar cheese and stir until it's melted and well combined into the sauce. (If the sauce has cooled too much and the cheese won't melt, return the pot to low heat on the stove seems a little thick return it to the stove until soft again. If however, the sauce gets too thick, like a custard, you can thin it by stirring in milk, a teaspoon at a time.) Pour sauce over pasta and top with the remaining half of the cheddar cheese and bake uncovered for 20 minutes or until brown and bubbling. Sprinkle with Cotija cheese, and serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/poblano-macaroni-and-cheese-586792', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}