{u'recipes': [{u'sourceName': u'Dessert Now Dinner Later', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628760-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 628760, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blueberry Stuffed Pull-Apart Bread with Lemon Cream Cheese Glaze', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 72.19, u'creditText': u'Dessert Now Dinner Later', u'extendedIngredients': [{u'originalString': u'2 \xbc tsp active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}, {u'originalString': u'1 cup blueberry preserves', u'aisle': u'Produce', u'name': u'blueberry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'\xbe cup warm buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'4 ounces cream cheese softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 large egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 to 3\xbd cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'3 Tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp finely shredded lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 9156, u'unit': u'Tbsp'}, {u'originalString': u'1 \xbd cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbc cup sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbe cup unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'3 Tbsp unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'\xbc cup warm water (about 105 – 110 degrees Fahrenheit)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'( 105 - 110 degrees Fahrenheit)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.dessertnowdinnerlater.com/2015/02/blueberry-stuffed-pull-apart-bread-lemon-cream-cheese-glaze/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a small cup, combine the yeast, warm water, and 1 Tbsp of the sugar. Stir to dissolve; let sit for 5 minutes.In a large mixing bowl, combine 1 cup of the flour, salt, remaining sugar, egg, buttermilk, vanilla, and butter.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix until well blended and smooth. Gradually add in enough of the remaining flour to make a stiff dough. Turn the dough out onto a lightly floured surface and knead until smooth and elastic, about 6 to 8 minutes. Dough is ready when it springs back when poked with a finger.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the dough in a greased bowl, cover, and let rise in a warm place until it doubles in size (about 1 hour).Meanwhile, melt the butter for the coating in a small bowl. In a separate bowl combine the sugar and lemon peel. Set aside.Spray a 10 cup bundt pan with cooking spray. Set aside. Punch the dough down gently. Divide the dough in half. Then divide each half into 16 balls. You should have 32 dough balls. Cover the dough balls with a damp towel as you work to prevent them from drying out. Pat each dough ball into a 2 -inch circle.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}], u'step': u'Place 1 tsp of blueberry preserves into the center of the dough. Pinch the edges together to form a seal, making the shape of a ball. Dip the ball into the melted butter then generously roll it into the sugar coating. Arrange the dough ball seam side down in the prepared bundt pan. Repeat until all of the dough has been filled and rolled.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add any remaining coating or butter to the top of the dough balls, making sure to cover the exposed surface. Cover and let rise once more for 45 minutes.Preheat the oven to 350 degrees Fahrenheit.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake for 30 to 35 minutes. Cool for 5 to 10 minutes. Invert the bread onto a serving plate.Make the glaze: Beat together the cream cheese and lemon juice. Gradually whisk in enough powdered sugar to form an icing drizzle.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Drizzle the glaze over the bread while the bread is still warm.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 24, u'instructions': u'In a small cup, combine the yeast, warm water, and 1 Tbsp of the sugar. Stir to dissolve; let sit for 5 minutes.In a large mixing bowl, combine 1 cup of the flour, salt, remaining sugar, egg, buttermilk, vanilla, and butter. Mix until well blended and smooth. Gradually add in enough of the remaining flour to make a stiff dough. Turn the dough out onto a lightly floured surface and knead until smooth and elastic, about 6 to 8 minutes. Dough is ready when it springs back when poked with a finger. Place the dough in a greased bowl, cover, and let rise in a warm place until it doubles in size (about 1 hour).Meanwhile, melt the butter for the coating in a small bowl. In a separate bowl combine the sugar and lemon peel. Set aside.Spray a 10 cup bundt pan with cooking spray. Set aside. Punch the dough down gently. Divide the dough in half. Then divide each half into 16 balls. You should have 32 dough balls. Cover the dough balls with a damp towel as you work to prevent them from drying out. Pat each dough ball into a 2 -inch circle. Place 1 tsp of blueberry preserves into the center of the dough. Pinch the edges together to form a seal, making the shape of a ball. Dip the ball into the melted butter then generously roll it into the sugar coating. Arrange the dough ball seam side down in the prepared bundt pan. Repeat until all of the dough has been filled and rolled. Add any remaining coating or butter to the top of the dough balls, making sure to cover the exposed surface. Cover and let rise once more for 45 minutes.Preheat the oven to 350 degrees Fahrenheit. Bake for 30 to 35 minutes. Cool for 5 to 10 minutes. Invert the bread onto a serving plate.Make the glaze: Beat together the cream cheese and lemon juice. Gradually whisk in enough powdered sugar to form an icing drizzle. Drizzle the glaze over the bread while the bread is still warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-stuffed-pull-apart-bread-with-lemon-cream-cheese-glaze-628760', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}