{u'recipes': [{u'sourceName': u'What Jew Wanna Eat', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/481197-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 481197, u'veryPopular': False, u'lowFodmap': False, u'title': u'Buffalo Mushroom Matzah Pizza', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 204.52, u'creditText': u'What Jew Wanna Eat', u'extendedIngredients': [{u'originalString': u'2 tablespoons bourbon (or red wine)', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [u'red', u'(or wine)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons butter, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u"2 teaspoons hot sauce (or more to taste. I used Frank's)", u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u"( to taste. I used Frank's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'teaspoons'}, {u'originalString': u'2 pieces matzah (preferably Yehuda brand)', u'aisle': u'Ethnic Foods', u'name': u'matzah', u'metaInformation': [u'(preferably Yehuda brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10018217, u'unit': u'pieces'}, {u'originalString': u'1 pint mushrooms, chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'pint'}, {u'originalString': u'Salt and pepper to taste (I used truffle salt to enhance the mushroom flavor)', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste', u'(I used truffle salt to enhance the mushroom flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 spring thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'\xbc cup blue cheese divided in two piles', u'aisle': u'?', u'name': u'cheese in two piles', u'metaInformation': [u'blue', u'divided'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://whatjewwannaeat.com/buffalo-mushroom-matzah-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 350 and toast your matzah for about 10 minutes. This will make the pizza extra crispy and not get soggy once you put the topping on.Chop up your mushrooms and saute in 1 tablespoon butter (or olive oil) under soft.Then add your minced garlic and cook for an additional 5 minutes.Now time to deglaze.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 10018217, u'name': u'matzo'}]}, {u'equipment': [], u'step': u'Add the bourbon and hot sauce along with the thyme and cook until reduced to one teaspoon.Once reduced to pretty much nothing, take off the heat and mount with 1 tablespoon butter.Mmm butter. Swirl around until the butter is melted and add half the blue cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Mix until melted.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add salt and pepper to taste. Cover the matzah pieces with the mushroom mixture and top more blue cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 10018217, u'name': u'matzo'}]}, {u'equipment': [], u'step': u'Bake until the cheese is melty, about 7 minutes, and serve immediately!', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 48, u'instructions': u'Preheat your oven to 350 and toast your matzah for about 10 minutes. This will make the pizza extra crispy and not get soggy once you put the topping on.Chop up your mushrooms and saute in 1 tablespoon butter (or olive oil) under soft.Then add your minced garlic and cook for an additional 5 minutes.Now time to deglaze. Add the bourbon and hot sauce along with the thyme and cook until reduced to one teaspoon.Once reduced to pretty much nothing, take off the heat and mount with 1 tablespoon butter.Mmm butter. Swirl around until the butter is melted and add half the blue cheese. Mix until melted.Add salt and pepper to taste. Cover the matzah pieces with the mushroom mixture and top more blue cheese.Bake until the cheese is melty, about 7 minutes, and serve immediately!', u'spoonacularSourceUrl': u'https://spoonacular.com/buffalo-mushroom-matzah-pizza-481197', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}