{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/759784-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 759784, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Tofu Steaks with Veggie Kabobs', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 190.91, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 tsp. chili-garlic sauce', u'aisle': u'Ethnic Foods', u'name': u'chili-garlic sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 93749, u'unit': u'tsp'}, {u'originalString': u'2 16-oz. pkgs. extra-firm tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'oz'}, {u'originalString': u'2 Tbs. minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 6175, u'unit': u'cup'}, {u'originalString': u'1/3 cup low-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'12 oz. mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'2 Tbs. frozen orange juice concentrate, thawed', u'aisle': u'Frozen', u'name': u'orange juice concentrate', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 9214, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'Tbs'}, {u'originalString': u'1/3 cup sherry', u'aisle': u'Alcoholic Beverages', u'name': u'sherry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 10214106, u'unit': u'cup'}, {u'originalString': u'\xbd lb. sugar snap peas', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10011300, u'unit': u'lb'}, {u'originalString': u'2 sweet onions, quartered', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/grilled-tofu-steaks-with-veggie-kabobs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place tofu between two cutting boards, and top with heavy pot or several cans to press out liquid.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Drain 1 hour, then pat dry.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut tofu blocks lengthwise into 4 slices.2.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Combine soy sauce, sherry, hoisin sauce, ginger, orange juice concentrate, sesame oil, and chili-garlic sauce in container.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9214, u'name': u'orange juice concentrate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'id': 93749, u'name': u'chili garlic sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add tofu, and toss to coat. Refrigerate 3 hours, or up to 2 days. 3. To make Veggie Kabobs: Oil grill grates and preheat grill to medium. Thread all vegetables onto skewers, and brush with oil. Grill onions and mushrooms 15 minutes, and snap peas 5 minutes, turning occasionally. 4. Meanwhile, drain Tofu Steaks, reserving marinade. Grill 8 minutes, or until browned and crispy. 5.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'id': 10011300, u'name': u'sugar snap peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat reserved marinade in small saucepan until simmering.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over tofu steaks, and serve.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u'To make Tofu Steaks'}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try Rombauer Merlot. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 26 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Enticing and lively red color; beautifully aromatic with black cherry and ripe plum. On the palate a purity of blackcurrant, cedar and mint flavors blend together seamlessly. Soft and supple, this wine has a medium-bodied mouth-feel with plush tannins that integrate with the generous finish.Our favorite pairings for this wine include chicken parmesan, cedar-planked salmon over wild rice, and mushroom pizza.  View More', u'title': u'Rombauer Merlot', u'price': u'$25.59', u'id': 447938, u'link': u'https://www.wine.com/product/rombauer-merlot-2008/116883', u'imageUrl': u'https://spoonacular.com/productImages/447938-312x231.jpg'}]}, u'aggregateLikes': 244, u'instructions': u'1. To make Tofu Steaks: Place tofu between two cutting boards, and top with heavy pot or several cans to press out liquid. Drain 1 hour, then pat dry. Cut tofu blocks lengthwise into 4 slices.2. Combine soy sauce, sherry, hoisin sauce, ginger, orange juice concentrate, sesame oil, and chili-garlic sauce in container. Add tofu, and toss to coat. Refrigerate 3 hours, or up to 2 days. 3. To make Veggie Kabobs: Oil grill grates and preheat grill to medium. Thread all vegetables onto skewers, and brush with oil. Grill onions and mushrooms 15 minutes, and snap peas 5 minutes, turning occasionally. 4. Meanwhile, drain Tofu Steaks, reserving marinade. Grill 8 minutes, or until browned and crispy. 5. Heat reserved marinade in small saucepan until simmering. Pour over tofu steaks, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-tofu-steaks-with-veggie-kabobs-759784', u'dishTypes': [], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}