{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/552236-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 552236, u'veryPopular': True, u'lowFodmap': False, u'title': u'Southern Comfort" Bacon Hot Dog with Southern Slaw', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 145.01, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u'8 strips bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u"22 oz. can good baked beans (I like Bushes Grillin' Beans)", u'aisle': u'Meat', u'name': u'baked beans', u'metaInformation': [u'good', u'canned', u"(I like Bushes Grillin' Beans)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-and-beans-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 22.0, u'consistency': u'solid', u'id': 16009, u'unit': u'oz'}, {u'originalString': u'8 hot dogs or polish sausages', u'aisle': u'Meat', u'name': u'sausages', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1017063, u'unit': u''}, {u'originalString': u'8 hot dog buns', u'aisle': u'Bakery/Bread', u'name': u'hot dog buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10018350, u'unit': u''}, {u'originalString': u'Caraway seeds and hot sauce optional', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'1/4 cup light mayonnaise', u'aisle': u'Condiments', u'name': u'light mayonnaise', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'8 pickled okra, halved lengthwise', u'aisle': u'Produce', u'name': u'okra', u'metaInformation': [u'halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11278, u'unit': u''}, {u'originalString': u'3 Tb. rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 3.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'Tb'}, {u'originalString': u'Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 lb. bag southern slaw mix (shredded cabbage and carrots)', u'aisle': u'Produce', u'name': u'slaw mix', u'metaInformation': [u'shredded', u'( cabbage and carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10011109, u'unit': u'lb'}, {u'originalString': u'2 Tb. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tb'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.aspicyperspective.com/2013/07/bacon-hot-dog-recipe-southern-slaw.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Preheat the grill to high heat and place a large skillet over medium heat. Cook the bacon in the skillet until crisp, then remove and drain over paper towels.In a medium bowl, mix the mayo, vinegar and sugar together until smooth. Toss in the southern slaw mix to coat. Salt and pepper to taste. If desired add caraway seeds and/or hot sauce to the slaw.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw.png', u'id': 10011109, u'name': u'coleslaw mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Place in the refrigerator until ready to serve.', u'number': 2, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place a hot dog in each bun and wedge a strip of bacon next to it. Top with warm beans, slaw, and two pickled okra halves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u'Place the bean in a small pot, then put the pot and the hot dogs on the grill. Grill the hot dogs for 4-6 minutes, turning for even char marks.To serve'}], u'winePairing': {u'pairingText': u"Riesling, Gewurztraminer, and ros\xe9 Wine are my top picks for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. One wine you could try is Columbia Winery Cellarmaster's Riesling. It has 4.7 out of 5 stars and a bottle costs about 12 dollars.", u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 1373, u'instructions': u'Preheat the grill to high heat and place a large skillet over medium heat. Cook the bacon in the skillet until crisp, then remove and drain over paper towels.In a medium bowl, mix the mayo, vinegar and sugar together until smooth. Toss in the southern slaw mix to coat. Salt and pepper to taste. If desired add caraway seeds and/or hot sauce to the slaw. Place in the refrigerator until ready to serve.Place the bean in a small pot, then put the pot and the hot dogs on the grill. Grill the hot dogs for 4-6 minutes, turning for even char marks.To serve: Place a hot dog in each bun and wedge a strip of bacon next to it. Top with warm beans, slaw, and two pickled okra halves.', u'spoonacularSourceUrl': u'https://spoonacular.com/southern-comfort-bacon-hot-dog-with-southern-slaw-552236', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}