{u'recipes': [{u'sourceName': u'Tessa the Domestic Diva', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/542969-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 542969, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oven Baked Chimichangas - Gluten & Dairy Free', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 99.98, u'creditText': u'Tessa the Domestic Diva', u'extendedIngredients': [{u'originalString': u'1 slice bacon, finely chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slice'}, {u'originalString': u'About 6-8 brown rice tortillas (or flour tortillas if you can have them, however, even my husband LOVES these with the brown rice tortillas, especially crunchy and crisp!)', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'with the brown rice tortillas, especially crunchy and crisp!)', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 20040, u'unit': u''}, {u'originalString': u'1 14 ounce can pinto beans, w/ soaking liquid', u'aisle': u'Canned and Jarred', u'name': u'canned pinto beans', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16044, u'unit': u'ounce'}, {u'originalString': u'2\xbc cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'2 teaspoons Fiesta chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'3-4 cloves garlic, sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cup long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}, {u'originalString': u'2 tablespoons oil (I prefer coconut oil )', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'(I prefer coconut oil )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon dried oregano leaves, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt (or more to taste)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd can tomato paste*** (see tip) or tomato sauce if it is what you have', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [u'(see tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cans', u'unitShort': u'can', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'can'}, {u'originalString': u'\xbd cup Daiya cheese or favorite shredded cheese', u'aisle': u'?', u'name': u'favorite cheese', u'metaInformation': [u'shredded'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.tessadomesticdiva.com/2011/06/chimichangas.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees.Start your rice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil over medium high heat in a pot with a tight fitting lid.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u"Add in the rice and stir to coat with the oil. Continue to cook and stir every minute or two to toast the rice (see picture above). When it looks like mine, you're ready to move on. This normally takes about 5 minutes or so.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add in the salt, garlic, paste and cumin, stirring to blend.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add in the chicken broth, stirring to blend again. Bring to a boil, cover, reduce heat and simmer for 15-20 minutes until rice is tender.Meanwhile, cook your beans!', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Saute the bacon in a small pot until crisp and browned.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a teaspoon or two of oil/fat in a pan large enough to accommodate the brown rice tortilla. (As a side note, anyone who had used these knows, if you try to roll them up cold, they will break. I have also had NO luck using the microwave to heat them for rolling. By heating the tortilla in fat, you are adding the oil to make the tortillas super crunchy in the oven too)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'id': 20040, u'name': u'brown rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Heat the tortilla until soft and pliable, about a minute, remove.First spread some beans, then the chicken. There is no science to how much of each, you just want to make sure you can roll it up!Once filled, roll the tortilla tightly up, placing seam side down on a cookie sheet. Make the remaining chimichangas. If you used no oil or flour tortillas, brush the chimichangas with oil before baking them.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Bake for about 25 minutes until crisp and golden.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with any extra cheese, salsa, avocado, chopped lettuce, or hot sauce.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve on a bed of Spanish rice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u'Pour in the whole can of beans with their liquid, and add the spices. Partially mash the beans with a potato masher or fork. Simmer while you prep the remaining items.Stir together all your chicken filling ingredients.To assemble'}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Chimichanga. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Parducci Small Lot Pinot Noir New Label Wine with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'strawberry , raspberry , cedar', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 116, u'instructions': u"Preheat oven to 400 degrees.Start your rice. Heat oil over medium high heat in a pot with a tight fitting lid. Add in the rice and stir to coat with the oil. Continue to cook and stir every minute or two to toast the rice (see picture above). When it looks like mine, you're ready to move on. This normally takes about 5 minutes or so. Add in the salt, garlic, paste and cumin, stirring to blend. Add in the chicken broth, stirring to blend again. Bring to a boil, cover, reduce heat and simmer for 15-20 minutes until rice is tender.Meanwhile, cook your beans! Saute the bacon in a small pot until crisp and browned. Pour in the whole can of beans with their liquid, and add the spices. Partially mash the beans with a potato masher or fork. Simmer while you prep the remaining items.Stir together all your chicken filling ingredients.To assemble: Heat a teaspoon or two of oil/fat in a pan large enough to accommodate the brown rice tortilla. (As a side note, anyone who had used these knows, if you try to roll them up cold, they will break. I have also had NO luck using the microwave to heat them for rolling. By heating the tortilla in fat, you are adding the oil to make the tortillas super crunchy in the oven too) Heat the tortilla until soft and pliable, about a minute, remove.First spread some beans, then the chicken. There is no science to how much of each, you just want to make sure you can roll it up!Once filled, roll the tortilla tightly up, placing seam side down on a cookie sheet. Make the remaining chimichangas. If you used no oil or flour tortillas, brush the chimichangas with oil before baking them.Bake for about 25 minutes until crisp and golden. Garnish with any extra cheese, salsa, avocado, chopped lettuce, or hot sauce. Serve on a bed of Spanish rice.", u'spoonacularSourceUrl': u'https://spoonacular.com/oven-baked-chimichangas-gluten-dairy-free-542969', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}