{u'recipes': [{u'sourceName': u'The Pioneer Woman', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/427831-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 427831, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fried Fruit Pies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 90, u'pricePerServing': 37.22, u'creditText': u'The Pioneer Woman', u'extendedIngredients': [{u'originalString': u'1 cup Buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'3 cups All-purpose Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Powdered Sugar (for Sprinkling)', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'(for Sprinkling)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3 Tablespoons Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tablespoons'}, {u'originalString': u'Shortening Or Vegetable Oil For Frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'1/2 cup Vegetable Shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'2 whole Eggs, Beaten In Separate Dishes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://thepioneerwoman.com/cooking/2013/02/fried-fruit-pies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'***Important: Be careful when frying with hot oil! If you have little ones in the house, put the pot of oil on the back burner.***To make the pastry, mix together the flour, sugar, and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut in the 1/2 cup of shortening until the mixture resembles coarse crumbs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Add 1 of the beaten eggs, stirring gently with a fork, then add the buttermilk, stirring gently until it all comes together. Form into a ball and refrigerate for at least 1 hour in a plastic bag. To make the pies, roll the pastry on a floured surface into a large rectangle, about 12 inches by 24-plus inches. Make sure the dough is rolled very thin! Using a pizza cutter or a knife, trim the edges to make a very uniform rectangle.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove the scraps along the edge.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the rectangle in half across the middle, then make three cuts in the other direction so that you wind up with 8 smaller rectangles.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place a heaping tablespoon of pie filling on the bottom half of each of the rectangles, leaving plenty of room around the edges.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u"Brush the other beaten egg around the edges of the half of the rectangle with the filling. Bring the top part of the rectangle over the bottom half, pressing lightly to remove air pockets. Press the sides to seal. Dip a fork in flour and crimp the edges gently so that they're extra sealed.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Heat shortening or oil in a large pot over medium high heat until the temperature reaches 350 degrees. One to three at a time (whatever you're comfortable with) lower the pies into the oil using a slotted spoon or metal spatula. Cook until golden brown, about 3 to 4 minutes, turning it halfway.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove to a paper towel-lined pan and repeat with the other pies.Sprinkle the pies generously with sifted powdered sugar.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Serve warm!', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 4200, u'instructions': u"***Important: Be careful when frying with hot oil! If you have little ones in the house, put the pot of oil on the back burner.***To make the pastry, mix together the flour, sugar, and salt. Cut in the 1/2 cup of shortening until the mixture resembles coarse crumbs. Add 1 of the beaten eggs, stirring gently with a fork, then add the buttermilk, stirring gently until it all comes together. Form into a ball and refrigerate for at least 1 hour in a plastic bag. To make the pies, roll the pastry on a floured surface into a large rectangle, about 12 inches by 24-plus inches. Make sure the dough is rolled very thin! Using a pizza cutter or a knife, trim the edges to make a very uniform rectangle. Remove the scraps along the edge.Cut the rectangle in half across the middle, then make three cuts in the other direction so that you wind up with 8 smaller rectangles. Place a heaping tablespoon of pie filling on the bottom half of each of the rectangles, leaving plenty of room around the edges. Brush the other beaten egg around the edges of the half of the rectangle with the filling. Bring the top part of the rectangle over the bottom half, pressing lightly to remove air pockets. Press the sides to seal. Dip a fork in flour and crimp the edges gently so that they're extra sealed. Heat shortening or oil in a large pot over medium high heat until the temperature reaches 350 degrees. One to three at a time (whatever you're comfortable with) lower the pies into the oil using a slotted spoon or metal spatula. Cook until golden brown, about 3 to 4 minutes, turning it halfway. Remove to a paper towel-lined pan and repeat with the other pies.Sprinkle the pies generously with sifted powdered sugar. Serve warm!", u'spoonacularSourceUrl': u'https://spoonacular.com/fried-fruit-pies-427831', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}