{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/425210-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 425210, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skinny Crab Quiche', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 171.86, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (6 ounces) crab', u'aisle': u'Canned and Jarred', u'name': u'canned crab', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 15141, u'unit': u'ounces'}, {u'originalString': u'1-1/2 cups egg substitute', u'aisle': u'Health Foods;Baking;Milk, Eggs, Other Dairy', u'name': u'egg substitute', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1226, u'unit': u'cups'}, {u'originalString': u'1 can (12 ounces) fat-free evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'fat-free', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1214, u'unit': u'ounces'}, {u'originalString': u'1/3 cup chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon ground mustard', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt-free lemon-pepper seasoning', u'aisle': u'Spices and Seasonings', u'name': u'lemon-pepper seasoning', u'metaInformation': [u'salt-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012030, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups (6 ounces) shredded reduced-fat cheddar cheese', u'aisle': u'Cheese', u'name': u'low fat shredded cheddar cheese', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 1001168, u'unit': u'ounces'}, {u'originalString': u'Dash paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'Dash'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup shredded zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11477, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/skinny-crab-quiche', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, combine the crab, cheese, zucchini and onions. Press onto the bottom and up the sides of a 9-in. deep-dish pie plate coated with cooking spray. In another bowl, combine the egg substitute, milk, mustard, salt and lemon-pepper; mix well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'id': 1226, u'name': u'egg substitute'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour into crust. Sprinkle with paprika.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake, uncovered, at 400\xb0 for 25-30 minutes or until a knife inserted near the center comes out clean.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for 10 minutes before cutting.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Luna Nuda Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste.', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                In a bowl, combine the crab, cheese, zucchini and onions. Press onto the bottom and up the sides of a 9-in. deep-dish pie plate coated with cooking spray. In another bowl, combine the egg substitute, milk, mustard, salt and lemon-pepper; mix well. Pour into crust. Sprinkle with paprika.                                                                                           Bake, uncovered, at 400\xb0 for 25-30 minutes or until a knife inserted near the center comes out clean. Let stand for 10 minutes before cutting.                                        Yield: 6 servings.                                                                                                                         Originally published as Skinny Crab Quiche in  Light & TastyFebruary/March 2004, p43                                                                                                                                                                                                        Nutritional Facts                                                                             One slice equals 223 calories, 9 g fat (5 g saturated fat), 50 mg cholesterol, 736 mg sodium, 10 g carbohydrate, 0.55 g fiber, 26 g protein. Diabetic Exchanges: 3 lean meat, 1/2 fat-free milk.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-crab-quiche-425210', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}