{u'recipes': [{u'sourceName': u'Freerange Human', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/602131-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 602131, u'veryPopular': False, u'lowFodmap': True, u'title': u'Review: Paleo Chocolate Lovers | Salty Caramel Bacon Bark', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 116.36, u'creditText': u'Freerange Human', u'extendedIngredients': [{u'originalString': u'4 strips of crisp cooked bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crisp', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'\xbd batch Salted Caramel', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramel', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 19074, u'unit': u''}, {u'originalString': u'1 cup coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'6 ounces dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'1 cup canned full-fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full-fat coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1/4 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://freerange-human.com/recipes/review-paleo-chocolate-lovers-salty-caramel-bacon-bark/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a heavy-bottomed pot, add the coconut milk, coconut sugar and salt', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk to combine the ingredients, and turn on the heat. Bring to boil for 15 minutes watching carefully so mixture doesn't boil over", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Reduce heat to low, and simmer for 5 minutes, making sure it doesn't burn.Wear gloves to pour the caramel into a small bowl, and stir periodically as it cools to room temperature.If the caramel isn't thick when it reaches room temperature, pour it back into the pot and let it simmer over the lowest heat possible for another 3-5 minutes.Wear gloves to pour caramel back into the small bowl, stirring occasionally until it reaches room temperature. Store covered at room temperature.Make Salted Caramel recipe above and let it cool to almost room temperature", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Line an 8" x 8" dish with a piece of unbleached parchment paper big enough to cover the bottom and go up the sides. Pinch the corners to help it stay in place and set aside', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Over a double boiler, melt the chocolate and pour it into the prepared dish', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Allow the chocolate to cool to room temperature on the counter then place it in the freezer until hard', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the caramel over the chocolate and sprinkle the top with crumbled crisp bacon', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Freeze the candy until it is hard enough to break into bark. You can then store in the refrigerator or freezer.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Bark on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u'In a heavy-bottomed pot, add the coconut milk, coconut sugar and saltWhisk to combine the ingredients, and turn on the heat. Bring to boil for 15 minutes watching carefully so mixture doesn\'t boil overReduce heat to low, and simmer for 5 minutes, making sure it doesn\'t burn.Wear gloves to pour the caramel into a small bowl, and stir periodically as it cools to room temperature.If the caramel isn\'t thick when it reaches room temperature, pour it back into the pot and let it simmer over the lowest heat possible for another 3-5 minutes.Wear gloves to pour caramel back into the small bowl, stirring occasionally until it reaches room temperature. Store covered at room temperature.Make Salted Caramel recipe above and let it cool to almost room temperatureLine an 8" x 8" dish with a piece of unbleached parchment paper big enough to cover the bottom and go up the sides. Pinch the corners to help it stay in place and set asideOver a double boiler, melt the chocolate and pour it into the prepared dishAllow the chocolate to cool to room temperature on the counter then place it in the freezer until hardDrizzle the caramel over the chocolate and sprinkle the top with crumbled crisp baconFreeze the candy until it is hard enough to break into bark. You can then store in the refrigerator or freezer.', u'spoonacularSourceUrl': u'https://spoonacular.com/review-paleo-chocolate-lovers-salty-caramel-bacon-bark-602131', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}