{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/447931-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 135, u'id': 447931, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken with Potato Stuffing', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 343.65, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'4 teaspoons dried parsley flakes, divided', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley flakes', u'metaInformation': [u'dried', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoons'}, {u'originalString': u'3/4 teaspoon dried rosemary, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'2-3/4 teaspoons dried thyme, divided', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoons'}, {u'originalString': u'1 cup finely chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'6 medium red potatoes, cut into 1-inch cubes', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'medium', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}, {u'originalString': u'1 roasting chicken (7 to 7-1/2 pounds)', u'aisle': u'Meat', u'name': u'roasting chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 7.0, u'consistency': u'solid', u'id': 5109, u'unit': u'pounds'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound Johnsonville\xae Mild Italian Sausage Links links', u'aisle': u'Frozen', u'name': u'veggie sausage links', u'metaInformation': [u'italian', u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 98971, u'unit': u'pound'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/chicken-with-potato-stuffing', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the potatoes in boiling salted water until almost tender; drain and set aside. Cook the sausage in boiling water for 10 minutes; drain. Halve each sausage lengthwise, then cut into 1/2-in. pieces.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet over medium heat, cook and stir potatoes, sausage and onion in butter until sausage is browned and onion is tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add 2 teaspoons parsley, salt, rosemary, 3/4 teaspoon thyme and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Stuff the chicken with the potato mixture.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the remaining stuffing in a greased 1-1/2-qt. baking dish; cover and refrigerate until ready to bake.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Place chicken in a roasting pan breast side up; brush with oil and sprinkle with remaining parsley and thyme.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add water to pan.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake, uncovered, at 350\xb0 for 2-1/4 hours or until a thermometer inserted in stuffing reads 165\xb0 and a thermometer inserted in the thigh reads 180\xb0.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Bake stuffing in the baking dish for 45 minutes or until heated through and lightly browned.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove chicken from oven; tent with foil.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let stand 15 minutes before removing stuffing and carving. Skim fat and thicken pan drippings for gravy if desired.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with chicken and stuffing.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Ghost Pines Sonoma County Napa County Monterey County Chardonnay. It has 5 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Directions                                                                                Cook the potatoes in boiling salted water until almost tender; drain and set aside. Cook the sausage in boiling water for 10 minutes; drain. Halve each sausage lengthwise, then cut into 1/2-in. pieces.                                                                                            In a large skillet over medium heat, cook and stir potatoes, sausage and onion in butter until sausage is browned and onion is tender. Add 2 teaspoons parsley, salt, rosemary, 3/4 teaspoon thyme and pepper.                                                                                           Stuff the chicken with the potato mixture. Place the remaining stuffing in a greased 1-1/2-qt. baking dish; cover and refrigerate until ready to bake.                                                                                           Place chicken in a roasting pan breast side up; brush with oil and sprinkle with remaining parsley and thyme. Add water to pan. Bake, uncovered, at 350\xb0 for 2-1/4 hours or until a thermometer inserted in stuffing reads 165\xb0 and a thermometer inserted in the thigh reads 180\xb0.                                                                                           Bake stuffing in the baking dish for 45 minutes or until heated through and lightly browned. Remove chicken from oven; tent with foil. Let stand 15 minutes before removing stuffing and carving. Skim fat and thicken pan drippings for gravy if desired. Serve with chicken and stuffing.                                        Yield: 8 servings.                                                                                                                         Originally published as Chicken with Potato Stuffing in  Country WomanMarch/April 1996, p33                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 651 calories, 38 g fat (11 g saturated fat), 183 mg cholesterol, 733 mg sodium, 16 g carbohydrate, 2 g fiber, 57 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-with-potato-stuffing-447931', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}