{u'recipes': [{u'sourceName': u'Love & Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446469-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 446469, u'veryPopular': False, u'lowFodmap': False, u'title': u'miso sesame squash salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 596.02, u'creditText': u'Love & Lemons', u'extendedIngredients': [{u'originalString': u'mixed baby salad greens - 3 cups', u'aisle': u'Produce', u'name': u'baby greens', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'1 medium fall squash - delicata, acorn, pumpkin, etc.', u'aisle': u'Produce', u'name': u'delicata squash', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/delicata-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11643, u'unit': u''}, {u'originalString': u'2 teaspoons yuzu juice (or lemon/lime juice & some zest)', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'(or lemon/lime juice & some zest)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon miso paste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16112, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 ripe pear, diced', u'aisle': u'Produce', u'name': u'pear', u'metaInformation': [u'diced', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'servings'}, {u'originalString': u'salt, pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.loveandlemons.com/2013/10/16/miso-sesame-salad/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. Toss sliced squash with olive oil, salt & pepper. Roast until the edges are browned and the flesh is tender. (Timing will depend on the type and thickness of your squash).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u"Let it cool slightly when it's done.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk together dressing ingredients. (Or better yet, shake them together in a small jar with a tight lid, so the miso doesn't get all stuck in your whisk). Taste & adjust.Toss all salad ingredients with the dressing and roasted squash.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 258, u'instructions': u"Preheat oven to 400 degrees. Toss sliced squash with olive oil, salt & pepper. Roast until the edges are browned and the flesh is tender. (Timing will depend on the type and thickness of your squash). Let it cool slightly when it's done.Whisk together dressing ingredients. (Or better yet, shake them together in a small jar with a tight lid, so the miso doesn't get all stuck in your whisk). Taste & adjust.Toss all salad ingredients with the dressing and roasted squash.", u'spoonacularSourceUrl': u'https://spoonacular.com/miso-sesame-squash-salad-446469', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}