{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/472281-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 472281, u'veryPopular': False, u'lowFodmap': False, u'title': u'One-Skillet Crispy Salmon with Mustardy Lentils', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 521.23, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 tablespoon chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon juice from 1 lemon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1 (14.5-ounce) can Puy lentils, drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 16069, u'unit': u'ounce'}, {u'originalString': u'1 cup homemade or store-bought low sodium vegetable or chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low sodium', u'homemade', u'store-bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1006970, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra-virgin olive oil, divided, plus more for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'divided', u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 (6-ounce) salmon fillets, skin on', u'aisle': u'Seafood', u'name': u'salmon fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounce'}, {u'originalString': u'4 medium shallots, thinly sliced (about 1/2 cup)', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}, {u'originalString': u'3 sprigs thyme or 1 sprig rosemary', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'1 tablespoon whole-grain mustard', u'aisle': u'Condiments', u'name': u'whole-grain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoon'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/05/crispy-salmon-mustardy-lentils-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a medium nonstick skillet, heat 1 tablespoon of olive oil over medium-high heat until shimmering.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add shallots and cook, stirring frequently, until very soft and browned, about 15 minutes; lower the heat if necessary to prevent burning. Season to taste with salt and pepper and set caramelized shallots aside. Wipe out skillet.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Press salmon filets between paper towels to dry surfaces thoroughly. Season on all sides with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon fillets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat remaining 1 tablespoon in the skillet over medium-high heat until shimmering.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add salmon filets skin side-down. Immediately reduce heat to medium-low. Cook, pressing gently on back of filets to ensure good contact with skin, until skin is rendered and crisp, about 6 minutes. If skin shows resistance when attempting to lift with a spatula, allow it to continue to cook until it lifts easily. Flip salmon and cook on second side until a thermometer inserted into the thickest part registers 120\xb0F for medium rare or 130\xb0F for medium, about 1 minute longer.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer salmon to a paper towel-lined plate and allow to rest.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add lentils, thyme or rosemary, broth, whole grain mustard, and caramelized shallots to the skillet and bring to a boil. Reduce heat to medium and simmer until the broth has reduced by about half, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'id': 1012046, u'name': u'whole grain mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Remove from the heat and stir in parsley and lemon juice. Season to taste with salt and pepper. Spoon the lentils onto plates, set the salmon on top, drizzle with more olive oil, and serve immediately.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Kris Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Brilliant lemon-green in color, KRIS offers enticing aromas of acacia flowers, citrus, tangerine, and hints of almonds.Try pairing with risotto, tossed salads, homemade pasta and grilled white meats or salmon.Blend: 100% Pinot Grigio View More', u'title': u'Kris Pinot Grigio', u'price': u'$14.99', u'id': 433207, u'link': u'https://www.wine.com/product/kris-pinot-grigio-2016/206138', u'imageUrl': u'https://spoonacular.com/productImages/433207-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Procedures                                                          1                                              In a medium nonstick skillet, heat 1 tablespoon of olive oil over medium-high heat until shimmering. Add shallots and cook, stirring frequently, until very soft and browned, about 15 minutes; lower the heat if necessary to prevent burning. Season to taste with salt and pepper and set caramelized shallots aside. Wipe out skillet.                                                                                    2                                              Press salmon filets between paper towels to dry surfaces thoroughly. Season on all sides with salt and pepper. Heat remaining 1 tablespoon in the skillet over medium-high heat until shimmering. Add salmon filets skin side-down. Immediately reduce heat to medium-low. Cook, pressing gently on back of filets to ensure good contact with skin, until skin is rendered and crisp, about 6 minutes. If skin shows resistance when attempting to lift with a spatula, allow it to continue to cook until it lifts easily. Flip salmon and cook on second side until a thermometer inserted into the thickest part registers 120\xb0F for medium rare or 130\xb0F for medium, about 1 minute longer. Transfer salmon to a paper towel-lined plate and allow to rest.                                                                                    3                                                                                                                                                                                                   Add lentils, thyme or rosemary, broth, whole grain mustard, and caramelized shallots to the skillet and bring to a boil. Reduce heat to medium and simmer until the broth has reduced by about half, about 5 minutes. Remove from the heat and stir in parsley and lemon juice. Season to taste with salt and pepper. Spoon the lentils onto plates, set the salmon on top, drizzle with more olive oil, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-skillet-crispy-salmon-with-mustardy-lentils-472281', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}