{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/217092-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 217092, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beany burgers with basil tzatziki', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 244.51, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'basil tzatziki (see separate recipe)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'(see separate recipe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'85g fresh breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'425g can borlotti beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned borlotti beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 425.0, u'consistency': u'solid', u'id': 10016021, u'unit': u'g'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tbsp fresh thyme leaves or 1 tsp dried', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'dried', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tbsp'}, {u'originalString': u'50g pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12147, u'unit': u'g'}, {u'originalString': u'flatbreads, tortilla or pitta breads', u'aisle': u'Bakery/Bread', u'name': u'pita breads', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18413, u'unit': u'servings'}, {u'originalString': u'1 small red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 tbsp sundried tomato paste', u'aisle': u'Pasta and Rice', u'name': u'sundried tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93797, u'unit': u'tbsp'}, {u'originalString': u'sunflower oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'servings'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2535/beany-burgers-with-basil-tzatziki', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a frying pan over a medium heat and lightly toast the pine nuts for 2-3 mins or until golden.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan and set to one side.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the borlotti beans into a large bowl and mash well with a potato masher or fork.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pine nuts, onion, tomato paste, half the breadcrumbs, the thyme and egg. Season to taste, then gently mix together until the ingredients are thoroughly combined. With slightly wet hands, shape the mixture into 4 burgers. Coat the outside of each burger with the remaining breadcrumbs. Cover and chill in the fridge for at least 30 mins.To cook the burgers: heat a thin layer of sunflower oil in a large frying pan and fry for3-4 mins each side until golden.', u'length': {u'number': 34, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4584, u'name': u'sunflower oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Drain on kitchen paper, then serve in warmed flatbreads, tortillas or pittas and spoon over the Basil tzatziki.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Gascon Malbec. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'A classic expression of the grape, our Don Miguel Gasc\xf3n Malbec opens with intense aromas of blackberry, plum and a hint of mocha. On the palate, dark fruit flavors are finely intertwined with notes of spice, licorice and chocolate for a magnificent full-bodied Malbec. Round tannins and a plush mouthfeel lead the way to a long, velvety finish. View More', u'title': u'Gascon Malbec', u'price': u'$12.99', u'id': 437536, u'link': u'https://www.wine.com/product/gascon-malbec-2012/128058', u'imageUrl': u'https://spoonacular.com/productImages/437536-312x231.jpg'}]}, u'aggregateLikes': 44, u'instructions': u'Place a frying pan over a medium heat and lightly toast the pine nuts for 2-3 mins or until golden. Remove from pan and set to one side.Put the borlotti beans into a large bowl and mash well with a potato masher or fork. Add the pine nuts, onion, tomato paste, half the breadcrumbs, the thyme and egg. Season to taste, then gently mix together until the ingredients are thoroughly combined. With slightly wet hands, shape the mixture into 4 burgers. Coat the outside of each burger with the remaining breadcrumbs. Cover and chill in the fridge for at least 30 mins.To cook the burgers: heat a thin layer of sunflower oil in a large frying pan and fry for3-4 mins each side until golden. Drain on kitchen paper, then serve in warmed flatbreads, tortillas or pittas and spoon over the Basil tzatziki.', u'spoonacularSourceUrl': u'https://spoonacular.com/beany-burgers-with-basil-tzatziki-217092', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}