{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/213469-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 213469, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini sage & onion scones', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 20.1, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'125-150ml/4floz-\xbcpt milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 125.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'6 sage leaves, finely chopped', u'aisle': u'Spices and Seasonings', u'name': u'sage leaves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'140g 5oz turkey breast, sliced to scone size', u'aisle': u'Meat', u'name': u'turkey breast', u'metaInformation': [u'sliced to scone size'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 5696, u'unit': u'g'}, {u'originalString': u'50g unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'4 tbsp cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 9081, u'unit': u'tbsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/889639/mini-sage-and-onion-scones', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven 220C/200C fan/gas 7.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heatthe oil in a pan and cook the onion for5 mins until soft, then set aside to cool.In a food processor, pulse the flour andbutter together until the mixture lookslike crumbs, then add the sage, cooledonion and enough milk to make a soft butnot sticky dough. Tip out onto a flouredsurface, knead briefly, then roll out to1cm thickness. Using a 1.5cm cutter,stamp out mini scones.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush tops withegg, put onto a baking sheet and bakefor 8-10 mins until risen and golden.To serve, split the scones, spreadeach side with cranberry sauce, thensandwich together with the turkey.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Scone can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u'Heat oven 220C/200C fan/gas 7. Heatthe oil in a pan and cook the onion for5 mins until soft, then set aside to cool.In a food processor, pulse the flour andbutter together until the mixture lookslike crumbs, then add the sage, cooledonion and enough milk to make a soft butnot sticky dough. Tip out onto a flouredsurface, knead briefly, then roll out to1cm thickness. Using a 1.5cm cutter,stamp out mini scones. Brush tops withegg, put onto a baking sheet and bakefor 8-10 mins until risen and golden.To serve, split the scones, spreadeach side with cranberry sauce, thensandwich together with the turkey.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-sage-onion-scones-213469', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}