{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/202720-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 202720, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Tortas de Milanesa', u'diets': [u'dairy free'], u'pricePerServing': 280.95, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 canned chipotle chilie in adobo sauce, minced', u'aisle': u'Ethnic Foods', u'name': u'adobo sauce', u'metaInformation': [u'canned', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6979, u'unit': u''}, {u'originalString': u'1 avocado, pitted and flesh scooped out, cut into thin slices', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'pitted', u'cut into thin slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cup plain bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 eggs, lightly whisked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 teaspoon fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'teaspoon'}, {u'originalString': u'2 limes, cut into wedges', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'12 pickled jalape\xf1os, stemmed, seeded, cut into 1/4-inch slices', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pickled jalapenos', u'metaInformation': [u'stemmed', u'seeded', u'cut into 1/4-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 10011632, u'unit': u''}, {u'originalString': u'4 (4-ounce) pork cutlets, pounded to 1/4-inch thick', u'aisle': u'Meat', u'name': u'pork cutlets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-cutlets.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10010066, u'unit': u'ounce'}, {u'originalString': u'4 leaves Romaine lettuce, torn', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'leaves'}, {u'originalString': u'salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 bolillo or telera rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'About 2 cups vegetable oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'cups'}, {u'originalString': u'1/2 white onion, thinly sliced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/03/spicy-tortas-de-milanesa-mexican-sandwiches-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the Chipotle Mayonnaise: In a medium-sized bowl, combine the minced chipotle chile, lime juice, and mayonnaise. Season to taste with salt and pepper. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'For the Torta: Pat the pork cutlets dry and season with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-cutlets.jpg', u'id': 10010066, u'name': u'pork cutlets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Add flour to one plate or shallow pie pan, eggs to second, and bread crumbs to third. Take one cutlet and toss it in the flour until covered. Shake off any excess, and dip the cutlet in the whisked egg.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the excess drip back into the bowl, and then toss the cutlet in the breadcrumbs, pressing down on the breadcrumbs so it is completely covered. Repeat process with remaining cutlets.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large cast-iron skillet, pour in enough oil to come 1/2-inch up the sides.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Heat over medium-high heat until it reaches 350\xb0F.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add as many of the breaded cutlets as will fit in a single layer. Cook until golden brown, two to three minutes a side. Adjust the heat as necessary to maintain the temperature.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain the cutlets on paper towels. Repeat process with any remaining cutlets.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the rolls in half horizontally, and use your fingers to remove some of the soft insides.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Spread some of the chipotle mayonnaise on the cut side of both the top and the bottom slices of each roll.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}]}, {u'equipment': [], u'step': u'Add the cooked cutlets on top of the bottom slices, and top each with a quarter of the lettuce, avocado, onion, and pickled jalapeno. Cap each with the top slice.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve with sandwiches with lime wedges.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 183, u'instructions': u'Procedures                                                                              1                                                                            For the Chipotle Mayonnaise: In a medium-sized bowl, combine the minced chipotle chile, lime juice, and mayonnaise. Season to taste with salt and pepper. Set aside.                                                                                                                             2                                                                            For the Torta: Pat the pork cutlets dry and season with salt and pepper. Add flour to one plate or shallow pie pan, eggs to second, and bread crumbs to third. Take one cutlet and toss it in the flour until covered. Shake off any excess, and dip the cutlet in the whisked egg. Let the excess drip back into the bowl, and then toss the cutlet in the breadcrumbs, pressing down on the breadcrumbs so it is completely covered. Repeat process with remaining cutlets.                                                                                                                             3                                                                            In a large cast-iron skillet, pour in enough oil to come 1/2-inch up the sides. Heat over medium-high heat until it reaches 350\xb0F. Add as many of the breaded cutlets as will fit in a single layer. Cook until golden brown, two to three minutes a side. Adjust the heat as necessary to maintain the temperature. Drain the cutlets on paper towels. Repeat process with any remaining cutlets.                                                                                                                             4                                                                            Cut the rolls in half horizontally, and use your fingers to remove some of the soft insides. Spread some of the chipotle mayonnaise on the cut side of both the top and the bottom slices of each roll. Add the cooked cutlets on top of the bottom slices, and top each with a quarter of the lettuce, avocado, onion, and pickled jalapeno. Cap each with the top slice. Serve with sandwiches with lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-tortas-de-milanesa-202720', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}