{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523208-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 523208, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spinach and cream cheese dumplings', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 120.26, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'about 1 1/2 c. of cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'c'}, {u'originalString': u'about 125 g. of cream cheese, at room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 1017, u'unit': u'g'}, {u'originalString': u'dumpling wrappers', u'aisle': u'Ethnic Foods', u'name': u'dumpling wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'servings'}, {u'originalString': u'about 1/2 tsp. of minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'a large bag of spinach, blanched and excess water squeezed out', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'bag'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://casaveneracion.com/spinach-cream-cheese-dumplings/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Chop the spinach. Take a few pieces of kitchen paper, place over the spinach and press down to remove as much of the water as you can. I had to do this three times. Yes, even after squeezing the spinach after blanching, it will still contain a lot of water. And you want all that water gone because it will make the filling too wet and the dumplings soggy.Lightly beat the cream cheese. Stir in the salt, pepper and garlic.Then, mix in the spinach. Taste and adjust the seasonings, as needed.Separate the dumpling wrappers and place a teaspoonful of the filling at the center of each one. Wet the edges with a little water and fold to seal. Remember to squeeze out any air pockets that form inside.Now, a little tip. How should the dumpling be shaped? If you have round dumpling wrappers, half-moon shaped dumplings would be the most logical and the easiest too. But with square dumpling wrappers? I made one spring roll-style and when I fried it, the inside layer of wrapper didn’t get cooked through. Why? Cooking time is very, very short because the frying part is only to brown the wrapper and to heat the filling. There’s nothing in the filling that needs to get cooked. If the wrapping is thick, as it would be if made spring roll style, the short cooking time won’t be enough to cook the inside layer of wrapping.\xa0So, it’s best to keep the wrapping thin. With square wrappers, triangle-shaped dumplings are best.When you’ve filled all your wrappers or run out of filling, whichever comes first, heat the cooking oil. Fry the dumplings, a few at a time, and drain the cooked dumplings in a strainer or a stack of kitchen paper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'id': 10018368, u'name': u'dumpling wrappers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve the dumplings immediately. No, they don’t need a dipping sauce.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 150, u'instructions': u'InstructionsChop the spinach. Take a few pieces of kitchen paper, place over the spinach and press down to remove as much of the water as you can. I had to do this three times. Yes, even after squeezing the spinach after blanching, it will still contain a lot of water. And you want all that water gone because it will make the filling too wet and the dumplings soggy.Lightly beat the cream cheese. Stir in the salt, pepper and garlic.Then, mix in the spinach. Taste and adjust the seasonings, as needed.Separate the dumpling wrappers and place a teaspoonful of the filling at the center of each one. Wet the edges with a little water and fold to seal. Remember to squeeze out any air pockets that form inside.Now, a little tip. How should the dumpling be shaped? If you have round dumpling wrappers, half-moon shaped dumplings would be the most logical and the easiest too. But with square dumpling wrappers? I made one spring roll-style and when I fried it, the inside layer of wrapper didn’t get cooked through. Why? Cooking time is very, very short because the frying part is only to brown the wrapper and to heat the filling. There’s nothing in the filling that needs to get cooked. If the wrapping is thick, as it would be if made spring roll style, the short cooking time won’t be enough to cook the inside layer of wrapping.\xa0So, it’s best to keep the wrapping thin. With square wrappers, triangle-shaped dumplings are best.When you’ve filled all your wrappers or run out of filling, whichever comes first, heat the cooking oil. Fry the dumplings, a few at a time, and drain the cooked dumplings in a strainer or a stack of kitchen paper.Serve the dumplings immediately. No, they don’t need a dipping sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-and-cream-cheese-dumplings-523208', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}