{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/394187-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 394187, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Rice Burritos', u'diets': [], u'preparationMinutes': 55, u'pricePerServing': 310.28, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2-1/2 cups chicken broth, divided', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'12 flour tortillas (10 inches), warmed', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'warmed', u'(es)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'10-inchs', u'unitShort': u'10-inch', u'amount': 12.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'10-inch'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/3 cup sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 cup uncooked long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}, {u'originalString': u'1/2 cup sliced ripe olives', u'aisle': u'Canned and Jarred', u'name': u'olives', u'metaInformation': [u'ripe', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9195, u'unit': u'cup'}, {u'originalString': u'Additional picante sauce and cheddar cheese', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'picante sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1006164, u'unit': u'servings'}, {u'originalString': u'1 jar (16 ounces) picante sauce, divided', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'picante sauce', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1006164, u'unit': u'ounces'}, {u'originalString': u'3 cups (12 ounces) shredded cheddar cheese, divided', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'7 cups shredded cooked chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cups'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/chicken-rice-burritos', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a skillet, saute onions and garlic in butter until tender. Stir in chicken, chili powder, 1/4 cup broth and 3/4 cup of picante sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 1006164, u'name': u'picante sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Heat through; set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, bring rice and remaining broth to a boil. Reduce heat; cover and simmer 20 minutes. Stir in remaining picante sauce; cover and simmer 5-10 minutes or until rice is tender. Stir into chicken mixture.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 1006164, u'name': u'picante sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add olives and 2 cups cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Spoon 1 cup filling, off center, on each tortilla. Fold sides and ends over filling, then roll up. Arrange burritos in two ungreased 13-in. x 9-in. baking dishes. Sprinkle with the remaining cheese. Cover and bake at 375\xb0 for 10-15 minutes or until heated through.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Garnish with picante sauce and cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 1006164, u'name': u'picante sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 802, u'instructions': u'Directions                                                                                In a skillet, saute onions and garlic in butter until tender. Stir in chicken, chili powder, 1/4 cup broth and 3/4 cup of picante sauce. Heat through; set aside.                                                                                            In a medium saucepan, bring rice and remaining broth to a boil. Reduce heat; cover and simmer 20 minutes. Stir in remaining picante sauce; cover and simmer 5-10 minutes or until rice is tender. Stir into chicken mixture. Add olives and 2 cups cheese.                                                                                            Spoon 1 cup filling, off center, on each tortilla. Fold sides and ends over filling, then roll up. Arrange burritos in two ungreased 13-in. x 9-in. baking dishes. Sprinkle with the remaining cheese. Cover and bake at 375\xb0 for 10-15 minutes or until heated through. Garnish with picante sauce and cheese.                                        Yield: 6 servings.                                                                                                                         Originally published as Chicken Rice Burritos in  Taste of HomeFebruary/March 1996, p29                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (2 each) equals 1,133 calories, 42 g fat (20 g saturated fat), 216 mg cholesterol, 2,133 mg sodium, 96 g carbohydrate, 13 g fiber, 75 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-rice-burritos-394187', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}