{u'recipes': [{u'sourceName': u'Rachel Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/803327-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 803327, u'veryPopular': False, u'lowFodmap': False, u'title': u'Moroccan Freekeh Pilaf', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 155.16, u'creditText': u'Rachel Cooks', u'extendedIngredients': [{u'originalString': u'1/2 cup diced dried apricots', u'aisle': u'Produce', u'name': u'apricots', u'metaInformation': [u'dried', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9021, u'unit': u'cup'}, {u'originalString': u'2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1 cup uncooked cracked freekeh', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'freekeh', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freekeh.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98869, u'unit': u'cup'}, {u'originalString': u'3 tablespoons chopped fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground cardamom', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2006, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon ground cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoons ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup orange juice (fresh squeezed is best)', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'fresh', u'( squeezed is best)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'grated zest of 1 orange (about 1 teaspoon)', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.rachelcooks.com/2016/09/21/moroccan-freekeh-pilaf/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place a large saucepan over medium heat. Stir in the cumin, ginger, cloves, cayenne, cardamom, coriander, and allspice; toast until fragrant, stirring, about 2 to 3 minutes. Stir in oil, raisins, apricots, salt, orange zest, chicken broth, orange juice. Bring to a boil.Once boiling, stir in the freekeh and reduce to simmer (medium-low). Cover and cook for 20 minutes or until liquid is absorbed. Keep covered and remove from heat - let stand 5 minutes. Fluff with a fork, and fold in chopped mint.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'id': 9021, u'name': u'apricot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freekeh.jpg', u'id': 98869, u'name': u'freekeh'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve warm or cold.', u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 69, u'instructions': u'Place a large saucepan over medium heat. Stir in the cumin, ginger, cloves, cayenne, cardamom, coriander, and allspice; toast until fragrant, stirring, about 2 to 3 minutes. Stir in oil, raisins, apricots, salt, orange zest, chicken broth, orange juice. Bring to a boil.Once boiling, stir in the freekeh and reduce to simmer (medium-low). Cover and cook for 20 minutes or until liquid is absorbed. Keep covered and remove from heat - let stand 5 minutes. Fluff with a fork, and fold in chopped mint. Serve warm or cold.', u'spoonacularSourceUrl': u'https://spoonacular.com/moroccan-freekeh-pilaf-803327', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}