{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/465204-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 465204, u'veryPopular': False, u'lowFodmap': False, u'title': u'Veggie Cheese Sandwiches', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 70.92, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 teaspoons butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup sliced fresh mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1/2 cup julienned green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'green', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'8 slices Italian bread (1/2 inch thick)', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'italian', u'(1/)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slices'}, {u'originalString': u'1/2 cup sliced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'4 slices reduced-fat process American cheese product', u'aisle': u'Cheese', u'name': u'process american cheese', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slices'}, {u'originalString': u'2/3 cup chopped tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/veggie-cheese-sandwiches', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a small nonstick skillet coated with cooking spray, cook onion and green pepper over medium heat for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add tomato and mushrooms. Cook and stir until vegetables are tender; drain.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Divide the vegetable mixture over four slices of bread; top with cheese and remaining bread. Butter the top and bottom of each sandwich. In a skillet, toast sandwiches until lightly browned on both sides.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 14, u'instructions': u'Directions                                                                                In a small nonstick skillet coated with cooking spray, cook onion and green pepper over medium heat for 2 minutes. Add tomato and mushrooms. Cook and stir until vegetables are tender; drain.                                                                                               Divide the vegetable mixture over four slices of bread; top with cheese and remaining bread. Butter the top and bottom of each sandwich. In a skillet, toast sandwiches until lightly browned on both sides.                                        Yield: 4 servings.                                                                                                                         Originally published as Veggie Cheese Sandwiches in  Light & TastyApril/May 2006, p21                                                                                                                                                                                                        Nutritional Facts                                                                             1 sandwich equals 168 calories, 6 g fat (3 g saturated fat), 15 mg cholesterol, 415 mg sodium, 20 g carbohydrate, 2 g fiber, 8 g protein. Diabetic Exchanges: 1 starch, 1 lean meat, 1 vegetable, 1 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/veggie-cheese-sandwiches-465204', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}