{u'recipes': [{u'sourceName': u'Just One Cookbook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/540712-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 540712, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ebi Fry (Fried Shrimp)', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 45, u'pricePerServing': 86.59, u'creditText': u'Just One Cookbook', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'\xbd lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'4 Tbsp. Japanese mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'Tbsp'}, {u'originalString': u'Oil for deep frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for deep frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'\xbc onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 cups Panko', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cups'}, {u'originalString': u'1 pickle or 7 cornichons/gherkins', u'name': u'pickle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11937, u'unit': u''}, {u'originalString': u'Large prawns (I used 17 prawns today)', u'aisle': u'Seafood', u'name': u'prawns', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 17.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.justonecookbook.com/recipes/ebi-fry-fried-shrimp/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chopsticks.jpg', u'id': 405596, u'name': u'chopsticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Let’s make Tartar Sauce first. We start with boiling eggs. I learned this method at Home Economics in elementary school and still practice till now. Put water in a saucepan, and gently put eggs. Make sure the eggs are completely covered by water. Bring the water to boil on medium heat. Meanwhile you rotate the eggs with chopsticks or a spoon once in a while (this is a tip to make sure the egg yolk will be in center). Once the water boils, lower heat but keep the water boiling (but don’t let the eggs jumping around) for the next 12 minutes. Discard the water and run under cold water. When eggs are almost cool, they are ready to peel.Meanwhile you dice the onion finely and soak the onion in cold water for 10 minutes to get rid of bitter flavor.Finely chop the pickles.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'id': 11937, u'name': u'pickles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the onion after 10 minutes. Put it the center of paper towel and squeeze the excess water out.In a bowl, break the eggs into small pieces with a fork.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the pickles, the onion, salt and pepper and squeeze some lemon juice. Then add the mayonnaise (and parsley) and mix all together. Cover and keep it in the fridge until Ebi Fry is ready.Ebi fry’s prawns are very straight. Here’s how we prepare prawns (click HERE).Season the prawn with salt and pepper.Dredge the prawns with flour, and then beaten egg (I do not dilute the egg mixture, but you can do so with 1 Tbsp of water or milk). Next you usually go to Panko, but for Ebi Fry, you double dredge with flour and egg. So after the egg, you go back to flour, then egg, and finally panko. Don’t forget to shake off the excess.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'id': 11937, u'name': u'pickles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Heat the oil to 350F (180C) degree (Read more on How To Deep Fry).Gently put 2-3 prawns in oil and deep fry them for about 2.5 minutes, or until golden brown.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer Ebi Fry onto a wire rack or paper towel-lined tray to remove excess oil.Between batches, make sure to scoop up the bread crumbs to keep the oil clean and avoid the oil turning dark.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Vampire Pinot Grigio Wine. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This dry, zestful combination is reminiscent of ripe pears and roses', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u'Let’s make Tartar Sauce first. We start with boiling eggs. I learned this method at Home Economics in elementary school and still practice till now. Put water in a saucepan, and gently put eggs. Make sure the eggs are completely covered by water. Bring the water to boil on medium heat. Meanwhile you rotate the eggs with chopsticks or a spoon once in a while (this is a tip to make sure the egg yolk will be in center). Once the water boils, lower heat but keep the water boiling (but don’t let the eggs jumping around) for the next 12 minutes. Discard the water and run under cold water. When eggs are almost cool, they are ready to peel.Meanwhile you dice the onion finely and soak the onion in cold water for 10 minutes to get rid of bitter flavor.Finely chop the pickles.Drain the onion after 10 minutes. Put it the center of paper towel and squeeze the excess water out.In a bowl, break the eggs into small pieces with a fork.Add the pickles, the onion, salt and pepper and squeeze some lemon juice. Then add the mayonnaise (and parsley) and mix all together. Cover and keep it in the fridge until Ebi Fry is ready.Ebi fry’s prawns are very straight. Here’s how we prepare prawns (click HERE).Season the prawn with salt and pepper.Dredge the prawns with flour, and then beaten egg (I do not dilute the egg mixture, but you can do so with 1 Tbsp of water or milk). Next you usually go to Panko, but for Ebi Fry, you double dredge with flour and egg. So after the egg, you go back to flour, then egg, and finally panko. Don’t forget to shake off the excess.Heat the oil to 350F (180C) degree (Read more on How To Deep Fry).Gently put 2-3 prawns in oil and deep fry them for about 2.5 minutes, or until golden brown. Transfer Ebi Fry onto a wire rack or paper towel-lined tray to remove excess oil.Between batches, make sure to scoop up the bread crumbs to keep the oil clean and avoid the oil turning dark.', u'spoonacularSourceUrl': u'https://spoonacular.com/ebi-fry-fried-shrimp-540712', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}