{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/597529-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 597529, u'veryPopular': True, u'lowFodmap': True, u'title': u'Stuffed Taco Potatoes', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'pricePerServing': 130.43, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces cream cheese, softened and at room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1/2 cup half and half, warmed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 cup shredded cheddar or jack cheese', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'4 large russet potatoes', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1 packet taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'packet', u'unitShort': u'packet', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'packet'}, {u'originalString': u'Any of the following for garnish: guacamole, sour cream, chopped scallions, salsa, chopped jalapenos, crush tortilla chips, ground red pepper, fresh lime wedges', u'aisle': u'?', u'name': u'any of the following', u'metaInformation': [u'fresh', u'sour', u'red', u'chopped', u'for garnish: guacamole,  cream,  scallions, salsa,  jalapenos, crush tortilla chips, ground  pepper,  lime wedges'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.framedcooks.com/2012/06/stuffed-taco-potatoes.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Scrub potatoes well, pierce a few times with a fork and bake until soft, either approximately 10 minutes in the microwave or one hour in a 350 degree oven.  Cool for 10 minutes.2.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the tops off of the potatoes lengthwise and discard.  Carefully scoop the cooked potato out of each potato skin, leaving the skins as intact as possible.3. Mash all the potato insides with cream cheese and butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add half and half in small increments until the potatoes are a consistency that you like (you might not need all the half and half). Stir in the taco season until well-mixed, and then stir in the chicken if you are using it.4. Sprinkle cheese on the top of each potato.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the potatoes on a baking sheet and bake in a 350 degree oven for about 10 minutes or until cheese is melted.5.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with your choice of toppings and serve at once.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Tacos can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Mark West Black Label Monterey County Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches.", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 924, u'instructions': u'1. Scrub potatoes well, pierce a few times with a fork and bake until soft, either approximately 10 minutes in the microwave or one hour in a 350 degree oven.  Cool for 10 minutes.2. Cut the tops off of the potatoes lengthwise and discard.  Carefully scoop the cooked potato out of each potato skin, leaving the skins as intact as possible.3. Mash all the potato insides with cream cheese and butter.  Add half and half in small increments until the potatoes are a consistency that you like (you might not need all the half and half). Stir in the taco season until well-mixed, and then stir in the chicken if you are using it.4. Sprinkle cheese on the top of each potato. Place the potatoes on a baking sheet and bake in a 350 degree oven for about 10 minutes or until cheese is melted.5. Garnish with your choice of toppings and serve at once.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-taco-potatoes-597529', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}