{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/762090-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 762090, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potato and Carrot Gratin', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'pricePerServing': 51.75, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'4 medium carrots, very thinly sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'\xbd tsp. dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'tsp'}, {u'originalString': u'1 medium onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd tsp. freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 to 1 \xbd cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'2 lbs. Yukon Gold potatoes, peeled and very thinly sliced', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'peeled', u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'lbs'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/potato-and-carrot-gratin/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position rack in upper third of oven. Preheat oven to 400\xb0F. Grease shallow 2  1/2- to 3-quart casserole. Pat potatoes dry with paper towels. Arrange half the potato slices in single layer over bottom of prepared casserole, overlapping slightly. Season with a little salt, pepper and basil. Sprinkle with half the chopped onion.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add all carrot slices, overlapping slightly. Season with a little salt, pepper and basil; sprinkle with remaining onion. Top with remaining potato slices, overlapping slightly. Season with remaining salt, pepper and basil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add enough broth to come three-quarters of the way up vegetables. Cover casserole with lid or foil and bake until potatoes are almost tender, 30 to 40 minutes. Uncover and bake until potatoes are very tender, about 25 minutes more.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 17, u'instructions': u'Position rack in upper third of oven. Preheat oven to 400\xb0F. Grease shallow 2  1/2- to 3-quart casserole. Pat potatoes dry with paper towels. Arrange half the potato slices in single layer over bottom of prepared casserole, overlapping slightly. Season with a little salt, pepper and basil. Sprinkle with half the chopped onion. Add all carrot slices, overlapping slightly. Season with a little salt, pepper and basil; sprinkle with remaining onion. Top with remaining potato slices, overlapping slightly. Season with remaining salt, pepper and basil. Add enough broth to come three-quarters of the way up vegetables. Cover casserole with lid or foil and bake until potatoes are almost tender, 30 to 40 minutes. Uncover and bake until potatoes are very tender, about 25 minutes more. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-and-carrot-gratin-762090', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}