{u'recipes': [{u'sourceName': u'Alaska from Scratch', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/519655-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 519655, u'veryPopular': True, u'lowFodmap': False, u'title': u'Black Bean Chili', u'diets': [u'gluten free'], u'pricePerServing': 255.71, u'creditText': u'Alaska from Scratch', u'extendedIngredients': [{u'originalString': u'avocado, chopped', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'1 (15oz) can beef broth', u'aisle': u'Canned and Jarred', u'name': u'canned beef broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'oz'}, {u'originalString': u'3 (15oz) cans black beans', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'1 (14.5 oz) can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2T chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'T'}, {u'originalString': u'1 chipotle in adobo, chopped (more if you like your chili hot)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle in adobo', u'metaInformation': [u'hot', u'chopped', u'(more if you like your chili )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'corn chips (like Fritos)', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u'(like Fritos)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19003, u'unit': u'servings'}, {u'originalString': u'2-1/2t cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u't'}, {u'originalString': u'jack cheese, grated', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'servings'}, {u'originalString': u'juice of half a lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1lb lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'servings'}, {u'originalString': u'1t salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u't'}, {u'originalString': u'2T tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'T'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.alaskafromscratch.com/2012/09/05/black-bean-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a large pot (I used my dutch oven) over medium heat, begin to brown the ground beef.  Meanwhile, drain and rinse two cans of the black beans.  To a blender or large food processor, add the undrained can of black beans, the diced tomatoes (with juice), and the chipotle. Blend until smooth. When beef is browned, add the onions and cook until opaque, 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the spices, tomato paste, and salt. Cook, stirring, another 1-2 minutes until fragrant.  To the pot, add the beef broth, drained black beans, and the contents of the blender. Stir to combine, bring to a simmer and reduce heat to low. Simmer, uncovered, 60-90 minutes (I did 90), stirring often to prevent chili from sticking. Chili will thicken as it simmers.', u'length': {u'number': 92, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the lime juice and chopped cilantro. Taste chili and check for seasoning.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Add more salt if needed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with jack cheese, corn chips, avocado, red onion, and fresh cilantro on top.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'id': 19003, u'name': u'corn chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili can be paired with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Bohigas Brut Reserva Cava with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale yellow colour. Constant and small bubble. Foam of great persistence. Very fruity aromas, especially of white fruit (acid apple and pear) on shades of peel of citrics and white flowers. In the background, some spicy notes owed to ageing (cinnamon) and cookies. It is a well-structured "cava" in the mouth. Well picked up over its acidity that tenses it overall from beginning to end. The bubble lends a creamy feeling, and it gives volume and softness to the structure that returns acidity and widens the aromas of white fruits and spices that are repeated in the mouth. Its balanced end harmonizes its acidity, and leaves a memory of freshness and volume owing to its light sugar content View More', u'title': u'Bohigas Brut Reserva Cava', u'price': u'$16.99', u'id': 440298, u'link': u'https://www.wine.com/product/bohigas-brut-reserva-cava/131248', u'imageUrl': u'https://spoonacular.com/productImages/440298-312x231.jpg'}]}, u'aggregateLikes': 555, u'instructions': u'In a large pot (I used my dutch oven) over medium heat, begin to brown the ground beef.  Meanwhile, drain and rinse two cans of the black beans.  To a blender or large food processor, add the undrained can of black beans, the diced tomatoes (with juice), and the chipotle. Blend until smooth. When beef is browned, add the onions and cook until opaque, 2-3 minutes. Add the spices, tomato paste, and salt. Cook, stirring, another 1-2 minutes until fragrant.  To the pot, add the beef broth, drained black beans, and the contents of the blender. Stir to combine, bring to a simmer and reduce heat to low. Simmer, uncovered, 60-90 minutes (I did 90), stirring often to prevent chili from sticking. Chili will thicken as it simmers. Add the lime juice and chopped cilantro. Taste chili and check for seasoning. Add more salt if needed. Serve with jack cheese, corn chips, avocado, red onion, and fresh cilantro on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-chili-519655', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}