{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/698109-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 698109, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mediterranean Eggs', u'diets': [u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 35.22, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon anchovy paste', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'anchovy paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovy-paste.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10015002, u'unit': u'teaspoon'}, {u'originalString': u'Sliced pitted black olives for garnish', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'pitted', u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'servings'}, {u'originalString': u'1/2 cup fresh breadcrumbs, (see Tip)', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons chopped fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'12 hard-boiled eggs, (see Tip)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled eggs', u'metaInformation': [u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup reduced-fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1179, u'unit': u'cup'}, {u'originalString': u'Salt and freshly ground pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/mediterranean_eggs.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place eggs in a single layer in a saucepan; cover with water. Bring to a simmer over medium-high heat. Reduce heat to low and cook at the barest simmer for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat, pour out hot water and cover the eggs with cold water.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Let stand until cool enough to handle before peeling.To make fresh breadcrumbs: Trim crusts from firm sandwich bread. Tear bread into pieces and process in a food processor until coarse crumbs form. One slice of bread makes about 1/3 cup crumbs.', u'number': 3, u'ingredients': []}], u'name': u'Tips To hard-boil eggs'}], u'aggregateLikes': 14, u'instructions': u'Tips: To hard-boil eggs: Place eggs in a single layer in a saucepan; cover with water. Bring to a simmer over medium-high heat. Reduce heat to low and cook at the barest simmer for 10 minutes. Remove from heat, pour out hot water and cover the eggs with cold water. Let stand until cool enough to handle before peeling.To make fresh breadcrumbs: Trim crusts from firm sandwich bread. Tear bread into pieces and process in a food processor until coarse crumbs form. One slice of bread makes about 1/3 cup crumbs.', u'spoonacularSourceUrl': u'https://spoonacular.com/mediterranean-eggs-698109', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}