{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/746942-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 746942, u'veryPopular': False, u'lowFodmap': False, u'title': u'Make-Ahead Cranberry-Fig Chutney', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 77.27, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 stick cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'stick'}, {u'originalString': u'1 12-ounce bag fresh or thawed frozen cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9078, u'unit': u'ounce'}, {u'originalString': u'1 cup dried figs, quartered', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9094, u'unit': u'cup'}, {u'originalString': u'1 tablespoon finely chopped fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 4-inch strip orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'strip', u'unitShort': u'strip', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'strip'}, {u'originalString': u'1/2 cup red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022068, u'unit': u'cup'}, {u'originalString': u'1 1/4 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/make-ahead-cranberry-fig-chutney.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Set aside 1/2 cup of the cranberries. Bring the remaining cranberries, sugar, vinegar, orange zest, cinnamon stick, ginger, 1/4 teaspoon salt and a few grinds of pepper to a simmer in a medium saucepan over medium heat, stirring frequently, until the sugar dissolves and the cranberries soften, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the figs and raisins, raise the heat to bring the mixture to a high simmer, then cook until the cranberries burst and the chutney is saucy and coats the back of a spoon, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat, and stir in the reserved 1/2 cup cranberries.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}, {u'equipment': [], u'step': u'Let the chutney cool to room temperature.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Transfer it to an airtight container or resealable plastic bag, label and date, and freeze for up to 2 weeks.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the chutney thaw in the refrigerator the night before you plan to serve it. To serve, heat it in a microwave-safe bowl in 30-second increments until the chill is gone. If the chutney is too thick, thin it out with a few tablespoons of water.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 264, u'instructions': u'Set aside 1/2 cup of the cranberries. Bring the remaining cranberries, sugar, vinegar, orange zest, cinnamon stick, ginger, 1/4 teaspoon salt and a few grinds of pepper to a simmer in a medium saucepan over medium heat, stirring frequently, until the sugar dissolves and the cranberries soften, about 3 minutes. Add the figs and raisins, raise the heat to bring the mixture to a high simmer, then cook until the cranberries burst and the chutney is saucy and coats the back of a spoon, about 10 minutes. Remove the pan from the heat, and stir in the reserved 1/2 cup cranberries.                          Let the chutney cool to room temperature. Transfer it to an airtight container or resealable plastic bag, label and date, and freeze for up to 2 weeks.                          Let the chutney thaw in the refrigerator the night before you plan to serve it. To serve, heat it in a microwave-safe bowl in 30-second increments until the chill is gone. If the chutney is too thick, thin it out with a few tablespoons of water.', u'spoonacularSourceUrl': u'https://spoonacular.com/make-ahead-cranberry-fig-chutney-746942', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}