{u'recipes': [{u'sourceName': u'Delish', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/703326-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 703326, u'veryPopular': False, u'lowFodmap': False, u'title': u"Curried Sweet Potato Shepherd's Pie", u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 200.01, u'creditText': u'Delish', u'extendedIngredients': [{u'originalString': u'1\xbd lb. carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11124, u'unit': u'lb'}, {u'originalString': u'1 can chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'can'}, {u'originalString': u'1 tbsp. curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2015, u'unit': u'tbsp'}, {u'originalString': u'1/3 c. all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'1 tbsp. grated peeled fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'2 lb. ground turkey or chicken', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'1 c. reduced-fat (2%) milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'2%', u'reduced-fat', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'c'}, {u'originalString': u'2 tbsp. margarine or butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4073, u'unit': u'tbsp'}, {u'originalString': u'1 medium onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1\xbd lb. parsnips', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11298, u'unit': u'lb'}, {u'originalString': u'1 package frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'package'}, {u'originalString': u'2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'5 medium sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'2 tbsp. vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.delish.com/cooking/recipe-ideas/recipes/a28700/curried-sweet-potato-shepherds-pie-ghk0308/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pierce potatoes all over with fork. Cook in microwave on High 15 to 17 minutes or until potatoes are tender when pierced with fork, turning potatoes over once; set aside.Meanwhile, in 12-inch skillet, heat 1 tablespoon oil on medium-high until hot.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add turkey; sprinkle with 1/2 teaspoon salt and cook 5 to 6 minutes or until no longer pink, stirring and breaking up turkey with side of spoon.Stir flour and curry powder into turkey in skillet; cook 1 minute, stirring.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add broth and heat to boiling. Cook 1 minute or until mixture thickens slightly. Divide turkey mixture between two 2 1/2- to 3-quart glass or ceramic baking dishes and spread evenly.Preheat oven to 375 degrees F. Wipe skillet dry. To same skillet, add remaining 1 tablespoon oil and heat on medium until hot.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add carrots, parsnips, and onion, and cook, covered, about 15 minutes or until vegetables are browned and tender, stirring occasionally. Stir in ginger, frozen peas, and 1/2 teaspoon salt. Divide vegetable mixture between casseroles, spreading evenly over turkey mixture.When cool enough to handle, cut potatoes in half and scoop flesh from skins into large bowl. With potato masher, coarsely mash potatoes. Stir in milk, margarine, and 1 teaspoon salt; mash until well blended.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Spread potatoes over vegetables.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Bake one shepherd's pie, uncovered, 35 to 40 minutes or until top is browned. Meanwhile, prepare second casserole for freezing (see Thawing and Reheating Tips).", u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 123, u'instructions': u"Pierce potatoes all over with fork. Cook in microwave on High 15 to 17 minutes or until potatoes are tender when pierced with fork, turning potatoes over once; set aside.Meanwhile, in 12-inch skillet, heat 1 tablespoon oil on medium-high until hot. Add turkey; sprinkle with 1/2 teaspoon salt and cook 5 to 6 minutes or until no longer pink, stirring and breaking up turkey with side of spoon.Stir flour and curry powder into turkey in skillet; cook 1 minute, stirring. Add broth and heat to boiling. Cook 1 minute or until mixture thickens slightly. Divide turkey mixture between two 2 1/2- to 3-quart glass or ceramic baking dishes and spread evenly.Preheat oven to 375 degrees F. Wipe skillet dry. To same skillet, add remaining 1 tablespoon oil and heat on medium until hot. Add carrots, parsnips, and onion, and cook, covered, about 15 minutes or until vegetables are browned and tender, stirring occasionally. Stir in ginger, frozen peas, and 1/2 teaspoon salt. Divide vegetable mixture between casseroles, spreading evenly over turkey mixture.When cool enough to handle, cut potatoes in half and scoop flesh from skins into large bowl. With potato masher, coarsely mash potatoes. Stir in milk, margarine, and 1 teaspoon salt; mash until well blended. Spread potatoes over vegetables.Bake one shepherd's pie, uncovered, 35 to 40 minutes or until top is browned. Meanwhile, prepare second casserole for freezing (see Thawing and Reheating Tips).", u'spoonacularSourceUrl': u'https://spoonacular.com/curried-sweet-potato-shepherds-pie-703326', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}