{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/209593-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 209593, u'veryPopular': False, u'lowFodmap': False, u'title': u"Schrodinger's Cat", u'diets': [u'caveman', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 693.73, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 dash Angostura bitters', u'aisle': u'Alcoholic Beverages', u'name': u'angostura bitters', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 93653, u'unit': u'dash'}, {u'originalString': u'1 1/2 ounces bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 10014037, u'unit': u'ounces'}, {u'originalString': u'1/2 cup Clover honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/2 ounce honey syrup', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'ounce'}, {u'originalString': u'Ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'serving'}, {u'originalString': u'3/4 ounce freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.75, u'consistency': u'liquid', u'id': 9152, u'unit': u'ounce'}, {u'originalString': u'1/2 ounce Lillet blanc', u'aisle': u'Alcoholic Beverages', u'name': u'lillet blanc', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 93786, u'unit': u'ounce'}, {u'originalString': u'Garnish: peach slice', u'aisle': u'Produce', u'name': u'peach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 9236, u'unit': u'slice'}, {u'originalString': u'3 slices peach', u'aisle': u'Produce', u'name': u'peach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'solid', u'id': 9236, u'unit': u'slices'}, {u'originalString': u'1/4 cup boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/08/schrodingers-cat-mezcal-cocktail-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'To make the honey syrup, stir hot water into honey until dissolved.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let cool. (Excess syrup can be stored, covered, in the refridgerator for several weeks.)', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Muddle peach slices in a cocktail shaker. Fill cocktail shaker with ice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Add Angostura, honey syrup, lemon, mezcal, Lillet, and bourbon. Shake vigorously.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 11014037, u'name': u'mezcal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Double-strain in to a cocktail glass.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with peach slice.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}], u'name': u''}], u'aggregateLikes': 54, u'instructions': u'Procedures                                                                              1                                                                            To make the honey syrup, stir hot water into honey until dissolved. Let cool. (Excess syrup can be stored, covered, in the refridgerator for several weeks.)                                                                                                                            2                                                                            Muddle peach slices in a cocktail shaker. Fill cocktail shaker with ice. Add Angostura, honey syrup, lemon, mezcal, Lillet, and bourbon. Shake vigorously.                                                                                                                             3                                                                            Double-strain in to a cocktail glass. Garnish with peach slice.', u'spoonacularSourceUrl': u'https://spoonacular.com/schrodingers-cat-209593', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}