{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/468547-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 468547, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crab Mornay', u'diets': [u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 407.82, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3 cans (6 ounces each) crabmeat, drained, flaked and cartilage removed', u'aisle': u'Canned and Jarred', u'name': u'canned crabmeat', u'metaInformation': [u'flaked', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 15141, u'unit': u'ounces'}, {u'originalString': u'1/8 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 can (12 ounces) evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1214, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup minced fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'6 green onions, sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 jar (6 ounces) sliced mushrooms, drained', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'drained', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1 jar (4 ounces) diced pimientos, drained', u'aisle': u'Produce', u'name': u'pimientos', u'metaInformation': [u'diced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pimento.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11943, u'unit': u'ounces'}, {u'originalString': u'1 package (10 ounces) frozen puff pastry shells', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry shells', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pastry-shells.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10018337, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (8 ounces) shredded Swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1040, u'unit': u'ounces'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/crab-mornay', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Bake pastry shells according to package directions. Meanwhile, place butter in a 2-qt. microwave-safe dish. Cover and microwave on high for 20-30 seconds or until melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the mushrooms, onions and pimientos. Cover and cook on high for 2-3 minutes or until vegetables are crisp-tender.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pimento.jpg', u'id': 11943, u'name': u'pimiento'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Combine flour and milk until smooth; gradually stir into the vegetable mixture. Microwave, uncovered, on high for 2-3 minutes or until thickened, stirring often.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the cheese, crab, salt and cayenne.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cook, covered, on high for 30-60 seconds or until the cheese is melted. Spoon into the pastry shells; sprinkle with parsley.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 62, u'instructions': u"Directions                                                                                Bake pastry shells according to package directions. Meanwhile, place butter in a 2-qt. microwave-safe dish. Cover and microwave on high for 20-30 seconds or until melted. Add the mushrooms, onions and pimientos. Cover and cook on high for 2-3 minutes or until vegetables are crisp-tender.                                                                                           Combine flour and milk until smooth; gradually stir into the vegetable mixture. Microwave, uncovered, on high for 2-3 minutes or until thickened, stirring often. Add the cheese, crab, salt and cayenne.                                                                                            Cook, covered, on high for 30-60 seconds or until the cheese is melted. Spoon into the pastry shells; sprinkle with parsley.                                        Yield: 6 servings.                                                                                                     Editor's Note: This recipe was tested in a 1,100-watt microwave.                                                                                                Originally published as Crab Mornay in  Quick CookingSeptember/October 2003, p37                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 627 calories, 43 g fat (22 g saturated fat), 117 mg cholesterol, 1,053 mg sodium, 35 g carbohydrate, 4 g fiber, 24 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/crab-mornay-468547', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}