{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/202713-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 202713, u'veryPopular': False, u'lowFodmap': False, u'title': u"Lamb Bolognese from 'Family Table", u'diets': [], u'pricePerServing': 497.91, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 cups dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14097, u'unit': u'cups'}, {u'originalString': u'1 pound fresh fettuccine', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'pound'}, {u'originalString': u'1 3-inch piece Parmigiano-Reggiano or Grana Padano rind (optional)', u'aisle': u'Cheese', u'name': u'grana padano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1011033, u'unit': u'piece'}, {u'originalString': u'1 pound ground lamb', u'aisle': u'Meat', u'name': u'ground lamb', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 17224, u'unit': u'pound'}, {u'originalString': u'1/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 cups Maialino Marinara', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'cups'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 cup grated Parmigiano-Reggiano, plus more for sprinkling', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'grated', u'plus more for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Pinch of red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'4 fresh thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'4 tablespoons (1/2 stick) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/04/lamb-bolognese-from-family-table.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 42, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a 12-inch skillet over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the ground lamb and brown slowly, scraping the bottom of the pan and reducing the heat as necessary to keep the lamb from browning too fast, until the moisture evaporates and the meat is well browned, 15 to 20 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 17224, u'name': u'ground lamb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'id': 10017224, u'name': u'lamb'}]}, {u'equipment': [], u'step': u'Add a pinch of salt and the red pepper flakes and cook for 1 minute more.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain off the fat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Turn the heat to high, add the thyme, bay leaves, and wine, and stir well. Bring to a boil and reduce until only a small amount of liquid is left in the pan, 5 to 10 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add the marinara and the cheese rind, if using, and simmer for 20 minutes, or until the sauce thickens.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Meanwhile, bring 4 quarts water to a boil in a large pot and add 2 tablespoons salt.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'5', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'When the sauce has thickened, remove and discard the thyme sprigs, bay leaves, and cheese rind, if you used it. Stir in the butter, cream, and grated cheese, bring to a simmer, and remove from the heat. Season to taste with salt and pepper. (The sauce can be made up to 3 days ahead, covered, and refrigerated; rewarm over medium-low heat.)', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'6', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Add the fettuccine to the boiling water, stir to separate the strands, and cook for 2 to 3 minutes, until al dente.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 10020409, u'name': u'fettuccine'}]}, {u'equipment': [], u'step': u'Drain.', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'7', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pasta to the sauce and stir to coat well. Sprinkle with cheese and serve immediately.', u'number': 18, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 100, u'instructions': u'Procedures                                                                              1                                                                            Heat the oil in a 12-inch skillet over medium-high heat. Add the ground lamb and brown slowly, scraping the bottom of the pan and reducing the heat as necessary to keep the lamb from browning too fast, until the moisture evaporates and the meat is well browned, 15 to 20 minutes. Add a pinch of salt and the red pepper flakes and cook for 1 minute more. Drain off the fat.                                                                                                                            2                                                                            Turn the heat to high, add the thyme, bay leaves, and wine, and stir well. Bring to a boil and reduce until only a small amount of liquid is left in the pan, 5 to 10 minutes.                                                                                                                            3                                                                            Add the marinara and the cheese rind, if using, and simmer for 20 minutes, or until the sauce thickens.                                                                                                                            4                                                                            Meanwhile, bring 4 quarts water to a boil in a large pot and add 2 tablespoons salt.                                                                                                                            5                                                                            When the sauce has thickened, remove and discard the thyme sprigs, bay leaves, and cheese rind, if you used it. Stir in the butter, cream, and grated cheese, bring to a simmer, and remove from the heat. Season to taste with salt and pepper. (The sauce can be made up to 3 days ahead, covered, and refrigerated; rewarm over medium-low heat.)                                                                                                                            6                                                                            Add the fettuccine to the boiling water, stir to separate the strands, and cook for 2 to 3 minutes, until al dente. Drain.                                                                                                                            7                                                                            Add the pasta to the sauce and stir to coat well. Sprinkle with cheese and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-bolognese-from-family-table-202713', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}