{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/587222-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 587222, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cinnamon Bun Popcorn', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 26.41, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'1/4 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 tablespoons vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon cinnamon, or more if desired', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon half & half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1049, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup popcorn kernels', u'aisle': u'Savory Snacks', u'name': u'popcorn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 25002, u'unit': u'cup'}, {u'originalString': u'1/2 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'3 dashes of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dashes'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.laurenslatest.com/cinnamon-bun-popcorn/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, mix butter and cinnamon together. Set aside. In a separate small bowl, mix powdered sugar with half & half until smooth. You may have to stir in a little more half & half to get it to drizzling consistency. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place oil and popcorn kernels into a large pot. Cover with tight fitting lid or foil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'id': 25002, u'name': u'popcorn kernels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Place pot over high heat. Shake pot back and forth over hot burner to heat kernels evenly. Continue shaking the pot until the popcorn starts to pop. After a minute or two, the popping will slow right down and you'll have a pot full of popcorn. Dump the hot popcorn onto a baking sheet and drizzle with cinnamon butter immediately. Stir to coat.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Drizzle the icing over the top and toss to coat as well.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm, or let it cool so the icing can harden up a bit.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3281, u'instructions': u"In a small bowl, mix butter and cinnamon together. Set aside. In a separate small bowl, mix powdered sugar with half & half until smooth. You may have to stir in a little more half & half to get it to drizzling consistency. Set aside.Place oil and popcorn kernels into a large pot. Cover with tight fitting lid or foil. Place pot over high heat. Shake pot back and forth over hot burner to heat kernels evenly. Continue shaking the pot until the popcorn starts to pop. After a minute or two, the popping will slow right down and you'll have a pot full of popcorn. Dump the hot popcorn onto a baking sheet and drizzle with cinnamon butter immediately. Stir to coat. Drizzle the icing over the top and toss to coat as well. Serve warm, or let it cool so the icing can harden up a bit.", u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-bun-popcorn-587222', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}