{u'recipes': [{u'sourceName': u'Fit Foodie Finds', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/716717-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 716717, u'veryPopular': True, u'lowFodmap': False, u'title': u'Clean Eating Crock-Pot Chicken Taco Bowls', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 215.36, u'creditText': u'Fit Foodie Finds', u'extendedIngredients': [{u'originalString': u'1 15 oz. can black beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'6 large chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'2 teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'2-3 tablespoons EVOO', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'EVOO', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'juice from \xbd lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'juice from 1.5 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'\xbd teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'salt and pepper to taste (generous)', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste', u'(generous)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups short grain brown rice', u'aisle': u'Pasta and Rice', u'name': u'short grain brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020040, u'unit': u'cups'}, {u'originalString': u'3 large sweet potatoes (or - 5 medium-size)', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'medium-size', u'large', u'(or - 5 )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'2 tablespoons tomato paste + \xbc cup water', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 51.0, u'imageType': u'png', u'spoonacularScore': 98.0, u'sourceUrl': u'http://fitfoodiefinds.com/2015/02/clean-eating-crock-pot-chicken-taco-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place 6 large chicken breasts and 2 tablespoons of minced garlic in a large crock pot and set to high. Cook for 3.5 to 4 hours, or until the chicken is no longer pink inside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Remove chicken breasts from crock pot and use two forks to shred it.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place shredded chicken back in crock pot (leave the liquid that is in there). Then, season with chili powder, cumin, garlic powder, paprika, onion powder, salt, and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix together tomato paste and water and place on top of chicken.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Mix.First, preheat oven to 400F. Then, dice sweet potatoes into bite-sized pieces. Line a baking sheet with tin foil and pour on about 2-3 tablespoons of EVOO.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place sweet potato pieces on baking sheet. Then, season, and toss with your hands. Roast at 400F for 25-30 minutes or until desired texture.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place 2 cups of brown rice and 4 cups of water in a medium-size pot. Bring to a boil, then lower heat to low and cover.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'id': 20040, u'name': u'brown rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let simmer until all of the water has absorbed. Once the rice has cooked, add in black beans, lime juice, and sea salt.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 8292, u'instructions': u'Place 6 large chicken breasts and 2 tablespoons of minced garlic in a large crock pot and set to high. Cook for 3.5 to 4 hours, or until the chicken is no longer pink inside.Remove chicken breasts from crock pot and use two forks to shred it. Place shredded chicken back in crock pot (leave the liquid that is in there). Then, season with chili powder, cumin, garlic powder, paprika, onion powder, salt, and pepper.Mix together tomato paste and water and place on top of chicken. Mix.First, preheat oven to 400F. Then, dice sweet potatoes into bite-sized pieces. Line a baking sheet with tin foil and pour on about 2-3 tablespoons of EVOO. Place sweet potato pieces on baking sheet. Then, season, and toss with your hands. Roast at 400F for 25-30 minutes or until desired texture.Place 2 cups of brown rice and 4 cups of water in a medium-size pot. Bring to a boil, then lower heat to low and cover. Let simmer until all of the water has absorbed. Once the rice has cooked, add in black beans, lime juice, and sea salt.', u'spoonacularSourceUrl': u'https://spoonacular.com/clean-eating-crock-pot-chicken-taco-bowls-716717', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 195, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}