{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/210898-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 210898, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate fruitcake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 35, u'pricePerServing': 181.07, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'75ml brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 75.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'ml'}, {u'originalString': u'200g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'100g dried sour cherries', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'dried', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9070, u'unit': u'g'}, {u'originalString': u'100g dark chocolate (we used 80%) broken into chunks', u'aisle': u'Baking', u'name': u'chocolate chunks', u'metaInformation': [u'dark', u'80%', u'(we used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10419903, u'unit': u'g'}, {u'originalString': u'3 tbsp cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'250g currants', u'aisle': u'Produce', u'name': u'currants', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/currants.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 9085, u'unit': u'g'}, {u'originalString': u'200g dark brown soft sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'g'}, {u'originalString': u'100g dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9079, u'unit': u'g'}, {u'originalString': u'3 eggs, beaten with a fork', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'with a fork', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100g ground almonds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'ground almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93740, u'unit': u'g'}, {u'originalString': u'100g mixed peel', u'aisle': u'Produce;Baking', u'name': u'mixed peel', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9426, u'unit': u'g'}, {u'originalString': u'1 tsp mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'mixed spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022035, u'unit': u'tsp'}, {u'originalString': u'250g raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 9299, u'unit': u'g'}, {u'originalString': u'200g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/889651/chocolate-fruitcake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Put the butter, sugar, chocolate, brandy,vanilla and dried fruits into a largesaucepan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Heat gently, stirring occasionallyuntil everything has melted together.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 150.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 150C/130C fan/gas 2.Line a deep cake tin, 20cm round or18cm square, with a double layer ofbaking parchment. Wrap a few layersof newspaper around the outside andsecure with string.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix the flour, almonds, cocoa and spicetogether. Stir the eggs into the slightlycooled chocolate mixture in the saucepan,followed by the flour mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u"Scrape intoyour prepared tin and bake for 1\xbd hrs-1 hr 45 mins or until a skewer poked incomes out clean. Cool in the tin, thendecorate (see 'Goes well with', right, for decoration ideas). Greaseproof-wrapped cake willkeep for 2 months in an airtight container.", u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Port, Cream Sherry, and Moscato d'Asti are my top picks for Fruit Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port.", u'pairedWines': [u'port', u'cream sherry', u'moscato dasti'], u'productMatches': [{u'imageUrl': u'https://spoonacular.com/productImages/430931-312x231.jpg', u'description': u'A deep ruby red color that sparkles in the glass describes this Zinfandel port. The aromas are a complex mixture of licorice, blackberry, and a whisper of vanilla. The rich jammy taste has hints of licorice, herbs, spice and currants with a lingering finish of almond and anise. Some recommended food pairings are crab cakes, Gorgonzola cheese, Ch\xe8vre, figs and chocolate, or a good cigar.', u'link': u'https://www.amazon.com/2001-St-Barthelemy-Cellars-Zinfandel/dp/B00EGF5XWU', u'id': 430931, u'title': u'St. Barthelemy Cellars Zinfandel Port'}]}, u'aggregateLikes': 282, u'instructions': u"Put the butter, sugar, chocolate, brandy,vanilla and dried fruits into a largesaucepan. Heat gently, stirring occasionallyuntil everything has melted together.Remove from the heat.Heat oven to 150C/130C fan/gas 2.Line a deep cake tin, 20cm round or18cm square, with a double layer ofbaking parchment. Wrap a few layersof newspaper around the outside andsecure with string.Mix the flour, almonds, cocoa and spicetogether. Stir the eggs into the slightlycooled chocolate mixture in the saucepan,followed by the flour mixture. Scrape intoyour prepared tin and bake for 1\xbd hrs-1 hr 45 mins or until a skewer poked incomes out clean. Cool in the tin, thendecorate (see 'Goes well with', right, for decoration ideas). Greaseproof-wrapped cake willkeep for 2 months in an airtight container.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-fruitcake-210898', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 155, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}