{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/532523-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532523, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Fish Tacos', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 442.55, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'1 avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'Pickled carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u'servings'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 cup cotija cheese', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001019, u'unit': u'cup'}, {u'originalString': u'1 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'1 jalape\xf1o, thinly sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 limes, quartered', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'8 3 ounce pieces of tilapia, skinless', u'aisle': u'Seafood', u'name': u'tilapia', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 15261, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'8 white corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'white corn tortillas', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}], u'healthScore': 71.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodiecrush.com/2014/04/spicy-fish-tacos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the cumin, chili powder, smoked paprika, onion powder and kosher salt in a small bowl. Season the tilapia pieces well with the spice mix.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'id': 15261, u'name': u'tilapia'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a cast iron skillet on high and warm the tortillas on both sides, until lightly browned, about 4 minutes per tortilla.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1/2 tablespoon of oil in the cast iron skillet and cook for about 3-4 minutes on both sides, depending on the thickness of the fish. Top each tortilla with a slice of fish, jalape\xf1o slices, pickled carrots, cotija cheese, avocado slices and cilantro leaves.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-slices.jpg', u'id': 1019037, u'name': u'avocado slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1001019, u'name': u'cotija cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Serve with lime wedges.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The King Estate Signature Collection Pinot Gris with a 4.3 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish.', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 52, u'instructions': u'Mix the cumin, chili powder, smoked paprika, onion powder and kosher salt in a small bowl. Season the tilapia pieces well with the spice mix. Heat a cast iron skillet on high and warm the tortillas on both sides, until lightly browned, about 4 minutes per tortilla. Heat 1/2 tablespoon of oil in the cast iron skillet and cook for about 3-4 minutes on both sides, depending on the thickness of the fish. Top each tortilla with a slice of fish, jalape\xf1o slices, pickled carrots, cotija cheese, avocado slices and cilantro leaves. Serve with lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-fish-tacos-532523', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}