{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/701549-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 701549, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pink Lemontini Champagne Cocktail', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 101.29, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'1 bottle champagne or prosecco (Extra Brut or Brut, you want it less sweet)', u'aisle': u'Alcoholic Beverages', u'name': u'champagne', u'metaInformation': [u'sweet', u'(Extra Brut or Brut, you want it less )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 10043155, u'unit': u'bottle'}, {u'originalString': u'Champagne or prosecco for topping', u'aisle': u'Alcoholic Beverages', u'name': u'champagne', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 10043155, u'unit': u'servings'}, {u'originalString': u'1/4 cup grenadine or maraschino cherry juice', u'aisle': u'Beverages', u'name': u'cherry juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 93677, u'unit': u'cup'}, {u'originalString': u'Optional: frozen lemonade or cherry juice for ice', u'aisle': u'Beverages', u'name': u'cherry juice', u'metaInformation': [u'frozen', u'for ice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 93677, u'unit': u'servings'}, {u'originalString': u'1 ounce lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'ounce'}, {u'originalString': u'4 ounces lemon juice (from about 4 lemons)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'(from 4 lemons)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'ounces'}, {u'originalString': u'1 1/2 ounces limoncello', u'aisle': u'Alcoholic Beverages', u'name': u'limoncello', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/limoncello.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'solid', u'id': 99021, u'unit': u'ounces'}, {u'originalString': u'6 ounces limoncello', u'aisle': u'Alcoholic Beverages', u'name': u'limoncello', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/limoncello.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 99021, u'unit': u'ounces'}, {u'originalString': u'Lemon slices and maraschino cherries, for garnish', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9328, u'unit': u'slices'}, {u'originalString': u'1 1/2 ounces vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 14051, u'unit': u'ounces'}, {u'originalString': u'6 ounces vodka (regular or citrus)', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [u'(regular or citrus)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 14051, u'unit': u'ounces'}, {u'originalString': u'2 ounces sweet and sour, reduce for a less sweet drink', u'aisle': u'?', u'name': u'reduce', u'metaInformation': [u'sweet', u'sour', u'for a less  drink'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'unit': u'ounces'}, {u'originalString': u'8 ounces sweet and sour, reduce for a less sweet drink', u'aisle': u'?', u'name': u'reduce', u'metaInformation': [u'sweet', u'sour', u'for a less  drink'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.crazyforcrust.com/2015/12/pink-lemontini-champagne-cocktail-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Chill all your ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add vodka, limoncello, sweet and sour, lemon juice, and grenadine to a punch bowl or pitcher. Stir, then add champagne.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/limoncello.jpg', u'id': 99021, u'name': u'limoncello'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'id': 10043155, u'name': u'champagne'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}]}, {u'equipment': [], u'step': u'Serve each drink with a cherry and lemon wedge.To keep the punch cold, add some lemonade ice cubes. (Freeze store bought lemonade in ice cube trays.)To make 2 cocktails only: add all ingredients except champagne and garnish to a cocktail shaker with ice. Shake then strain into glasses and top off with champagne and garnish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'id': 10043155, u'name': u'champagne'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 87, u'instructions': u'Chill all your ingredients. Add vodka, limoncello, sweet and sour, lemon juice, and grenadine to a punch bowl or pitcher. Stir, then add champagne. Serve each drink with a cherry and lemon wedge.To keep the punch cold, add some lemonade ice cubes. (Freeze store bought lemonade in ice cube trays.)To make 2 cocktails only: add all ingredients except champagne and garnish to a cocktail shaker with ice. Shake then strain into glasses and top off with champagne and garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/pink-lemontini-champagne-cocktail-701549', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"new year's eve"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}